{
    "filpkart": [
        {
            "comment": "Best among the other phones at the same budget. Good : > Slimmer and the design. > Better Camera/ Bad : > Battery (but not a big problem).",
            "date": "05 Feb 2015",
            "name": "Pavan W3b",
            "stars": "5 stars"
        },
        {
            "comment": "been a month since i bought this phone, everything in this phone is great but the only minor issue is that it hassles a little but it works when it runs heavy apps like games bigger than 200 - 300 mb",
            "date": "05 Feb 2015",
            "name": "vinay",
            "stars": "4 stars"
        },
        {
            "comment": "very good product with very nice quality. Pros: Everything is good at this price and upgraded version of Android Cons: Its charging speed is very slow and drains out very soon with simple internet searching",
            "date": "05 Feb 2015",
            "name": "Anjan Kumar D S",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this mobile since last few months and am pretty happy with the performance. Amazing phone with Lolipop. Worth for money.",
            "date": "04 Feb 2015",
            "name": "Dhvanish",
            "stars": "5 stars"
        },
        {
            "comment": "updated to lollipop and after that it's performance is quite lagging but other than that its awesome and reeeeeeeeeeeeeeeeeeeeeeeeeeeally good for selfies ;)",
            "date": "04 Feb 2015",
            "name": "sumith thogiti",
            "stars": "4 stars"
        },
        {
            "comment": "product is very good, and design is excellent, and flip kart delivery is out standing. moto g (2nd Gen) having good camera, battery lasts for Only one day, may be need to add latest version os.",
            "date": "04 Feb 2015",
            "name": "Manikandan Madhus...",
            "stars": "5 stars"
        },
        {
            "comment": "Simple Great product, OS Upgradable to Lollypop",
            "date": "04 Feb 2015",
            "name": "Nitesh Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "i recommend every one must get product from ws retail only as they are the genuine products vendor service quality every thing is perfect",
            "date": "04 Feb 2015",
            "name": "prabhakar singh",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone at this price. perfect size and shape to hold in one hand. performance is also pretty good. I got the product 2 days before expected delivery. Now it is upgraded with Lollipop. really sweet...!!!",
            "date": "04 Feb 2015",
            "name": "Jithin K M",
            "stars": "5 stars"
        },
        {
            "comment": "Best mobile for your hard earned money, i didn't find any logging or other problem, very smooth. Just go for it..",
            "date": "04 Feb 2015",
            "name": "Praveen RM",
            "stars": "5 stars"
        },
        {
            "comment": "obvious Moto g 2 is best but my one question..Airtel offer has gone in 31st jan but why you people shown....?",
            "date": "04 Feb 2015",
            "name": "kshitish..",
            "stars": "4 stars"
        },
        {
            "comment": "If U Want A Mobile That can last long Then U can buy this phone, otherwise go for some cheap brand like Mi or Micromax Or Asus...",
            "date": "04 Feb 2015",
            "name": "Neeraj Vohra",
            "stars": "5 stars"
        },
        {
            "comment": "go for it...amazing experience......very good at performance and processing..camera is good..supports OTG cable for mouse, keyboard and pen drive.",
            "date": "04 Feb 2015",
            "name": "Satish W",
            "stars": "5 stars"
        },
        {
            "comment": "Thx filpkart u give me fast delivery and low rate ...... WS Retail is best of all seller in online market...your item 100% genuine....",
            "date": "04 Feb 2015",
            "name": "Mahesh Jagani",
            "stars": "5 stars"
        },
        {
            "comment": "Display - superb Camera - excellent battery backup - average disappointed with Main functionality of the phone call clarity/Ear piece clarity/heating If you are really need a phone with call clarity and ear piece clarity , my suggestion is not to buy this one. other than this everything is good. I replaced the first product because of call clarity and heating , I got the new one with volume key defect now I don't want to replace it for any other defect piece please mind this before you buy this product",
            "date": "04 Feb 2015",
            "name": "san",
            "stars": "3 stars"
        },
        {
            "comment": "I have used the product from last 10-15 days and didn't come across any problem. Everyone should go for it in the range of 10-12K",
            "date": "04 Feb 2015",
            "name": "Prerak",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchased it and i feel it is wonderful and i love this phone. good look good life durable and also at reasonable lyf. good batry life and camera clearity also",
            "date": "04 Feb 2015",
            "name": "ANONYMOUS",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this mobile on Satday evening and got it by Sunday morning. It was way better than my earlier phone which is Samsung Galaxy S4. Pros : 1. Battery 2. Stock android with Lollipop 3. Front boom speakers. 4. Call quality & 3G Cons: 1. Less RAM",
            "date": "04 Feb 2015",
            "name": "Ragavendar Red...",
            "stars": "5 stars"
        },
        {
            "comment": "hai two days back i brought motog2 and my power and volume buttons are placed inside.it is difficult to press.can any anyone help me regarding this.what should i do",
            "date": "04 Feb 2015",
            "name": "hari",
            "stars": "3 stars"
        },
        {
            "comment": "motorola service center punjab bathinda 151005 lali mobile not giving servise and they have no idea how to talk with someone",
            "date": "04 Feb 2015",
            "name": "Deepak Taneja",
            "stars": "1 star"
        },
        {
            "comment": "I had purchased the Moto G2 phone in Nov2014 month after doing many followups with customer care peoples for its delivery. But when I received it was an awesome phone. I observed below two problems after using it for 3 months: a. As moto g2 is an optimized phone on its original model moto g, but phone battery backup is NOT optimized at all and it last only for ONE day. The phone needs to charge every day. b. After capturing a continues VIDEO for more than 10-15 minutes, the phone is getting warm (HEAT) and got hang for few seconds. Motorola should pay attention to these problems and provide some FIX for the same. Thanks",
            "date": "04 Feb 2015",
            "name": "Bisan Shah",
            "stars": "3 stars"
        },
        {
            "comment": "Great device, very good screen resolution, No lags till I got updated to Lollipop. Very nice browsing experience on 3g and 2g as well lacks an enter option for coming to next line while typing sms, else the rest are so good. I suggest if you are comparing some other products at the same price better go for it, its a best deal.",
            "date": "04 Feb 2015",
            "name": "Naveen Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Flip kart Packing is excellent and Given the best in time. Product is as expected. Flip kart Packing is excellent and Given the best in time. Product is as expected.",
            "date": "04 Feb 2015",
            "name": "Anil Adla",
            "stars": "4 stars"
        },
        {
            "comment": "hi every one, I bought the moto G2 phone for 12,999 Rs from flipkart.Their Faster delivery is good.The sound and camera Quality are fine But the piece,though Android, is lacking of some basic Apps like Conference Call,Voice recorder,file manager,mobile Security app, Faster draining of battery even though I'm not a crazy of games.BIGgest drawback is the CAPs key is missing. i.e for each Capital letter of a word we have to use shift key every time.Even the ear phones of MOTO (USA) products are very hard n cheap quality.Detection of 2G network by dual Sim cards is bad.My earlier Samsung touch phone is better than this in Internet access and Indian Micromax cells around 10k r far better than this, as told by my friends. So folks i suggest u not 2 prefer Moto G2,unworthy from a US brand",
            "date": "04 Feb 2015",
            "name": "Krishna",
            "stars": "3 stars"
        },
        {
            "comment": "The is really good but the camera quality is not that good and also the battery back up is not that much.",
            "date": "04 Feb 2015",
            "name": "Nidhin Lakshmanan",
            "stars": "4 stars"
        },
        {
            "comment": "gud.................................................................................................................................................................................................................................................................................................",
            "date": "04 Feb 2015",
            "name": "fhm",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is not good at all when compared to Moto G. when u charge it, the phone becomes hot, hangs every now and then. after updating the new software, it became even more pathetic.",
            "date": "04 Feb 2015",
            "name": "Shweta Singh",
            "stars": "1 star"
        },
        {
            "comment": "mobile overall is excellent in all matters, happy to buy, go for it, sceen is excellent, camera superb, sound quality good, ram spedd good, yet no lag from 4 months.",
            "date": "04 Feb 2015",
            "name": "preetam patil",
            "stars": "5 stars"
        },
        {
            "comment": "The phone hangs after update into Lollipop.. Also it heats a lot... the phone is good in other aspects",
            "date": "04 Feb 2015",
            "name": "Sumit Agrawal",
            "stars": "1 star"
        },
        {
            "comment": "Awesome Speaker, specially when you plays 320Kbps(HD Quality) Songs. I'm totally satisfied with this product. Overall in this price range, Moto 2g Stands at Best. I love the feature 'Camera Slow 720p HD' You can run most of the application simultaneously with any time lag or interruption.",
            "date": "04 Feb 2015",
            "name": "Pawan Tejas",
            "stars": "5 stars"
        },
        {
            "comment": "Pros ------- * Screen is bright and vivid * 5\" IPS 720p capacitive touch screen of 294ppi, Gorilla Glass 3 * Loud speaker is good * Full Android experience * Active noise cancellation with a dedicated microphone Cons ------- * Camera in low light * Battery Mah should have been better * Audio quality via headphone sucks * SAR Value bit higher * Camera doesn't record 1080p video * RAM should be 2GB for this features.",
            "date": "04 Feb 2015",
            "name": "Arun T Raj",
            "stars": "4 stars"
        },
        {
            "comment": "Using this for the past 3 months .. Good value for money.. Only draw back it has is it heats up when using camera for a very prolonged period..",
            "date": "04 Feb 2015",
            "name": "Ram Prasath",
            "stars": "5 stars"
        },
        {
            "comment": "My first Android phone - has been a Nokia fan. Exchanged Nokia through Flipkart offer. A good phone for the price - quality is OK. Quick and responsive for most of my needs. Got Lollipop (5.0.2) update. Very good packaging and fast delivery by Flipkart.",
            "date": "04 Feb 2015",
            "name": "Nirmal N",
            "stars": "5 stars"
        },
        {
            "comment": "Worst Customer Support ever. They don't value the customers. Considering the track order they could have helped me.",
            "date": "04 Feb 2015",
            "name": "Sushil Kabadar",
            "stars": "1 star"
        },
        {
            "comment": "Just started using the phone for a week and is really good in terms of performance..the only minus of the phone is an OK OK Camera and not so great battery.",
            "date": "04 Feb 2015",
            "name": "Anup Nair",
            "stars": "5 stars"
        },
        {
            "comment": "DO NOT UPDATE ANY GENERATON OF MOTO G TO LOLLIPOP !!! Android 5.0 looks cool with its material interface. Thats what actually drove me to update to Lollipop. But once I updated, the UI started to lag. Applications started to take time to open. Even the menu would sometimes freeze. I desperately started to search for solutions in online forums. I tried everything, including clearing the phones cache partition, but nothing worked. I had this wrong image in my mind about stock android, that whatever the hardware might be, if its a stock android it will never lag. But I was wrong. New releases of Androids are only focused on Nexus. To expect a decent android experience after OS upgrades you either have to buy the upcoming Nexus device with which the new OS is released or buy any existing Nexus device. Dont trust me?? Update it. But once you are done updating you cant roll back to Kitkat. This is said by the Motorola Customer Care Executive. Well you can actually... but you will have sacrifice your waranty. Good luck with that!",
            "date": "04 Feb 2015",
            "name": "C Sarkar",
            "stars": "2 stars"
        },
        {
            "comment": "this is a very good phone..camera good, display good,no lag in operating,i didnt play big games but for small games it is good. BUT one problem is with two sim cards on and internet working battery life is jz 8 hrs but with out internet it is 20 hours of battery life... if you would like to buy this phone i will you to buy and carry a powerbank along with this.",
            "date": "04 Feb 2015",
            "name": "poorna",
            "stars": "4 stars"
        },
        {
            "comment": "I like the MOTO G 2nd Generation phone because it as a lot of features which are in a smart phone. Never worry about stopping to charge. Quickly switch from playing a game to texting. With a quad-core processor, Moto G 2nd Generation multitasks as easily as to do.",
            "date": "03 Feb 2015",
            "name": "Deep Kumar Pal",
            "stars": "5 stars"
        },
        {
            "comment": "phone is pretty good, and the stock android is awesome.. speed,touch,camera is good .. But Need some camera apps for more fun... best phone for buy under 15K..",
            "date": "03 Feb 2015",
            "name": "Rajat",
            "stars": "4 stars"
        },
        {
            "comment": "Performance before and after lollipop up gradation is amazing ,except the battery performance which has gone down drastically .Can someone suggest me how to uninstall lollipop and go back to the previous OS.?",
            "date": "03 Feb 2015",
            "name": "vivek",
            "stars": "3 stars"
        },
        {
            "comment": "Good feature of Phone 1. Good Video Player 2. Good Speed 3. Support 5.0 Android But normal battery life for 1 day",
            "date": "03 Feb 2015",
            "name": "Robin Jindal",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone, worthy for the money spent. Performance was quite good until i received lollipop update, which slowed my phone performance a bit. Rest of the features as camera, touch feel experience.",
            "date": "03 Feb 2015",
            "name": "anvesh reddy",
            "stars": "4 stars"
        },
        {
            "comment": "Hi guys, have had Moto g2 just now b4 a week .. running good .. satisfied with the features shown ... Rather me surprising why the company does not given a mp4 format video support or some other popular .... any expert among you people have any idea to make this comapatible with these like formats to run the videos. else where very good device .. recommends to everybody to have it .. it gives you a charm of having rich like device you have and the performance wise amazing. :~)",
            "date": "03 Feb 2015",
            "name": "Sanjay Suryaw...",
            "stars": "4 stars"
        },
        {
            "comment": "Very very good set to use. Full hd video support and one day battery backup. Android Lollipop can be updated",
            "date": "03 Feb 2015",
            "name": "Abdul Basith EK",
            "stars": "5 stars"
        },
        {
            "comment": "so nice.....................................................................................................mobile in this price",
            "date": "03 Feb 2015",
            "name": "palugulla venk...",
            "stars": "5 stars"
        },
        {
            "comment": "6 months running, no lags. Absolute bang for the buck. I have used Samsung galaxy core earlier and it suffered alot during multi-tasking, the battery life too was poor, unlike this one. Well @ 13000 bucks, definitely a best in class product.",
            "date": "03 Feb 2015",
            "name": "Rahul Poddar",
            "stars": "5 stars"
        },
        {
            "comment": "i got a damaged piece..return requested but not yet picked nor got replace................................................................",
            "date": "03 Feb 2015",
            "name": "ashwin",
            "stars": "1 star"
        },
        {
            "comment": "Phone is excellent. But do not upgrade to Lollipop yet. It enables one white theme which consumes 25% battery on display. There is no black theme as of now to save battery for entire day.",
            "date": "03 Feb 2015",
            "name": "Rhishikesh Kul...",
            "stars": "4 stars"
        },
        {
            "comment": "I'm satisfied with my Moto G second generation phone. I like the size of the screen and the overall size of the phone. I like the camera resolution and the sound quality. So far so good! Fingers crossed for future...",
            "date": "03 Feb 2015",
            "name": "Gautam Chowdhury",
            "stars": "5 stars"
        },
        {
            "comment": "nice one... and lollipop is amazing... superb",
            "date": "03 Feb 2015",
            "name": "Mohan Raj",
            "stars": "5 stars"
        },
        {
            "comment": "i got so impressed by the specs, reviews & went on to buy this shitty phone. My bad time started then. though there was excellent delivery by flipkart i got a faulty product as speaker was not working. then replacement also went smooth from flipkart which is needless to say good. again i received a faulty product with second sim slot tray having fault. with no word to express my frustration & trouble, i have returned the product. Bad buy as in product. sincere thanks to flipkart for an excellent service.",
            "date": "03 Feb 2015",
            "name": "Putta M",
            "stars": "1 star"
        },
        {
            "comment": "Awesome phone with awesome specs . No doubt its worthy of 5 stars . Prompt delivery by Flipkart . Always buy from Ws Retail fast delivery Only cons is that the offer mentioned with the phone about 1gb data pack is valid till 31st jan and i got my phone on 2nd of feb , had ordered on 31st jan",
            "date": "03 Feb 2015",
            "name": "maneet",
            "stars": "5 stars"
        },
        {
            "comment": "If you want quality product and not only the big phone go for Xperia sp in this range. Which is very good in look. This phone is big but look is very bad.",
            "date": "03 Feb 2015",
            "name": "Amit",
            "stars": "5 stars"
        },
        {
            "comment": "The Price must have been decreased baring Lenova A6000 4g you get very cheaper with almost same specs",
            "date": "03 Feb 2015",
            "name": "Praveen",
            "stars": "4 stars"
        },
        {
            "comment": "It's a best phone. It never hangs. Using it for more than 4 months.",
            "date": "03 Feb 2015",
            "name": "vinay shankar",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone, I am very happy after using for 4 months. I have even loaded with Lolipop its working very well. Thanks to Flipkart for good delivery service.",
            "date": "03 Feb 2015",
            "name": "EswarReddy",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased it 10 days before and upgraded to lolly pop instantly. There is a problem with this phone that it is being hanged and my voice is not audible to the caller and i am unable to hear the caller tune of the receiver during dialing . after restart it is being solved .",
            "date": "03 Feb 2015",
            "name": "ranjan sahu",
            "stars": "3 stars"
        },
        {
            "comment": "under 15k good mobile and Android L is working Brilliant in moto g2 moto G -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "03 Feb 2015",
            "name": "Mohan Kumar B S",
            "stars": "5 stars"
        },
        {
            "comment": "First i got a mobile at a bad condition but i replaced it and really it's awesome, everything works fine, the touch, the battery, the performance, and even i got the update 5.0.2 on the same day after installing gmail acc to my mobile. Best experience love moto g2 Flipkart thanxx",
            "date": "03 Feb 2015",
            "name": "Mohammad",
            "stars": "5 stars"
        },
        {
            "comment": "Camera struggles at times. Vanilla android is still not that very useful around contacts and messages. but you can live with it.",
            "date": "03 Feb 2015",
            "name": "Shaiju",
            "stars": "3 stars"
        },
        {
            "comment": "i'm enjoying alotttttt..with this. updated to lollipop. good features & adv apps. but battery was taking 3 to 3.5 hrs to charge and backup is little less still not a problem, finally this was excellent in 13000 price.",
            "date": "03 Feb 2015",
            "name": "HemaKondalarao...",
            "stars": "4 stars"
        },
        {
            "comment": "it is a bad experience with moto service centre.. it happened when i placed my sim in second sim slot and sim got fixed in slot and did not came out. then i went to service centre operated by third party the guy on counter told me that of if they remove sim from slot the pin got damaged your warranty will void and your phone will be a single sim phone what the shit !! such a stupid thing... 0 rating",
            "date": "03 Feb 2015",
            "name": "AKASH GOYAL",
            "stars": "1 star"
        },
        {
            "comment": "awesome delivery i got in less than 40hrs really super.i will be back with the review of my phone within a couple of days",
            "date": "03 Feb 2015",
            "name": "prem",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased this product 10 days back and observed battery is not up to mark. Charging not with stand even 20 hours",
            "date": "03 Feb 2015",
            "name": "SRINIVASA RAO...",
            "stars": "4 stars"
        },
        {
            "comment": "An excellent mobile at this price.I have been using it with single sim. the battery backup is good considering the battery size. The updates get downloaded and the updation process is smooth. sleek design. Overall a good phone 5/5.",
            "date": "03 Feb 2015",
            "name": "Rahul Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome display..wid gorilla glass 3 Camera is good not the best. Battery's back up is also good. No hanging.. Best build quality.. Got 5.0 lollipop.. Nice delivery time even in small towns.. Nice replacement experience.. (Replace flip cover) Its the best option I found among any other branded phone.. I m totally satisfied...you aren't expect more at This price tag..",
            "date": "03 Feb 2015",
            "name": "vasim husain",
            "stars": "5 stars"
        },
        {
            "comment": "I brought this phone 3 months back and it was working good with android version Kit Kat. But 5 days back I got new Lollipop software updates for my moto g 2nd generation mobile. I was so happy to install Lollipop software but I was disappointed after installing Lollipop software. This software is very slow and also it leads to hang. Please give me any suggestions to come out of this problem.",
            "date": "03 Feb 2015",
            "name": "rajasekar reddy",
            "stars": "3 stars"
        },
        {
            "comment": "Dear Team, Please provide invoice for the above purchase. as you send sms to purchase person, invoice will be sent through email. sofar i have not received. please look into this.",
            "date": "03 Feb 2015",
            "name": "ALAPATI%20VENK...",
            "stars": "4 stars"
        },
        {
            "comment": "Good on time delivery by flipkart. The phone works like a charm except the contacts application acts weird at times.",
            "date": "03 Feb 2015",
            "name": "Rohit Yadav",
            "stars": "3 stars"
        },
        {
            "comment": "Good mobile to buy. Thanks to flipkart for fast delivery. Some people are said battery back up is problem but i didn't find battery backup problem. Anyway it is depend on our usage",
            "date": "03 Feb 2015",
            "name": "Narendra",
            "stars": "4 stars"
        },
        {
            "comment": "After Lollipop update it work smooth.. Ram management is improved, But Android 4.4.4 is better battery life.. Note;- Lollipop update u must wipe cache clear",
            "date": "03 Feb 2015",
            "name": "DanyPrasad",
            "stars": "5 stars"
        },
        {
            "comment": "Simply its Awesome... I am enjoying latest OS Android Lolipop 5.0 with Moto G2 and its really excellent. As per my experience, with this cheap price Moto G2 is best one as compared to other with all its features and facilities.",
            "date": "03 Feb 2015",
            "name": "Ravi Der",
            "stars": "5 stars"
        },
        {
            "comment": "Lollipop UI is pretty well compared to KitKat. Works well no hang up. Lollipop save energy. getting around 5% extra battery life.",
            "date": "03 Feb 2015",
            "name": "thejomayananthan",
            "stars": "4 stars"
        },
        {
            "comment": "Waste of money. Out of 10 mobiles eight mobiles are having problem of non connecting for first time dial. We have to call again. Battery performance is very poor. It will take minimum 3 to 4 hours to recharge the battery. Waste product.",
            "date": "03 Feb 2015",
            "name": "Radhakrishna.S...",
            "stars": "1 star"
        },
        {
            "comment": "its a very good phone. Indeed Samsung interface is great but this phone's battery back up, RAM of 1 GB and internal space of 16 GB makes it a great phone. primary and front camera is fantastic. focusing has a bit issues sometimes but its manageable. I am liking it and feeling so secure about my choice of buying mobile through Flipkart. I never trusted online shopping for electronic goods but this product and transaction has changed my mind.",
            "date": "03 Feb 2015",
            "name": "D Chowdhury",
            "stars": "5 stars"
        },
        {
            "comment": "Value for Money......But go For Lumia 730 it is the best option.................moto g is quite heavy at the same time display quality is poor as compared to lumia 730 and lumia 730 not at all lags because it is windows........",
            "date": "03 Feb 2015",
            "name": "Raghupati S",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart combined it with airtel 1 GB 3G data offer. Upon asking they didnt solve the problem. Actually none of the executives know anything about any offer flipkart is putting with products and they actually dont care. Anyway this is not expected from rising online seller like flipkart. Mobile is very good actually. Decent Hardware, Nice Screen. Resolution is good. I am disappointed with the camera though. but it takes good pics in broad daylight. Overall very good buy (****). Flipkart services are getting bad day by day(*).",
            "date": "03 Feb 2015",
            "name": "Cool Kals",
            "stars": "3 stars"
        },
        {
            "comment": "The MOTO G Second generation was good phone but if you are using airtel prepaid sim, you will not get the offer. If you contact the Airtel Customer care centre they will not provide the offer and they will give bullshit reasons. Please dont go with the offer. Hello team, Please remove the offer what you mentioned.",
            "date": "03 Feb 2015",
            "name": "Srinivasa",
            "stars": "3 stars"
        },
        {
            "comment": "Well what to comment, Moto G and Flipkart is a marriage made in Heaven. Excellent Quality Mobile and far excellent delivery by Flipkart. I think I am addicted to Flipkart but it's worth. I congratulate the team who have cracked the exclusive tie up of Moto with Flipkart. Smart move.",
            "date": "03 Feb 2015",
            "name": "Gurmeet Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "very nice phone, just go for it. value for money phone. camera quality is very nice, display is very good. best feature for this price with quality.",
            "date": "03 Feb 2015",
            "name": "prashant gunjan",
            "stars": "5 stars"
        },
        {
            "comment": "Simply awesome and value for money. Amazing product from motorola at this price range. Guys do not think just go for it.",
            "date": "02 Feb 2015",
            "name": "Himanshu Goyal",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto g 2nd gen is really really worth more than my expectations...and what more you need in a smart phone..... Motorola is Motorola for it's best communication technology in wireless etc.... After using for two months and after recent upgrade to Android 5.0.2, I am writing this review.....the phone became more smart after upgrade. I sincerely recommend to buy only Motorola....it is the best.... you will feel it once you own it..... Here I want to salute Flipkart, yes salute for the service, promptness, commitment and response etc....I think Flipkart is the best online seller in India. Thanks to Motorola for wonderful mid segment smart phone and thanks to Flipkart for delivering it to me...",
            "date": "02 Feb 2015",
            "name": "Asad Ahmed",
            "stars": "5 stars"
        },
        {
            "comment": "moto g is good at its price no lags camera features is best at all battery drains fastly in kitkat bt now in lollipop drains slowly. battery performance is increased by 33 percent in lollipop.",
            "date": "02 Feb 2015",
            "name": "JAY patel",
            "stars": "4 stars"
        },
        {
            "comment": "THIS MOB IS VERY GOOD .ONLY THE BIG PROBLEM -BATTERY BACKUP IS VERY POOR .ESYEST MOBILE,NO COMPLICATED. IM SATISFIED VERY STRONG MOBILE",
            "date": "02 Feb 2015",
            "name": "S BHATTACHARYA",
            "stars": "4 stars"
        },
        {
            "comment": "Nice product, Nice Battery Backup, Less Battery consumption on Data/Internet. Look may be better in upper and lower bar removed. Overall Nice mobile in 13K.",
            "date": "02 Feb 2015",
            "name": "dharmendra kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, I ordered mobile on 31st Jan and same day delivered product with extra charge. Also I updated Android 5.00 on same day via OTA update through Wifi. Today I put down the Airtel sim card and trying to connect mobile data but some time it will connect when i enable the data after 30 to 40 seconds. However, most of the time its not connecting at all. very disappointing. Very irritating white background UI theme. Also silent profile and audio profiles also not there. Even Restart options also not there when we hold the switch off key. I want to flipkart guys contact me to resolve these issues.",
            "date": "02 Feb 2015",
            "name": "Kishor%20Kumar...",
            "stars": "2 stars"
        },
        {
            "comment": "Powerful Stereo Sound, Pure Android experience, Brilliant 5\" HD Display, All day battery, Personalisation. These are the features required & expected for an android smartphone!",
            "date": "02 Feb 2015",
            "name": "Nihaarika Sirsi",
            "stars": "5 stars"
        },
        {
            "comment": "Overall performance is good for the price. But one disappointment is that, it doesn't provide some of the really required apps like file manager. We can not set our own ringtones. Screen display and camera qualities are good. So I am satisfied with the phone.",
            "date": "02 Feb 2015",
            "name": "Nanda Kishor",
            "stars": "4 stars"
        },
        {
            "comment": "Well, it is great to tell you that this phone is worth of every penny you pay for it. The phone runs very well, its fast, smart and awesome. The phone supports all the heavy games, asphalt, mortal combat in more then average graphics. I have never seen this phone to give some delay as i already said its fast. Updated my phone to Android Lollipop and it makes the phone even more awesome than it already is. This product is a MUST BUY. P.S. Flipkart Delivery was just fine, i opted one day delivery and the phone was delivered in the last minute. So, not a problem in buying from Flipkart ( However that's the only option :p )",
            "date": "02 Feb 2015",
            "name": "Prayas Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "A very Nice phone on this price. marvellous features.Only thing it lags is, It Should have a larger battery mAh",
            "date": "02 Feb 2015",
            "name": "ABHISHEK KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "i m unable to buy any (smartphone) prouct in my area above 10k from 9 september 2014 they r saying some delivery courior issue so i am dissatisfied with flipkart so big thumbs down to flipkart",
            "date": "02 Feb 2015",
            "name": "vivek kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd gen have superb build quality and good durability. It never hangs and very smooth . After lollipop update its performance increases more. Pros: 1) HD display 2) Battery Backup 3) Lollipop update 4) Never hangs Cons: Nothing",
            "date": "02 Feb 2015",
            "name": "Karthikeyan Sw...",
            "stars": "5 stars"
        },
        {
            "comment": "Three problems 1) low speaker sound, which puts you off, while referring this product to others. 2) Batters, just vanishes in 6 - 8 hours 3) Data cable is not available; charger cannot be used as the data cable.",
            "date": "02 Feb 2015",
            "name": "vvk2k5",
            "stars": "3 stars"
        },
        {
            "comment": "Phone hang every time I get a call or a message. Please fix this. Otherwise phone is very good. Moto Assist works in very smooth way. Also do not enable multi account as Phone will hang every time.",
            "date": "02 Feb 2015",
            "name": "Deepak Srivas...",
            "stars": "1 star"
        },
        {
            "comment": "I actually changed back to Android from Windows.....(read,Lumia 1020 to Moto G 2)....wanted to downsize for some personal reasons,especially the former being an equally powerful cam phone with a whopping 41mp AF Xenon flash camera. Now this Moto G2,I read a lot abt it & most of which was good actually. I was thinking of buying a Xiaomi, Honor 6.....but decided on this Moto G 2,as I loved the Lollipop interface on a friend's phone & also there are certain apps that I needed to use,which were not available in the Windows Store....After spending the 2 days with the Moto G 2, am loving it.....On the downside,the box pack doesn't include a DATA CABLE & the handset actually comes with KitKat not Lollipop,out of the box. Camera is gud,for a 8mp. Slow Mo 720 is an added advantage I must say.",
            "date": "02 Feb 2015",
            "name": "Samrat Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "easy to used.......goooooooooooooooooooooooooood product ..............As compared to samsung S3.....................moto 2nd gen.......lolipop update.........and with OTG.....",
            "date": "02 Feb 2015",
            "name": "Mobin Sayyad",
            "stars": "5 stars"
        },
        {
            "comment": "After using the phone for a month I am writing this review.There are a lot of phones in the market available in the mid range. This phone in this range is really good. As per performance it works well. Very smooth and responsive. camera quality is also nice but the video quality is not so great. Screen quality is also good but not excellent maybe because of guerrilla glass. As per Head phone it is very ordinary. Company don't provide with data cable. Over all this phone is best in its range than other phone.",
            "date": "02 Feb 2015",
            "name": "Sanjeev kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delivery is spot-on. Good mobile for this range. Sturdy Pure android experience is cool, upgraded seamlessly to Lollipop 5.0.2 version, till now no glitches and all the other apps are working just fine. Feather touch is awesome. Crisp display. Network and sound quality is just great. Enjoying the experience.",
            "date": "02 Feb 2015",
            "name": "Parama Gati D?s",
            "stars": "4 stars"
        },
        {
            "comment": "valuable for money ..samung is very hangable,,,,it is ok the performance is good... very wonderful ..in lollipop...",
            "date": "02 Feb 2015",
            "name": "Mohan Raj",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone but with minor upsets. It has every thing except: 1: Direct Video calling facility, 2. will not play Videos. For these two, we need to download apps for these two. Also, it doesn't have a data cable and ear phones are of old model (not ear buds types) these are some of the drawbacks in this mobile. Rest, all are just awesome especially after Lollipop is installed. Regards, Naresh",
            "date": "02 Feb 2015",
            "name": "Naresh Babu",
            "stars": "4 stars"
        },
        {
            "comment": "This Mobile is Very Nice & we can upgrade it............................................................",
            "date": "02 Feb 2015",
            "name": "Prajwal Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Hey folks...., I'm writing this review on first day...This review is only on hardware and accessories... The handset has awesome look...This is my first ever smartphone...All the features seems great! No doubt the phone is a masterpiece...But earphone is very worst...you can get this kind of earphone in local market for 100 bucks....I don't know why but Motorola's concentration was only on the handset...earphone could have been much better..If you are a music lover then you will have to buy a good headphone... Charger seems poor in quality...Heats after one hour of charging...but it's ok... Overall handset is great!! Go for it... I'll write my next review after using this phone for some days! Thanks!",
            "date": "02 Feb 2015",
            "name": "Rakesh Khot",
            "stars": "4 stars"
        },
        {
            "comment": "Am not going into the specs and comparisons as there are decent reviews for that. It has been less than a month since i bought this product.My first impression of the product was very impressive. The touch screen is decent and resolution could be better(but it is definitely up to the standards). The power and volume buttons are very well located. Holding the phone and the quality is simply outstanding for the price we pay. Already received the lollipop update and the performance is enhanced noticeably. Battery is top notch. One of the best thing is an option for expandable memory. Final say: Bang for the buck. Best phone in this price range. Definitely feels better than all the samsung's, sony's and nokia's in this price range.",
            "date": "02 Feb 2015",
            "name": "Abhiram Bharadwaj",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile getting heat and battery getting dry in half day only.cant see the Motorola standards in moto g. silly things is no usb and ear phones or bad in quality.",
            "date": "02 Feb 2015",
            "name": "sandeep samudrala",
            "stars": "1 star"
        },
        {
            "comment": "Its a superb mobile i never seen it before !!!!!!!! Simply Wonderful !!! Both camera is very superb!!! I can give 5* for this mobile . i'm a fan of moto g .. love it !!",
            "date": "02 Feb 2015",
            "name": "Prasanth S",
            "stars": "5 stars"
        },
        {
            "comment": "I won't comment on the delivery aspect of flipkart as it is well known to all as to how awesome it is. I received this product just yesterday and initially it gave me some Wifi connection related issues , so i thought it might be a defective product. But, today when i tried connecting it to my college wifi, it successfully got connected, so for now i am understanding it to be my personal wifi connection issues. Rest the product looks good. Will update you guys after a little more usage. Thanks Flipkart.. :)",
            "date": "02 Feb 2015",
            "name": "Sankalp Jain",
            "stars": "5 stars"
        },
        {
            "comment": "It was a good exchange offer for Moto G (2nd gen) and very good mobile with great features. Only Charger cable is not detachble. you cannot use as USB data cable, you have to purchase it seprately.",
            "date": "02 Feb 2015",
            "name": "Jay Chavda",
            "stars": "4 stars"
        },
        {
            "comment": "Price is not much.processing is very good.Purchaged 6 month before still don't have any complain.recently upgrated android lolipop software and feel its faster.",
            "date": "02 Feb 2015",
            "name": "Manas Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is a awesome product for the feel and touch related earlier was using Samsung products and for the price range its a good deal but the concern is with the battery life which is too less comparatively 2070 mAH is not sufficient to complete entire day's activity.",
            "date": "02 Feb 2015",
            "name": "Nagavenu Vidiyala",
            "stars": "3 stars"
        },
        {
            "comment": "nice phone but late update. Ram get low at time when u use facebook and other heavey apps games run smooth but lag is seen sometime",
            "date": "02 Feb 2015",
            "name": "riz",
            "stars": "4 stars"
        },
        {
            "comment": "Moto gen 2 is the best phone available at this rate. All features are superb.. The cam clarity is too gud.. I have cross checked with phone like LG3 series. Pics taken with moto looks colourful crisp and live.. In addition got updated with lollipop few days back.. Only the concern is with batery backup..",
            "date": "02 Feb 2015",
            "name": "Farooq",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing phone and a super amazing delivery. I was a bit reluctant to buy this phone as every other person has it. But I think I made the right choice of buying it after all. Go Flipkart :) fastest delivery EVER!!",
            "date": "02 Feb 2015",
            "name": "Lovely John",
            "stars": "5 stars"
        },
        {
            "comment": "Leaving all the technical aspects and product features.. I was only worried about the battery life which turned out to be good.. But found when using the Camera (which is amazing), it runs out quickly.. Apart from that I didnt find much difference as I already have Moto E as well. Good buy!",
            "date": "02 Feb 2015",
            "name": "VSK",
            "stars": "4 stars"
        },
        {
            "comment": "Super doing great till date I love this very much value for money and as always flipkart is best no.1 online service and do care the customers",
            "date": "02 Feb 2015",
            "name": "Kumar D M",
            "stars": "5 stars"
        },
        {
            "comment": "Used for 6 months now Not a damn problem Even got the lolipop update Camera quality is good and the delivery was fast too.",
            "date": "02 Feb 2015",
            "name": "rakesh",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this one month ago form flipkart.com after 10-11 days it started showing signal problem, i place a replacement request and after 2 days received a call from technical department, they try to resolve the problem and cut the phone the problem is still there, one again i place a replacement request but the same happen and battery of this is continuously getting low 7-8 hours only.",
            "date": "02 Feb 2015",
            "name": "Ravi Kant",
            "stars": "2 stars"
        },
        {
            "comment": "Good features, good camera, does not lag, loud sound, durable , one month done and still no complains.",
            "date": "02 Feb 2015",
            "name": "Sagar",
            "stars": "5 stars"
        },
        {
            "comment": "When I bought Moto G- 2nd Gen, as the offer of Free usage of 3G for 2 months is not given. please do the needful. When will i get this offer",
            "date": "02 Feb 2015",
            "name": "venkat",
            "stars": "3 stars"
        },
        {
            "comment": "I am very happy with the Flipkart service, I could able to get this phone within 24 Hrs of my order though i was residing almost 400 Kms away from Bangalore. As to the phone is concerned it is very good with pure android features and on the day i received my phone it is updated to Lollipop 5.0.2.",
            "date": "02 Feb 2015",
            "name": "Mastan Vali Shaik",
            "stars": "5 stars"
        },
        {
            "comment": "amazing product,you will not have better phone than this in this price range. pros 1.amazing display with corning gorilla glass 3 2.great front and rear camera 3.great performance,and gaming 4.good battery life 5.upgradable to latest android version 5.0 lollypop",
            "date": "02 Feb 2015",
            "name": "vinaykumar koli",
            "stars": "5 stars"
        },
        {
            "comment": "amazing product,you will not have better phone than this in this price range. pros 1.amazing display with corning gorilla glass 3 2.great front and rear camera 3.great performance,and gaming 4.good battery life 5.upgradable to latest android version 5.0 lollypop cons nothing",
            "date": "02 Feb 2015",
            "name": "vinaykumar koli",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile is awesome. fast and efficient.. got the next day delivery too..but not happy with the headset",
            "date": "02 Feb 2015",
            "name": "mithu",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using it for a month now...in this price range best phone...just love my phone...n i got lolipodate recently..its just got better...",
            "date": "02 Feb 2015",
            "name": "Maria Manisha",
            "stars": "4 stars"
        },
        {
            "comment": "Just loved d fone.. pic quality is best... Flash quality is just awesome... someone has stolen my moto g... i felt very bad. GUI is also very nice. No heating problem. Front speaker are also very nice... Just want to buy it again :( Flipkart as usual provided best service.",
            "date": "01 Feb 2015",
            "name": "Shankar Gandhi",
            "stars": "5 stars"
        },
        {
            "comment": "1.look nd feel is awesome. 2.in fact i purchased 2 sets,1 for me nd the other i gifted my father who is 73 yrs old..he is very happy nd using it easily with large letter options available inside settings. 3.i have been using since a month without any problem. 4.best set in this price range...in the market. 5.overall i recommend friends to go for it.",
            "date": "01 Feb 2015",
            "name": "ck patnaik",
            "stars": "5 stars"
        },
        {
            "comment": "If we update NEW SYSTEM SOFTWARE VERSION 22.21.28en.03, whether the contacts and notes saved in the phone affected or not.",
            "date": "01 Feb 2015",
            "name": "Raja Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I am resident of Amritsar Punjab. My wife who uses this phone commutes daily to Medical College, Jalandhar. I purchased Moto g2 in Oct 2014. Recently I received Notification for Lollipop update. When I started download on the night of 29 Jan 2015, it got stuck at 15%. I waited for 45 min. But it didn't increased. Finding no other option I restarted the phone. On restarting the download automatically resumed from 15%. On completion of download it asked to install. I clicked yes. Then it showed shutting down dialogue and then the screen after restart showed Motorola logo with powered by android written below. That was it and thereafter it got stuck there. I waited for 01 hour but nothing happened. I thought the process of installation is going to take long. So I put the phone on charging as the screen was on and then I slept. In the morning I found same thing on screen i.e. Motorola logo with powered by android written below. The phone couldn't be switched off. I had to go to Medical College Jalandhar with my wife. So I decided to go to Motorola service center at 2nd floor, Monica Tower, Milap Chowk Jalandhar. But they told me to go to New Rays Enterprises, SCO 11, Khukhrana Complex, Canal Road, near Khaira Palace, Main Road, Jalandhar as that is the authorized service station for Moto g2 bought from Flipkart. I went there. That center was just awful. There was a single person who seemed clueless about what he was doing. The aluminium partition was shut from inside. You have to give the phone and communicate with that person through a window. I told him the whole story. He removed sim and memory card and disassembled the phone. I was surprised as I was thinking throughout that it was a software problem. Then he took the phone to a well covered corner in the room where I couldn't see what was he doing. He took 10 minutes for inspecting the phone. Then he said that it was a motherboard problem and I would have to leave the phone there. I said I can't leave the phone as I have to go back to Amritsar in about an hour. He then reassembled the phone and when he put back the sim he said the lock was broken. When I asked how he blamed it on me. I was furious. When I checked myself the lock was intact. I wondered that the guy, who can't tell whether sim lock is ok or not, is quoting problem with the motherboard of the phone. When I went to Medical College, Jalandhar I showed the phone to software engineer of the IT department of the Medical College. He told the problem was that the new version didn't install and old version got removed. He is confident that he will be able to install the software properly. I became depressed with the pathetic after sales service of Motorola. No doubt The device is flawless but the service centers are just pathetic. I even came to know that they remove the original LCD panels of the phone and replace them with the fake ones. All this has been a rude shock to me. I was a fan of Motorola device but now I have to really think hard whether to buy Motorola phone in future or not.",
            "date": "01 Feb 2015",
            "name": "SUNIL BHARDWAJ",
            "stars": "1 star"
        },
        {
            "comment": "Sexy mobile with android lolipop, Super fast with new 64 bit os, and new updated google launcher and new look of recent apps style",
            "date": "01 Feb 2015",
            "name": "pavan kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Received in good condition. No problems with the device. Product is just as advertised. I don't need to review about the specs, just the product condition and delivery service.",
            "date": "01 Feb 2015",
            "name": "chaitu nakka",
            "stars": "5 stars"
        },
        {
            "comment": "very good quality from hard to software.....go for it. spectacullorrrrrrr look...... easy economical use..... good stereo speakers..... just elephant in the room........",
            "date": "01 Feb 2015",
            "name": "ravi sanghani",
            "stars": "5 stars"
        },
        {
            "comment": "i got this phone on 24 jan ...flipkart has delivered it in within 2 days without any delivery charge....hats off to flipkarts fast delivery service................i m very fond of music and sterio sound give awesome feeling... one of the best mobile in the range of 13000/-.... guys if u r thinking to buy it please don't.......... just go for it blindly.............",
            "date": "01 Feb 2015",
            "name": "Swapnil Aher",
            "stars": "4 stars"
        },
        {
            "comment": "I had Purchased the product just a week ago. The product is good as per the specification and recently updated with Lollipop. The only thing which I feel is: 1. No data cable provide (like what we see in other mobiles charger cable can be use as data cable). 2. Headphone quality is just OK",
            "date": "01 Feb 2015",
            "name": "Nitin Shrivastava",
            "stars": "4 stars"
        },
        {
            "comment": "this is a really good phone for the price .it is a very good budget phone . pros -good battery life , supports otg ,first in line for updates cons -lower display compared to moto g 1 , becomes a little slow when a lot of apps aare open",
            "date": "01 Feb 2015",
            "name": "aditya",
            "stars": "5 stars"
        },
        {
            "comment": "mobile is good with kitkat 4.4.4. it will work fast and smooth. But after when i have upgraded my mobile to lollipop 5.0.2. Some times my phone get stuck. Process have been decreased. Any way mobile is very good. Still i am using.",
            "date": "01 Feb 2015",
            "name": "Ajit Saha",
            "stars": "4 stars"
        },
        {
            "comment": "Good Phone for that Price. Felt good using the mobile. Offers Provided by Flipkart were really Great. Worth buying the phone.",
            "date": "01 Feb 2015",
            "name": "Venkateswara t...",
            "stars": "5 stars"
        },
        {
            "comment": "This product which is symbol of Amaze with it's Use, Price and many other feature...... I bought 3 sets from Flipkart and delivered much before than to expected date of delivery.",
            "date": "01 Feb 2015",
            "name": "Sumit Tiwari",
            "stars": "3 stars"
        },
        {
            "comment": "Its awesome to use, the camera has good clarity, easy to connect the usb device. I like the latest update of lollipop 5.0",
            "date": "01 Feb 2015",
            "name": "SAIGANESH A",
            "stars": "5 stars"
        },
        {
            "comment": "Good quality, Good looking. excellent battery backup and upgradable to Lollipop 5.0 ( Already I have upgraded my Moto G 2)",
            "date": "01 Feb 2015",
            "name": "G.JANAKI RAM",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone at this price point. Definitely worth a BUY !! Nice camera (including the front camera).",
            "date": "01 Feb 2015",
            "name": "Nilen Palicha",
            "stars": "5 stars"
        },
        {
            "comment": "Bought the phone when it was first launched(Sep-end) from Flipkart.Was going good for a while(only minor hiccups like difficulty is starting phone when the battery drain).Come Jan,the phone went into a reboot cycle.Took it to the service centre and was told that the mother board needs to be replaced.Been like a couple of weeks and havent heard back from the service centre yet.Its a toss up between which is crappier,Motorola's phone or it service. Bottom-line: Have been a user of Nokia,Samsung,Sony and HTC in the past.But the worst experience ive had is with Motorola.Pathetic phone.Wouldn't recommend it,even to an enemy. P.S.Phone aint worth even a single star.",
            "date": "01 Feb 2015",
            "name": "lokesh Ar",
            "stars": "1 star"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "01 Feb 2015",
            "name": "Hitesh Nagriya",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this Moto G-2 phone in month of september 2014 and I was very happy with this phone but now I want to put second sim in the slot but only single sim slot is working such a pathetic experience. If anybody loyal there I request to that person please help to fix this issue asap. Looking forward for the positive revert.",
            "date": "01 Feb 2015",
            "name": "Rupender Singh",
            "stars": "1 star"
        },
        {
            "comment": "Go for it.its have good camera quality,sound quality also good. it has gorill glass ,no need to protection like scratch guard,battery life is the area u will check .it is decent but depends on u r usage",
            "date": "01 Feb 2015",
            "name": "Amul Harad",
            "stars": "5 stars"
        },
        {
            "comment": "hello all, since from 26th Jan , i am facing issue in this mobile and what strange i got to know when i reached to Motorola website that IMEI number which is register is not under warrenty, i have register the case to Motorola team with the given invoice its still not given any results. when i called Flipkart they send me mails twice that they need more time to call me to resolve the issue means here is that once you purchased the brand or product you are never been take care because its all business.",
            "date": "01 Feb 2015",
            "name": "Ajay Rai",
            "stars": "1 star"
        },
        {
            "comment": "Hi Everyone, just i sharing my experience with this mobile. I have purchased this moto g2 in flipkart online in Dec and dont know my bad luck or not i got touch problem in 40 days. so i am not able to return my product as it is valid for 30days only. after that 1 year warranty replacement for any part of the mobile. this is one thing. the other thing is there is no dedicated service center for motorola. Trident technologies is service center in chennai for many mobile vendors like HTC, Motorola etc. Response with service center is not good. Camera Quality is very good which i feel very happy in this mobile.",
            "date": "31 Jan 2015",
            "name": "Sreehari Tholikonda",
            "stars": "3 stars"
        },
        {
            "comment": "Nice Exp for Product and Flipkart and It has made my day and my wife's birthday. Thanks for the same, Would definitely recommended to others",
            "date": "31 Jan 2015",
            "name": "Jinesh Sheth",
            "stars": "5 stars"
        },
        {
            "comment": "hi i not cancelled this order wat happing is this site hacked wat to do i need call or i will never booked order on this site",
            "date": "31 Jan 2015",
            "name": "paresh ranka",
            "stars": "1 star"
        },
        {
            "comment": "100% satisfied with quality given by motorola if u r confused between the azus or moto g2 then go for moto g2, you will not feel regret",
            "date": "31 Jan 2015",
            "name": "Sunil Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks FLIPKART for the quick delivery of my phone. A must buy product. Pros :- 1 Brilliant design and looks. 2 Captures images and videos in real HD quality. 3 Powerful stereo speakers which give crystal clear output. 4 Screen brightness is very good, we can use the phone in direct sunlight as well as in a dark room. Without any problem for eyes. 5 Long lasting battery 6 Android version 5.0.2 (Lollipop) update available. 7 And many many more.... Cons:- :D 1 This phone is very addictive. Once you take it in your hands you cannot put it down for next few hours... :P :P :P In short, this is a perfect phone having no problems at all...!!!!",
            "date": "31 Jan 2015",
            "name": "Ashish Karmarkar",
            "stars": "5 stars"
        },
        {
            "comment": "1. If I use any headphones other than Motorola and after removing it, I am not able to hear or speak using the normal speakers and mic. It requires a restart. 2. Opening the back door is a hectic operation. I am very much scared to open it whenever I need to change a sim card. 3. Unable to find the difference between top and bottom side. (when in half sleep or driving as well) 4. Voice calls clarity is not upto the expectation. 5. Battery is draining out comparatively with other mobiles with similar features",
            "date": "31 Jan 2015",
            "name": "Well Wisher",
            "stars": "3 stars"
        },
        {
            "comment": "best phone for the price . got an discount as well. using this phone for a month now and it is working smooth. runs all apps smoothly. not a big gaming fan just the usual social networking apps and ms office. amazing phone and amazing price.",
            "date": "31 Jan 2015",
            "name": "Shreya S",
            "stars": "5 stars"
        },
        {
            "comment": "It is a good Phone in such range. even I purchase it in exchange of my old phone. so it dosnt cost me much.",
            "date": "31 Jan 2015",
            "name": "abhi",
            "stars": "5 stars"
        },
        {
            "comment": "A true VFM phone with all the features of all the high end exorbitant phone artfully packed into a mere price range of 13K. Apart from the battery drain issue with continuous 3G usage, the phone's features along with the look is absolutely worth every penny of your investment.",
            "date": "31 Jan 2015",
            "name": "Shreya Dutta",
            "stars": "5 stars"
        },
        {
            "comment": "The reviews and number of ratings by certified buyers speak for themselves. Truly an awesome phone at this price. High on quality, nice screen with good colours production and viewing angles, good dual speakers. Upgraded to lollipop as well !! Been using for 3 days, no complaints at all. Just go for it guys ;)",
            "date": "31 Jan 2015",
            "name": "Nabeel Raza",
            "stars": "5 stars"
        },
        {
            "comment": "I bought a Moto G through Flipkart on 8 December. My friends and children recommended it.I used it for a month and really liked it- the looks, the feel, the features. I had no complaint. Then exactly one month one day from the date of purchase something went wrong and I could not charge the phone. I have taken it to an authorized service centre on 10 January but I am not entirely satisfied with the service care as it's been 20 days now and they have not been able to fix it. I have all the invoices/receipts etc. What do I do? Can you help?",
            "date": "31 Jan 2015",
            "name": "Sarita Mathur",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this mobile for 3 months, nice touch pad and camera. Battery is not that great if you are using wifi, but should be okay for an average user.",
            "date": "31 Jan 2015",
            "name": "Santhosh",
            "stars": "4 stars"
        },
        {
            "comment": "good looking, handy, upgradable to lollipop (Already I have upgraded my mobile to lollipop.) battery back up is good.",
            "date": "31 Jan 2015",
            "name": "G.JANAKI RAM",
            "stars": "5 stars"
        },
        {
            "comment": "By Default I need to appreciate the timing of flipkart. and about the phone overall its a good choice at this price",
            "date": "31 Jan 2015",
            "name": "Manohar Reddy J",
            "stars": "4 stars"
        },
        {
            "comment": "I didnot get offer from flipkart : Airtel post paid discount on next bill. (see my product offer), I request you to solve this issue. Your costumer executive not giving proper reply and try to close the issues.",
            "date": "31 Jan 2015",
            "name": "narendra sonawane",
            "stars": "1 star"
        },
        {
            "comment": "I'll directly come to pros and cons of this very good phone.. Pros - * Value for money * Not much of heating issue unlike most of the android phones * smooth interface * Upgradeable to Lollypop * Almost native android * dual sim and good speakers * decent camera * Feels sturdy Cons - * Pathetic display. You can't take pic or make call in sunlight(You won't be able to see anything in bright sunlight) * Just 1 GB RAM * No support for 4G Overall it's a good phone but not exceptional. If Lenovo can upgrade the display it will be awesome camera. 5 stars to flipkart for delivering within 48 hrs.",
            "date": "31 Jan 2015",
            "name": "Siddhartha Vatsal",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome phone in its class,,though battery is a bit problem while playing games it goes down fast.But on normal usage it is very gud...so 5 stars",
            "date": "31 Jan 2015",
            "name": "Faraz Hussain",
            "stars": "5 stars"
        },
        {
            "comment": "i have ordered this cell...and got it in time...well done flipkart.. but the procuct is heating abnormally after some time of use and battery drains very fastly, unlike the moto g 2nd generation owned by my friends.....i want to replace it",
            "date": "31 Jan 2015",
            "name": "shivam kishor...",
            "stars": "3 stars"
        },
        {
            "comment": "This is my first smartphone ordered on the very first day of G2 release. Also as promised by Motorola, got update of Android L. Pros: 1) G2 has really very stylish look(gorilla touch :)) as compared to other mobile of same range. Also 5 inch screen fits perfectly in my hand. 2) Front camera takes really nice selfies 3) Sound quality is good with dual speakers in it.(but dont expect sound like beats audio :P) 4) With extended memory card slot, it complets your memory requirement. 5) Also, Android L makes MOTO G2 perfect mobile in this range. Rest all the features mentioned are as mentioned, so I don't want to explicitly mention it. Cons: 1) I am quite not satisfied with rear camera (8MP though). 2) Battery drainer. Needs more Power battery since 5 inch screen + android(battery drainer) 3) ONE MAJOR ISSUE, I noted serveral times is that whenever my battery gets fully discharged and then when I plugged my charger to charge and kept it for few minutes(10 mins). After that, I tried to turn on cell by removing charger, but it didn't start for 20-30 mins and was continously showing battery % in charging state(though charger is removed) whenever I clicked the power button. It was quite annoying. Later it automatically got started after 20-30 odd minutes.",
            "date": "31 Jan 2015",
            "name": "Sagar Gurav",
            "stars": "4 stars"
        },
        {
            "comment": "Experience- I purchased two units, first in 13K for my father in October during launch. Based on his positive feedback I risked for me. Bought Second under old phone exchange program, Where I returned my previous phone Sony Ericsson WT19i at 3K + 1K off on HDFC card. And got this one for 9K, nice deal, ah ! But even if I had bought it for 13K, its worth ! Upgradation to lollypop - Was in doubt whether to update OS but eventually it was worth. There is no lagging wrt performance, UI is refreshed. I don't see anything wrong in updating. - Only issue with the phone is, it's now pretty common in the segment, but if that doesn't bother you.. Go for it.",
            "date": "31 Jan 2015",
            "name": "OJ SHRIVASTAVA",
            "stars": "5 stars"
        },
        {
            "comment": "mobile is good in quality with affordable price But ear phone is not upto the mark, in my case i got defected ear phone",
            "date": "31 Jan 2015",
            "name": "ramesh",
            "stars": "4 stars"
        },
        {
            "comment": "i want money for other mobile.it was not sufficient for me it low price mobile it not many function so i was want to buy apple iphone 5.thank you..",
            "date": "31 Jan 2015",
            "name": "ABHISHEK KUMAR...",
            "stars": "3 stars"
        },
        {
            "comment": "I m mahesh, I shop Moto G2 before a week, Moto G 2nd generation phone having very fantastic features with front and rear cameras.",
            "date": "31 Jan 2015",
            "name": "Mahesh Kamble",
            "stars": "5 stars"
        },
        {
            "comment": "Its the same product I wanted to have. Nice delivery by flipkart.................... .........................................",
            "date": "31 Jan 2015",
            "name": "Nandita Singh...",
            "stars": "4 stars"
        },
        {
            "comment": "i purchased this handset on 29 December 2014,and received 3g for 1 month absolutely free.But for second month ,Airtel stopped my free data pack.Even though i registered complaint 2-3 times with airtel, no action was taken. I have checked on different complaint blogs that many other user had similar issues with airtel offer.",
            "date": "31 Jan 2015",
            "name": "Anish kumar",
            "stars": "1 star"
        },
        {
            "comment": "Of all the features, Camera is average..Not too many options.. Good video recording. Battery consumption is more while using single SIM. But to my surprise, its just the opposite while using 2 SIMs..Overall great phone for 13K...",
            "date": "31 Jan 2015",
            "name": "Aditya Acharya",
            "stars": "5 stars"
        },
        {
            "comment": "Got this mob through flipkart, marvelous service from flipkart hats off, got the mob on the next day of my order well packed. MOTOG in one word too gud worth buying splendid",
            "date": "31 Jan 2015",
            "name": "Gopu Karupannan",
            "stars": "5 stars"
        },
        {
            "comment": "very good phone... bought it for my Dad... now going to order one for myself too!!! looks and performs like a premium high end phone at an unbelievable price... go fir it without blinking an eye... 100% recommended...!!!",
            "date": "31 Jan 2015",
            "name": "Bhaskar Das",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is a good mobile performance wise and look wise. I have used Moto E,Moto G and Moto G2 all are very good.....",
            "date": "31 Jan 2015",
            "name": "Jai Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the phone for my father who was using the smart phone for the first time. When it got delivered it had lots of dead pixels & he did not know that it was a feature rather than a defect. When I found out few days later, I called flipkart and they were brilliant in sending me a replacement. The replacement is brilliant - so a big thank you to the Flipkart service. Now coming to the phone itself - be careful what you wish for. It is a 13K phone and comes with features which is apt for that price and no wonder it has 4 ratings with over 18K reviews. I use Grand 2 so I am comparing against that. 1. Display brilliant, but don't compare it against Galaxy Grand 2, which'd cost another 3 K more. 2. CPU - very comparable. 3. RAM - 1GB vs 1.5 in Grand 2. So, if you are looking to install lots of games that use too much RAM, think twice. If you are more whatsapp/facebook/phone call type person, then this may be the phone for you.",
            "date": "31 Jan 2015",
            "name": "Subramanyam Vi...",
            "stars": "5 stars"
        },
        {
            "comment": "I was using samsung and just moved to MotoG . What a difference in experience. lag free, smooth like MAKHAN. Nice display , smooth touch, excellent camera and front speakers .",
            "date": "31 Jan 2015",
            "name": "Arvind Pathania",
            "stars": "5 stars"
        },
        {
            "comment": "worst mobile in my life poor battery backup. some times mobile hanging service centers also rare picture clarity also not good compare to samsung 8 mp",
            "date": "31 Jan 2015",
            "name": "trinadha reddy",
            "stars": "2 stars"
        },
        {
            "comment": "Worth trying .................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................... You will love it.",
            "date": "31 Jan 2015",
            "name": "Krishnendu Mandal",
            "stars": "5 stars"
        },
        {
            "comment": "hello! I'm not sure whether my battery has damaged or the phone is indicating wrong battery %. But two times it got switched off , but i'm sure that the battery % was 30 at that time.",
            "date": "31 Jan 2015",
            "name": "Sekhar Jangapol",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased this phone 4 month ago and it is a owesome experience. speed and picture quality is osesome. durability incredible. overall phone is paisa vasool...",
            "date": "31 Jan 2015",
            "name": "Aftar Hussain",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone, been using it for 6 months now , haven't faced any issue yet. All the features are pros in this phone. Cons Speaker is inconsistent - sounds low or high sometimes(maybe just in my phone) Wont recommend 5.0.1 update as it still has many issues. Kindly wait for 5.1 which comes out at Feb end.",
            "date": "31 Jan 2015",
            "name": "Gilroy Dsouza",
            "stars": "4 stars"
        },
        {
            "comment": "Great screen, No lags, Brilliant sound love the mobile, but sold due to terrible battery....Good mobile if your use limited, but otherwise its problematic due to battery....",
            "date": "30 Jan 2015",
            "name": "Irfan Ismail",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased motorola 2 g mobile by flipkart my observation about mobile as below 1. Screen very good. 2. speaker good 3. Style very good. 4. Easy to use 5 Battery average.",
            "date": "30 Jan 2015",
            "name": "Piyush Upadhyay",
            "stars": "4 stars"
        },
        {
            "comment": "Fone is good as your luck. I have purchased 5 moto g 2 and 3 of it have board complaint. I approached the service centre. But the service screwed me up. Phone is awsome if you are lucky othervice it will fed you up. Too bad service",
            "date": "30 Jan 2015",
            "name": "Ginson Gayos",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this mobile since last 30 days , mobile is awesome but the problem is with the latest lollipop OS, every one buying this mobile because of lollipop OS and me too. But lollipop OS have a lot of bugs.if you buy this mobile dont update to the latest lollipop until and unless the lollipop OS released with all bugs fixed.Except this issue mobile is awesome.",
            "date": "30 Jan 2015",
            "name": "Venkatesh Konamma...",
            "stars": "2 stars"
        },
        {
            "comment": "Nice Phone in this price range.Slim design,Gorilla glass,good internal memory,Latest Lollipop update are few features for this phone.Better camera,sound quality better than other phones in this price range.Hard to press buttons for power,volume keys.Headsets are of low quality.",
            "date": "30 Jan 2015",
            "name": "vishal lohkare",
            "stars": "4 stars"
        },
        {
            "comment": "Highly recommended, awesome touch and fast processes, motorola have done a good job, one day delivery by ws retail and flip kart",
            "date": "30 Jan 2015",
            "name": "Pankaj Rawat",
            "stars": "5 stars"
        },
        {
            "comment": "Very nice phone and good grip, now there is lolypop in it. Camera is good but the only demerit is its battery. Other then that all is tooo goood.....I am loving it",
            "date": "30 Jan 2015",
            "name": "Rahul Garg",
            "stars": "5 stars"
        },
        {
            "comment": "Poor product. Frequently hangs. Getting auto switch off. I am totally frustrated. Have approached Flip kart for product change. don't know how long they will take for replacement",
            "date": "30 Jan 2015",
            "name": "sureshbabu R",
            "stars": "1 star"
        },
        {
            "comment": "THIS IS A SOLID AND VERY HARD MOBILE OF THIS CATEGORY. VERY GOOD VIEWING DISPLAY ANGLES GREAT DISPLAY GOOD SOUND CLEAR CAMERA BEST FOR PRICE",
            "date": "30 Jan 2015",
            "name": "BALU ARJUNAN",
            "stars": "5 stars"
        },
        {
            "comment": "Lollipop has some bugs still. Hope that will be fixed in the coming versions. Best product overall otherwise.",
            "date": "30 Jan 2015",
            "name": "Parasuraman R",
            "stars": "5 stars"
        },
        {
            "comment": "Already was using Moto G 1st gen. Bought it since I was impressed by the specs. The phone is kind of cool with good performace and nice speed while browsing. Most use it on different apps. Haven't tried gaming. Overall a good buy compared to samsung. Like since the OS upgarde is always there",
            "date": "30 Jan 2015",
            "name": "Kiruthivasan S",
            "stars": "5 stars"
        },
        {
            "comment": "Caution: Do not update to v5.0.2 Lollipop due to bugs somewhere in the software battery life is massively decreased and you would hardly get 1-2 hours of screen on time. Not only moto G2 is facing this problem but other devices (nexus 5 & moto x2nd gen) which were updated to lollipop are experiencing same issue. This is a viral problem, if in any case you have already updated to lollipop version, wait for motorola to patch it. anyway, Device is great!",
            "date": "30 Jan 2015",
            "name": "Megh Gusain",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone in this price range. Very Good LED Flash. Good Pictures even in low light. easy to use. Fits good in hand.",
            "date": "30 Jan 2015",
            "name": "Pushpraj Singh",
            "stars": "5 stars"
        },
        {
            "comment": "using since last two months, no lag in gaming, one day battery backup, no heating issues, speakers are loud and clear, and in last such a wonderful phone with in competitive price,",
            "date": "30 Jan 2015",
            "name": "Jatin Malik",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone for past 4-5 Months, Feels really good, And I never felt that my Phone is Increasing heat compare to my previous smartphone I was using.",
            "date": "30 Jan 2015",
            "name": "Katragadda Pradeep",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone in the price range.. would definitely recommend for someone wishing to have a featured phone with good value for money to buy this phone..",
            "date": "30 Jan 2015",
            "name": "Tapash Mukherjee",
            "stars": "4 stars"
        },
        {
            "comment": "TOUCH RESPONSE GOOD,BATTERY STAND BY GOOD,OVERALL GOOD,INTERNET SPEED/ACCESSING VERY GOOD,FAST RESPONSE IN WORKING,OVERALL GOOD FRONT CAM IS TOO GOOD, THE ONLY THING IS RAM NEED TO 2GB",
            "date": "30 Jan 2015",
            "name": "suresh kumar ch",
            "stars": "5 stars"
        },
        {
            "comment": "Got my product within 3 days of my order. The packing quality is very nice as usual. I'm writing the review after using Moto G2 for about 3 weeks. The performance of the phone is outstanding regarding display, speed, sound quality, handling, network, wifi. I've not faced any issue with the phone so far. Also, the great point is, as promised by Motorola, I've got Lollipop on 22nd January this year. If you're thinking of buying Moto G2, then my opinion will be, don't think so much, JUST GO FOR IT !!!!!!!!",
            "date": "30 Jan 2015",
            "name": "rajib das",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is just awesome in this range of 13000 bugs... i would definitely recommend to others those who r willingly to in this range.",
            "date": "30 Jan 2015",
            "name": "Tanmay Srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "Phone build looks like little delicate. Moto G generation1 phone is much stronger than this. The features are promising and making the phone still worth purchasing.",
            "date": "30 Jan 2015",
            "name": "Shiva B",
            "stars": "4 stars"
        },
        {
            "comment": "Decent config for 13K. Build quality is good. Got Lollipop update too. For games It does perform okay not bad. Sometimes you ll be thrown out of the game (I'm facing this issue in asphalt 8). Camera very good in outdoor as well good in indoor but not like outdoor performance (In terms of focus and quality),Indoor noise you'll find in the pic. Front cam is decent to take selfie. Battery performance is little disappointing.Overall it is a good phone to buy. No need to worry much about the quality , It has good quality in terms of build. Wifi and data speed is very good no issues found so far. I've been using this phone for 3 months and It restarted only once by itself when I was watching online cricket.",
            "date": "30 Jan 2015",
            "name": "Karthik S",
            "stars": "4 stars"
        },
        {
            "comment": "Best mobile for the price.. well packed. and timely deliver by Ws Retail.... Fully satisfied.. :) I gifted to my brother.. :) He z just loving It. :)",
            "date": "30 Jan 2015",
            "name": "Abisheik Shanm...",
            "stars": "5 stars"
        },
        {
            "comment": "2070mh battery :( Faster speed due to good quality & upgraded processor, Sensors work is excellent, Music quality good specially by ear wrapped Headphone. After using one month the phone creates problem its screen is heated up to 43 degree C.It suddenly stop charging after restart it works. Previously i have samsung quattro which is best phone i ever use.I am disappoint with this phone. Think once before buying this phone #motog2ngen ........!!!!! :) :) :)",
            "date": "30 Jan 2015",
            "name": "Tarun Bhamdare",
            "stars": "3 stars"
        },
        {
            "comment": "its camera is fine for hd recording. voice is clear. touch super smooth.....if the battery mah increased another 500-1000mah it will be best.",
            "date": "30 Jan 2015",
            "name": "a r shankar d...",
            "stars": "4 stars"
        },
        {
            "comment": "The one among the best mobile in its range and glad flipkart gave me this product at the said price and for the timely delivery.",
            "date": "30 Jan 2015",
            "name": "Kannan Bhagat",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery from flipkart was good... got this product within 4 days. Its good phone for moderate use... If some one is buying this for playing games then you should go for some other option (2000MAH+ Battery). With Moderate use this phone hardly lasts for day. Giving it 4 start as disaapointed with battery life. Overall with android 5.0 update..phone works fine with no lag. Dual Sim (both 3G supported) and moderate use. One should definitely go for this model.",
            "date": "30 Jan 2015",
            "name": "Rohan Pathak",
            "stars": "4 stars"
        },
        {
            "comment": "Previously used phones: Samsung galaxy S2, Tab 2, Note 2 and Xperia SP, Currently Blackberry Z10 but purchased moto G2 for andriod lollipop My experience with moto G2: 1. Build quality: Good considering price of 13K 2. Decent performance ( few stutters while multitasking but considering price I am pretty satisfied). 3. Handling 32GB memory card (Class 10) smoothly 4. Back covers are good you can purchase one. 5. No heating issue ( I don't play games but heavy user of Google Apps) 6. Updated to lollipop and running smoothly. 7. Battery backup: not bad",
            "date": "30 Jan 2015",
            "name": "Satish Reddi",
            "stars": "5 stars"
        },
        {
            "comment": "great phone display, ram ,storage speaker are little bit disaapointing but overall great product at this price",
            "date": "30 Jan 2015",
            "name": "Archit mittal",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone and more then happy :) As expected phone has excellent results for Video and call quality is also good. Battery Saver is ultimate and keep you on always.",
            "date": "30 Jan 2015",
            "name": "Manil",
            "stars": "5 stars"
        },
        {
            "comment": "Worst phone, board crashed, strucked at zero charging, boot loop,,, etc given to service center, they r asking me to wait till 20 feb. 1 whole month.. waste of money.",
            "date": "30 Jan 2015",
            "name": "Chandu Bellamkonda",
            "stars": "1 star"
        },
        {
            "comment": "ITS UPGRADE TO LOLIPOP THAT'S NICE INTERNET SPEED IS AWESOME.The powerful Qualcomm® Snapdragon™ 400 processor with 1.2GHz quad-core CPU and advanced graphics lets you switch back and forth between tasks without ever slowing down. :) :) :) :)",
            "date": "30 Jan 2015",
            "name": "RAHUL ROY",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this Moto G2 two weeks back and I got upgrade to Lollipop 5.02 directly & its running smoothly. The phone is quite fast. The only problem with this phone is it take more time to get charged.",
            "date": "30 Jan 2015",
            "name": "Kiran",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this for my sister and shes pretty much satisfied with this fone..it even got lollipop update..the is nice doesnt lag...it had battery issues but after lollipop update that issue got solved. Only con it has is its charger which takes alot of time to charge the fone...so i got a sony charger and that charges the fone just fine.",
            "date": "30 Jan 2015",
            "name": "Talib Zaz",
            "stars": "5 stars"
        },
        {
            "comment": "using for 3 weeks now.good build quality,good camera,little lags.very good camera but average battery.overall a good buy.",
            "date": "30 Jan 2015",
            "name": "Ranjan Bhowmik",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 is simply superb mobile with latest android l update.. nice battery back up... umma loving it.. Thanks for motorolla and flipkart..",
            "date": "30 Jan 2015",
            "name": "Shruthi",
            "stars": "5 stars"
        },
        {
            "comment": "Lollipop Upgraded one is pretty good.... Simple & Great...... I expect more updated version of lollipop.....",
            "date": "30 Jan 2015",
            "name": "Nirmal M Maliekal",
            "stars": "5 stars"
        },
        {
            "comment": "I have used this product about 3 months and finally argued that the moto g (2nd) works like a civilized beast in this category .The camera is undoubtedly good .",
            "date": "30 Jan 2015",
            "name": "AVIJIT CHOWDHURI",
            "stars": "5 stars"
        },
        {
            "comment": "I used only 2 months, Software crashed the entire phone. no display, no switching on. totally gone. please take care before releasing Motorola, don't do just for money. Do sell good thing. wasting our time and money including your ad also waste for these products.",
            "date": "30 Jan 2015",
            "name": "Manjunatha Raju",
            "stars": "1 star"
        },
        {
            "comment": "it is one of the most affordable and genuine product at 13000 rs. and gra=eat thing is it is a stock android so i could get Lollipop immediately. I suggest that this is a great value for money product.",
            "date": "30 Jan 2015",
            "name": "Kalyan Kanth",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome phone. robust for rough use. do not forget to buy a good quality cover from flipkart itself, it proves itself useful when you later drop it umpteen times.i been using this fone for 2 years i think . before this i used a LG G2 phone for 3 years and had good experience with it too . moto g was supposed to be motorola's recovery vehicle and what a way to roll ...",
            "date": "30 Jan 2015",
            "name": "purplepatch",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this one from FK without doing much research. I am using it since Sept 2014. No problem till date. Yeah Battery is average. Also bit heavy. Display is nice.",
            "date": "30 Jan 2015",
            "name": "Nipul Boruah",
            "stars": "4 stars"
        },
        {
            "comment": "It is really a improved version of moto g. Body is not attractive like moto old versions but it seems Motorola had done a lot of homework on it . bigger screen and better camera quality.",
            "date": "30 Jan 2015",
            "name": "vivek kumar singh",
            "stars": "5 stars"
        },
        {
            "comment": "A very trendy and fast moving mob and a best choice for anyone who would like to show off or in search of a quality product... Delivery is very fast and was delivered in two days without any delivery charges or any extra payment for a quick delivery is needed. Was quite dissatisfied with the accessories for I recieved white colour normal speaker (for a 13,000 worth product) and White charger for my black mob and USB was not included... But I am very satisfied with this Shiny new toy of mine... Really Awesome :)",
            "date": "30 Jan 2015",
            "name": "Pearline Prisc...",
            "stars": "4 stars"
        },
        {
            "comment": "This is really nice piece. Sound quality is excellent. Just got lollipop update today. Sweet experience..!",
            "date": "30 Jan 2015",
            "name": "ritesh",
            "stars": "5 stars"
        },
        {
            "comment": "YAAA THIS IS THE PHONE I WANTED BEST PHONE THIS DOESNT GET HANGED BUT 1 DRAW BACKJ IS BATTERY DOESNT LAST MUCH YOU MUST HAVE A POWER BANK THAT IS THE MAIN DRAW BACK ELSE PHONE ROCKS!!!!!!",
            "date": "30 Jan 2015",
            "name": "Pradyumna B Ra...",
            "stars": "5 stars"
        },
        {
            "comment": "simply say trust to buy product in flipkart. first impression is best impression this is my first buy in flipkart,very good purchase item tracking system, very good customer relationship,very good internal communication to shipping area.and full fill in customer requirement.finally very good followup in customer satisfaction.",
            "date": "29 Jan 2015",
            "name": "sathish",
            "stars": "5 stars"
        },
        {
            "comment": "A very awesome phone and now i am missing it I have lost this in train while charging the sound quality is best stereo sound camera is super and touch and processing is very fast and satisfying",
            "date": "29 Jan 2015",
            "name": "AMMAR RIZVI",
            "stars": "5 stars"
        },
        {
            "comment": "a perfect phone but now lenovo is better with half price and same confi,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,",
            "date": "29 Jan 2015",
            "name": "narian singh",
            "stars": "4 stars"
        },
        {
            "comment": "Good Mobile using last six Month no problem as of now . No hanging issue and working with out any issue . worth for money .. recommend to buy ..",
            "date": "29 Jan 2015",
            "name": "Palani Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I got this mobile two months back .. and was enjoying the same... But one day my handset fell down from 2 feet height and the whole gorilla glass was cracked badly : Now the service center is demanding approx. 7000/- for replacement i.e. more than half the cost of phone for screen only. What a system of recovering the cost through repairs and charging the huge amount for small repairs. RATING - 4 star for phone. - 1 star for after sale services.",
            "date": "29 Jan 2015",
            "name": "Sanjay Tyagi",
            "stars": "4 stars"
        },
        {
            "comment": "good one,excellent features,even delivery also before time,everything superb,with in the budget it is a good product.",
            "date": "29 Jan 2015",
            "name": "SRCP",
            "stars": "5 stars"
        },
        {
            "comment": "Better than my previous 8 GB moto G. They should make UI better. Still issues with charger. Surprising to note that not much improvisation done in that part. Motorola can think about providing covers/pouches even on chargeable basis.",
            "date": "29 Jan 2015",
            "name": "Mahesh M",
            "stars": "4 stars"
        },
        {
            "comment": "It is one of the most developer friendly phone ever...! Fits well on your palm, decent under the bonnet stuff and hell I love my phone. Certain go for if you are on this budget line.",
            "date": "29 Jan 2015",
            "name": "Ravi Tej",
            "stars": "5 stars"
        },
        {
            "comment": "Apart from low battery backup and heating on regular use there is nothing that I can complain about. It has all the features of a high end smart phone. There is nothing you can't do with a MotoG. Love this phone. Screen size is good and you can use multiple apps at the same time without making the phone go sluggish.",
            "date": "29 Jan 2015",
            "name": "Sundeep Bhatia",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile is taking long while hanging up. Purchased on 19th Jan delivered on 21st Jan. Still no other apps installed even then hanging problem.",
            "date": "29 Jan 2015",
            "name": "M M D",
            "stars": "3 stars"
        },
        {
            "comment": "I strongly recommend that please buy the each and every electronics items from shop near you or authorized dealer because as per government new guidelines now the ploicy changed for online shopping, in new policy product purchased from online stores will be treated and services by different services centers and also consumer is not able to claim anything on company. So just go and buy from stores only may be the product cost differ little bit but customer can satisfied with services.",
            "date": "29 Jan 2015",
            "name": "Dharmendar Cho...",
            "stars": "1 star"
        },
        {
            "comment": "We bought 2 of these in 1 month as the performance of the phone is just too good. I use a Samsung Note 3 and am amazed at the quality of MotoG 2nd gen as this is pretty good keeping in mind the price you are getting it for!",
            "date": "29 Jan 2015",
            "name": "N. Rao",
            "stars": "5 stars"
        },
        {
            "comment": "worth of money I have been doing online shopping past 2 years and my overall experience is good. Of the very stores I had shopped one of the best Is Flipkart.com.",
            "date": "29 Jan 2015",
            "name": "flipkart user",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is really awesome for the price. Pros: Good processor Little lag( Hardly any lag when i updated to Android L) Very sturdy- This phone is very sturdy. I have accidentally dropped my phone at least 10 times till now. No crack on screen or anything. Very sturdy as compared to other good phones like asus zenfone 5. Water proof- This doesnt mean that you use it while in the pool. it can easily bear some water on the surface. Expandable storage upto 32 gb. Along with my 16 gb internal i have external 32 gb. memory isint a problem. Updates(Moto g is one of the 1st phones to recieve Android L) Cons: RAM- only 1 gb hence multi tasking is a problem, u can play heavy games on medium settings. Camera- i did not like the camera app of moto g2. very average interface. Battery life- same as the moto g1. The screen of moto g2 is bigger than it's previous version hence battery is consumed more. This phone should have had more battery life. Speakers- The voice somewhat cracks at high volume(smooth voice after upgrading to Android L. I dont know how) As compared to other phones, this phone is very good(Asus zenfone 5 has stronger processor and 2 gb ram, better display but it is fragile, not specified as waterproof, voice quality while calling is not as good as moto g2, display not as bright as that of moto g2) In short, Moto G2 is an all rounder for the price. In my opinion you should go for it. This is my personal review. Hope it helped :-)",
            "date": "29 Jan 2015",
            "name": "Karan Javali",
            "stars": "5 stars"
        },
        {
            "comment": "MotoG 2nd Gen available only flipkart delivery are super like moto g 2nd gen, 16 gb internal, 32 gb external front cam is awesome 2 MP smooth operating 1 GB Ram totally its Budget phone",
            "date": "29 Jan 2015",
            "name": "CHANDAN KUMAR...",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Almost every thing about the phone is good.Best available option in this range with no performance issues. Game play experience is also good. Cons: Voice quality is OK.",
            "date": "29 Jan 2015",
            "name": "ROHIT BISHT",
            "stars": "4 stars"
        },
        {
            "comment": "The product delivered has a defective primary camera. I had ordered the phone even though i know that most of the phones from moto are faulty because it has great specs when compared to the other phones in this price range. But seriously I now regret for buying this phone which has more defects and irritating customer service.",
            "date": "29 Jan 2015",
            "name": "Ravi",
            "stars": "1 star"
        },
        {
            "comment": "Some features are not easily accessible..later you will habit it . Nice product. At price tag you will find high end features .. if you are brand oriented go for this..",
            "date": "29 Jan 2015",
            "name": "JONES JEEVA",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it recently and it is really Good. Suggested to my friends too. v",
            "date": "29 Jan 2015",
            "name": "Thirupathirajan K",
            "stars": "5 stars"
        },
        {
            "comment": "It is good mobile from Motorola. They delivered before expecting delivery date. This device has nice look and performance also very nice. I will recommend this product.",
            "date": "29 Jan 2015",
            "name": "vijayasekhar redd...",
            "stars": "5 stars"
        },
        {
            "comment": "battery backup is very poor. even i haven't installed any game the back up is very poor and i will be happy to return the cell phone just after 1 month from the date of purchase",
            "date": "29 Jan 2015",
            "name": "Mohit Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "i Have purchased Moto G 2 thinking it will be good , mobile is getting heat when I do following actions in the mobile. When i switch ON mobile data when i open camera ( if i take 20photos it will be hanged) when i open Videos, battery is also not good...discharging like anything.. i am fedup of moto g 2.... i am more worried about mobile is getting more heat. i can make omlet also..!!!!",
            "date": "29 Jan 2015",
            "name": "santhosh varma",
            "stars": "1 star"
        },
        {
            "comment": "Using this phone for last 3 months. Everything is fine with this product. Cons: 1) battery life is not too high, particularly when many Apps are running simultaneously (though it is normal case for all smart phones). takes long time to be charged. 2) network connectivity is not good. it goes off any time but does not automatically catch the network. you have to connect it manually every time. Pros: Camera, Sound, software, design and overall other all aspects are very good.",
            "date": "29 Jan 2015",
            "name": "Shubhatam Sen",
            "stars": "4 stars"
        },
        {
            "comment": "Guys don't have a second thought on buying this phone.......................................................",
            "date": "29 Jan 2015",
            "name": "Amruth KS",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product (after using 3 months). Everything is fine except the battery backup. Picture quality and video quality is really very good if you compare to any other brand.",
            "date": "29 Jan 2015",
            "name": "Prasenjit Paul",
            "stars": "4 stars"
        },
        {
            "comment": "I can not really compare it with anything in this category. I got this by exchanging my old phone that is Samsung Galaxy Y Duos, thinking of try some different brand other than Samsung this time. Pros : 1) Superb 8 MP Primary Camera and 2 MP Secondary Camera 2) Dual Sim (GSM + GSM) 3) 1.2 Ghz Qualcomm Quad Core Processor - slows down for more apps 4) 1 GB RAM - Can be improved 5) Android v4.4.4 (KitKat) OS - Upgradable to LOLIPOP- nice to have 6) 5-inch HD Screen - Really nice to watch Cons : 1) battery Life might be improved. 2) Might be more slim",
            "date": "29 Jan 2015",
            "name": "Smruti Ranjan...",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone in this budget. Go for the Moto G..I have purchase 3 phone,,...............Gud job flipkart",
            "date": "29 Jan 2015",
            "name": "NAYAN KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "It was good decision....nice features.....backup easily taken....battery consume some time.....over all good phone.",
            "date": "29 Jan 2015",
            "name": "Rohan Modi",
            "stars": "4 stars"
        },
        {
            "comment": "the phone is genuinely an excellent experience, runs all the apps, and works in a fantastic manner, but there are few faults that may have crept into it, the operating system crashes within a span of 90 days, and puts u to face a huge amount of inconvenience, rest the phone deserves a 5 star rating",
            "date": "29 Jan 2015",
            "name": "ashutosh singh",
            "stars": "5 stars"
        },
        {
            "comment": "The features included in this mobile are good,but i would give a 5 star if the battery backup would have been better",
            "date": "29 Jan 2015",
            "name": "Rohit Karnatakapu",
            "stars": "4 stars"
        },
        {
            "comment": "hi everyone i bought this Motorola G mobile from Flip kart the service is awesome reach on time , delivery boy + customer care executive are very helpful plus supportive keep it up !!!",
            "date": "29 Jan 2015",
            "name": "Nida Syed",
            "stars": "5 stars"
        },
        {
            "comment": "i love it very much..design..camera...clarity...sound.... speed...everything is superb just buy and enjoy",
            "date": "29 Jan 2015",
            "name": "naveen subrama...",
            "stars": "5 stars"
        },
        {
            "comment": "The offer for airtel users that they will be given 1 gb 3g data for 2 months does not works. I lost my ₹100 balance because of this fake offer",
            "date": "29 Jan 2015",
            "name": "Raghav Goel",
            "stars": "3 stars"
        },
        {
            "comment": "nice product form Motorola. sound quality nice. touch is ok ok. camera is better. i bought this before 4 month. handy shape. but i think s3 neo is better.",
            "date": "29 Jan 2015",
            "name": "AMIT DESHWAL",
            "stars": "4 stars"
        },
        {
            "comment": "this phn z asssum i bugth dis phn 4m flipkart & knwm am usig dis phn feeling good camera quality good performence z good battery packup is also good but it could have beter increase the battery from 2070 to 2300 as moto g to moto g2",
            "date": "29 Jan 2015",
            "name": "roshan",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is an outstanding and an amiable thing in Moto G2 except the worst and poor Battery. Simply Best for those who will not be using 3G all the time and for those who will not be playing much games on this device. Worth to buy this product for just 13K.",
            "date": "29 Jan 2015",
            "name": "Ganesh Rajavel",
            "stars": "4 stars"
        },
        {
            "comment": "I am using motorola for the first time and i m in love with it....In kikkat the launcher use to repin after heavy multitasking but it was fixed in lollipop. You should go for it...!!!!",
            "date": "29 Jan 2015",
            "name": "Karan Thakur",
            "stars": "4 stars"
        },
        {
            "comment": "as a product it is quite good. battery back up is decent and all. The only problem thus far is that it lacks in essential things like a file manager or \"my files\" lacks the option to set default storage device as SD card which can be irritating if I want to conserve space in the phone by transferring the files to SD card. When I want to do that, I have to manually transfer the files everytime",
            "date": "29 Jan 2015",
            "name": "aditya pillutla",
            "stars": "3 stars"
        },
        {
            "comment": "Display costs more. Authorized service center is costing 7000 for moto g 2nd geenration. Its better to go for non-gorilla glass version if any available",
            "date": "29 Jan 2015",
            "name": "Arunkumar Garige",
            "stars": "1 star"
        },
        {
            "comment": "Worth buying looking at the features Would be great if i received it with a cover The glass finish is excellent and the feel is really good Go ahead buy it because you are worth it",
            "date": "29 Jan 2015",
            "name": "Sanjay Gawas",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone , been using it for 4 months now and there hasn't been a single issue with it. Jan 25th phone received android lolly pop update. Highly recommend the phone if you are looking for dual sim card phone with good battery backup on a decent price.",
            "date": "29 Jan 2015",
            "name": "PraDeeP G",
            "stars": "5 stars"
        },
        {
            "comment": "everything is superb. best budget phone. pros-camera (superb),speakers(best after htc),look-very slim and light (i loved the dimple most),processor n ram-combination gives u no lag at all if u don't play heavy games,screen and display-super crisp (i tell u its really kool),no inbuilt app(although very few are there) cons-battery(but its o.k gives you one full day on medium usage). no UI i.e it comes with stock android but is manageable in fact i din't want it as well",
            "date": "29 Jan 2015",
            "name": "Saurabh Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "gr8 phone 1. Nice camera. 2. Good selfies. 3 a 24 hr battery on 3g usage. 4. good display. only prob i faced in this phone till nw is.. auto brightness. its vry vry low... i always keep it on 70-80% brigtnss level.",
            "date": "29 Jan 2015",
            "name": "abhishek chaud...",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product. I also appreciate the flipkart service. I recommend this product to user. Go With moto g2 . There is good camera quality execllent phone speed. Good battery life.",
            "date": "29 Jan 2015",
            "name": "Keyur Patel",
            "stars": "5 stars"
        },
        {
            "comment": "blank display problem... when i gave it for replacement...the service centre(Motorola affiliated service centre) people told they'd repair it instead of replacement...it has been over a month...still i haven't received my handset... regret choosing Motorola.",
            "date": "29 Jan 2015",
            "name": "karan",
            "stars": "1 star"
        },
        {
            "comment": "There is not at all a single problem i have faced after buy.. A very decent and preferable device i have ever seen.. OTG support, full hd video, and it supports all the functions as mentioned in the 'about' part.. Only cons i can talk about are: ~ First, the battery. It should be of more power. its drainage is very fast. It drains like a flowing water while transferring files using OTG. On heavy usage, using internet, battery can lasts upto 7-8 hours. ~Secondly, The display is not very pretty as compared to the old Moto G. Its colors is not as much bright as moto g. but supports full hd videos without any lag. ~Third, Motorola Headphones are of very bad quality. Even in full volume it sound very slow and not be considered as a good quality earphones. Samsung or other are very good as compared to motorola.. Beside these CON's the new Moto G (2nd Gen) is very cheap and best phone.. One should prefer it under the budget phone.. Thank You..! :)",
            "date": "28 Jan 2015",
            "name": "Lalit Namdeo",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product in this range. Quality of the camera is good and battery backup also good. I recommend it to all of you",
            "date": "28 Jan 2015",
            "name": "Sunder",
            "stars": "5 stars"
        },
        {
            "comment": "Bakvas phne exchange this phne othervise i will not buy anything from your site, bas ye phne exchange karlo nahi aapki ye flipkart company band karvadunga excahnge this phne bhai ye phne mat lena specially from flipkart anyother site you can buy this phne",
            "date": "28 Jan 2015",
            "name": "Surbhi mehta",
            "stars": "1 star"
        },
        {
            "comment": "thank u very match sir.. i was received my product moto g2..you are delivery is very fast and safe..daily delivery update very good, thanks to fedex courier ..moto g2 is very good phone and very nice..thanks to my seller ws retail and thanks my best site flipkart.com.than you......",
            "date": "28 Jan 2015",
            "name": "Nareshkadiveti",
            "stars": "4 stars"
        },
        {
            "comment": "Best budget Android smartphone within the 13K range! Pros: 1) 5 inch HD Display with Gorilla glass 2) 8MP primary camera 3) Android 5.0 Lollipop update 4) Front Speakers 5) Pure Android Experience Cons: 1) A bit sluggish after the Android 5.0 Update 2) Battery not that very impressive",
            "date": "28 Jan 2015",
            "name": "Manish Kanakaraj",
            "stars": "5 stars"
        },
        {
            "comment": "Bought the phone 4 days before, it looks a very good phone but at the first moment i opened it its SIM slots were not working, I tried everything i.e. troubleshooting but still the SIM is not recognized.....waiting for the flipkart to resolve the issue at earliest as i want to opt for the offer of Airtel 3G 1 GB data for 2 months",
            "date": "28 Jan 2015",
            "name": "Nikhil Kumar",
            "stars": "1 star"
        },
        {
            "comment": "I was looking forward to this phone as my birthday present to myself. I was utterly disappointed with the model as the basic audio of the phone had an irritating disturbance. I experienced this disturbance each time I attended or called someone. I wanted to get the phone replaced but the customer service agents would just not do it as easily. I was asked to follow a troubleshooting exercise which did not resolve the problem, even so my ticket was closed as- the customer declined the request to replace the device. In my third attempt I was lucky enough to get it replaced. Finally, I was eagerly awaiting the new handset as I thought only my earlier piece had this audio disturbance issue. As soon as I inserted the sim to check the audio , I faced the same issue of audio disturbance It is to my utmost dissatisfaction that I am writing this review as my experience could not have been worse. If it is a company defect then it needs to be highlighted immediately and I believe products when going for replacement should be checked once to be sure that atleast the next time the customer is not left dissatisfied.",
            "date": "28 Jan 2015",
            "name": "Shruti",
            "stars": "1 star"
        },
        {
            "comment": "I am completely satisfied with features in moto g but I received handset with faulted speakers. I have made complain regarding it. Lets see what happens next.",
            "date": "28 Jan 2015",
            "name": "Maulik Sakhare",
            "stars": "4 stars"
        },
        {
            "comment": "Quick Response from Flipkart .... I have few bullets to say about Moto-G 2nd Gen: 1. Phone runs with 1.2 Ghz Qualcomm Quad Core Processor ... good performance 2. 5-Inch display make sure user can handle the phone in one hand. 3. Speakers are awesome 4. 8MP camera liked most 5. battery performance is average Thanks, -Nagesh",
            "date": "28 Jan 2015",
            "name": "Nagesh M",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this phone as a gift for my sister. Then after using it 2hr I thought of buying one for myself. So I purchased another for myself. This story continues and now my whole family is using MOTO G 2nd Gen. Software is upgraded to lollipop. Battery backup is the best. No lags at all. No heating problem I faced till now. Only problem what i feel is the screen responsiveness. Touch screen respond is not that effective. May be because I am using screen protector on the screen which may be causing the problem.",
            "date": "28 Jan 2015",
            "name": "kumar abhinandan",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone available in this price range....The camera is too good...processor is fast enough to run multiple operations at the same time...Best thing is service quality of flipkart..",
            "date": "28 Jan 2015",
            "name": "M kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The UI is very basic, which is probably the best thing about this device. Its very easy to jump to different apps and menus. Phone is not as powerful as other Chinese Brands flocking the market these days but for someone who is not a hardcore gamer like me, its definitely value for money.",
            "date": "28 Jan 2015",
            "name": "Pardeep",
            "stars": "4 stars"
        },
        {
            "comment": "Great...better than Moto-g first generation. very good camera, sound quality. Good improvement with very good features",
            "date": "28 Jan 2015",
            "name": "RAJESH LALWANI",
            "stars": "4 stars"
        },
        {
            "comment": "Deliverd on time!! Ws retailer rock!! very good phone at this price range.But interface of the phone not upto the mark!",
            "date": "28 Jan 2015",
            "name": "Arpan Sengupta",
            "stars": "5 stars"
        },
        {
            "comment": "Really love this phone. Its everything worth penny.. Specs are killer and. Really hate about this phone is battery life not good. Need to charge two times in a day. I am a heavy user.",
            "date": "28 Jan 2015",
            "name": "Usmangani Patel",
            "stars": "4 stars"
        },
        {
            "comment": "Its awesome no laggy performance. The Front Speakers are very good. Camera Performance is also very nice. Now my phone running on 5.0 Lollipop. Still got no issues. Simply WOW!!! No further thinking Just Buy it. I would like to thanks Flipkart as One Day delivery Awesome .",
            "date": "28 Jan 2015",
            "name": "Viraj Kulabkar",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome product. Try it if you r going fo budget phone. battery power is little bit bad. But it goes for a day with 100% charging. Nice phone",
            "date": "28 Jan 2015",
            "name": "Aneesh Mondal",
            "stars": "5 stars"
        },
        {
            "comment": "Although i have just bought this mobile yesterday. Still after playing with it, I really impressed with motorola. I first thought of buying YU Yureka ....However I was not able to win one in flash sale (I was really unhappy on the number of units available for flash sale). Anyway, So i went for Motorola G(2nd Generation)... Motorola as mobile is very steady and reliable phone..(I have earlier used Motorola Defy plus for 2 years) ..believe me they are quiet rugged mobiles..However I was quite not happy with Motorola after sales service in india..Hope it has improved..",
            "date": "28 Jan 2015",
            "name": "Chandan Dasgupta",
            "stars": "4 stars"
        },
        {
            "comment": "Defective product has been given to me.I bought this mobile 10 days back..My friend bought Moto G (2nd generation) 2 months back. 2 days back I went to his marriage, his brother and me shooting his marriage, my mobile heated so much that I cannot handle it...My friend's mobile did not heated as much as mine got heated up.....Why such thing happens for new mobile, that too I received on 14th Jan-2015...Why within such short span my mobile gets heated?? Also my ear piece volume goes up without my intervention while doing or receiving some calls...Customer care person asked me to check whether software is updated or not. That moment I checked, its updated. Why ear piece volume gets heated within short duration of call?? Why ear piece volume just goes to maximum without my intervention",
            "date": "28 Jan 2015",
            "name": "Sai ram",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this phone and within 10-12 hrs the issues with the sim slot started. It is unable to detect the sim. I have applied for the replacement of the product. Lets see what comes next.",
            "date": "28 Jan 2015",
            "name": "Piyush Singh",
            "stars": "1 star"
        },
        {
            "comment": "This is the best smartphone in its price range & the best u can get with all feature in its class. So,i recommend u to go for it.I m giving this phone 4 stars because i want Moto to improve much more than this.",
            "date": "28 Jan 2015",
            "name": "Vibhor Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Few days after recieving this phone i experienced some Quality issue withthe the earpiece. Raised the Same concern with flipkart team. They took around 8 days to replace the phone. The best part is, replacement product i got is also faulty. Please dont Busy this product its having some serious quality assurance issues.",
            "date": "28 Jan 2015",
            "name": "Vipin Dua",
            "stars": "1 star"
        },
        {
            "comment": "Dis product is so gud.... total value for money n xcelnt services by flipkart... keep it up.....delivered before expected time n very nicely packed product... luking fwd to shop more on flipkart only....",
            "date": "28 Jan 2015",
            "name": "G S Bhullar",
            "stars": "5 stars"
        },
        {
            "comment": "Its a awesome phone. very good service from flip kart. The phone didn't lag anymore. And the camera clarity just awesome even if in the night. Battery backup is also good at this range(Better from asus zenfone 5 gb n 16gb ). A very good mid-range mobile from moto..",
            "date": "28 Jan 2015",
            "name": "Santanu",
            "stars": "5 stars"
        },
        {
            "comment": "i have bought this on 4th of december..flipkart as promised delivered it on next day..initially i doubted on the product but after some days of using i found it one of the best mobiles as far as i have used.. so i would suggest all of you to go for this as this is the best..:)",
            "date": "28 Jan 2015",
            "name": "Saurav Shekhar",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G 2nd Generation 3 months back.and I want to thank Flipkart for such wonderful gift at reasonable price and also thanks to their on time delivery. Very good product at range of 12999 INR. Camera Quality Superb..No hanging problem. Fast, Smooth and easy to grip. Buy it if you wana rock the world.",
            "date": "28 Jan 2015",
            "name": "Lalit Bisht",
            "stars": "5 stars"
        },
        {
            "comment": "Though i got a SIM slot replacement for free but within 3 months it was failed to detect the second SIM Slot. Apart from this everything else is working good.",
            "date": "28 Jan 2015",
            "name": "Rupak Samant",
            "stars": "3 stars"
        },
        {
            "comment": "Motorola has not kept the promise of providing the Moto G 2nd Generation with Android L Update. It was suppose to reach us by 2014. Now it's almost Jan end but no news of any update coming soon. It seems that Motorola is slowly degrading to the level of its new owner, i.e. Lenovo",
            "date": "28 Jan 2015",
            "name": "Subhashis Ghosh",
            "stars": "2 stars"
        },
        {
            "comment": "I love this phone nice futures really i suggested to buy this phone and use.lovely phone clarity is chance less nice one use guys use",
            "date": "28 Jan 2015",
            "name": "Sampath Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I have used both the version of Moto G, but I found Moto G 2nd Generation not handy. After using it for 1 months, it started restarting itself and it keeps restarting for 4-5 hours. I still have this problem since October 2014. I have faced this problem more than 30 times. I am fed up with this phone.",
            "date": "28 Jan 2015",
            "name": "Ashish Dwivedi",
            "stars": "1 star"
        },
        {
            "comment": "BEST MOBILE IN LOW PRICE, FEATURES ARE GOOD, INBUILT MEMORY SUPERB, SUPPORT HD GAMES ALSO,ONLY ONE PROBLEM CANNOT TRANSFER DATA FROM MEMORY CARD TO MOBLIE",
            "date": "28 Jan 2015",
            "name": "konar balamurugan",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone to have in this budget. This is working perfectly fine for last 2 months and there isn't a single issue i found in it.",
            "date": "28 Jan 2015",
            "name": "Rakesh Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Value for money. Simple review for this device. Superb android experience, good voice clarity and brilliant display. At this price, this device is nothing more than awesome. Screen is the only challenge. It is strictly advisable to go for Tempered Glass Screen Protector else you might lose your hard earned money in one go.",
            "date": "28 Jan 2015",
            "name": "Jatinder S",
            "stars": "4 stars"
        },
        {
            "comment": "This is a good phone.I have purchased a 2nd set for a friend because the delivery to Patna is not available by Flipkart. Reaquest Flipkart to expand the delivery circle in India.",
            "date": "28 Jan 2015",
            "name": "Pranay Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I would only say.....just buy it and feel the difference. a very reach look, great performance. Got update for lolipop. Amazing look and feel. I was actually waiting for Micromax's Yureka but thank god you saved my money and showed me Moto G (2nd Gen). though Yureka has lot many features but it cannt bit Moto G Thanks Flipkart, it was my first shopping from your portal. wonderful experience. I was roaming here and there in search of mobile and you made my journey easy. Regards, Sanjay",
            "date": "28 Jan 2015",
            "name": "Sanjay Jhala",
            "stars": "5 stars"
        },
        {
            "comment": "In my opinion this phone is the BEST in its price range. It handles apps very smoothly and without any lags. But some minor features are missing such as, voice recorder, self timer camera and it doesn't have other video recording size option, only 720p. But this can be obtained by installing some apps, so not much of a problem. It doesn't support mkv avi mov and some more video formats. But MX Player supports all video formats, hence this also isn't much of a trouble. The panorama is one thing i found very poor about this phone, but still its ease of focusing, lighting and image and video quality makes us forget that. Overall i would recommend it to all who are searching for a good quality phone in this price range.",
            "date": "28 Jan 2015",
            "name": "Immanuel Vaiphei",
            "stars": "4 stars"
        },
        {
            "comment": "can't ask for anything more in this budget phone. excellent phone. good battery life. good processor. more than useful camera and video recording.",
            "date": "28 Jan 2015",
            "name": "Manindra Varma",
            "stars": "5 stars"
        },
        {
            "comment": "Good Smart Phone to buy under 13K. Look and Feel is super and I am using with dual sim. Pro's ------- Good Design One of the first phones to get update Good Performance for day today use Con's -------- Playing Games like boom beach and clash of clans heating phone. Some time network signal completely goes down and Will come back automatically, Not sure is it phone problem or network provider issue. Some of my friends having MOTO E facing this issue more. Not Great Camera, But Ok. Also I found bug in camera functionality.",
            "date": "28 Jan 2015",
            "name": "Viswanathan Ch...",
            "stars": "4 stars"
        },
        {
            "comment": "This is an amazing phone for the price. It's a steal! I've been using it for the past 4 months, on kitkat, and now, on Lollipop But since last month, the flash has stopped working. Very dissapointed! :(",
            "date": "28 Jan 2015",
            "name": "Advait Gudepu",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased this phone by Flipkart with exchange offer. Really i like this phone. Battery Backup, Camera, Interface all is good",
            "date": "28 Jan 2015",
            "name": "Ashish Dey",
            "stars": "5 stars"
        },
        {
            "comment": "With the Motorola backing of regular updates for its moto-g phones, this is one of the best buys in the budget phone market!",
            "date": "28 Jan 2015",
            "name": "Navneeth",
            "stars": "5 stars"
        },
        {
            "comment": "Great performance, worth more than its price tag. No issues at all. Lollipop update really boosted battery capabilities. Perfect stock android mobile.",
            "date": "28 Jan 2015",
            "name": "Bhagath Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "I think its a value for money, at this price point I can't find any other phone. I don't regret buying this phone,",
            "date": "28 Jan 2015",
            "name": "Harshal",
            "stars": "5 stars"
        },
        {
            "comment": "Ordered Moto G (2nd Gen) Mobile Phone on 19/01/2015 and got the delivery on 22/01/2015. When I started using the phone it just happen to check the internal storage capacity of the phone. To my surprise the storage capacity was only 12.90 GB & not 16 GB. This is gross in accuracy wherein the product is advertised as having 16 GB internal storage capacity but in reality it is just 12.90 GB. This is kind of cheating done by flipkart with the customer...Will Flipkart provide any explanation on my above grievance???",
            "date": "28 Jan 2015",
            "name": "Milind Nagvekar",
            "stars": "1 star"
        },
        {
            "comment": "It is best option in price range b/w 10 k to 15 k. in similar range htc 616 is closer but htc 616 has 4 GB of internal memory, while moto G2 has 16 GB internal memory. But if u r camera lover then go with htc 616 coz it has more camera features than moto G2",
            "date": "28 Jan 2015",
            "name": "Mayur Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "This is a very nice phone... feels solid in hands and good performance for the price. Audio clarity on headphone not so great ... And the biggest problem is with the network reception , once you move out of the coverage phone doesn't automatically reconnect to network when you come back to coverage area... I did check this with my other friends using the phone and I got to know that this is a common issue with moto phones ..",
            "date": "28 Jan 2015",
            "name": "Arun KV",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is one of the awesome phones I have ever used. The touch is very responsive with great processor (hardly any lag). Clarity is an advantage which enables to read (emails, notes, books) very crisply. I am very happy with my purchase.",
            "date": "28 Jan 2015",
            "name": "Shamit Jana",
            "stars": "4 stars"
        },
        {
            "comment": "Very good product at best price with many features. Reliable product with good battery life. Can suggest for people looking for branded smart phone at reasonable price.",
            "date": "28 Jan 2015",
            "name": "Eswar",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent VFM product, powered with Qualcomm chip. Runs raw android 4.4 and hence with 1 gb ram it can easily manage. Battery life is good. A little fat phone so people who prefer thin ones look elsewhere.",
            "date": "28 Jan 2015",
            "name": "Vishak Shanmug...",
            "stars": "4 stars"
        },
        {
            "comment": "i got this mobile one week back and after using it i can say that its best mobile under Rs 15000/-. People are saying its battery is average but i can say that its more than average.I charged my phone to 100% yesterday and watched 3 movies back to back each movies were around 2 and half hours still battery used was only 78%. What else you want?????",
            "date": "28 Jan 2015",
            "name": "Amit Kumar Rai",
            "stars": "5 stars"
        },
        {
            "comment": "I am happy with the mobile performance. But when i notice other brands give more features with less than half a price of MOTOG2 feel little uncomfortable. Noticing heating while playing games and Battery gets discharged in less than a day/Half a day(When data is ON).",
            "date": "28 Jan 2015",
            "name": "Kiran",
            "stars": "3 stars"
        },
        {
            "comment": "Best phone i ever used. display is good. camera quallity is quality is excelent. works smoothly.android 4.4.4. never hanged very fast and runs very smoothly.",
            "date": "28 Jan 2015",
            "name": "Jayesh Salian",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone amazing fatures at the price :)................................................................................................................................................",
            "date": "28 Jan 2015",
            "name": "Pranav Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "It was working good till now but now it suddenly get switched off and now its not turning on and when i searched this its happened with most of the people. coz of non removable battery its become impossible to do boot up. and it takes years to get full charge even if you charge on airplane mode It takes 3 hr at-least to get full charge and battery drains in 4 hr which sucks..........",
            "date": "28 Jan 2015",
            "name": "Abhinav Saxena",
            "stars": "2 stars"
        },
        {
            "comment": "Good product Initial got faulty piece, as per Flipkart replacement policies, they have exchanged, got the best bone, great work",
            "date": "28 Jan 2015",
            "name": "Mohammed Nizam...",
            "stars": "5 stars"
        },
        {
            "comment": "I became customer of Motorola with it's Moto G series. I was so happy with it that I got whole my family either a Moto G1 or Moto E. And when Moto G2 was launched, I was happy to realize that I can now have a larger moto G with much better specs at optimal cost. But alas, Moto G2 has disappointed me. With larger display comes the proportionally larger fonts and icons, which means, it'll seem like you've watching at a zoomed in phone. I needed a larger display to space more items on screen. However, it just got them bigger in size. Apart from this nonsensical issue, the major two issues I'm facing are: 1. Quick battery draining, as the 5\" display requires larger capacity battery which Moto G2 certainly hasn't, and 2. Overheating. I don't know what's wrong with this series but Moto G2 has a serious over heating problem during charging as well as during working on it. So, now that many alternate options are available in market, I won't suggest anyone to buy Moto G2",
            "date": "27 Jan 2015",
            "name": "Sayed Abbas",
            "stars": "3 stars"
        },
        {
            "comment": "after putting tempered glass for screen protection. touch of my mobile is not so smooth. overall phone performance is good",
            "date": "27 Jan 2015",
            "name": "ankit",
            "stars": "3 stars"
        },
        {
            "comment": "I replaced the phone due to speaker problem and received the new phone however the same has battery issue. If I switch on the data services battery drains out within 1 hour. I am very dissappointed",
            "date": "27 Jan 2015",
            "name": "Anil Chandnani",
            "stars": "1 star"
        },
        {
            "comment": "Works well. Value for money. Sleek design and feel. Would recommend to others. Had to buy a cover separately though.",
            "date": "27 Jan 2015",
            "name": "Paras",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone, I liked the motog design. Didn't face any issue till now. Value for money.",
            "date": "27 Jan 2015",
            "name": "Prasanna Aithal",
            "stars": "5 stars"
        },
        {
            "comment": "When it comes to cell, I would say only that its excellent. But when I check offers provided by flipkart, the only thing comes to my mind that that they cheat me. they promised to give Airtel data plan and I am still waiting for that to activated. To all buyers please confirm that whatever offer you opted you get it on time because this time flipkart team told me that your time expired and we can not do anything now.",
            "date": "27 Jan 2015",
            "name": "Krishna",
            "stars": "2 stars"
        },
        {
            "comment": "Started using the product.. Performing nice...... The display is tooooooooooooo good. Let me keep posted the updates..",
            "date": "27 Jan 2015",
            "name": "Ramesh Thamburaj",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is well packaged. The ability to connect to calls while 3G is on is a little circumspect. The overall proposition is very good. Will check on its longer term performance.",
            "date": "27 Jan 2015",
            "name": "Deepak Kuriakose",
            "stars": "4 stars"
        },
        {
            "comment": "the phone style, camera quality and sound quality is very good... upgraded to lollipop 5.0.2... looks awesome.. the best one for 12999....",
            "date": "27 Jan 2015",
            "name": "NOOR AHAMED KHAN",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Good Looks 2. Durable 3. Good Battery 4 Good Performance Go for it if you want to buy a phone at 13k",
            "date": "27 Jan 2015",
            "name": "Vijayaraghavan...",
            "stars": "5 stars"
        },
        {
            "comment": "Best Phone in this 18 k range. go for it... :) Up gradable to Android 5.0 Lalipop ......................................",
            "date": "27 Jan 2015",
            "name": "Kumar Gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "This is by far one of the best mobile phones that I have used in this range. A must buy for people looking for budget phones but good with features.",
            "date": "27 Jan 2015",
            "name": "Kundavalli Sar...",
            "stars": "5 stars"
        },
        {
            "comment": "Best Mobile Very Smooth Runing Game Display clearity is good camera is also clear I recomend To all Buy This Mobile",
            "date": "27 Jan 2015",
            "name": "Abdul Mujawar",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, I have recently purchased Moto G (2nd gen), i very frequently get SD Card removed unexpectedly. Can you please some one tell, what need to be done. otherwise i see its a good one.",
            "date": "27 Jan 2015",
            "name": "chaithanya kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought moto g2 with 3G 1GB data per month for 2 months. But I got only 2G data even i had 3G circles. I have bought this mobile as you gave this offer, if not i would n't have bought it like Cheating me...",
            "date": "27 Jan 2015",
            "name": "Prakash",
            "stars": "2 stars"
        },
        {
            "comment": "If your budget is within 20000, then thats the product u r looking for . Nice camera, display, no hang issue like samsung, no heating problems like chinese brands xiaomi,huwaei,lenovo even htc. Nd superb speakers. Go for it. And last but not d least thumb's up to flikart delivery. A good decision from Flipkart to enter own courier business. Got the product within 2days.",
            "date": "27 Jan 2015",
            "name": "Akalp Singh",
            "stars": "5 stars"
        },
        {
            "comment": "This is good mobile . Photo clarity is very good Touch screen very much smooth . Features are all good",
            "date": "27 Jan 2015",
            "name": "Amit",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone at this price. Quality is good. Battery dries earlier but after upgrading to Lollipop version increased backup.",
            "date": "27 Jan 2015",
            "name": "Vasim Tamboli",
            "stars": "5 stars"
        },
        {
            "comment": "All function is good. only battery quality too much poor. It should be 2500 Mhz.Sound quality and camera awsome.",
            "date": "27 Jan 2015",
            "name": "Asim banerjee",
            "stars": "4 stars"
        },
        {
            "comment": "Used this phone for more than a month now and would say that this is simply great. It has amazing CPU performance with simple stock Android. I have installed a lot of applications and use them frequently with lots of games and faced no issues till date. This phone has amazing stereo speakers and a good video performance (though with a semi-hd screen). On the negative side, this phone could have more battery backup (just 2030 mAH for 5\" screen). The headphone is actually bad but you can substitute this with a headphone of a better company (I use xperia z headphone with this one and it is amazing). 1GB RAM will not be sufficient but still this phone does not lag, though it may terminate heavy duty applications at times.",
            "date": "27 Jan 2015",
            "name": "Hitesh Jain",
            "stars": "5 stars"
        },
        {
            "comment": "When switch to data mode, sometimes connecting and sometime not connecting. I have to switch the mobile when I need internet connection. I dont know how to solve this issue.",
            "date": "27 Jan 2015",
            "name": "Ramakrishnan V...",
            "stars": "3 stars"
        },
        {
            "comment": "Camera and Picture quality is good with HDR. No hanging mode Never strucked and rebooted Good quality in minimum budget by exchange offer Referred friends to buy Suggestion: Before initial use please charge battery at least 8 hours to avoid battery problems @Motorola : Please give/print as a special instruction \"Before initial use please charge battery at least 8 hours' to the customers to avoid some kind of battery issues.",
            "date": "27 Jan 2015",
            "name": "Ashok Thukkani",
            "stars": "5 stars"
        },
        {
            "comment": "Cheap delivery process for prepaid orders.. so friends don't paid your money in advance........ Very cheap and pathetic delivery process...",
            "date": "27 Jan 2015",
            "name": "Rohit Goyal",
            "stars": "2 stars"
        },
        {
            "comment": "Great, value for money.I am writing this after two months usage. Very good mobile, fantastic experience.",
            "date": "27 Jan 2015",
            "name": "Mathan Ganesan",
            "stars": "5 stars"
        },
        {
            "comment": "I am using Moto G2 since oct 2014 .. very good phone and presently its get upgraded to lollipop 5.0.2 also. working very good with 32 gb memory card fully loaded condition also. battery back up is also good running full day.",
            "date": "27 Jan 2015",
            "name": "Handal Dada",
            "stars": "4 stars"
        },
        {
            "comment": "flipkart very fast delivery really m not expect within a day i recived and moto g2 is supperb phone dimension is toooo good and display awesome and sound clarity is suppperb and gaming no lag really too good to buy this phone",
            "date": "27 Jan 2015",
            "name": "khan",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone on 24 jan from flipkart. It is good phone with excellent features but it's hang sometime. It is giving upgrade for android lollipop but i think it's has hanging problem so i suggest that buy it becoz battery backup is good and features are excellent so overall it is good phone",
            "date": "27 Jan 2015",
            "name": "Gaurav Singh",
            "stars": "4 stars"
        },
        {
            "comment": "One of the best phone available in market, but I didn't find the sound quality of earphone as good as I was expecting, but apart of this it is satisfactory.",
            "date": "27 Jan 2015",
            "name": "Deepak Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "I booked the Moto G using HDFC credit card. Later on my order was cancelled with the false reason that the order was returned undelivered by courier partner. None of their courier partner contacted me. Since the month of October 2014, this has become the usual practice of Flipkart that they accept too many orders and are not able to deliver and they have to cancel the order by giving such false reasons. In our country e-commerce business is not widely acceptable due to such kind of unfair trade practices of the vendors like FLIPKART. Going forward be-aware while dealing with Flipkart",
            "date": "27 Jan 2015",
            "name": "Deepak",
            "stars": "1 star"
        },
        {
            "comment": "The first issue I faced as soon as opening was the charger. The charger gets heated very soon even when used for just 10 to 15 minutes. Otherwise I find the phone worth the money. Yet to provide the review on the phone after complete use. Please let me know is it a common issue or should I go for a replacement of the charger.",
            "date": "27 Jan 2015",
            "name": "Ramesh Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Battery is very poor , Hanging when multiple application running simultaneously, sound quality is good .",
            "date": "27 Jan 2015",
            "name": "noorsha",
            "stars": "2 stars"
        },
        {
            "comment": "The Moto G which I got from Flipkart was truly an amazing phone in all sense.But Unfortunately I lost this exceptional phone in a bus @Mysore.May be the exceptionality of this phone lead to its theft.Or my worst luck.I hardly used the phone for 2 months.The phone was just Great.",
            "date": "27 Jan 2015",
            "name": "Albin Chandy",
            "stars": "4 stars"
        },
        {
            "comment": "this is the best phone in its range.... using this phone more than one month. better than micromax nitro. no lag at all. its the best budget phone.",
            "date": "27 Jan 2015",
            "name": "Arvind Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I love this device's hardware and software part both..Must say it delivers u similar to nexus experiences..Features Like USB OTG,Android's Latest Update(Lollipop),Waterproof,Sd card support,16GB ROM,1GB RAM,True Quad Core speed with Cortex A-7,Comfortable looks and feel,Dual frontal speakers,Corning Gorilla Glass 3,Dual sim with 3G,Customizable coloufull back shells for matching your style..etc. All these for just Rs.13k from a US trusted Brand Motorola...Must Pick device if u love to be updated with the world.",
            "date": "27 Jan 2015",
            "name": "Aman Raj",
            "stars": "5 stars"
        },
        {
            "comment": "great ..................................................................................................................................................................................",
            "date": "27 Jan 2015",
            "name": "Surinder Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "Very fast delivery and I liked the product and packing. I ordered midnight and by 9 AM I had the product at my doorstep the next day morning. I like the customer centricity and the speed of delivery very much.",
            "date": "27 Jan 2015",
            "name": "Bharath Cadambi",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product from Flipkart. Using this mobile since 3 days..... Just awesome mobile in this price range... If you are planning to go for this handset, just go for it..... Great work by Motorola.....",
            "date": "27 Jan 2015",
            "name": "Ajinkya Dande",
            "stars": "5 stars"
        },
        {
            "comment": "Perfect phone in this price with all features......Have to mention camera clarity which is awesome. Superb phone with no defects.",
            "date": "27 Jan 2015",
            "name": "Rajkumar",
            "stars": "5 stars"
        },
        {
            "comment": "great phone i am very satisfied with features, BUT i am not satisfied with courier service it very pathetic it take 10 long days to reach.",
            "date": "26 Jan 2015",
            "name": "customer",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone since 4 months. Works butter smooth! No lag of force closes yet. Switching between apps if lightning fast. Every high-end game played ran smoothly mostly giving 40 FPS. Pure Android feels great. Display is just awesome and proves to be the best source of entertainment(Games and youtube mostly :P) in boring lectures. The voice commands and Moto Assist are just amazing. Friends usually end up playing allot on X. And when they start to annoy you, just shout out \"Wake up Falix\" and Moto would listen even in a noisy environment. Ambient|Active display is very helpful. I never use the power button to unlock the phone, it just knows when you are around or wanna play with it and wakes up immediately. Well thats all the good stuff. Coming to the bad ones I would like to exclusively mention the batter. The battery lasts for a complete day on normal usage around an hour of gaming etc.. If you forget to plug in your phone at night, it'll be useless the next day. I would be happy if Moto could have squeezed in a larger battery. A friend bought an iPhone 6 recently. I was playing around with its camera and that was the first time i realised how bad was X's camera in \"low light\". I'm not a professional photographer but i still expect Moto to work on the camera. Rest all about the Moto X is green. If you have an opportunity just go for it blindly (except photographers).",
            "date": "26 Jan 2015",
            "name": "Abhiraj Darsh...",
            "stars": "5 stars"
        },
        {
            "comment": "Nice, descent phone with good battery, good camera , fast processing, cool speakers, Great display. Good value for money.",
            "date": "26 Jan 2015",
            "name": "Kumar Sumit Sunil",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on Thursday and received on Saturday itself. Well done team Flipkart. Till now Im happy with the services of flipkart,they have an excellent record for on time performance in delivering my products. I love shopping from Flipkart. So about Moto G 2,Packing is great,as usual. About the phone Im using it now for 2 days,and it seems to be doing great in terms of battery,camera is OK,screen is bright and clear. Grt phone at this price.",
            "date": "26 Jan 2015",
            "name": "Vishal Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "A VERY AWESOME PHONE VERY HAPPY WITH IT AND ALSO CAMERA IS DAMN GOOD AND ALSO VERY NICE DESIGN AND BRILLIANT DISPLAY TO PLAY MOVIE......",
            "date": "26 Jan 2015",
            "name": "SAGAR KOLGE",
            "stars": "5 stars"
        },
        {
            "comment": "FAKE OFFER you will get the airtel 3G data for prepaid data connection only for the first month, neither the data is activated automatically after 1st month nor their is any option available to activate the data for 2nd month. every time you will try to activate the data on www.airtel.com/offers/ it will show the plan is already activated on your device,nothing else. to avail the plan for 2nd month no information is there.",
            "date": "26 Jan 2015",
            "name": "Sanchit Jain",
            "stars": "1 star"
        },
        {
            "comment": "I recently ordered this phone, at time when i took this phone in my hand i noticed that he power and volume buttons are pressed inside and was very hard to operate them. i asked Flipkart for the replacement but they rejected my request.. very disappointed by the team of flipkart.",
            "date": "26 Jan 2015",
            "name": "Sagar Anand",
            "stars": "1 star"
        },
        {
            "comment": "last month i got this amazing mobile phone, that is upgradeable to lollipop latest android . now i m experiencing latest android with mobile phone and i m impressed , this mobile phone have 16GB inbuilt storage and have expandable memory slot up to 32GB ^_* rjt",
            "date": "26 Jan 2015",
            "name": "Rajat verma",
            "stars": "4 stars"
        },
        {
            "comment": "Good Phone with this range of price but touch screen is not comparable with Samsung, Sony or iPhone...",
            "date": "26 Jan 2015",
            "name": "Mahesh",
            "stars": "3 stars"
        },
        {
            "comment": "I PURCHSED 1 MONTH BACK... ITS WORKING SMOOTHLY.. NO HEATING ISSUE. BATERRY BACK UP IS GOOD .. LOLIPOPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPP IS AWESOMEEEEE. I RECOMAND THIS MOBLIE IN THIS RANGE....",
            "date": "26 Jan 2015",
            "name": "THIPPANNA M GAUTAM",
            "stars": "5 stars"
        },
        {
            "comment": "Guys please help me. Where is profile change option ? Not able to find vibrate mode or silent mode. please help me . How to switch change silent or vibrate mode on lolipop update.",
            "date": "26 Jan 2015",
            "name": "PANKAJ ZAJAM",
            "stars": "3 stars"
        },
        {
            "comment": "WS Retails shipped the phone and I received it in a very good condition and also I must say that the phone was packed in a quite safe manner. Now , The main course is that The phone is awsm and I got the LOLLYPOP upgrade in the very first day I connected to a wi-fi. Overall the phone is excellent. Best phone in this price range. The ignorable issue is that: 1. Facebook messenger notification sound is set in an incremental manner..",
            "date": "26 Jan 2015",
            "name": "Gaurab Ganguly",
            "stars": "5 stars"
        },
        {
            "comment": "As usual, Flipkart always keeps its promises. At first, the delivered phone was dead within 10 days of usage, Flipkart immediately replaced with a new one which is working fine. Software has been upgraded to Lollypop version. Moto G 2nd generation is an excellent phone. Pro's: browsing speed, screen size and interface, does not get warm while using net, upgradable to Android Lollypop. Con's: Haven't seen any",
            "date": "26 Jan 2015",
            "name": "Vineet Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I am test phone 4 month use regular I got 4 star for processor,3 1\\2 star for camera ,3 star for battery 4 star for designe",
            "date": "26 Jan 2015",
            "name": "Dinu THAPA",
            "stars": "3 stars"
        },
        {
            "comment": "The motog 2 received is having display issue and half the screen goes pink all of a sudden. Delivered a defective piece.",
            "date": "26 Jan 2015",
            "name": "Brian",
            "stars": "1 star"
        },
        {
            "comment": "good i got Android Lollipop 5.0 upgrade my mobile .....................................................................................",
            "date": "26 Jan 2015",
            "name": "balaji mobiles",
            "stars": "5 stars"
        },
        {
            "comment": "It is an awesome phone.. i m using it since 4 months.. Pros.. >Sexy Design >Good Hardware as it comes from the house of motorola >stereo sound ..superb !! >latest android update is available for d phone >Powerful processor for heavy use. >awesome camera both front n back cons.. Battery is not removable earphone & charger are not of good quality. Go for it u wont regret..:) :)",
            "date": "26 Jan 2015",
            "name": "Nitin",
            "stars": "5 stars"
        },
        {
            "comment": "middle class people budjet phone, & features is good camera is excellent & front camera & flashlight & internet browsing is excellent",
            "date": "26 Jan 2015",
            "name": "Bheeshma Chary",
            "stars": "5 stars"
        },
        {
            "comment": "Way better than any other phone in its price range...Moto G2 has everything u need .Superb build quality..good battery backup..lot of cover options...crisp and clear display...studry.",
            "date": "26 Jan 2015",
            "name": "Ashish Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone a couple of months back and it works fine with the default features. However, the display and functioning got messed up when I upgraded it to Android Lollypop. There are too few service centers. If you want to get the phone serviced, you may need and extra pair of shoes to wear out.",
            "date": "26 Jan 2015",
            "name": "Aravinda Prakash",
            "stars": "3 stars"
        },
        {
            "comment": "Unmatched cellphone in this range.A revolution in MOTOROLA.Very good battery back up, good quality of display",
            "date": "26 Jan 2015",
            "name": "Vish",
            "stars": "5 stars"
        },
        {
            "comment": "Ive been using this phone for a month now. And yesterday i got THe Android Lollipop update also. Overall a very good phone at this price. gives a good gaming experience too. im currently playing Fifa 15, Asphalt 8, etc on it. functions very smoothly.",
            "date": "26 Jan 2015",
            "name": "Fahed Rashid",
            "stars": "5 stars"
        },
        {
            "comment": "It's paisa wasool phone... only problem battery backup...i think we can manage.. company could have upgraded battery capacity as they have increased display size.... No comparsion with any other phone in this range either MI-3 or samusng..any other phone....... Full Satisfied.......Thank Q Motorola.....",
            "date": "26 Jan 2015",
            "name": "Sridhar Rao Na...",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this from flipkart and was a great deal as 10% bank discount and 2000 bucks for my old micromax phone was given so it costed 9944 in place of 12999. altogether phone itself is a marvel in respect to camera, battery, sound, speed performance. I will buy one more......waiting for the bank offer !!",
            "date": "26 Jan 2015",
            "name": "VINEET MISHRA",
            "stars": "1 star"
        },
        {
            "comment": "good and i just got android lollipop ,now it is the best with updated version good sound .camera .and other application",
            "date": "26 Jan 2015",
            "name": "Vishal Bharti",
            "stars": "4 stars"
        },
        {
            "comment": "there is nothing better than Stock Android experience... in India Moto G 2nd gen gets lollipop update on 23rd jan '15... It's an awesome phone...",
            "date": "26 Jan 2015",
            "name": "realslimshady",
            "stars": "5 stars"
        },
        {
            "comment": "Hi all. I bought this phone as a gift for my mother. And it has made a total phone addict out of her. This is a big thing because, before getting this phone she was not that high on the idea of new and upcoming technology ( only because it took her time to understand it.). I can't give a true user review, but my mom looks very happy using it. :) . Also note that i bought a Micromax A1 instead of buying this phone. I have put up my review for that phone.",
            "date": "26 Jan 2015",
            "name": "vinayak joshi",
            "stars": "4 stars"
        },
        {
            "comment": "Very cool product with reasonable rate....only suggestion to flipkart is please provide mobie theft insurance policy..",
            "date": "26 Jan 2015",
            "name": "Kittu",
            "stars": "4 stars"
        },
        {
            "comment": "REVIEW AFTER 2 WEEKS OF USING MOTO G2 THE GOOD • Nice build quality • Smooth usage, multi tasking • Stock android, no in-built unnecessary apps THE BAD • Battery life is about 12-18 hours, but I’m assuming this is the problem with every android. Takes 3-4 hours to charge from 0-100% • No OTG cable provided THE UGLY • The earphone quality sucks big time. Even the Rs. 20 earphones that are sold near railway stations are better. Surely, a 13k phone deserves a better earphone P.S: Increase your budget by 1000Rs to buy OTG cable/power bank/memory card/earphones",
            "date": "26 Jan 2015",
            "name": "Aditya Devalla",
            "stars": "4 stars"
        },
        {
            "comment": "moto G 2 is most of all mobile as a price range, quility of this products as awasing, i love this and want purchase again bater expriance",
            "date": "26 Jan 2015",
            "name": "j agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "There is no words to express this product Amazing , Awesome , Beautiful , Super fast , Smart , Friendly user",
            "date": "26 Jan 2015",
            "name": "Prasad Babu",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones. Certainly it was a good decision to purchase this. However there is always chances of improvement but for me it is compact and paisa wasool device.",
            "date": "26 Jan 2015",
            "name": "AKS",
            "stars": "5 stars"
        },
        {
            "comment": "Only thing i can say for this Mobile is Good but screen is costly. Purchased in sep, screen got broken in Nov & now it is costing 7000 :( . Suggestion for FlipKart : They should provide Insurance with Mobiles as well as we use to get from local shops.",
            "date": "26 Jan 2015",
            "name": "Sushil Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "Screen became unresponsive after two days of use....dont know because of Lollipop update or something else but made me frustrated...its been two days only....bad experience with moto...opted item return...lets see what happens after replacement...counting on flipkart service !!",
            "date": "26 Jan 2015",
            "name": "Zeeshan Khan",
            "stars": "1 star"
        },
        {
            "comment": "this phone is the best in its price and today i just got its lollipop update and the phone is just good. never lags but the camera quality would have been made better.",
            "date": "26 Jan 2015",
            "name": "Deepanshu Budh...",
            "stars": "5 stars"
        },
        {
            "comment": "This won't be a phone that you fall hard and fast for. It won't sweep you off your feet, nor will it dazzle you with a slew of whizbang features. That's just fine, though. Because none of that changes the fact that the Moto G is still the best budget smartphone you can buy today. Using the thing isn't as revelatory an experience as firing up the new Moto X was, but Motorola's long list of seemingly modest improvements collectively add up to a device that's worth your attention. It was one of those gadgets that wound up being more than just \"good enough\"; between the price and performance, the Moto G was one of the best cheap smartphones you could own, period. I would have myself bought this phone if not for Xiaomi MI3, but since I could not buy it for myself, ended up gifting my Aunt. And it has worked just amazing as well. The entire functionality makes more sense in the amount of price and features it consolidates for the given structure. And nonetheless, the performance is still beyond mediocre. Its simply stunning. Additionally, the new lollipop features must work equally well ( I haven't made the update as yet, but sure hope to do so.) Th phone is overall brilliantly built for the Indian consumers & I bet you shall like as well. ( Skipped the spec part since everyone is already writing about it as commonly as they should be)",
            "date": "26 Jan 2015",
            "name": "Saurabh Bhivan...",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered two of them and believe me I am very happy with MOTO G .. In my family I have 3 MOTO G as of now ..going to buy one more...",
            "date": "25 Jan 2015",
            "name": "Sachin Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Fast delivery from W's retail and flip kart a nice product for 10k under change and hdfc cash back Nice screen size 5inch and camera clarity and nice processor. Definitely I would recommend my friends",
            "date": "25 Jan 2015",
            "name": "srikanth",
            "stars": "4 stars"
        },
        {
            "comment": "this is my second purchase of this mobile for my uncle ,he simply loves it , you cant ask for better from motorola a hardy device in every aspect for a mediacore user. Pros: 1.Solid build quality, 2.Good HD display, 3.Nice looks. 4.Updated to android L Cons: 1.Accessories are on the costly side, 2.No bass on the inbox earphones, 3.Average camera, 4.Average Battery backup, VERDICT: A Good Phone For The Average User And A Good Value For Money",
            "date": "25 Jan 2015",
            "name": "goutham reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased moto g2 for my son who is engineering student. Overall the package is very good, look & design, screen resolution, camera, processor speed etc. I liked this phone very much and ordered another for myself (to replace my 2 years old Samsung galaxy ace). After just few days of usage, I dropped the phone accidently (which all phone users will do some or the other day). To my surprise, the much publicized Corning Gorilla glass screen broke into pieces. I have dropped my old phone no. of times but never ended up in this manner. After recovering from this shock, I called Motorola service centre to ask the replacement cost ( I understand well that breakage cannot be covered under warranty). This is the time I got next shock, replacement cost is 7000, i.e. more than 50% of the phone value. It was too difficult for me to spend another 7000 within one month of spending 13000 on new phone. Now I am again using my old phone, need few days to make up my mind. Motorola shall advise customers on fragile nature of screen & heavy replacement cost. Special protection screen can also be recommended so that the customers do not blame Motorola at later stage for keeping them in dark. I will request customers to make informed choice, no doubt this is an excellent phone (deserve 5 stars) but if you ever drop this (or any other phone with glass screen), be ready for spending a large sum. Hope my review will help you, Gursharan",
            "date": "25 Jan 2015",
            "name": "Gursharan Dhillon",
            "stars": "3 stars"
        },
        {
            "comment": "hi guys i am using moto G2 since past few months kitkat was butter smooth after update the phone hangs/lags and i keep getting error \"widget not found\" or \"widget not loaded\" the UI is heavy and All Apps takes more time to load compare to kitkat. phone dialer takes more time to load on lollipop then kitkat. i wish MOTO release a patch or i will try to roll back to kitkat if possible.",
            "date": "25 Jan 2015",
            "name": "Asif Hooda",
            "stars": "4 stars"
        },
        {
            "comment": "Do we need to purchase separate USB cable to connect to PC?? I don't see an option to remove the other end of charger cable that came along with the set. I want to connect moto g to system..",
            "date": "25 Jan 2015",
            "name": "Habeeb",
            "stars": "3 stars"
        },
        {
            "comment": "Friend.. please go for it.. Its my 3rd Android phone and i am in just love with it... every thing is awesome.... Moto come with new technology.... to be very truthful... The only con is Battery... it will dry early when u will use 24*7 3G.. It will go good with WI-FI... But with the battery saver option they have tried to improve it. So i will suggest that don't think... just go for it.",
            "date": "25 Jan 2015",
            "name": "Anubhaw Srivas...",
            "stars": "5 stars"
        },
        {
            "comment": "better pay a little extra and buy samsung or sony devices as you will spend much more of money and time in its maintenance. 1. Battery is attached so cannot force stop phone when it gets hanged 2. Phone gets heated. 3. brought 2 phone 1 was replaced within a weeks time by flipcart and now other is giving trouble in charging and starting. 4. Limited service centres.",
            "date": "25 Jan 2015",
            "name": "Shradha",
            "stars": "1 star"
        },
        {
            "comment": "its really the best among its price but ,one thing i am unsatisified is about its battery life ....it reduces very quickly thats it ..but its been upto its price.",
            "date": "25 Jan 2015",
            "name": "Tejas Teja",
            "stars": "4 stars"
        },
        {
            "comment": "I am happy with the product and flipkart delivery.haaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaapppppppppppppppppppyyyyyyyyyyyy",
            "date": "25 Jan 2015",
            "name": "Karun Kumar Ku...",
            "stars": "4 stars"
        },
        {
            "comment": "it obviously has a good chipset and a gpu but the problem lies in the poor battery configuration. even a bit of high usage of ram and the phone starts to heat up really fast compared to any other devices. its good for a lite usage. recommended for adults who rarely use their phone in a while.",
            "date": "25 Jan 2015",
            "name": "Bharath Mohankumar",
            "stars": "2 stars"
        },
        {
            "comment": "phone is awesome. Phone is upgradable to lollipop version at first software update.phone is just awesome. front camera is really nice. but only battery backup is low. Other feature are very good. Motorola and Flipkart both are Fab.",
            "date": "25 Jan 2015",
            "name": "Nilesh Fagnekar",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this product in December 2014, everything is great but there were few issues like: 1. Sometimes while scrolling down the notification bar it doesn't respond but after lock-unlock it becomes normal. 2. Opening recent apps used to take 2-3 attempts sometimes. But after lollipop update these issues are resolved and everything is normal.",
            "date": "25 Jan 2015",
            "name": "Punit",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is doing fraud. When I order it they cancel it after 2 days. Their courier guy does not come to home and return items without coming to home. In tracking it shows that its in my city but being returned without any reason. They delivered memory card but not phone. Now memory card is of no use without phone.",
            "date": "25 Jan 2015",
            "name": "Rohit Khatkar",
            "stars": "1 star"
        },
        {
            "comment": "Good smart Phone of the year 2015 , I got the latest update of android Lolipop for Moto G2 and i am very happy with the flipkart delivery .. As a Mangalorean i received with in 2 day.",
            "date": "25 Jan 2015",
            "name": "Madhu Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i baught this phone on 5 january 2015, but phone was not upto expectation and battry backup is poor and flipkart dont take any responsibility of replacement , i got call when i raise a request regarding replacement and they deny replacement of phone.",
            "date": "25 Jan 2015",
            "name": "Vibhor Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "Touch is awesome,nice resolution,speakers are good,build quality is very good,You feel good while holding the phone in ur hands.Good Performance,no lags till now. Firstly there was a problem with speaker but thanks to flipkart for its awesome service,got replaced with a new one within 2 working days. Overall the phone is very good in 13 thsnds. 10/10 for Flipkart service.",
            "date": "25 Jan 2015",
            "name": "Aniket Jinturkar",
            "stars": "5 stars"
        },
        {
            "comment": "I have compared almost all below 20k phones before buying this one, because of its optimum price-performance balance. I have also bought Moto G (1st gen) earlier and the satisfaction I received prompted me to again go for Moto G (2nd gen) And And And you will soon get Lollipop update for this budgeted phone.",
            "date": "25 Jan 2015",
            "name": "Akarsh Pratap",
            "stars": "5 stars"
        },
        {
            "comment": "FLIP KART has delivered a defective product. Sim slots are not working. Customer care person is not helping to support to get the problem rectified.",
            "date": "25 Jan 2015",
            "name": "sujay saxena",
            "stars": "1 star"
        },
        {
            "comment": "A very Good mobile in this range. Worth for money. Its good for medium range phone buyers. Got fast delivery also.",
            "date": "25 Jan 2015",
            "name": "Sebin Joseph",
            "stars": "4 stars"
        },
        {
            "comment": "Using this phone for more than a month. Pros: Price - No other device comes close in offering the same features for that price range Decent processor - no lag so far on medium gaming. Call Quality - didn't have any issues with noise / re-sound Screen size and its 720p resolution Neutral : Speakers - not loud enough - but managable Can't comment on expandable memory / camera - as I don't have much use for them. Cons: Battery - Continuous gaming drains the batter in < 5hrs. Also charging takes around 3 hours. Head phones - nothing great about them. Definitely not suitable for listening to songs/videos. USB connector to PC is not available in the package. Cool device in the price range - Go for it !! Also flipkart's delivery is spot on for one-day delivery. Got it by next day 4 PM.",
            "date": "25 Jan 2015",
            "name": "Suraj V",
            "stars": "4 stars"
        },
        {
            "comment": "Hi I have purchased this product on December. Everything is works perfectly fine except that battery. Battery going to die within 4 hours.It will take 3 hours + time to fill the complete charging. Its better to sell this product with powerbank",
            "date": "24 Jan 2015",
            "name": "Chaitanya B",
            "stars": "1 star"
        },
        {
            "comment": "thanks to flipkart for the prompt delivery the phone is worth 13k. updating to lollipop. (dear FK why do you need 100 min characters for the review?)",
            "date": "24 Jan 2015",
            "name": "Vimal Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "It's good product from flipkart. but the device is working very slow on lollipop os.Some times it got hang whlie playing games or browsing internet.",
            "date": "24 Jan 2015",
            "name": "Rafi",
            "stars": "4 stars"
        },
        {
            "comment": "IN PURSUIT OF QUICK MONEY, FLIPKART HAS SACRIFICED QUALITY AND IT IS THEREFORE TARNISHING THEIR SOLID REPUTATION. I EXCHANGED MY NOKIA LUMIA 720 (AN EXCELLENT PHONE) FOR MOTO G2. WHEN THE PHONE ARRIVED I WAS ALL EXCITED . CONNECTED IT TO WI FI THEN AND THERE AND DOWNLOADED ABOUT 1 GB APPS....ALL FINE SO FAR. THE PROBLEM STARTED WHEN I SWITCHED OFF WI FI . IT WONT CATCH 3G NETWORK!!! INFACT IN H+ MODE THE CONNECTION IS WAY SLOWER THAN MY LAST PHONE. WHEN I SWITCHED OFF AND RESTARTED THE PHONE, IT STOPPED RECEIVING NETWORK ALL TOGETHER !SO I LOST MY EXCELLENT LUMIA 720, 1 GB DATA COST AND AROUND 5 HOUR OF MY TIME.....I APPLIED FOR A REPLACEMENT....LETS SEE HOW THEY HANDLE A DISAPPOINTED FLIPKART FIRST CUSTOMER.",
            "date": "24 Jan 2015",
            "name": "partha sarathi...",
            "stars": "1 star"
        },
        {
            "comment": "I would like to thank FlipKart for their service .. i am really happy that i have received the mobile within 3 days from the date of booking... i wish flipkart team to keep up the service all the while .. i just loved it .. i ll soon share the experience once i get used completely to my moto G2..",
            "date": "24 Jan 2015",
            "name": "Satya Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "yeh i got lollipop on 24 jan its amazing phone working good no lags battery ok camera nice over all its worthy to buy",
            "date": "24 Jan 2015",
            "name": "NARSIMHARAO DU...",
            "stars": "5 stars"
        },
        {
            "comment": "This phone works like a charm.... The great thing about this mobile is i absolutely don't experience heating issues. Only con is as the name goes, the phone is a little bit motto (heavy) in terms of width and weight, compared to other phones in this segment.",
            "date": "24 Jan 2015",
            "name": "Muthuraman S",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone few months back during exchange off. Excellent phone, but power hungry if you start using 3g services.",
            "date": "24 Jan 2015",
            "name": "Chithu",
            "stars": "5 stars"
        },
        {
            "comment": "Price is reasonable.. Getting the same by 12250. I am so happy after using this Moto G2. Battery backup is sufficient. Internal memory is sufficient . Picture quality is satisfactory. Without any hesitation one can easily choose this mobile for use.",
            "date": "24 Jan 2015",
            "name": "BASAB RAJ KARM...",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone in class...dont try to compare it with Asus Zenphone! camera (Both rear and Front) performance is awesome!!! Extremely good looks...1 GB RAM doesn't makes u feel dumb! Just lacks in battery life, but still loving it!!!!:)",
            "date": "24 Jan 2015",
            "name": "Gourav Ravidra...",
            "stars": "4 stars"
        },
        {
            "comment": "This is very good product, Good Configuaration Still I face no problems I Trust Flipkart and refer.. Motorola Always rockssss.",
            "date": "24 Jan 2015",
            "name": "Maa Mani",
            "stars": "5 stars"
        },
        {
            "comment": "battery drains quickly and it takes lots of time to charge completely(100%), remaining all things are fine satisfied with packing and delivery",
            "date": "24 Jan 2015",
            "name": "vijay kumar",
            "stars": "4 stars"
        },
        {
            "comment": "display is super,best phone under 15000 category.. got in one day thanks flipkart! waiting for lollipop update.. if your from chennai you must want to notice about service centre because there is no separate service centre for moto.",
            "date": "24 Jan 2015",
            "name": "Munna awesum",
            "stars": "5 stars"
        },
        {
            "comment": "A good phone for an avg user..but personally i dont like the camera quality of this phone..the handsfree provided by the company is third-class..",
            "date": "24 Jan 2015",
            "name": "Aakash Singhal",
            "stars": "2 stars"
        },
        {
            "comment": "i replaced twice and each time i faced loose volume button in each handset,so i have asked for refund.Otherwise the product is good. how many of you are facing the same issue?",
            "date": "24 Jan 2015",
            "name": "saurabh upadhyay",
            "stars": "3 stars"
        },
        {
            "comment": "Very bad experience with the mobile.I took moto g 2 with exchange offer with my samsung mobile which was far better. I think they provide used moto g when you order with exchange offers. Did not expect this from Flipkart.",
            "date": "24 Jan 2015",
            "name": "Kiran H",
            "stars": "1 star"
        },
        {
            "comment": "mobile is really excellent look wise, camera clarity, picture clarity, speed, battery usage is outstanding",
            "date": "24 Jan 2015",
            "name": "siva kumar",
            "stars": "5 stars"
        },
        {
            "comment": "THIS PHONE IS REALLY VALUE FOR MONEY. YOU CANT GET BETTER THAN THIS IN THIS PRICE. GOOD BUILT QUALITY, GOOD CAMERA, PERFECT GRIP AND LOOKS AMAZING IN WHITE COLOUR",
            "date": "24 Jan 2015",
            "name": "Prince Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "It is one of the very good mobiles I purchased recently. Value for money at this price. Again want to mention here I have been very happy with the services provided by flipkart.",
            "date": "24 Jan 2015",
            "name": "CApt Santosh",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using the phone for the last 2-3 months and it has been a satisfactory experience so far. The phone is handy and just about fits in shirt or trouser pockets. The display is crisp and resolution is quite high. If you set the brightness on auto then it will adjust to a variety of light conditions so that the screen always remains readable - unlike a few other sets I have seen where the auto setting does not give good results. Readability under direct sunlight is pretty good. The sound quality is okay. It is not as good as, say, a Sony Xperia, but still the speaker output is okay. The sound does start to crack if you listen at full volume. Sound output to a headphone is much better. Battery life tends to be poor. I am a moderate user, and never play games on my device or browse for long sessions. I use it with wifi though, and the battery hardly lasts for one full day. But today I got the Lollipop 5.0.2 upgrade, so lets see if the battery life improves. Overall I am quite satisfied with the phone. Minus one star due to battery.",
            "date": "24 Jan 2015",
            "name": "Sanjoy Chanda",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing Moto G(2nd Gen) i ordered on 20th and I got it my hand on 22nd ..Nice product with fast Delivery..",
            "date": "24 Jan 2015",
            "name": "Arun prasath",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this product from flipkart from day one i am facing issue. First time shopping experience on flipkart was very bad. Looks like flipkart delivered me defected peace of mobile. I raised a request of exchange they are saying you need to deliver it back i can do that not a issue but i bought mobile when i was in my home town (Rajasthan) and currently i am in Bangalore(Karnataka). Flipkart executive saying you have to courier back and they will deliver on same location my home town which i have no use . I requested them to deliver in bangalore but flipkart not ready . This is last shopping on flipkart from my side. No more shopping on flipkart. bye Bye Flipkart. Thanks for not helping. Single star is not for mobile it is for flipkart service.",
            "date": "24 Jan 2015",
            "name": "Sameer Bansal",
            "stars": "1 star"
        },
        {
            "comment": "moto g i love it good battery life and good camara quality and worth of money and great shipping service and worth it.",
            "date": "24 Jan 2015",
            "name": "Nikhil",
            "stars": "5 stars"
        },
        {
            "comment": "1)Everything is fine except battery. 2)But still it is up to the mark.",
            "date": "24 Jan 2015",
            "name": "Nagendra Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "high quality superb product.Price is marginal.Picture quality is good.superb........................................................................................................................................................................................................................",
            "date": "24 Jan 2015",
            "name": "Santosh",
            "stars": "5 stars"
        },
        {
            "comment": "Liked the phone and its speed . The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -8MP camera takes amazing pictures -micro SD slot up to 32gb",
            "date": "24 Jan 2015",
            "name": "MAYANK MADHUR",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2gen is a best budget phone for middle. 5 inch Lcd display....Two Stereo Speaker for Front...Good Body build...water resistant...over all activities r best....",
            "date": "24 Jan 2015",
            "name": "S.Ganesa Moort...",
            "stars": "5 stars"
        },
        {
            "comment": "both the flipkart and motorola provide very good customer service. flipkart deliver phone in a day guarantee and motorola provide good customer support",
            "date": "24 Jan 2015",
            "name": "ravindra bhagat",
            "stars": "5 stars"
        },
        {
            "comment": "value for money must buy in the range best camera, good display.....................................................................................",
            "date": "24 Jan 2015",
            "name": "ashish",
            "stars": "5 stars"
        },
        {
            "comment": "Its very good product........",
            "date": "24 Jan 2015",
            "name": "Rakesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The product is good...cheaper as compared to other phones with the same features...The shipping time was a bit longer than expected but can be ignored..",
            "date": "24 Jan 2015",
            "name": "ManishG",
            "stars": "4 stars"
        },
        {
            "comment": "i have selected exchange offer basis which was supposed to be get Rs. 3000 discount, but at the time of delivery time he asked me to pay full price i.e. Rs. 13000, and that delivery boy was not aware of Exchange offer, due to this you have wasted my time waiting for long hold, as i have don't have phone right now, due to this i am lacking behind. there is no proper communication between them.",
            "date": "24 Jan 2015",
            "name": "Sushant S. Patil",
            "stars": "1 star"
        },
        {
            "comment": "This is the best budget phone with power packed performance and aesthetics.... In one word the best available.... You'll find all the pros and cons in the reviews above and below mind but i have to say just one thing... the day i got my phone in ten mins it showed the update for Andriod L or 5.0 as known to most of you... buy it, it doesnt get any better... (as of now at least) Flipkart Delivery as usual right on time (mostly before)....",
            "date": "24 Jan 2015",
            "name": "Shreyansh Trip...",
            "stars": "5 stars"
        },
        {
            "comment": "get the lollipop update .. fantastic phone.. camera is good.. built quality good.. one of best phone in this price range..",
            "date": "24 Jan 2015",
            "name": "CHIRANJIT SAHA",
            "stars": "5 stars"
        },
        {
            "comment": "i have faced some technical faults in this device thats y i am returning it... 1. hangs a lot 2. once battery is 0% it wont switch on no matter how long u charge it 3. Sometime flash hangs while using camera...n it wont go off even u switch off d phone",
            "date": "24 Jan 2015",
            "name": "ashish yadav",
            "stars": "2 stars"
        },
        {
            "comment": "dont buy i cant play high end games but 6000 rs micromax can play games what i expexted shitttttttttttttttttttt battery problem",
            "date": "24 Jan 2015",
            "name": "dinesh babu",
            "stars": "1 star"
        },
        {
            "comment": "Good for three months when I bought it after that stopped working completely....now under maintenance",
            "date": "24 Jan 2015",
            "name": "Maruthi",
            "stars": "2 stars"
        },
        {
            "comment": "Moto g 2nd gen is an excellent phone within a reasonable range and has excellent features. If you are looking for a phone which is not too expensive then you should definitely buy this.",
            "date": "24 Jan 2015",
            "name": "Namay Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "I just Updated my moto g 2014 to lollipop. everything is good ....wifi working well...not a single bug....ram is 40% free now...no lock screen widget....google now not detecting hot words \"ok google\" as before....battery back up is better now...",
            "date": "24 Jan 2015",
            "name": "vinod kks",
            "stars": "5 stars"
        },
        {
            "comment": "yaar ager purana mobile lena hi nhi toh dhoke mai kyu rekhte ho .... ?? 18,000 wale mobile ko 3000 mai de reha hu toh kya ekdum new hoga kya .... kabhi toh sochte website pr likhne se pehele \"Change with your old phone\" ... what old yaar ek single ek single scratch nhi h koi tuta hua nhi 1GB RAM Corning Gorilla Glass Dual-core 1.2 GHz Cortex-A9 8 GB Internal, 1 GB RAM micro-SD, up to 32 GB 8 MP, 3264 x 2448 pixels ( 2K resolution ) Li-Ion 1785 mAh battery (original) Full HD Recording ice cream sandwich (noROOT) what u wants more in 3000 just have one thing in mobile that it has single black mark on bottom of screen just little smaller then 1cm ....... :( no one in ur customer service understand this thing they say to me that have no rights over this ... yaar ager unko rights kuch diya hi nhi h even ek COMPLAIN likhe ka bhi toh phr numder diya hi kyu kuch bhi COMPLAIN ho toh baat kro .... m i mad so i waist my balnce to just to talk to them whn i know that their is no solution over anything..... ANYTHING...... worse service ever like hell",
            "date": "24 Jan 2015",
            "name": "Durgesh Mahesh...",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is a good one but if someone orders the phone from northeastern or eastern part of India, I would suggest them to keep around a months' time at hand before they get to lay their hands on the phone. Flipkart's delivery services are growing worser day-by-day, and they are least bothered about the customers until they cross the deadline of delivering the products.",
            "date": "24 Jan 2015",
            "name": "Bhaskar Sharma",
            "stars": "1 star"
        },
        {
            "comment": "Best smart mobile from Moto.. Thank you Flip.. Delivered before 24hours... Good for skpe, gaming, whatsup, fb...",
            "date": "24 Jan 2015",
            "name": "praveen kolipaka",
            "stars": "5 stars"
        },
        {
            "comment": "You get a brand worth @13k ...... what else ??? no lag....features are gud ....camera could have been better",
            "date": "24 Jan 2015",
            "name": "Recoiler",
            "stars": "5 stars"
        },
        {
            "comment": "I will review Moto G, that is self explanatory. I ordered this from fk.com and it get delivered by 5.41 PM (paid 90/- extra :P). Got 5.0.2 update as well. !!",
            "date": "24 Jan 2015",
            "name": "Annkiit Talwar",
            "stars": "5 stars"
        },
        {
            "comment": "I am using from last 10 months. Purchased from flipkart and got within 8 days. Pros: Working well with internal memory 16 GB capacity even filled up to 12 GB Not hanged up to this date Camera is very good compare to other mobiles Sony experia, Samsung quatro, Micromax, Red Mi (very bad), sound quality is very good rather than others Games can ply without hang up Resolution is plus point Battery back up is very good over Micromax, Red Mi, others Cons: call voice is giving some problem (Moto can think over it, Its real problem) GSM sim slot is giving problem",
            "date": "24 Jan 2015",
            "name": "Santosh Chavan",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this mobile one month ago. I believe 13,000 is good deal for purchasing this mobile. It's very handy and touch is very good. Front and secondary camera clarity is good. It has 1 GB Ram which access the internet and browser very quickly (3G). If you play any games in this mobile never it get hanged. Dual loud speaker which gives quality of sound when you are listening music. Due to huge internal space we can download lots of games and useful apps. The only con what i felt is inbuilt battery which is not detachable like other mobiles. So we have be careful of battery life.",
            "date": "24 Jan 2015",
            "name": "Ganesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "in a word excellent product for a great price great quality no second thought go for it delivery was very fast good packing no cons",
            "date": "24 Jan 2015",
            "name": "drsiva",
            "stars": "5 stars"
        },
        {
            "comment": "The specifications are great for the amount that it is available for. It does everything that it claims to do.",
            "date": "23 Jan 2015",
            "name": "Abhijeet",
            "stars": "4 stars"
        },
        {
            "comment": "a way better than Moto G 1st Gen. but Battery drains after few hours with Automatic Brightness setting.",
            "date": "23 Jan 2015",
            "name": "Saurabh Naik",
            "stars": "5 stars"
        },
        {
            "comment": "today i hv ordered my G 2. Hope will get it soon . This phone is unbeatable at this price.. especially this big screen 5\".Overall this phone looks good and is easy to handle. I hav heared from many frnds that the price of the screen is much higher as compared to other companies. I am going to get my phone insured from any company. So, GO ON & buy this phone NO problem at all",
            "date": "23 Jan 2015",
            "name": "Ashu Dhankhar",
            "stars": "5 stars"
        },
        {
            "comment": "My experience with Moto G 2nd is super awesome. I love phone, its camera & handiness of phone. But I don't like less in build apps & very poor battery life.",
            "date": "23 Jan 2015",
            "name": "Randeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "flipkart delivery is nice...only drawback in the phone is no data cable in the moto g box. moto g display is good and usb type adapter is used means much better..",
            "date": "23 Jan 2015",
            "name": "SAKTHIVEL VELU...",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone, i have been using for almost six month..first i had moto g 1st than moto g 2.. both are good product from motorala. with lollipop 5...",
            "date": "23 Jan 2015",
            "name": "M D Tufail",
            "stars": "4 stars"
        },
        {
            "comment": "Very Good Product , Good Screen and Display, Processor is Fast and seamless , No time lag, Data speed is good one , Camera Quality needs improvement. Earphone not upto the mark w r t sound quaality Overall Value for money",
            "date": "23 Jan 2015",
            "name": "Vinit Bafna",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delievery is awesome, delivers product before commitment. But unluckly got defective product having touch screen problem while dialing numbers fastly .Also while operating some sound is coming out. Please guys check your mobile also if such sound is coming out or not from your mobile. Hope so flipkart will take this product and give me new one ASAP!!",
            "date": "23 Jan 2015",
            "name": "devanshu anand",
            "stars": "4 stars"
        },
        {
            "comment": "i recommend users to switch to moto G. Best product on android smartphone. Value for money and service by flipkart",
            "date": "23 Jan 2015",
            "name": "Deepak Bashetty",
            "stars": "5 stars"
        },
        {
            "comment": "It is one of the best phones in this range. User experience is phenomenonal and do not lag. Phone is light and screen appropraite to the use.",
            "date": "23 Jan 2015",
            "name": "Aman Jain",
            "stars": "5 stars"
        },
        {
            "comment": "It has been 3 months and its very smooth and user friendly .. still having many other phones which offer more specifications, Moto G 2 is little dissapointing in Features which moto offers like Menu view, RAM and front CAMERA, still i have no idea about After sale service :) All I can say is its worth it for people who want to use it officially but not for those who are Gaming Freaks,",
            "date": "23 Jan 2015",
            "name": "Sreekanth Boya...",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile very good...no lag...no heat in mobile..i got lollipop update on 23/01/2015 Little bit improvement in battery....earlier it use to drain battery very fast..after lollipop update battery is not draining fast",
            "date": "23 Jan 2015",
            "name": "Ravindra Reddy P",
            "stars": "4 stars"
        },
        {
            "comment": "outstanding Have you used this product? It's always better to review a product you have personally experienced. Educate your readers Provide a relevant, unbiased overview of the product. Readers are interested in the pros and the cons of the product. Be yourself, be informative Let your personality shine through, but it's equally important to provide facts to back up your opinion. Get your facts right! Nothing is worse than inaccurate information. If you're not really sure, research always helps. Stay concise Be creative but also remember to stay on topic. A catchy title will always get attention! Easy to read, easy on the eyes A quick edit and spell check will work wonders for your credibility. Also, break reviews into small, digestible paragraphs.",
            "date": "23 Jan 2015",
            "name": "Ashu Ayu",
            "stars": "5 stars"
        },
        {
            "comment": "This product is one of my best buys from flipkart.They delivered it on time.The screen is wide and the display is wonderful.Touch is awesome.It is the best phone and is better than Samsung S3 because of the price difference. Moto provides the same features in a comparitively lesser price.The only setback is the battery capacity.It is not very bad but could have been better.Battery is good if 3G is not used.If used also it stands for about 14 hrs.",
            "date": "23 Jan 2015",
            "name": "Hariharan",
            "stars": "5 stars"
        },
        {
            "comment": "Good One but Battery issue,, Cam quality is fine,, performance wise and look wise Moto G2 is superb but the problem is the battery that drains very fast as it comes with 2070mah ,,,if the battery is 2500mah then it will be 5 stars.",
            "date": "23 Jan 2015",
            "name": "Nagarjuna K",
            "stars": "4 stars"
        },
        {
            "comment": "The way I heard it seemed like it was a great product but to my astonishment it was totally a flop as it's speaker sound goes bad in the higher volumes as well as it's look is not as per Moto standard advertised look as it looks almost duplicate. Please reconsider your needs and then after you see another person using the same or telling you his/her experience to get a good phone and don't go for the advertisements. Though good branding hats off to Google.",
            "date": "23 Jan 2015",
            "name": "Roshan",
            "stars": "2 stars"
        },
        {
            "comment": "The phone clarity, touch, flipkart delivery, everything is good, but major problem I am facing is the POOR NETWORK catching capacity of my phone.It goes out of coverage at places where other phones on same network have complete coverage. moreover it disconnects the ongoing call if the network drops suddenly, while other phone would just maintain the call even though we may not be able to talk and revive as the network is received.Because of this a fresh call has to be started which cause loss of money of one call. I dont know if this problem is with my phone or with all Moto G 2 phone. Believe the Moto G will come up with some solution.",
            "date": "23 Jan 2015",
            "name": "Dipak Singhania",
            "stars": "2 stars"
        },
        {
            "comment": "The Screen On Off button has gone stiff and is not working with 1 month of purchase. Seems like the quality of the phones they are producing has gone down drastically. Didn't expect this from a highly reputed brand such as Moto G.",
            "date": "23 Jan 2015",
            "name": "Kamlesh Verasi...",
            "stars": "1 star"
        },
        {
            "comment": "Just now received the update 4.4 to 5.0. Feeling Awesome.",
            "date": "23 Jan 2015",
            "name": "Raghu Jagadale",
            "stars": "5 stars"
        },
        {
            "comment": "What fantastic phone at price range... Also icing on cake as got a lollipop update today... before any other devices available in market",
            "date": "23 Jan 2015",
            "name": "Yogesh Daliya",
            "stars": "5 stars"
        },
        {
            "comment": "Camera is bad,, should improve camera quality. and phone is getting heat when we gaming.. other wise its good.......",
            "date": "23 Jan 2015",
            "name": "priya",
            "stars": "2 stars"
        },
        {
            "comment": "Bough a Moto G (2nd Gen) from flipkart and its awesome. The display is very clear HD quality and playing games like Temple Run had an excellent frame rate. The preloaded apps(though it does not matter what with Play store download what you want) it was excellent. No crapware and needless apps preloaded. And the beauty of Just android.",
            "date": "23 Jan 2015",
            "name": "Parag Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "good phone Value for money... best phone in this class.................................................................................",
            "date": "23 Jan 2015",
            "name": "Ankit Shah",
            "stars": "4 stars"
        },
        {
            "comment": "For a price of 12999, this is one heck of a budget phone from Google! The operation is buttery smooth despite 1GB RAM. Simple and intuitive stock android controls make your life a breeze. Good battery dischage; lasts me almost an entire day (close to 17-20 hours with wifi/data on, whatsapp, facebook and twitter on, while listening to music). Those who look for a budget stock android experience with ZERO lag, excellent hardware quality and a pleasing to hold phone, go for this.",
            "date": "23 Jan 2015",
            "name": "Utkarsh G",
            "stars": "5 stars"
        },
        {
            "comment": "its been 5 months since i buyed this mobile and all i can say is it has the best ui and performance with good features for reasonable price. Go for it!!",
            "date": "23 Jan 2015",
            "name": "ABHISHEK MOHAN...",
            "stars": "5 stars"
        },
        {
            "comment": "got this mobile on nov 15 2k14 and the service offered by flipkart is good.i have been using it for two months or so till now i didnt find any lag on my phone..every thing works like a charm and the touch experience you get with this phone is buttery smooth you will truely fall in love with that amazing technology motorola has equipped with..previously i was using a windows phone and when i checked out this phone when my friend bought this i wished to grab one for me..thanks to its 5'inch display which offers amazing clarity..it doesnt feel too big but its fit in your hand easily..i had a white phone and looks wise it feels like a premium set..and the camera is just amazing which is a 8MP shooter and also the front camera which is 2MP is good for video calls..but in complete dark with flash ON you might find some noise in pictures and in day light conditions the pics and also the video clarity were awesome..and you get a stock android experience on this which is the most appreciable one due to which you wont find any lag..call clarity on this phone is good its loud and clear..and for me battery lasts one day,i was not a power user and with the data on it lasts pretty good actually..i was really wondering how motorola could manage to put in extraordinary features in a budget smartphone..its a very value for money device..you can blindy go for it..",
            "date": "23 Jan 2015",
            "name": "Nagendra Prasad K",
            "stars": "5 stars"
        },
        {
            "comment": "Good product given the price sensitivity and features. No trouble so far. The only issue was that offer for replacement of old phone which was was used at the time of buying this product appeared on first screen of order and was not there at the time final order placed. Post delivery calls with flip kart executives and their response against my query was extremely poor. I decided not to buy from flip kart thereon and am still stick to it. May change my decision in future",
            "date": "23 Jan 2015",
            "name": "Pramod Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "Thank you very much , very systematic and punctual. No more word to write for your initiative. Moto G 2nd is quite awesome product .",
            "date": "23 Jan 2015",
            "name": "THDarendrajit...",
            "stars": "5 stars"
        },
        {
            "comment": "A winner from Motorola. If you are planning to buy a phone within the 13k range this is the phone for you. All that specs and the Motorola brand name and this price is a definite must have.",
            "date": "23 Jan 2015",
            "name": "Siddharth Dasg...",
            "stars": "5 stars"
        },
        {
            "comment": "Cons: High Usage of 3G or wifi-hotspot or gaming drains battery too fast. Look is not much encouraging while comparing Sony/HTC products but which costs more If switched off while Battery is under ~3% requires a lot of patience/effort to start the mobile again while charging... I think its not getting started till your battery reaches level 10% which sucks sometime. Pros: I like the Camera & Talk to me feature while driving & @home. Overall Performance is good.",
            "date": "23 Jan 2015",
            "name": "Jipal Shah",
            "stars": "4 stars"
        },
        {
            "comment": "Auto Call Recorder Not Working Problem Record Only one Person Self Voice not record Second Person Voice So please check & solve this problem. Ram Short increase Ram 2 GB Batter Backup Good Camera Good",
            "date": "23 Jan 2015",
            "name": "Dheeraj Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "I have bought Moto G2 two weeks back.Earlier I have used Samsung Galaxy Grand and Nokia Lumia 520.Compared to both the phone I have found this amazing in respect of UI and also performance when it is compared to other android device under 15 K. Pros: 1) Look and feel of the phone is awesome. Phone looks very beautiful from the front and back with sleek design and amazing finishing. 2)Screen: The screen is very vivid and very smooth with Gorilla glass 3(but it is not scratch proof).It has an amazing colour punch. 3)Camera-Both the front and back camera is very good.Picture quality is very sharp and colour tint and quality of the pictures are very rich.Low light pictures are also good . 4)Processor:processor is good.No lag still now.I have already installed many apps. 5)Signal strength is very good. 6)It has a solid Build Quality. 7)Gaming and HD Video recording is not excellent but it is good and met my expectation is certainly better than samsung phones under 20 K 8)16 Gb internal memory and applications take less phone memory when transferred to external memory card since the android is vanilla and original from google in the device like nexus. 9)Speakers is simply superb and video call quality is also very much satisfatory Cons: 1) Battery back up is not as good as moto g 1. But it is still good. 2)File manager is not delivered here.And pictures canot me moved directly from the gallery.Either You have to connect to PC or have to download a file manager. 3)Very bad Ear phone 4) I really doubt its hardness...I am sure it is not like galaxy grand or other samsung /Nokia device,You have to use it delicately 5) There is no data cable provided in the box It is an amazing phone from worlds first mobile phone manufacturer.Only through online sell It has spreasd like hell.You can go for it blindly.",
            "date": "23 Jan 2015",
            "name": "Soumyajit",
            "stars": "5 stars"
        },
        {
            "comment": "Very good mobile. Display is awesome. Gets high end features in very low price. I am writing this review after 4 months of use. Mobile does not get slow like Sony or even does not get hangs like Samsung when more app are installed.",
            "date": "23 Jan 2015",
            "name": "Vishal Gaikwad",
            "stars": "4 stars"
        },
        {
            "comment": "Full value for money.Its much better then Samsung and other's in this price segment.A new buyer so not aware about the after sales service.",
            "date": "23 Jan 2015",
            "name": "Naresh",
            "stars": "5 stars"
        }
    ]
}
