{
    "filpkart": [
        {
            "comment": "I have bought this mobile before a month. But found my battery drained up fast and also takes lot of time to get full charged. Also mobile gets heated up while playing games or watching a movie more than 30 mins. If you are an android phone lover with previous experience, you will hate this phone. If you are new to android mobiles then go for it. Also camera picture quality is not up to the mark. Front cam is okay when compared to rear Cam though it got more mega pixels.",
            "date": "04 Jun 2015",
            "name": "NARASIMHAN",
            "stars": "3 stars"
        },
        {
            "comment": "Phone look is nice & pleasant. Performance is good. Maximum Features. Talk time is not so good. Battery will run only one day on full charge.",
            "date": "03 Jun 2015",
            "name": "Pankaj Chawla",
            "stars": "4 stars"
        },
        {
            "comment": "Brought this phone few months back !! facing lot of signal problem !! updating MOTO G2 to lollipop was the biggest mistake i did.. really irritating !!",
            "date": "03 Jun 2015",
            "name": "Hemanth Kumar...",
            "stars": "2 stars"
        },
        {
            "comment": "I loved this product. Moto G (2nd Generation) Phone is sleek, nice grip, nice picture quality, HD video, OTG supporting, easy to maintain, nice battery backup for an Android phone (one and half day with wifi whole day WOW!) First I bought this phone and liked it and immediately bought it for my sister too. Even she liked it a lot. Thanks to Flipkart.com for excellent service and package.",
            "date": "03 Jun 2015",
            "name": "Ram Mopati",
            "stars": "5 stars"
        },
        {
            "comment": "it has been 5 months that I bought the Moto G ( 2nd Gen)..while the features are good, the quality of the product is poor. The display had stopped working and I had to run to the service centre. The apathy at Service centre is it will take 3-5 days to repair the same. The product is 2nd Gen but the service is 2 decades behind..",
            "date": "03 Jun 2015",
            "name": "Sathish Krishnan",
            "stars": "2 stars"
        },
        {
            "comment": "I bought Moto g2 on April 24th. After one month now the battery is getting drained in minutes and for charging it is taking 12 hours to get full. I got battery issue where now I am not able to use my phone not more than 1 hr. Always needs to charge it.",
            "date": "03 Jun 2015",
            "name": "shaik ibrahim",
            "stars": "1 star"
        },
        {
            "comment": "First of all Flipkart rocked this time too in their delivery speedness..... I got delivery in only 16 hrs...which was like unbelievable for me..... About Moto G2: Pros: 1) Very speed set and never hangs or stucks for even 1 sec.. 2) Camera clarity and pixel is superb cool...slomo is really nice....but if sound is available, it would be better.... 3) Touch is very good and smooth enough to use... Cons: 1) The only cons in this phone is that we cannot peg internet connection to 3G only mode. It drags us to 2G automatically if the network is not strong in the location. Very rare to get 3G in it...Dont worry users if you want to use 3G only data in this set follow this below procedure as I did and it worked for me....thats y i have rated 5 stars for this mobile and to Flipkart as well...... How to force 3G only mode: 1)Go to your Phone/Dialer app and dial the following USSD code: *#*#4636#*#* 2)A popup window will open something 3)Select the first option from the list that appears i.e. Phone Information 4)Scroll down till you get to the Set preferred network type heading. By default, it might be on GSM only (i.e. 2G only) or WCDMA preferred (i.e. 3G preferred). Change this option to WCDMA only and your phone will automatically switch to 3G only mode. 5) Unless you understand what you are doing, don't tweak any other option in this menu as it can lead to problems. If you are having a dual sim phone, you can go to Wireless and Networks >> More >> Mobile Networks >> 3G service and select which sim you want to activate 3G on.",
            "date": "03 Jun 2015",
            "name": "RaviKiran Kalb...",
            "stars": "5 stars"
        },
        {
            "comment": "All rounder Performance by Moto g2 and Thanks for In time delivery by flipcart. Advantages: - Superb Camera result both front and rear - Smooth performance in all condition, good graphic, sound results. - The Android 5.0 Lollipop version.",
            "date": "02 Jun 2015",
            "name": "Urnish Makwana",
            "stars": "4 stars"
        },
        {
            "comment": "Good device with great performance as looks tough and expensive in hand, best deal under 11k, nice look only one drawback that display seems invisible in sunlight",
            "date": "02 Jun 2015",
            "name": "Yogesh Srivastava",
            "stars": "4 stars"
        },
        {
            "comment": "The deadline was 6days for delivery,but got the mobile before 24 hours.Thank you FLIPKART, best mobile with 1gb RAM...........",
            "date": "02 Jun 2015",
            "name": "Jithendhar jith",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile hangs a lot while using contacts itself. High end Apps closes automatically. Very bad software and firmware. If possible will give negative stars.",
            "date": "02 Jun 2015",
            "name": "Arumugam",
            "stars": "1 star"
        },
        {
            "comment": "its taking 5-6 hours to full charge . its waste of time only.but all things are good. only there is a big charging issue.and delivery time is not perfect. it was said to me that it will delivered in 1 day only but i got it in 5 days .",
            "date": "02 Jun 2015",
            "name": "sanjay yadav",
            "stars": "1 star"
        },
        {
            "comment": "I bought this awesome moto g 2nd gen mobile. Firstly the standard delivery date was much longer but I got the delivery very much earlier than the expected date. Very satisfied with this purchase.",
            "date": "02 Jun 2015",
            "name": "Prasad Rudrawar",
            "stars": "5 stars"
        },
        {
            "comment": "i received moto g 2nd gen.but the received piece not in good condition(camera flash not working) i raised complaint but i didnt get resonance please respond immediatly",
            "date": "02 Jun 2015",
            "name": "maatu venkates...",
            "stars": "1 star"
        },
        {
            "comment": "Worst battery, only runs 10 hours if you use normally also,Heating problem , Worst Headset, Worst Charger, no USB Connector in the device. Some times Hangs, Ringtone cannot be changed and customized with songs, For all basics things u need to download the app like file explorer etc etc. Any ways its ok ok type phone.",
            "date": "02 Jun 2015",
            "name": "Anupam Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "I bought a MOTO G 2nd gen in january.It used to hang many a times between switching applications.And now it has hardware issues .Service centres for Motorola are not at all good in Pune.",
            "date": "02 Jun 2015",
            "name": "Meenu",
            "stars": "1 star"
        },
        {
            "comment": "the mobile speakers are not working properly and not getting battery backup like my bro moto g2 so please check and decide your self.. but one thing all the mobile are not like this ..",
            "date": "01 Jun 2015",
            "name": "Prem.k",
            "stars": "3 stars"
        },
        {
            "comment": "Battery backup is poor. Other functionality is very good. There need to improve in battery backup. processing is good. Touch is good.",
            "date": "01 Jun 2015",
            "name": "Rakesh prasad",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is simply awesome. They delivered my phone 2 days before the delivery date.Its neatly packed.Complelety satisfied with your service. :) This is my first Smartphone, so feel proud to I have Moto g2 which looks really cool and fantastic.As of now i did't get any issue.The design is sleek and elegant ..,Display is vivid, Screen is massive :D Camera - The clarity of the primary camera is really good for 8 MP. Best when shot in natural light. OS - This phone came with Android 5.0.2,Its perforamnce is good . N this phone is smooth and lag but the main disadavantage is that datacable is not provided wih it :/",
            "date": "01 Jun 2015",
            "name": "Vishnu",
            "stars": "5 stars"
        },
        {
            "comment": "I recently purchased this one using the Exchange offer, So far the phone has been awseome, no issues yet.",
            "date": "01 Jun 2015",
            "name": "Saroj Patro",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, This is a great product, the UX is soo good, flipkart delivered it on time, great service, this phone is really better than samsung, i used a I8262 samsung, that did cost me more, but Moto G, GEN2 is a great phone. now i can understand the difference.",
            "date": "01 Jun 2015",
            "name": "Joydeep",
            "stars": "4 stars"
        },
        {
            "comment": "After usage of 6 months, i am observing that battery is draining quite frequently. Phones buttons and touch is not as good as it was previously. Some heating issue is also there if i use torch for 5 mins or wifi for long time. Overall i am satisfied from user point of view but some features like \"multi window feature\" is missing in phone. Camera quality is not good as it is in Nokia lumia (>10 k ranges) Its taking long time to charge full (approx 6 hours) which is not good at all. Good thing about phone is you will get android updates automatically .",
            "date": "01 Jun 2015",
            "name": "Hitesh",
            "stars": "4 stars"
        },
        {
            "comment": "BOUGHT IS JUST TWO DAYS BEFORE THEY DROPPED ITS PRICE. I AM AN IOS AND BB USER . BOUGHT IT FOR MY FATHER. OVERALL A VERY NICE AND DECENT PHONE. MOTO HAS MADE A VERY NICE COMEBACK BY ITS NEW MID RANGE PHONES. A MUST BUY FOR ANDROID MID RANGE MOBILE USERS. PREFER MOTO OVER HTC AND SAMSUNG",
            "date": "01 Jun 2015",
            "name": "LAKSHAY SINGHAL",
            "stars": "5 stars"
        },
        {
            "comment": "good phone with all the required features at this budget..very handy and stylish.. flipkart service is awesome..got this phone delivered within 24hours.",
            "date": "01 Jun 2015",
            "name": "Sreeram",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this mobile on may 4th 2015, Mobile is good only but iam facing some issues like battery backup(6 hrs), options are less comparing to samsung, and am hearing some noise in speaker while calling and speaking. Anybody is facing the same issue. Anybody is having any idea to overcome these issues plz help me out.",
            "date": "01 Jun 2015",
            "name": "Muthurockz",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone and it started creating problems related to touch & software after one month. Flipkart refused to give replacement so I brought the phone to service center. Service center kept the phone for over a month but still cant resolved the problem. Motorola people don't want to resolve the issue and I am bound to use the defective phone.",
            "date": "01 Jun 2015",
            "name": "Shobhit Johari",
            "stars": "5 stars"
        },
        {
            "comment": "I have a poor and irresponsible customer service and ordering by Flipkart. I have placed an exchange offer for Moto G 2nd Gen on wednesday 27th May with expected delivery date of 1st June Monday and I was not in town during week end.The delivery person called me on Friday 28th May and informed me that product arrived and I informed i was out of town and asked them to deliver on Monday 1st June,he too agreed. Monday I got email order cancelled since delivery failed on saturday and sunday.Even sunday i called delivery personnel he told they are not doing delivery on sunday and will deliver on Monday. 1. Their website and delivery personnel are not in sync. 2. Intention is to not providing good customer service",
            "date": "01 Jun 2015",
            "name": "Vijaibabu",
            "stars": "1 star"
        },
        {
            "comment": "Purchased the phone 1 week ago. Its working perfectly without any problems. Really loved it. Its up to my expectations. worth to buy it.",
            "date": "31 May 2015",
            "name": "Anand Gopinath",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is awesome and everybody knew that..most probably moto turbo will be awesome ...because this phone is very awesome and looks is great..feels good when hold in hand. modern combat 5 runs smoothly..the main thing is that if you buy this phone you will never regret",
            "date": "31 May 2015",
            "name": "purba jk",
            "stars": "5 stars"
        },
        {
            "comment": "-Firstly,I am so glad and convinced by flipkart delivery.The delivery got misrouted one day before mentioned delivery date somehow bt still the logistics person came at evening 8:15pm just to deliver my phone on the same day before given delivery date.I got my order only in 3days of time.Secondly,i would like to thank WS Retail for giving me the perfect product.Well i can even say that i am quite lucky to receive the perfect one because some people have reviewed that they got old product or something like that.So,be lucky enough to get a brand new and perfect product.In that case WS Retail is the most trusted sellers of all,dont go for any other retailers if you want to buy electronic goods. -Well,talking about phone,it is exeptional in this price range,what else do u expect??Its working superbly well.I installed battery saving tools such as DU Battery saver,Battery doctor as well which is helping me to have more battery life and providing me more backup. -Camera is really awesome,front and back cam gives awesome quality pics and flash makes it even better when u have low light around.I bought this phone only beacuse it has great camera.Micromax and all give 13mp bt they arn't even having quality of 3.2 mp.... -Games are playing quite well,i am not fond of playing very high end games.Bt asphalt 8,jelly blast,candy crush,temple run 2,subway surfer and all are playing quite well on this. -1080p videos are also playing without any lag on this phone,internet is fast and wifi working perfectly. -OTG helps a lot to watch your favourite movies by connecting your pen drive directly to your phone via OTG cable. -One con i found is that u can't play music and play asphalt 8 together,your phone will hang.But its fine because the game needs lot of memory to play and as we have only 1gb of ram,so according to that its fine... -I would like to suggest everyone to buy this phone because it has great design,feels so good to hold in your hands,quite well battery backup,superb camera,games are playing perfectly,camera is great,and last but not the least-u will have android version updates regularly on this phone in future. -I just wish that it works well in future and if some problems arise then service centre people helps properly.",
            "date": "31 May 2015",
            "name": "RAVI TIWARI",
            "stars": "5 stars"
        },
        {
            "comment": "Please stay away from this phone as it has the worst UI experience when compared to other android phones. I tried to return the item through Flipkart and they have played games and did not accept my return stating that it is a feature of Motorola and they cannot do anything. There are a lot of saliet features missing in the phone, like customization by SIM, viewing the phone list is not easy, clearing the log clears everything and you have to go go into 2 step process and sometimes 3 step process. My final advice is to stay away from this phone as much as possible and Flipkart is trying to clear its stock as fast as possible",
            "date": "31 May 2015",
            "name": "Krishna",
            "stars": "1 star"
        },
        {
            "comment": "Very good phone for daily use. You'll get pros from specs given. Only con is that battery drains very fast. Amazing delivery by flipkart. Received this phone 15 days before the delivery date given by flipkart. Overall good phone. But I'll recommend Mi 4i instead of this phone because of Mi's massive battery power, battery backup and performance.",
            "date": "31 May 2015",
            "name": "Ninad Mahajan",
            "stars": "4 stars"
        },
        {
            "comment": "Good in Performance but poor in battery life. Pros : Good display Camera Touch Performance Gaming Cons : Battery Life",
            "date": "31 May 2015",
            "name": "Shamil Ahmed",
            "stars": "4 stars"
        },
        {
            "comment": "Total mental satisfaction with the product, price and service...Hatzz off..thank u team flipkart.. :)",
            "date": "30 May 2015",
            "name": "Mayank Baranwal",
            "stars": "5 stars"
        },
        {
            "comment": "Accidentally dropped the phone from a foot's height on a bag and the LCD screen cracked on impact, display is blacked out in the cracked quadrant. Gorilla Glass is intact from the outside Replacing the screen will cost me Rs 6000+ for a phone that cost me 9500. Will never buy a Moto again. Stay away if you can. Cheap phone = Cheap parts = good realization. Forced to give a 1 star rating --- ideally would have preferred a zero rating",
            "date": "30 May 2015",
            "name": "Nilesh",
            "stars": "1 star"
        },
        {
            "comment": "Screen touch is giving problem, battery level suddenly drops from eg 70% to 5%. Sometimes not able to pick calls, issue with touch.",
            "date": "30 May 2015",
            "name": "Prasanna Kulkarni",
            "stars": "1 star"
        },
        {
            "comment": "Can any 1 tel me whether, the power key and volume key both are in level or the power butten is little down because mine power button seems little down than volume buttn and feel tough to press power button,so please reply.",
            "date": "30 May 2015",
            "name": "Deepak mankar",
            "stars": "3 stars"
        },
        {
            "comment": "I have been ordered many mobile from Flipkart.com but moto g 2gen. is worst product. When i put charger on my phone touch screen not working and it reboot again and again and front camera not working",
            "date": "30 May 2015",
            "name": "Jitender Lohan",
            "stars": "1 star"
        },
        {
            "comment": "it takes 5 hours to charge 100% and discharges in 2 to 3 hours.. May be they gave me a product with defect.",
            "date": "30 May 2015",
            "name": "Latha",
            "stars": "2 stars"
        },
        {
            "comment": "It's a beast but I have found that after updating all the necessary google apps, GOOGLE KEYBOARD DOES NOT COME UP, it simply is not visible IF YOU FIND THIS PLEASE TRY A FACTORY RESET. Also Lollipop update has caused musch for the battery drain. Thank YOU",
            "date": "30 May 2015",
            "name": "SHIVAM SUKHDEVE",
            "stars": "4 stars"
        },
        {
            "comment": "This is the best mobile and worth it cost also .. Compare to other mobiles this is best . I strongly believe that this is awesome mobile at this price.",
            "date": "30 May 2015",
            "name": "veeresh Dachep...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased a moto g next gen from this site, delivery is ok , but when the product moto g was started to use had problem with the screen unlock so i complained for a repair or replacement of the product by calling the customer exe. where i didnt get my problem solve and now i wish to get a refund don't want the moto g such is the magnitude of the unresponsive moto g issue . i brought the product from flipkart so it them i want to take to task .",
            "date": "29 May 2015",
            "name": "sebastian ferns",
            "stars": "1 star"
        },
        {
            "comment": "DELIVERY LITTLE LATE COMPARED TO OTHER ITEMS DELIVERED BY THIS SELLER.. PRODUCT WORTH ...PAST ONE WEEK I AM USING..",
            "date": "29 May 2015",
            "name": "JAYAKUMAR LAKS...",
            "stars": "5 stars"
        },
        {
            "comment": "I traded in my sony xperia c for this, got it at a price of 8k. The look of this phone is pretty decent but what's under the hood sets this phone apart from the other phones retailing at sub 10k. The screen is crisp, the camera is amazing for this price range, performance-wise it is pretty darn fast at launching apps and graphics and ram intensive games run without any lags. The quality of materials used is excellent and the feel is pretty premium. Would definitely suggest potential buyers to go for it. Cheers.",
            "date": "29 May 2015",
            "name": "Darth Vader",
            "stars": "5 stars"
        },
        {
            "comment": "i have ordered 8 moto g 2 phones all are working great without complaints ws retail has shipped them with full care nice phone",
            "date": "29 May 2015",
            "name": "PRAMOD VK",
            "stars": "5 stars"
        },
        {
            "comment": "DO NOT CLAIM YOU DELIVER WHEN YOU CANT!!! While purchasing the product, I entered PINCODE for which portal reflected saying delivery is available for the given Pincode. But actually product came to my district place which doesnt fall in the Pincode I given, which is around 40 Kms away from my place. Then delivery guy calls and says you come and pick the product else leave it. I wanna know whose mistake is this? The worst part in all of this is, it was a surprised birthday gift for my dad who lives in my native place and I live in Bangalore. So what should i say to dad that \"Please go and collect the surprised gift which I have sent to you by travelling 80 Kms two way\" Ridiculous. :@ Some thing should be dealt with sensitivity. You must understand that Flipkart!!. I would not have placed that if you guys haven't shown me that delivery is available. \"Dont ask the Pincode for verification to check whether you have delivery service or not, when you really dont bother.\" Top of all this, there were 4 to 5 escalations for this product to resolve and nothing happened. And I was kept on hold for almost 45 minutes in the process of transferring call to senior officials. It all ended up asking my cousin to pick up the product and asked him present my dad. :( Not even a courtesy call after the delivery.",
            "date": "29 May 2015",
            "name": "Sudarshan Mise",
            "stars": "1 star"
        },
        {
            "comment": "good phone .except little bit laggy lollipop.sometimes phone heat ups .which is normal on heavy usage.battery lasts for one day on normal usage.im reviewing after 1.5 months of usage.",
            "date": "29 May 2015",
            "name": "britto",
            "stars": "5 stars"
        },
        {
            "comment": "The display is Superb!! The cameras are also very good. The front camera is much better than expected for 2MP I was confused before which phone to buy. Go for this one blindly. This is a complete phone - with Gorilla glass, good build, good speakers, Lollipop pre-installed",
            "date": "29 May 2015",
            "name": "N H",
            "stars": "5 stars"
        },
        {
            "comment": "Hi friends, I am writing this review after using phone for 10 days. I found that Moto g2 performs really well. This is my first Smartphone, so feel proud to I have Moto g2 which looks really cool and fantastic.As of now i did't get any issue. Some Important point:- -Camera quality is very good as compare to other phone like Yu-Yureka & other. -Performance is to good, as of now I download all required apps and didn't any issue like heating, hanging. Phone is performing really well. -No heating issue like Mi4i, Yureka. -Battery backup is also good. If you used normal then its for 12-16 hours. If you continuously 3G or gaming its drains quickly its for 6 hours normally. Only I found that its take lot time to charged full aroud 3-4 hours. -Overall it is a very good phone. So, Go for it friends, because Moto G2 is trust-able smartphone. Not having that much issue.",
            "date": "29 May 2015",
            "name": "Punyashil Wank...",
            "stars": "5 stars"
        },
        {
            "comment": "Good product in this price range, also got faster delivery against shown time. Till now working fine, battery backup is 8 - 10 hours on 3G on moderate usage.",
            "date": "29 May 2015",
            "name": "Nitin Vats",
            "stars": "4 stars"
        },
        {
            "comment": "Probably the best phone in its generation for its price. Offers you countless features and the Corning Gorilla Glass is silky smooth with the brightest and smartest appearance. A great point to be noted is that as soon as you get your phone and switch it on, its gonna ask you for the Android upgrade to Lollipop(make sure you have your Wi-Fi on) and it updates within seconds. Provides you an exceptional battery back-up and a sleek rear cover. Also the screen is massive, bigger than the 1st Gen model. So folks, just go for it!",
            "date": "29 May 2015",
            "name": "Rahul Bhartari",
            "stars": "5 stars"
        },
        {
            "comment": "i expected a lot from this Brand. But it seems to be an ordinary stuff. with the same price we can get a phone with good specs.",
            "date": "29 May 2015",
            "name": "Sreedhar",
            "stars": "3 stars"
        },
        {
            "comment": "Hi, I got this phone today after 2 days of my order and it is excellent delivery by Flipkart. But when I opened the back panel to insert the sim cards, \"I smelt plastic burnt smell and it still it continues...\" I filed a complaint with Flipart, they were not assured about the replacement but they said their technician will call tomorrow. Need to see whats gonna happen.",
            "date": "28 May 2015",
            "name": "Phaneendra Gud...",
            "stars": "3 stars"
        },
        {
            "comment": "Thanks to Flipkart for delivering this great phone within 2 days of online purchase. I would like to express my views after a month's use: Pros: 1. The design - Sleek, elegant; never felt bulky in spite of the near 11 mm thickness and the 150 grams. In my opinion, the black color suited the design well. 2. Screen lock button - Low profile and firm - helped prevent accidental dialing. 3. Notification light, aptly designed and helpful. 4. Display - This is where it scores the max. Vivid, with good color depth and crisp lines. 5. Graphics - Smooth and lag free. Fluid transition between menus and windows. 6. Call clarity - Loud and clear, without cracking or buzzing, on both the earphones and the speaker, as well. 7. OS - This phone came with Android 5.0.2, which was delightfully devoid of unnecessary apps. The interface was a refreshing change, and the performance was good. 8. Battery life - Well, it lasted a maximum of about 40 hours with calling, messaging, surfing and online apps, on 3G, hence quite decent. 9. Camera - The clarity of the primary camera is really good for 8 MP. Best when shot in natural light. 10. It did get warm while charging; no overheating, though. Cons: 1. No data cable provided with the phone. 2. The lack of a file manger. I had to get one from the PlayStore, which obviously came at the cost of ads. 3. No useful PC/Mac interface. The Motorola Device Manager merely checks for updates to the phone software. Overall, I would say that the Moto G 2nd offered great value for money in comparison with other phones in its class.",
            "date": "28 May 2015",
            "name": "Anand Madhavam...",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is all good unless u get in touch with their customer service center or online support staff. to share the experience i bought the phone (October 2014). It got a android update to lollipop but since then mobile data stopped working. So i contacted the Support staff ( online and Service center) 1. Service center makes me visit every week but every time tell me by next week we will provide u d software to resolve ur issue. 2. Ever time i call the online support they make me dictate the issue and then tell contact service center. 3. We i tell them that service center cant help they tell me to wait for 24- 48 hours. 4 but after waiting i get a mail stating that since we haven't heard from u so we consider the issue resolved. 5 then i have to make the call again , and have to make fun of my self by repeating the issue and i get the same response. ITS A TRAP [Incident: 150524-000931], [Incident: 150211-002831], [Incident: 150209-015846] [Incident: 150211-002831] [Incident: 150226-030405]",
            "date": "28 May 2015",
            "name": "Danish Khan",
            "stars": "1 star"
        },
        {
            "comment": "I will really appreciate fast service provided by Flipkart. MOTO G is great phone with features at very affordable price.",
            "date": "28 May 2015",
            "name": "Sajid Momin",
            "stars": "5 stars"
        },
        {
            "comment": "Basic function of the phone ie the speaker is not working. Along with it multiple other issues .The worst phone and services.Never buy the phone waste of money and time talking to services center without any result",
            "date": "28 May 2015",
            "name": "Manasi",
            "stars": "1 star"
        },
        {
            "comment": "Received piece is not good and I have raised almost 10 return requests but no one responded. Customer care service is very bad and i have never seen these type of responses.if i will get a chance sure i will case a file on this.",
            "date": "28 May 2015",
            "name": "Baburao Adari",
            "stars": "1 star"
        },
        {
            "comment": "The phones starts hanging after a couple of days... Got it replaced and the same issue with the phone after a month... There are better phones in the market for this price...",
            "date": "28 May 2015",
            "name": "Karthik",
            "stars": "2 stars"
        },
        {
            "comment": "Complete value for money, but considering that other Chinese brands are bringing smartphones of higher specs at half the price, i wonder how long will this handset's market domination last.",
            "date": "28 May 2015",
            "name": "Ashutosh Mandelia",
            "stars": "5 stars"
        },
        {
            "comment": "I wonder if flipkart even checks the sellers before sending a product to customers. got a moto g2 two days back and its still lying untouched in the box... reason - the screen flickers, apps open up automatically... can't even touch a option menu a faulty product is delivered to me ordered a replacement now... waiting for it",
            "date": "28 May 2015",
            "name": "Himanshu Puri",
            "stars": "1 star"
        },
        {
            "comment": "absoulute good phone but the piece u have given is faulty. 2ND gen means good ram it has 1 GB but it doesn't give you that feel. I M really sorry but i am not satisfied with your service and product",
            "date": "28 May 2015",
            "name": "Yogendra Revankar",
            "stars": "1 star"
        },
        {
            "comment": "The Product I received is good and working fine .. Tx SG",
            "date": "28 May 2015",
            "name": "S Ganesh Babu",
            "stars": "4 stars"
        },
        {
            "comment": "Such an awesome phone. everything is perfect except the battery. you must have to do some adjustments in the phone for the better battery life like low brightness, uninstall all the factory installed stupid useless apps that may run in background, installing to many messengers which runs background all the time, playing hd games etc.to get a full day. that's all. this phone is excellent in every way. using it since 5 months. Bought 1 for mom and she gets 2-3 days easily and still 20-25% left. :D",
            "date": "27 May 2015",
            "name": "Alan Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "1. I have given 3 stars because delivery is delayed by one day from actual delivery date. 2. While trying to connect mobile data, some times connection is not happened untill I restart the Phone. 3. While I managing the voice calls even I set minimum volume, the volume is very high like loud speaker. These are the issues I found.",
            "date": "27 May 2015",
            "name": "Mani",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is worth the money spent and feels premium!!! But as mentioned by many, battery should have been upgraded. This is really a cheap tactic by all mobile companies to keep rolling out new incremental versions.",
            "date": "27 May 2015",
            "name": "Shreenath Desh...",
            "stars": "3 stars"
        },
        {
            "comment": "I have the first gen Moto G too and this is the newer version. There is no phone which has good built and good functions at this price. I would buy the MOto G 3rd gen too. LOL Good seller, delivered fresh stock, good packaging, no dents and a good piece",
            "date": "27 May 2015",
            "name": "Gautam Verma",
            "stars": "4 stars"
        },
        {
            "comment": "This is an all time popular phone with great camera, graphics. Touch is very smooth and taking selfie using this mobile is also very easy.",
            "date": "27 May 2015",
            "name": "VJ",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone does not hangs, atleast till now bought for 11000. Overall happy with the product at this price.",
            "date": "27 May 2015",
            "name": "Rishabh Kasliwal",
            "stars": "4 stars"
        },
        {
            "comment": "well using since last 6 month. it was my b-day gift. happy with the purchase. coming to the point for pros and cons :: pros: I) screen is bright and vivid II) price worthy android phone under Rs 15000 III) camera in daylight IV) nice rubbery grip V) best inbuilt twin audio speaker (my best ever experience) CONS: I) some heating issues II) facing some lag while using random access of apps (after upgrading lollipop) III) battery life not good. but still my best vote for this mobile look wise and performance its best deal from MOTOROLA. but they should think for battery mAh. they should upgrade to 2300 mAh. thank you FLIPKART :)",
            "date": "27 May 2015",
            "name": "Sampa Das",
            "stars": "4 stars"
        },
        {
            "comment": "great mobile ,i purchase only 9899 rp just, good look 1 gb ram but no problem suprb perform , 16 gb inbult memory and expend up mmc to 32 gb wow !!!",
            "date": "27 May 2015",
            "name": "shashi savaliya",
            "stars": "5 stars"
        },
        {
            "comment": "Got this mobile on 28th Apr'15, but battery backup is very poor. Replaced it and got new one(it is already used by some-one). Got a defected piece, there is defect in display. Informed to Customer care guys more than 6times and every time they are saying \"Our Technical people will contact you with in 24 hours\". But i did't got any call or help from their side. These type of service they are providing. Guys please think once before you going to purchase any electronic device online(specially from flipkart). My only one advice don't purchase electronic items from online, if there is good customer support, then you can...",
            "date": "27 May 2015",
            "name": "Naveen Kumar A...",
            "stars": "1 star"
        },
        {
            "comment": "Nice experience other than Camera performance, video recording is good, battery performance is average. The Airtel offer of 2 GB was not given even after registering a complaint about it.",
            "date": "27 May 2015",
            "name": "Rajeev Ranjan",
            "stars": "4 stars"
        },
        {
            "comment": "I used the product for 3 weeks now and am seeing heavy call drops. Everything else works fine, like internet or and display etc. I raised a request for replacement, waiting for flipkart to exchange it.",
            "date": "27 May 2015",
            "name": "Prasad",
            "stars": "1 star"
        },
        {
            "comment": "Its good................................................................................................................",
            "date": "27 May 2015",
            "name": "soumya satapathy",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G has always been high on performance (Battery backup + Responsiveness + Performance). This set is best in range (10-20K) and offers a great experience to users. Moto G Migrate is a great option along with tracker for security and data transfer.",
            "date": "26 May 2015",
            "name": "Deepak Kushwaha",
            "stars": "5 stars"
        },
        {
            "comment": "This is a good phone, However the phone has some drawbacks as well. Phone is hanging most of the time, Battery backup is not that good. some time battery power % is hanging though the power is 10% it is showing as 90%. Better don't opt for this mobile when you are paying 13K",
            "date": "26 May 2015",
            "name": "G P Chandrasekhar",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G2 got a humongous response with it's high-end features in one's budget. no point to raise about anything excet the essential battery. aaahhh god !! To those many features in hand- the given 2070mah battery is not even close to the benchmarks. finally, disappointed with battery but overall performance is quite good .",
            "date": "26 May 2015",
            "name": "Gopi Krishna H",
            "stars": "4 stars"
        },
        {
            "comment": "Using this mobile from last one month, not getting any issues, Nice phone. I like the front camera clarity which is just awesome in day light as well in dark area. handling also cool. Gaming department is just amazing, can play any game without any issues.",
            "date": "26 May 2015",
            "name": "Mahesh Patil",
            "stars": "4 stars"
        },
        {
            "comment": "For: Stock Android experience. Other similar specced choices in this segment: Huawei Honor Holly: for-camera, great designing. cons:no Gorilla glass Lenovo A6000 Plus Asus Zenfone 5",
            "date": "26 May 2015",
            "name": "Kavera MP",
            "stars": "3 stars"
        },
        {
            "comment": "Even with minimum browsing its like anything........even i acnt attend the calls by using this mobile... i think i am only facing this problem?...today i requested flipcart for return of this hot plate ...lets see ...",
            "date": "26 May 2015",
            "name": "Lakshmisha Gowda",
            "stars": "1 star"
        },
        {
            "comment": "But it has only 1 GB RAM.FRONT CAMERA IS NOT UP TO THE MARK NOT GOOD IN DIM LIGHT.Processor is very good. Speakers not good in loud music.",
            "date": "26 May 2015",
            "name": "Nilesh Jadhav",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome phone with better performance. Fast processor. Those who are starting with smart phones. This is better and best choice. I will recommend all my friends out there to go ahead with the brand that has brought mobile technology. Really proud of the brand for a great comeback.",
            "date": "26 May 2015",
            "name": "Mithun Roy",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G2 is very good phone for the first time users of smart phones. it has good camera quality as compare to moto g1.Good Call quality.onlt the thing is Battery is only 2070mah ,it should be at least 2500 mah with 5 inch screens. overall nice budget phone ....for me. go for it friends..............very good performance overall.",
            "date": "26 May 2015",
            "name": "Ravi Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent phone!!! 1GB RAM, the phone wont stuck as a usual 1GB RAM of andriod phones. PROS: 1. very good front nd back camera 2. water proof coating all over the phone 3. very rare lags 4. good internal storage around 12GB 5. great call quality!!!! 6. nice speakers 7. install more than 50 apps bt still the phone will run smoothly not lik other android phones of 1GB RAM that lag often nd hang very badly CONS : 1. poor battery back. with hvy usage it wil last long abt 5-6 hrs lik enabled data, playing light games, whatsapping, fb messenger. 2. near rear camera, heating is there bt not a big deal, keep it idle fa 5 mins, everything is set now 3. looks lik huge phone on our hand since it has huge width.",
            "date": "26 May 2015",
            "name": "raghu",
            "stars": "4 stars"
        },
        {
            "comment": "Go for it. Good product. Product received on time. All are apps are running , no problem. Camera is not that great. But only concern is when i brought it was 12,999. and with in a week immediately it is changed to 10,999 with 10% offer. I have not got any refund.",
            "date": "26 May 2015",
            "name": "dev",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is super. Service is also best. The packing of phone is good. the charger and head phones are working good.",
            "date": "26 May 2015",
            "name": "Bala Subrahmanyam...",
            "stars": "5 stars"
        },
        {
            "comment": "The delivery was quicker than expected, the packing was good. The design was good and happy with the screen size. Whenever playing games the mobile is getting heated up fastly. Sometimes the touch is not working, have to restart the phone. Overall my experience with the phone is ok.",
            "date": "26 May 2015",
            "name": "SivaKumar CG",
            "stars": "3 stars"
        },
        {
            "comment": "I placed my order on 12th March and made all the payment via credit card. Despite this my product was delivered very late compared to the products in which I keep cash on delivery option . The customer care too was very irresponsible and used to give me lame excuse all the time I called to them. The more the flipkart grows in user number the more it takes the customers lightly. The product is good and works fine. Battery backup is also good . The touch is also very smooth . Response of apps is also good. I am happy with the product. I recommend buying it if you are asking for a good phone around 13k price range .",
            "date": "26 May 2015",
            "name": "Shakeel Ur Rahman",
            "stars": "5 stars"
        },
        {
            "comment": "Good display! Better than average camera. But lag sometimes when you load with multiple application. Not at all for gaming. Just for basic use. Nice speaker quality. I would recommend not to buy rather wait for it's next version. I expect then upgrade the processor in next version for smooth experience.",
            "date": "26 May 2015",
            "name": "Varun Agarwal",
            "stars": "3 stars"
        },
        {
            "comment": "first i had faced a network problem due to this service center has changed its motherboard. Now display is not working. Battery back up is not good camera and other thing are good I think to increase their productivity they had compromise with their quailty.",
            "date": "26 May 2015",
            "name": "Pushpendra",
            "stars": "1 star"
        },
        {
            "comment": "Happy with it. Quick Delivery. Good Packaging. Phone is working great. I wish they can also give a protective screen-film with this.",
            "date": "26 May 2015",
            "name": "satinder singh",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product from motorolla. Good UI and nice to handle.Using this MOTO G2 for last two days.This is a killer product.",
            "date": "26 May 2015",
            "name": "Kanhu Charan P...",
            "stars": "5 stars"
        },
        {
            "comment": "features wise this is very good mobile and I brought this mobile for 9900. this is a good deal. I've recevied this phone with in 3 days, it was so quick.",
            "date": "25 May 2015",
            "name": "Srinivasu Boddu",
            "stars": "5 stars"
        },
        {
            "comment": "http://womenglory.com/ one should go for this mobile if they want a smart phone with awesome features and low cost. I recently bought and if I compare with other high priced mobile it worth alot",
            "date": "25 May 2015",
            "name": "http://womengl...",
            "stars": "4 stars"
        },
        {
            "comment": "plz exchange this cellphone withmoto x 2nd generation reason for 1 gb ram plz suggest",
            "date": "25 May 2015",
            "name": "o.p chaurasiya",
            "stars": "4 stars"
        },
        {
            "comment": "Overall mobile is good except few features. below the some problems which I have identified. Speaker Problem Bluetooth problem Don't have option to send the songs through Bluetooth Complete call hours history facility is not available songs does not play some times(needs to be switch off and on for play again) By coolin rodricks Goa",
            "date": "25 May 2015",
            "name": "pradeepa km",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after using this product for 3 months. I am not a big addict of games and all, I had installed only one game and few other Apps. Now my phone works very very slow, it hangs most of the time even when i try to make a call, its taking atleast 5 secs to just open my contacts..it will tell you how slow it is.. very very poor. Also it gets heated quickly during browsing and playing games. This is also not a good sign. Now there are lot of options to buy high config phones comparing to this with same budget.",
            "date": "25 May 2015",
            "name": "Thiru",
            "stars": "1 star"
        },
        {
            "comment": "this phone having very hanging problem some times it will not working properly lollypop version very drawback on this phone",
            "date": "25 May 2015",
            "name": "Shobana G",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent product within a range od 10K. Camera quality is very good . Speed is excellent and external memory slot is added advantage .",
            "date": "25 May 2015",
            "name": "Mallikarjun Patil",
            "stars": "5 stars"
        },
        {
            "comment": "i brought a phone on 13 april and after that it doesnt charge and i got replacement after few days it again got problem voice clarity, charging issue.after so many calls finally they send me refund form to get my money back and next day they refused to refund my money and replace again as 30 day replacement is only on papers.so i would request you to dont but this phone from flipkart atleast as they dont do what they say",
            "date": "25 May 2015",
            "name": "shubham",
            "stars": "1 star"
        },
        {
            "comment": "Good value for price,connectivity is fast,good design, brilliant picture quality,good OS and the camera is also good.",
            "date": "25 May 2015",
            "name": "Sayan Saha",
            "stars": "5 stars"
        },
        {
            "comment": "Brought this device and within two days of using the device.. the device often gets rebooted automatically...even when you are making call... I can understand it's a manufacturing defect... But what add to problem was the service provided by FLIPKART. When I asked for money back and not the replacement... Please check for other viable option's before purchasing any product from here.",
            "date": "25 May 2015",
            "name": "Neeraj Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Good phone but current 2000 less ,which i have buy...................................................................................................",
            "date": "25 May 2015",
            "name": "Gulfam",
            "stars": "5 stars"
        },
        {
            "comment": "when i open my box and switch on my phone my excitement was gone screen is having black lines from top to bottom on right side of the screen im disappointed ,flipkart support is not responding in a good way hoping for a refund or replacement Update : got a replacement and all good",
            "date": "25 May 2015",
            "name": "srikanth g",
            "stars": "5 stars"
        },
        {
            "comment": "DIS: Charge is not sufficient drains quickly. Ram is low more applications cannot be installed ADV: Display is good. Best phone in low price.",
            "date": "25 May 2015",
            "name": "Ganesh K",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased this mobile..,just in 1month i came to know that this is waste product... we can make an omelet on it...full of HEATING PROBLEM..",
            "date": "25 May 2015",
            "name": "Sukender rao Madu...",
            "stars": "1 star"
        },
        {
            "comment": "highly priced ,inefficient customer care representatives,defective products.everything else is worse.",
            "date": "25 May 2015",
            "name": "Pradip Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Excellet feature with great price with a android upgraded version 5.0.2 only the issue is when charging its molten rock",
            "date": "25 May 2015",
            "name": "Swapnil M Kawa...",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased it 20 days back. I have ordered at night 12 and i received it very next day 9 am... full marks to delivery. I had 3 options while buying this phone moto g 2nd gen ,mi 4i and lenavo a6000 plus. though it was released few months back... no flaunting upgrades .. its decent a phone. Pros: 1. Brand its Moto! 2. very good build quality 3. No lags though 1 gb Ram! 4. good call quality. 5. good display n sound quality. 6. affordable price. 7. Stock android Experience Lollipop built in! 8. Dual Sim phone multiple features 9. 16gb internal memory + expandable. cons: 1. Camera not that great yet for this price okay... 2. Battery drains faster 3. 2g slow internet and 3g is okay not impressive . no 4 G 4. no pre installed non google apps like whatsapp, facebook 5. no 2gb ram for game savvy people. 6. higher SAR value",
            "date": "25 May 2015",
            "name": "Shrinivas K",
            "stars": "4 stars"
        },
        {
            "comment": "Just awesome phone at these price range Camera clearity is good, sound clearity also But phone lags during heavy use because 1gb of ram. Looking great and touch is very sensitive.",
            "date": "25 May 2015",
            "name": "amar walke",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G for my brother and a friend. The device has a very clean design and the display is good too. The negatives is the hardware punch, the phone lags and hangs with day today use. I would recommend xiaomi red mi 2, which has better specs at lower price and it doesn't hangs in day to day use. So concluding : Moto G is good but there are tons of new options out there, which are value for money, this one is lagging here.",
            "date": "25 May 2015",
            "name": "Ankit Sejwal",
            "stars": "3 stars"
        },
        {
            "comment": "This phone hangs all the time, is heavy and has bad receptivity to touch. Flipkart shows no concern about the bad quality of the product.",
            "date": "24 May 2015",
            "name": "Abdullah",
            "stars": "1 star"
        },
        {
            "comment": "i bought this mobile as gift for my fiancee.she really liked it. the features offered are good. the handling is easy. the display is good.",
            "date": "24 May 2015",
            "name": "zed",
            "stars": "4 stars"
        },
        {
            "comment": "This has been a good bet for me as I needed a phone which I can handover to my kids and not worry about the phone getting damaged. Provides a good grip and is a tough phone. Performance is pretty good. I have had no issues whatsoever.",
            "date": "24 May 2015",
            "name": "Mohammed Shoaib",
            "stars": "5 stars"
        },
        {
            "comment": "I bought it as gift for my brother. He loves it and uses it for all the different things. I bought it against my old Nokia phone which had no scrap value whatsoever. Flipkart bought it for 2500 bucks which was such a steal deal.",
            "date": "24 May 2015",
            "name": "Singh Saurabh",
            "stars": "5 stars"
        },
        {
            "comment": "Superb phone without any doubt at this price point. I have been using for about 9 months now, although it would be advisable for people to go for higher spec device, coz post the Lollypop (5.0) android update the phone becomes slow.",
            "date": "24 May 2015",
            "name": "Arijit Kundu",
            "stars": "5 stars"
        },
        {
            "comment": "everything works flawless , with the latest lollipop PROS camera 9/10 looks 11/10 speakers 8/10 display 10/10 front cam 9/10 cons 0 cons they could have gave a usb cable except that its very good",
            "date": "24 May 2015",
            "name": "VASUDEVA RAO",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is awesome no performance drop in like 3 to 4 months but i must say battery backup is SHIT SHIT SHIT!!!!!!..... I had to lower the brightness at lowesttt...:( 4 stars for the bad battery backup...",
            "date": "24 May 2015",
            "name": "Mukul Dubey",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delivered this in under 12 hours!! amazing.. the phone is great.. looks.. display.. everything... A nice buy for this price range...",
            "date": "24 May 2015",
            "name": "Rahul Sasikumar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is simply amazing and thanks to Flipkart for delivering it in good packaging. Handset is just superb being a Motorola. Service from Flipkart is just superb and very fast delivery.",
            "date": "24 May 2015",
            "name": "Sushil Jena",
            "stars": "4 stars"
        },
        {
            "comment": "Please don't buy this product. Flipkart shipped me defect piece. They are not event responding to my mails. Don't buy this. it getting struck and some time i couldn't able hear the voice. Flipkart is a waste website. don't buy here.",
            "date": "24 May 2015",
            "name": "mani",
            "stars": "1 star"
        },
        {
            "comment": "After istalling lollipop update device cant run fast as compared to kit-kat. This device needs one more update for boost up device thats i am expecting not more Thanks you Motorola.",
            "date": "24 May 2015",
            "name": "vishal bhosale",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile is too good for 11k, i am using this phn from 2 days camera,screen sensitivity processing speed all are good but draw back is battery it will discharge very fast and while charging sometimes phn will get heated",
            "date": "24 May 2015",
            "name": "Js Darshan",
            "stars": "4 stars"
        },
        {
            "comment": "I brought the moto g2 phone on 14th of December. i dropped the phone and from that moment its touch screen isn't working properly . can u guys please help in with fixing this problem thanks in advance",
            "date": "24 May 2015",
            "name": "anunayana",
            "stars": "1 star"
        },
        {
            "comment": "After browsing many mobile in this range ( renowned brand ) , I had decided to buy this mobile.. I am completely satisfied with this mobile.",
            "date": "23 May 2015",
            "name": "Dipankar Majumder",
            "stars": "5 stars"
        },
        {
            "comment": "Its more than the worth of ur money comparatively its better than the other mobiles which r in the market in this price range Highlights: Speed Handy Gorilla glass (anti scratch) Version and many",
            "date": "23 May 2015",
            "name": "Avinash P",
            "stars": "5 stars"
        },
        {
            "comment": "The phone was delivered to me on last Monday. I have started using this mobile from today. After few hours, The display is getting green fully with grid lines fully over the screen and also the screen is getting blink with green and white color on the full screen. I have requested to replace this item. Please replace this phone with the new one immediately. Thanks Flipkart for replacing with the new phone. Replacement Mobile was delivered with in 3 days as mentioned.",
            "date": "23 May 2015",
            "name": "karthik sekar",
            "stars": "4 stars"
        },
        {
            "comment": "wonderful set now at gr8 price, my 5th set in family personally 2nd as 1st lost. only camera is little poor than others, call recording feature not available.",
            "date": "23 May 2015",
            "name": "Apurva Katyayan",
            "stars": "5 stars"
        },
        {
            "comment": "It comes with Android lollipop. Awesome features and the camera is good. I cant get tired rolling my finger over the screen.",
            "date": "23 May 2015",
            "name": "Kamal",
            "stars": "5 stars"
        },
        {
            "comment": "I will buy Moto G (2nd gen) Mobile This Month 6th May. They will send a Display Problem Mobile and i will resend the mobile at May 7th and i will call customer care nobody can responsible me and they will taken slow processing and they will resend my product 1 month. and i dont want your product to say Flip kart Higher officer to refund my like that and they will be told to your money will be refund in 1 week of working days and all over processing will be very slow. So my dear nobody can buy in flipkart online shopping cart.They go going to frod and forgery me.",
            "date": "23 May 2015",
            "name": "thats tamil",
            "stars": "1 star"
        },
        {
            "comment": "Using this phone since last 8 months and I am fully satisfied. Very good phone for gamers. Run any game very smoothly whose size is more than 3 GB. Highly Recommend.",
            "date": "23 May 2015",
            "name": "Archit Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "when browsing internet mobile got over heated, that time if we take calls ear got burn, so pathetic i feel bad after buy this phone it is really bad",
            "date": "23 May 2015",
            "name": "Bhoopal Thumbur",
            "stars": "1 star"
        },
        {
            "comment": "Its been two days the I am using the phone, but dont know why the phone is heating even I am not using it. Its heats so much that cant even put it on hear. I though that it might be due to the tempture but I has Moto g 1st gen and its not heating.",
            "date": "23 May 2015",
            "name": "Kapil Jadhav",
            "stars": "2 stars"
        },
        {
            "comment": "With all the competition in market this one looked promising at the starting. But not a good performer though. Regretting decision of getting this one.",
            "date": "22 May 2015",
            "name": "Amit Rastogi",
            "stars": "3 stars"
        },
        {
            "comment": "I am using this this phone from last 6 months. the phone is working very well without any lagging. I would recommend this product.",
            "date": "22 May 2015",
            "name": "Ankur",
            "stars": "4 stars"
        },
        {
            "comment": "I find a difference between others using this same product and me using it, there is a speed and performance difference.",
            "date": "22 May 2015",
            "name": "Ankie",
            "stars": "2 stars"
        },
        {
            "comment": "Got this phone for my Wife as a Birthday Gift. In 2 Days they delivered the product, with nice gift wrapping. The phone is amazing and must say i thought i need to upgrade the OS but i got it with Lollipop Android. Worth for money.",
            "date": "22 May 2015",
            "name": "Maclean Ebi",
            "stars": "5 stars"
        },
        {
            "comment": "All the all aspects of this phone is is the best in this budget...Its look is so awesome than when ever U get the ph. From ur pocket...public must look atleast once ..coz this device is much more differ than other conventional smart phones..for its charming design display and look...Im very happy with dis masyer piece...U believe me or not..I also look like see again and again in my hand...n feel proud..",
            "date": "22 May 2015",
            "name": "Suraj Singh",
            "stars": "1 star"
        },
        {
            "comment": "Excellent Smart Phone with all Features. Very happy with the Product.",
            "date": "22 May 2015",
            "name": "Phani Kumar Gu...",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased Moto G 2nd Generation on 24-3-15, from then onwards i am facing Issues with Mobile Heating, Network connectivity for 1 SIM Card, Media & Ring Volume reduces automatically, Both SIM cards will get \"x\" mark & many more problems. For this Flipkart checked the mobile by installing Smart Check, but nothing improved. The whole process took nearly 2 months, but as per the return policy, product will be returned with in 1 month only. But as the complaint is registered with in 1 month & the product delivered is defective Flipkart promised to replace it if is defective & asked me to visit a customer care center. Customer care center has confirmed that the product delivered was defective & Flipkart on the discussion initially rejected but after talking to their supervisor replaced the product & delivered in 2 days only. Thanks for the Team.",
            "date": "22 May 2015",
            "name": "Vinay Kumar B",
            "stars": "5 stars"
        },
        {
            "comment": "I bought MOTO G 2nd generation mobile last week and with in couple of hours I found there was a problem in speaker and i have requested for returning the mobile. Customer care ppl called and try to convince me several times even when speaker was not working. when I called final time they are telling some excuse and to update the software, to check dust could have struck at speaker. How could dust will struck for new mobile? With my experience please ever buy any electronics from this site",
            "date": "22 May 2015",
            "name": "Sai kiran",
            "stars": "1 star"
        },
        {
            "comment": "Had high expectations after reading the review. After two months of usage this is my feedback. I work in the TELECOM field and use the phone for basic activities like Voice calls Whatsapp etc. I dont use gaming or download too many other applications. The phone is very sluggish to move from one menu to another. Many times my contacts complaint that they cant reach me while calling. I observed during such times I cant make outgoing calls either . The phone gets into some kind of Hung state. Solution : Restart phone or Flight mode ON / OFF Last 2-3 days new problem is I cant answer incoming calls. The phone doesn't respond when I touch the Answer button. The screen sensitivity is ok as I tested other apps in the same area of screen, it works. Solution : I can lock the screen and unlock this time I can answer . Thinking of what next to do !!!!!",
            "date": "22 May 2015",
            "name": "Rinu Thomas",
            "stars": "1 star"
        },
        {
            "comment": "I was very happy with the New MotoG. But after getting charged the mobile is heated up and not able to touch the mobile as well. I am very much unhappy with the product.",
            "date": "22 May 2015",
            "name": "Manju H",
            "stars": "1 star"
        },
        {
            "comment": "Good phone to buy at this price compare to all other brands, this phone has very smooth touch and smooth operation... keep it up moto..",
            "date": "22 May 2015",
            "name": "Vijay Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Well I purchased the phone because of its reputation and my trust on flipkart. I had already bought a nexus 7 and a nexus 5 from flipkart those products were great no complains at all. BUT this one was a completely different story.. This phone was delivered to me in the 1st week of April I don't exactly remember the date but the problem was sound from its bottom speaker distorted at full volumes. so no issues i requested for replacement. i had to be on phone with flipkart support for 46 mins just for them to check the phone when all that verification and testing was done they told me My new device will be shipped only when this will be picked up and will reach them. I had no other option to wait. then I received the replacement model on 23rd April and guess what it had the exactly same problem. But this time I did not have the patience to be on the phone with flipkart customer support and explaining the same thing to the same guy over and over again. So i kept the phone did not do anything and i am using it.. its working absolutely fine but the sound distortion problem still persists. Plus I've reduced shopping from flipkart because last 10-12 orders i've placed from flipkart either they were defective or not functioning at all. I bought clothes 2 out of 4 t shirts faded in the 1st wash. I ordered a wireless mouse the package was torn all the way when i received it and the worst part it did not even turn on, i requested a refund that took 16 day. I sincerely request flipkart to improve the quality if they really want to retain their customers. I am certainly not happy and so are not many other loyal buyers.",
            "date": "22 May 2015",
            "name": "Arpit Awasthi",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone for a mid range budget, but the RAM might be a turn off for high performance seekers. The phone does satisfy most of the other requirements and has a quite a good camera",
            "date": "22 May 2015",
            "name": "Biplab",
            "stars": "4 stars"
        },
        {
            "comment": "this moto g secong generation maobile is nice ,but battery is gone in one day , i recommnded this mobile ,hearphones very bad",
            "date": "22 May 2015",
            "name": "DILEEPREDDY K",
            "stars": "5 stars"
        },
        {
            "comment": "I am very satisfied and happy on purchasing my new Moto G2 mobile handset. I have gone through the handset and I did not faced any kind of issues whatsoever for which I was very afraid-of basing upon town talks. Software is brilliant and gives an out of this world experience. Lollipop Android on this handset is like \"Icing on the cake\". All the rest features are also very good and quite amazing. However one upsetting thing about this phone is that it does not have a USB Data cable-cum-Charger which makes user to arrange it from somewhere else also Headset is kind of OK. But nevertheless experience is awesome!",
            "date": "22 May 2015",
            "name": "Deepak Kumar Jha",
            "stars": "5 stars"
        },
        {
            "comment": "I used more Couple of android devices and old Moto G as well, till now and this Moto G next Gen was poorest battery performance under both 2G and 3G network. Battery is getting Discharged 5-6 hours after full charge which is very pathetic ... usage was very nominal with few mails and few calls with few sms. No multimedia/Games play at all. If you looking for better android experience with decent battery backup this is not what is suggest. otherwise Phone is awesome....no doubts...",
            "date": "22 May 2015",
            "name": "Srinivas Ramchand",
            "stars": "2 stars"
        },
        {
            "comment": "it is slowing down the mobile..battery capacity is very less.in all other aspects it is good ..all games performing good.",
            "date": "22 May 2015",
            "name": "MURALI KRISHNA",
            "stars": "5 stars"
        },
        {
            "comment": "This would be a perfect product if it didn't heat up when charging or playing game. Touch is awesome, absolute value for money for price you are paying. Probably the best in it's class in Indian market.",
            "date": "22 May 2015",
            "name": "Mohit Saxena",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola may be one of the brands that has seen better days in the past. With brands like Sony, HTC and Samsung grabbing the android limelight, and the giant killer from One Plus One, Motorola may have a hard time tying to find a clientele. You have to get a feel of it to see, how well built this unit is. It surely gives the midrange units from HTC, Sony and Samsung something to think about. Its well built and its operation is really smooth for 1Gb of RAM. I had recent;y purchased it for a friend who wanted to upgrade from the Samsung Note N7000. He was shocked when he found out how well the unit performed. although he was skeptical at first. My advice, is you gotta try it to believe it.",
            "date": "22 May 2015",
            "name": "Melvile de Melo",
            "stars": "5 stars"
        },
        {
            "comment": "Using since 6 months. Everything is good but the battery sucks. Battery drains when it is in standby mode too. Would have given 5 stars if battery backup was good enough.",
            "date": "22 May 2015",
            "name": "Santhosh Rokz",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this one from Flipkart and have been using this mobile for past 1 month and the performance is excellent. 1. DISPLAY- It is crisp and colors are punchy. 2. BATTERY- It lasts for a full working day with screen on time of 4+ hrs approx on WI-FI along with moderate gaming , web surfing. 3. CAMERA- Both primary and secondary are decent but not excellent but considering the price its ok. 4. CHARGING- It takes around 3+ hrs from 0-100% with supplied charger. 5. OS- Latest Android LOLLIPOP at its best and simply flawless performance . 6. GAMING- It could many of the games including Asphalt 8, Dead Trigger ,Clash Of Clan etc without any issues at medium graphics . 7. AUDIO OUTPUT- Both the front facing speakers are adequately loud and call quality is good. 8. HEATING- It gets slightly warm on extensive gaming, which is common with all mobiles. OVERALL AN EXCELLENT MOBILE AT THIS PRICE POINT AND JUST GO FOR IT",
            "date": "22 May 2015",
            "name": "AQEEL SHAIK",
            "stars": "5 stars"
        },
        {
            "comment": "All its features are great! No disillusionment. Wish it had a recycle bin ! Deleted my photos accidently . . . want them back desperately !!!",
            "date": "22 May 2015",
            "name": "Milan",
            "stars": "4 stars"
        },
        {
            "comment": "it's working so nice, no defects found in this one, expecting some more variants of Motorola since marketing is open for 2G RAM phones at present.",
            "date": "22 May 2015",
            "name": "RAJESH REDDY B...",
            "stars": "5 stars"
        },
        {
            "comment": "its a amazing phone, look is so gud, back cover classic. battery back up not so gud, quiet gud mobile.",
            "date": "22 May 2015",
            "name": "sushil sharma",
            "stars": "5 stars"
        },
        {
            "comment": "The most horribly slow OS. Terrible touch response. Regret buying this peice. I suggest you for some other phone rather than wasting your money on this.",
            "date": "22 May 2015",
            "name": "Sudeesh",
            "stars": "1 star"
        },
        {
            "comment": "Wow super mobile performance is very good. But battery backup is very less No hanging No software problems designing is good",
            "date": "21 May 2015",
            "name": "Shivakumar Cholli",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for last 10 days.The only issue i have with this phone is their is no File Manager & Music Player app.The display,camera and speed of phone is good as compared to my S duos.The battery also last a day(if no games are played).",
            "date": "21 May 2015",
            "name": "Abhay Salunkhe",
            "stars": "4 stars"
        },
        {
            "comment": "Right from the day I ordered this phone....I received dis-satisfactory response. First you delayed my delivery my one week, then u guys called me to place another order. Not just that.....When I got the phone, I found no google play store in it. I made several request to resolve the issue......no help from ur side. Right from the day first, this phone is not working well. Sometimes it get hanged, sometimes it start ringing on its on. Even after doing reboot of it, situation of phone is same. Totally unpleasant experience i face, I request for phone replacement, and look what i response I am getting, Seller is not willing to replace it. What the hell F-Team is doing there.",
            "date": "21 May 2015",
            "name": "Pawan Sehrawat",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this phone for my dad . It has been working very well since last 4 months. Specially ppl who are looking for a smart ph for basis networking purpose its d best available in market . it is as good as any Samsung or nexus which cost above 25k.",
            "date": "21 May 2015",
            "name": "abc",
            "stars": "5 stars"
        },
        {
            "comment": "At first I was addicted with the phone and after using this phone for few months, here are my views. The specification of the phone is good however I can find few mismatches from my expectations. - The \"Cast Screen\" feature (also available explicitly in the pull down drawer) doesn’t work with miracast or Smart TV. You cannot mirror you mobile screen with TV (wirelessly) even when it is supported by Lolipop as it seems to be disabled by Motorola at OS level (based on my Goggling). - The declared Gorilla glass is not of great quality and I have got few scratches on the screen. I recommend taking good care of the screen. If you could not handle screen carefully then buy a good Flip Cover. - For some of the Days, the Phone hangs a lot and couldn’t let you browse through your app. Not sure of the pattern and reason but happens once every two-three days. It is very irritating and not expected from the phone of this specification. Rest all is good and not a completely bad choice for buying.",
            "date": "21 May 2015",
            "name": "Avinash Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "this one was my first andrid phone - I am compleatly disppointed whith this phone (comparable to my freinds phone) -very poor battery bacup, heating issue( it reaches up to 50 degree centigrate while long phone calls and while doing multitasking ) - except its look and gorilla glass features there in nothing good to say about this phone - Anyway thanks to flipcart for returning my money aftwer uage of 40 days.",
            "date": "21 May 2015",
            "name": "Ujjawal Raj",
            "stars": "2 stars"
        },
        {
            "comment": "Battery takes 5-6 hours to get fully charged. Very less stand by time of the battery. Cant even back the whole day up from to evening even if you charge it 100% in the morning",
            "date": "21 May 2015",
            "name": "Sabyasachi Bhuyan",
            "stars": "2 stars"
        },
        {
            "comment": "hangs too often. The call drops and mobile shuts down on its own anytime. Bad service at service center. Bad experience with moto g first generation also.",
            "date": "21 May 2015",
            "name": "Deependra Anand",
            "stars": "1 star"
        },
        {
            "comment": "It was a good experience buying this phone from flipkart. Phone is working nice without any issue. though the battery back up is less.",
            "date": "21 May 2015",
            "name": "Rahul Patel",
            "stars": "4 stars"
        },
        {
            "comment": "i brought this phone on january 2015 it came with the problem i request the flipkart company to avoid these type of problems and return my money",
            "date": "21 May 2015",
            "name": "Naveen",
            "stars": "1 star"
        },
        {
            "comment": "Cheap plastic....bought it for my mom...she hates battery life, she hates the interface (She used HTC One V before) and she always complain why i didn't bought her an HTC device:(",
            "date": "21 May 2015",
            "name": "Parvinder Rakhra",
            "stars": "2 stars"
        },
        {
            "comment": "Sound is really fantastic.... at this price... the phone is awesome... go for it ... i got this phone in exchange of my old moto quench.... thanks flipkart !!!",
            "date": "21 May 2015",
            "name": "Muntazir Khan",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is the best at the price range of 10 to 15k. nice LCD touchscreen with ips display and corning gorilla glass which is found in high end mobiles and quadcore processor for the speed! nice 8 mp camera and a good 2 mp camera for selfies. it would be better if they had more colours. poor battery backup.",
            "date": "21 May 2015",
            "name": "sumanth s",
            "stars": "4 stars"
        },
        {
            "comment": "WORST EXPERIENCE WITH SELLER. I DIDN'T RECEIVE ANY PRODUCT. I JUST RECEIVED AN EMPTY BOX AND ASKED FOR REPLACEMENT THEY MAKE ME WAIT FOR A LONG TIME AND NOW THEY WERE SAYING THAT THEY HAVE GONE THROUGH INVESTIGATION AND GAVE A CONFIRMATION THAT PRODUCT IS WITH ME. THIS IS A REAL SITE FOR MAKING SOMEONE FOOL. PLEASE DON'T BE IN A TRAP. YOU GONNA LOOSE YOUR 10999.",
            "date": "21 May 2015",
            "name": "Suresh Kumar",
            "stars": "1 star"
        },
        {
            "comment": "i worried when i bought this...about the charger...but flipkart guys assisted me...i thought of changing d product...but now i love my mobile..radio is not that good...rest all awesome...picture quality is best than all d mobiles...super hard..",
            "date": "21 May 2015",
            "name": "esther nadar",
            "stars": "5 stars"
        },
        {
            "comment": "Good Packing and Good Product.. I am impressed..Very Nice product too..Wroth Buying..Good Job Flipkart",
            "date": "21 May 2015",
            "name": "Buyer",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone 4 months back, I can say I am satisfied customer of Motorola now. Very good phone, no lags so far. One suggestion I could give is Motorola should improve quality of earphone and charger that ships with devices. Overall very nice",
            "date": "21 May 2015",
            "name": "Darshit Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "while i appreciate the express delivery of flipkart, the product is very bad and the phone hangs very often..also the battery back up is poor! Flipkart has sold me faulty product!",
            "date": "21 May 2015",
            "name": "kalpana rangan...",
            "stars": "1 star"
        },
        {
            "comment": "evrything is good except the cam (in low light) go for it if ur phone need to have a premium look and beware u may receive a replaced product from flipkart",
            "date": "21 May 2015",
            "name": "shashank gowda",
            "stars": "4 stars"
        },
        {
            "comment": "The product says 16 GB inbuild, but shows 12.8 GB... it might be due to internal usage... Downloaded some games and it's quite good to play... For Camera Quality i give 2 star only... it's not looks like 8 MP quality... it blurs if you expand.... Anyhow it's ok...",
            "date": "21 May 2015",
            "name": "Krishnan",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone for the price. Using it for a couple of months and had no issues till date. The only problem is while calling on Facebook Messenger or Whatsapp, a slight echo is created due to the location of the microphone(near the top speaker); use headset for while calling on anything other than the phone app. Other than that, everything is good. It would have been better if the battery was removable, just in case the phone stopped responding for some reason.",
            "date": "21 May 2015",
            "name": "Trinopoty Biswas",
            "stars": "5 stars"
        },
        {
            "comment": "I am using both moto g 1st gen and 2 gen, only the problem is battery backup in 2nd Gen. If I make full charge in night it will stay till evening but 1 st gen battery backup will stay 1 and 1/2 day. Manufacturer need to think to provide higher battery backup for Moto g2.",
            "date": "20 May 2015",
            "name": "Umesh M M",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this mobile on 25th nov 2014 from flipkart. Mobile become completely hanged while I am using camera in sun light. Apart from that: Charger is dead within 4 months.",
            "date": "20 May 2015",
            "name": "Rajdeep Rana",
            "stars": "2 stars"
        },
        {
            "comment": "Though, the product reached on its scheduled time, it did not tempt me to use as swiftly as much as I was waiting for it. I was amazed to know that Moto G2 does not have file manager on a first place. (though, you might download) Further, the contacts that were synced with gmail account could not be deleted on a one go. Meaning thereby, perhaps there is no option of \"select all\" or for that matter \"select multiple\" Next, I was astonished on noticing that one cannot assign a song from the playlist as a ringtone. You are forced to use default ringtones. In my further discovery, I came across text messages where you are definitely allowed to type but there exists no provision to \"save its as draft\" The absence of \"memo\" and alike makes it so obvious for the need of draft messages. All what I feel is the phone is surely a \"smart phone\" without incorporating some basic much needed features.",
            "date": "20 May 2015",
            "name": "Manan Vora",
            "stars": "2 stars"
        },
        {
            "comment": "It has been arounf 3 months using this device. Its a really good phone for the price. Though you can get better phones from chinese and indian manufacturers at half of this price, this is still the best as it has the best ecosystem of all the accessories and ROMS and other than that it has the best user interface STOCK ANDROID. No other manufacturer can match this quality at this price. Just a little bit dissappointed because of the screen quality when compare to moto g(2013) and also the unknown heating issues when using the camera. And i also feel that motorola has compromised a bit on the quality to cut down the cost. I hope they fix these issues with the 3rd gen moto g. I dont want a full hd screen, neither an octa core processor, i want the same old qualtiy and reliability for which motorola has been known for. Overall, just dont look into chinese products, buy motorola, and upgrade ur phone every 2 years.",
            "date": "20 May 2015",
            "name": "Himansh Mulchandani",
            "stars": "5 stars"
        },
        {
            "comment": "good service of flipcart , moto g 2 nd gen - features is good , i cant say without minimum 6 month exp, features is good , because i burned my hands with lenovo with in warranty period I have purchased a LENOVO mobile model S660 ( IMEI / SR NO -863336021322270 ) on flipcart.com on 10.5.2014 for 12899.00 vide their Invoice No BLR WFLD 20140500258299 of same date and delivered at address of my office . Mobile manufactured by Lenovo , party no- 2 and they said Fourtech computers , ---- party no -1 , is authorized service in pune . After 10 months of date of purchase I found simcard not detected in mobile on 04/04/2015 . Then I deposited mobile in a Fourtech computers four times to solve the same problem on 04/04/2015 , 07/04/2015 , 23/04/2015 and 24 / 04/2015 but they could not repair it permanently. I have attached service record of each time. That time mobile was in warranty period . Now just warranty period was expired on 10.05.2015 & if that problem comes again they will take money from me. Now I don’t believe on lenovo company.",
            "date": "20 May 2015",
            "name": "somnath khandave",
            "stars": "1 star"
        },
        {
            "comment": "i have started using Moto g 2 and it is very good in display and options etc., only problem, i faced is that the phone is heated if i play games for an hour or so. Further, the speaker is little loud. except for these things, phone is worth buying as the price has come down now.",
            "date": "20 May 2015",
            "name": "Jagannadh Grandhi",
            "stars": "4 stars"
        },
        {
            "comment": "Friends, I have been using this phone since last month & I am really satisfied with it. Every aspect of this phone is a true value for the money invested.........!!!!",
            "date": "20 May 2015",
            "name": "ABHIJEET GHOSH",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this around 6 months before and up till now no problem at all. The USB connection is also very great for me and i use it number of times to watch movies on my phone",
            "date": "20 May 2015",
            "name": "lavish malhotra",
            "stars": "4 stars"
        },
        {
            "comment": "No Doubt Moto G is a Good phone. But RAM is 1 GB only which should be 2GB We have other choices like Lenovo A6000 which gives you 2 GB RAM and 16 GB Inbuilt memory",
            "date": "20 May 2015",
            "name": "Akhtar Hussain...",
            "stars": "5 stars"
        },
        {
            "comment": "I gifted this product to my wife and this is amazing. configurations you can read in product description what i would say very good build, very good touch sensitivity, good camera, automatic upgrade to android lollipop. good sound quality, screen is good too. You cant expect anything more in this price range.",
            "date": "20 May 2015",
            "name": "Rahul Nagle",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for my friend. and I have no idea of how the phone features working. I am writing as it is asking for minimum of 100 characters",
            "date": "20 May 2015",
            "name": "Rajashekar Adh...",
            "stars": "3 stars"
        },
        {
            "comment": "A applegiri choice...... Don't expect washing machine and refrigerator.... IT'S a mobile..... Super no doubt.... Moto is conquering and they will.... Battery is average other than the mobile is mamamia..... . . . . .",
            "date": "20 May 2015",
            "name": "APPLEGIRI APPL...",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased Moto G2 two months ago after a long search. In this price range motorola is giving more features in compare to other mobiles in the market but I am facing a lot of problem. Its not a durable product.",
            "date": "20 May 2015",
            "name": "Salman",
            "stars": "2 stars"
        },
        {
            "comment": "Hi All, Moto G is good mobile. I have purchased in 26'January 2015. It is working good. But the battery back need to be increased and Ringtone and SMS options not there for two SIMs. Only one ringtone, One SMS tone is working. FM Radio Recording is not there. Remaining every thing is ok. Now the mobile is 2000 less. This is good time to purchsae this mobile.",
            "date": "20 May 2015",
            "name": "Raja",
            "stars": "5 stars"
        },
        {
            "comment": "I received Moto G(2nd Gen) Mobile. I have issues in that. Mobile Screen is blinking and Voice Problems. Pls dont Buy this Mobile. God Promise telling If you Buy then you will get disappoint and Time waste and Money Waste. First time i received MotoG2 Mobile. and I got 2 issues Screen is blinking and Voice Problems. I requsted for Replacement. They taken lot of time for Replacement by checking. Ireally got Irritation. They Replaced new one, After Replacement i am getting Screen is Blinking. Hi all Pls dont Buy this Mobile there are Problems in this MOTO G(2Gen) Mobile. Pls Buy other Good Brands.",
            "date": "20 May 2015",
            "name": "Vijay",
            "stars": "1 star"
        },
        {
            "comment": "The Moto g 2nd gen was delivered to me in just a week. Thats a good job. But the product which i received has some defects. The power button is very loose nd not working properly. Otherwise the product is fine",
            "date": "20 May 2015",
            "name": "karthikeyan kr...",
            "stars": "1 star"
        },
        {
            "comment": "Somehow my phone is lagging and hanging. bought 15 days ago from flipkart. delivery was good but the phone is making doubt on my choice.",
            "date": "20 May 2015",
            "name": "Debendra Nath...",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone for few months now and it has not disappointed. Its UI is great and camera is superb. Applications runs at ease and 1 GB RAM is just sufficient for day to day app use. I have loaded my cell lots off apps and still i have 400 MB of RAM space free. All in all its a great phone at its price. Initially i faced issues with the battery it used to not calculate remaining battery usage properly. Now this issue is resolved i believe after updating the OS. I also faced some issues with the speakers at times while calling or receiving a call the speakers they wont work. Then i have to restart the mobile and then it starts working.",
            "date": "20 May 2015",
            "name": "Rohit Naik",
            "stars": "5 stars"
        },
        {
            "comment": "Battery backup good Camera quality good Video quality good ------------------------- Drawbacks: No Custom OS like Xiaomi, Asus. Its plain old Android OS. Some times OS issues like sync wont happen. Show incorrect battery percentage (how much charge exist).",
            "date": "20 May 2015",
            "name": "Naresh Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "gr8 phone frm motoroala!! best for selfie aspecially!! i love its display also flipkart shipped as fast possible!",
            "date": "19 May 2015",
            "name": "Anjushkpba AJ",
            "stars": "4 stars"
        },
        {
            "comment": "The battery back not very good also the offer is a hoax .The pricing is competitive but Flipkart service leaves a lot to be desired. The policy are not keeping customer in view",
            "date": "19 May 2015",
            "name": "rajesh shah",
            "stars": "1 star"
        },
        {
            "comment": "3g only network mode not found...........................................................................................................",
            "date": "19 May 2015",
            "name": "Rahul Chauhan",
            "stars": "3 stars"
        },
        {
            "comment": "Lollipop 5.0 has lots of bugs in it. It has lots of bloats in it. Please provide the update ASAP ! Even the basic use like calling feature has bugs in 5.0",
            "date": "19 May 2015",
            "name": "Saurabh",
            "stars": "3 stars"
        },
        {
            "comment": "First unit that I got was suffering from no sound output, weak network reception. Flipkart replaced it with a new one, which is still suffering from various problems. Suddenly stops detecting the simcard, battery indicator shows 100 percent for a few hours until it suddenly goes dead shutting down the phone. Puts the phone onto 2g network even if the 3g network is available and selected. weak WiFi and cellular network reception are just a few problems out of several. The best thing that I liked about the cell phone is the two cameras, which when put into HDR render amazing results. One word, disappointed!",
            "date": "19 May 2015",
            "name": "Aniruddha Guddi",
            "stars": "2 stars"
        },
        {
            "comment": "not up to mark, battery problem, touch screen prob, overall did not meet my expectation as others say",
            "date": "19 May 2015",
            "name": "mallikarjun",
            "stars": "1 star"
        },
        {
            "comment": "I'm using moto g 2nd gen dual sim. Whenever I play music and leave the phone idle, the playback automatically pauses and after a pause of about 15-20 seconds... Resumes itself... This happens with Google play music, and many other players too. experienced the same with rocket player, es file manager player too. Anybody knows a solution?",
            "date": "19 May 2015",
            "name": "Mithilesh Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "Hi All, This phone is awesome. I got it in offer price. At mentioned price this product is worthy. Screen is very nice. I did not put any screen guard, still no crashes after all that's gorilla glass. And recently I got latest OS update also. I will recommend to go with this phone. Only problem i was faced with charger. Charger is not in working condition, but FPK(flipkart) gave me refund for that charger. Hats off to FPK delivery. Thank You. Hope it will help you.",
            "date": "19 May 2015",
            "name": "Prakash Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "a very cost-effective & fabulus product...can't get such features in this cost.. only 1 problem that we Indians bother about - service centres (as we think more than par)....",
            "date": "19 May 2015",
            "name": "Rudraksha",
            "stars": "5 stars"
        },
        {
            "comment": "i used the product for 5 months. From the day one I faced the problem of battery indication showing zero sometimes eventhough its full charge. There was no problem in the usage. But from the last 15 days its continuously getting heated up and discharging in 3-4 hrs. Showed in service centre but all in vain. Its still in warrenty and no one is taking the responsibility for replacement neither the flipkart nor the service centre people. Its really disgusting.",
            "date": "18 May 2015",
            "name": "Shaiju K Nair",
            "stars": "1 star"
        },
        {
            "comment": "I was little skeptical about buying a motorola phone as my first phone bought in 2005 was incidentally motorola. The phone was defective and was having network problems.But having bought first moto e and now moto g2, I am very much happy with its performance. The display is awesome ,the sound quality and camera are too good.But I have some issues with the battery. The battery does not last even 15-18 hrs.I dont expect a smartphone battery to last more than 24 hrs like the old nokia phones.But still when you are buying a 13000 rupees phone,the battery could have been little bit better. Hope that when moto g3 is released,the battery life issue is addressed.",
            "date": "18 May 2015",
            "name": "Ujjal Sengupta",
            "stars": "4 stars"
        },
        {
            "comment": "quick delivery by flipkart - love their outstanding service as always. Phone heats up a little bit but maybe thats bcoz of the summer when outside temperature itself is 45 degrees. Other than that, its a steal at 9900",
            "date": "18 May 2015",
            "name": "pritesh",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Camera Super Audio Quality Nice Screen Clarity -Battery drain Quickely -GPS and Wi-fi are not off properly",
            "date": "18 May 2015",
            "name": "Arul Raja",
            "stars": "4 stars"
        },
        {
            "comment": "Product is gud..Flipkart service was gud..Got it delivered a day before the promised date. Waiting for Moto G 3rd gen ..:-)",
            "date": "18 May 2015",
            "name": "Sivarajesh J",
            "stars": "5 stars"
        },
        {
            "comment": "Camera is not able to capture the motion for both the pics and videos ; this happens every time and after the resetting the factory settings and software update my product is not replacing with new after complaining multiple times...",
            "date": "18 May 2015",
            "name": "Kiran Ravoori",
            "stars": "1 star"
        },
        {
            "comment": "i replaced this phone from flipkart within 10 days of delivery and later after 4 months that replaced Moto G 2 got its Motherboard crashed. Motorola service center don't give a damn to what problem their customer is facing, I lost my precious data once. and later when they changed the mother board, it got crashed again and my phone is still in Motorola service center till date, as Motorola service centers are always running short of components. I would like to say loud nd clear... Worst shitty phone ever and even more shitty services from Motorola and Flipkart I wish there could be an option of giving negative ratings.",
            "date": "18 May 2015",
            "name": "Deepak Kumar S...",
            "stars": "1 star"
        },
        {
            "comment": "The which I purchased for 9899/- is getting charged for 6 to 7 hours and the backup is up to 9 hours. Apart from that I observed hanging when using apps, which I didn't expected from Motorola... I thought that getting in discounts routes users to get a device with refurbished semiconductors assembled... Because the power consumption of processors to high compared to a Qualcomm snapdragon processor in another phone.... I requested for returning my device for replacement with new one... Need to see for good service from retailer...",
            "date": "18 May 2015",
            "name": "Satyakanth K",
            "stars": "1 star"
        },
        {
            "comment": "For first 3-4 months the phone was awesome. But after that the phone becomes very much slow. I do not have more space consuming running apps also and clean junks everytime. Still it becomes very much slow. Camera quality is very good.",
            "date": "18 May 2015",
            "name": "Rashmi",
            "stars": "2 stars"
        },
        {
            "comment": "I ordered this Moto G2 for the second time. This was bought one month after I purchased my first Moto G2. This second phone that I have recieved is defective. If I compare both the phones, the recent one has many problems. 1) The screen seems to be yellowish in color as compared to my previous Moto G2. 2) There are many options in my first Moto G2 which are missing in the new one. 3) My recently purchased Moto G2 gets hanged often when I get a call and I am unable to answer it. Please note, I have not installed any apps in the phone so far. So there is no possibility of it getting hanged due to the phone being loaded with apps. My plight does not end here. I requested for a replacement of this phone and it is past 3 weeks but no action has been taken on it. I have not got an SMS from flipkart stating that my replacement has been rejected by the seller -\"We're sorry. We are unable to process your replacement request. Reason : The issue has been resolved between you and the seller. Hence, there will be no replacement or refund.\" I WOULD AGAIN LIKE TO HIGHLIGHT THAT I HAVE ORDERED THE REPLACEMENT OF MOTO G2 WITHIN 2 WEEKS OF PURCHASE. I have been given a defective piece and now FLIPKART and WS RETAIL refuse to replace it. PLEASE DO NOT TRUST THIS SELLER. THEY ARE SELLING DFECTIVE PRODUCTS AND THEN REFUSE TO REPLACE IT EVEN THOUGH THE PRODUCT IS WITHIN THE LIMITS OF RETURN POLICY. IF THIS IS NOT REPLACED, I WILL MOVE TO THE CONSUMER COURT AGAINST FLIPKART AND WS RETAIL.",
            "date": "18 May 2015",
            "name": "Dipesh Barot",
            "stars": "1 star"
        },
        {
            "comment": "Awsome phone. Good battery life. The product shipped by flipkart was in excellent condition. The product delivery was on time.",
            "date": "18 May 2015",
            "name": "Azhar Husain",
            "stars": "4 stars"
        },
        {
            "comment": "After Sales service is poor. Direct Wi-fi feature is not available. Camera quality is relatively poor. Battery starts heating after some time. Touch screen feature is not stable.",
            "date": "18 May 2015",
            "name": "Mukesh Kr",
            "stars": "1 star"
        },
        {
            "comment": "my cell phone was not working properly i complained n on the day i got replacement of it very very good service flipkart keep it up",
            "date": "18 May 2015",
            "name": "harsh marwah",
            "stars": "5 stars"
        },
        {
            "comment": "delivery was a little slow but when i received it my mouth fell open.it was a mindblowing phone one could get under 15000.i am really impressed.:)",
            "date": "17 May 2015",
            "name": "praveen",
            "stars": "5 stars"
        },
        {
            "comment": "mobile data is not enabling with single click, I need to turn off the phone and re enable it. I faced this problem with my first piece then I returned and got second new piece. Satisfied with second piece. But after 3 months my new second piece also behaving like same. Other than that mobile was pretty good with in my budget. But mobile data enabling was frustrating me when I was in urgency.",
            "date": "17 May 2015",
            "name": "shyam yammanuru",
            "stars": "3 stars"
        },
        {
            "comment": "go for it guys.. amazing and at a wonderful price.. it is a layman's nexus.. just the best features.. easy to handle.. fits right in your hand.. 1 PROBLEM: battery drains too fast.. won't last even a day with net on..",
            "date": "17 May 2015",
            "name": "Neha Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone Giving tough competition to the other high budget phones in the market.. Very good at this offer price.. I am loving it",
            "date": "17 May 2015",
            "name": "sarfaraz malim",
            "stars": "5 stars"
        },
        {
            "comment": "Power Button and Volume Buttons are loose. Rest is good. As compare to samsung it good phnone, gud power backup etc",
            "date": "17 May 2015",
            "name": "Vikas Singh",
            "stars": "3 stars"
        },
        {
            "comment": "Good:- 1. Core Android support with Upgradable to Lolipop 5 2. Gorilla glass 3. 5\" HD screen with good resolution 4. battery backup is 1.5-2 days with normal usage and 2G( after Upgrading to android 5 ) 5. accelerometer sensor supports Compass apps Bad:- 1. average camera quality 2. some times hitting issue found",
            "date": "17 May 2015",
            "name": "N Patel",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola company application are awesome. Great sound, impress with color display and even camera also. It give slr type click.",
            "date": "17 May 2015",
            "name": "Nikul Patel",
            "stars": "5 stars"
        },
        {
            "comment": "disappointed by flipkart's attitude on my request to replace the peice. Phone makes irritating noise while making and attending calls. One more thing. Google chrome hangs on opening multiple tabs. Occurs quite frequently. Camera quality is very poor compared to any other phone available for above 10K. Nothing in the phone that i can suggest to others to buy. Made a mistake by believing on brands Moto and Flipkart. Guys do read reviews before taking a call to buy this worthless phone",
            "date": "17 May 2015",
            "name": "Ankit Tiwari",
            "stars": "2 stars"
        },
        {
            "comment": "I had my reservations about buying a phone that has just one gb of ram, but Moto G but my fears to rest. This phone just never lags. Not while playing games, or while flipping between multiple applications. Both the front and rear cameras are good with solid low light imaging. The phone is a tad heavy, but it adds to its charm. It feels sturdy to hold, and needless to say, the gorilla glass requires no screen cover. Phone itself is a thing of beauty. Up till now, I have no regrets. Upgraded to 5.0 the moment I started it(I have WiFi,so). Buy it. You won't regret it even once.",
            "date": "17 May 2015",
            "name": "Sanjoy Roy",
            "stars": "5 stars"
        },
        {
            "comment": "The display quality is very poor. in off mode or sleep mode some scratch line is reflecting on display.i think this is defective product by manufacturer.i want to return the product and refund my money.",
            "date": "17 May 2015",
            "name": "Rupesh kumar",
            "stars": "2 stars"
        },
        {
            "comment": "its has been more than 6 months using this mobile. After update to Android 5, the battery backup is awesome... i am getting nearly 2 days while connected to wifi and GPS most of the time!! i use most of the mail box and chatting apps.",
            "date": "17 May 2015",
            "name": "Mithun Kumar G",
            "stars": "5 stars"
        },
        {
            "comment": "It is an awesome phone. Got this in offer. Flipkart release amazing offers.Keep going :) If i talk about phone...its very nice.picture quality is good. Look good,feel good.",
            "date": "17 May 2015",
            "name": "Nikki",
            "stars": "5 stars"
        },
        {
            "comment": "Though It has some improvements in hardware specs and yes, bigger screen feels better, the phone has some bugs since I have opened the package. 1) Message Inbox always gives a false heading (recipient name) TD-Sulekha..TD-Sulekha even if the message has been sent by Vodafone.. very frustating 2) Sometimes it hangs while picking up the call 3) Seems to have some battery issues as well At last I can only say that reduction in G2 price is highly correlated with quality of the handset.",
            "date": "16 May 2015",
            "name": "Gaurav Rustagi",
            "stars": "2 stars"
        },
        {
            "comment": "I m using MotoG since one year & found it very excellent & suggest to use this very smart phone in this segment",
            "date": "16 May 2015",
            "name": "Laxman Singh Rawat",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this mobile for last 6 months battery and mobile performance is very good.. Good to buy..................................................................................................",
            "date": "16 May 2015",
            "name": "Ram",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone.But it is giving a low battery back up than lenevo s850 and camera quality is also little bit less than lenevo S850. Performance wise it is best.",
            "date": "16 May 2015",
            "name": "Stitaprangya Dash",
            "stars": "4 stars"
        },
        {
            "comment": "moto g 2nd gen is overall good,, but it has a big problem that it take 3 hours and 30 min to get full charge but battery get drain in 8 hours of use... moto must take care of this..",
            "date": "16 May 2015",
            "name": "Pankaj",
            "stars": "3 stars"
        },
        {
            "comment": "I read a lot of reviews before purchasing this product. All I was worried about was what if I got a defective product like the reviews on the site describe. Here's the thing. People who get a proper working product not necessarily review , they just ignore and move on. However, people who might have received a defective product would probably share their experience because it is not satisfactory. Hence , this gives an image of the product that may be it is buggy and has lot of issues. I bought this phone ,was worried it could be buggy since it came with Lollipop Pre-loaded , but wasnt . Its just great ! If anyone is thinking of buying one and are reading this review. Please go ahead and purchase one without any worries.",
            "date": "16 May 2015",
            "name": "Rohan Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "We are getting excellent sales support from Flipkart for Moto and other Products. I had a problem in display in my 4 Months Old MOTO G2. Given at an Authorized Service Center At Chennai. Even after a Week there is no firm delivery Commitment. Reason for Delay was told as \"Waiting for Spares\". I feel very bad that spare is not readily available with authorized service agents even at Metros like Chennai. Since MOTO Phones are sold Exclusively in Flipkart...Flipkart should playa role in service also.",
            "date": "16 May 2015",
            "name": "ARUL PONNUSAMY",
            "stars": "1 star"
        },
        {
            "comment": "worst battery back up without using battey starts to drain mobile data is not connecting while speakin automatically going on hold mor problema ia am facing what to do dont know i ask replacement to flipkart they told to wait for days",
            "date": "16 May 2015",
            "name": "Aamir Ahamed",
            "stars": "1 star"
        },
        {
            "comment": "i have brought this six months back 2 months back i got display problem each time i go to the service enter they are saying that there is no problem with your mobile finally they accepted the fault and took the mobile for the replacement of display it has been 1 month since i have given my mobile in service center but still they are saying that they did't got the replacement and when i questioned them seriously they are saying that if you need your mobile you have to wait for 2 to 3 months if it needed.and even i came to know that there are many similar cases with moto mobiles . i own two moto g2 in my home now i am thinking that i have made a wrong choice .so please think before buying it",
            "date": "16 May 2015",
            "name": "goutham srinivas",
            "stars": "1 star"
        },
        {
            "comment": "I BOUGHT THIS PRODUCT IN REPLACEMENT OF SAMSUNG GALAXY GRAND & I AM FULLY SATISFIED WITH THE FEATURES I GOT I FORGOT THE PROBLEM OF LACKING MEMORY AND IT NEVER HANGS I AM FULLY SATISFIED WITH THIS PRODUCT OF MOTOROLA",
            "date": "16 May 2015",
            "name": "ASHWANI TIWARI",
            "stars": "5 stars"
        },
        {
            "comment": "30 DAYS REPLACEMENT GUARANTEE? SORRY I DONT GET IT Got touch problems within 10 days of buying since then i am trying flipkart to replace my phone, touch problem remains till now, got contacted by flipkart team 40% of the time I have lodged complaints, worst service I came to till date, two times replacement rejected within the 30 days guarantee, false promises only, I was told that the guarantee remains once contacted within 30 days, I was contacted twice by the technical team and they left me telling to reset the phone while the problem remains. I will not leave you even if you have left me. regards flipkart",
            "date": "16 May 2015",
            "name": "Amrita Singh",
            "stars": "1 star"
        },
        {
            "comment": "Hi All. Moto G 2nd Gen is a good phone with it's specification but I can't say it's an awesome phone. Purchased it from Flipkart and got the phone at price of Rupees 8,999.00 but had an issue with 2nd sim slot. had to return and got a new one. The phone has major issue with its heating problem and battery. Heat - It heats up after 15-20 minuets of internet use or game. Battery - battery could be better. Come on, for 5\" Screen 2070 Mah battery is not enough.... but it will give u full day with minimal usages. Else everything is cool like display is awesome and touch also cool.... Front Camera is Very good with 2 M.P. Primary Camera is Very Good with outdoor Photos not with indoor photos. Gaming graphics is Very good with no lag. It's stock android so interface is Very good but for me My previous Sony UI interface was better than this one as it was a customized UI. Overall I will give 3 Star to MOTO G 2nd gen with all Pros and cons. Hope my review will help you guys to chose the best one. Thanks.",
            "date": "16 May 2015",
            "name": "DEBRAJ PAUL",
            "stars": "3 stars"
        },
        {
            "comment": "Moto g 2nd generation mobile have good sound quality and voice clarity, but battary back up is poor otherwise best mobile othe competative mobile.",
            "date": "16 May 2015",
            "name": "B. L. Jakhar",
            "stars": "3 stars"
        },
        {
            "comment": "battery backup of this model or unit received is very poor, it does not withstand ever fro 2-3 hrs without using.",
            "date": "16 May 2015",
            "name": "Digamber Ghodekar",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using this phone for 6 months now. The phone suffices all the requirements of a smartphone. Is very competitively priced. I had No delivery issues from Flipkart. The camera music player and all are pretty good. The camera infact is pretty impressive for a point and shoot and portrait photography. The other useful features are of course having the latest android (Not too impressed with Android lollipop though), 16GB Internal memory plus the option of extending the memory with a memory stick (earlier Moto G lacked this) and features like moto assist, google synchronization to display all my calendar entries, travel/play/movie bookings, etc. Plus there is no bloatware stuffed by Motorola. Battery life is also very decent. Only thing lacking is a detachable charger. Also there is no USB cable provided alongwith the phone for data transfer. Not sure why Motorola has done this? Otherwise I have no complains. The screen size, display and overall feel of the phone material is very good. All in all a handy phone and can be bought for the wonderful price that it is offered at.",
            "date": "16 May 2015",
            "name": "Amit Choudhary",
            "stars": "5 stars"
        },
        {
            "comment": "nice phone not like moto g1 and low hardware config and hangs on some points but best phone in range like camera , lollipop , fast and loud sound",
            "date": "15 May 2015",
            "name": "SUMIT BANSAL",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is great as of now after 2 weeks of usage. Only thing is power switch is little loose due to its constant use to wake up screen. Installed app to reduce its use, but moto should provide double tap to wake up screen.",
            "date": "15 May 2015",
            "name": "Pranjal Borah",
            "stars": "4 stars"
        },
        {
            "comment": "i am using phone from 5 days and i m satisfy with the preformance everything is great from hardware to software ,no lags awosome battery life",
            "date": "15 May 2015",
            "name": "suhail arora",
            "stars": "5 stars"
        },
        {
            "comment": "Batter backup is not good at all. I use to charge my phone twice. Sometime it lags too. Also, charging time is more than 3 hours from 0 to 100% And Android Lollipop have make it more worse. It have become very slow",
            "date": "15 May 2015",
            "name": "Madhav Arora",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased 4 moto g2 phones from flipkart at various times in the last one year. I am an ardent lover of moto g phones. I had lot of respect for the professionalism flipkart shows in selling/delivering/addressing problems of the customers. Now it is not there anymore. The latest phone which I have recieved had number of issues. 1. No voice clarity: The speaker makes crackling noise. This is the problem seen in 3 out of 4 phones I purchased(only 1 phone is good). Two are to be replaced by flipkart after lot of struggle/discussion with customer care. The latest one I recieved is the worst of all. The noise is so much that I cant listen what the other person is speaking. 2. Top speaker of the phone is not working: There are two speaker one on the top and another at the bottom. Top speaker doesnt work at all. 3. Camera quality is bad: The phone has 8 mp camera, but it is worse than 5 mp camera of any samsung phone. Pixellation is seen in the images. The worst part is yet to come. I have given complaint about all these to flipkart, 3 times till now. There is no proper response. First time I recieved a call. They spoke some thing which I could not listen because of problem in the phone. I asked them to call back again. They didnot call. I raised second complaint. they called me and told that they will send a service person within 2 days. No body turned up even after 3 days. Not even anyone called. Today I raised third complaint. I dont know whether they will settle the matter or not? This experiance made me to lose my confidence not only on moto phones but also on flipkart. I am not a flipkart fan any more. Thank you flipkart. I cannot rate this experiance as zero, so rated with one star.",
            "date": "15 May 2015",
            "name": "sayam rajeshwa...",
            "stars": "1 star"
        },
        {
            "comment": "everything is ok except battery backup it has a very poor battery. if your smartphone doesn't carry a good battery life then it's pretty much useless.",
            "date": "15 May 2015",
            "name": "Raju Yadav",
            "stars": "4 stars"
        },
        {
            "comment": "I am not happy with the moto g (2nd gen) mobile. when i get the mobile that operating system is good that time. but now a days mobile is too slow. Not happy with the multitasking in moto g (2nd gen).",
            "date": "15 May 2015",
            "name": "Vinay Trivedi",
            "stars": "1 star"
        },
        {
            "comment": "i was using this phone since 1 month . it is good no hanging . i advise to improve camera quality and and decrease weight of the phone",
            "date": "15 May 2015",
            "name": "RAJENDER REDDY",
            "stars": "4 stars"
        },
        {
            "comment": "Its best in this price segment. Its 8 MP camera produces clear sharp pictures compared to many devices with 13 MP camera. Its battery runs for a day easily. It never hangs during multi tasking with its just 1 gb ram(now a days many devices offer 2 gb ram and gets hang). Its build is also very strong.",
            "date": "15 May 2015",
            "name": "Yogesh Saxena",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it on big app sale day . now its again 11k hence no such accomplishment feel. Android lollipop 5.02 out of the box Smooth experience Asus Gionee and Xiaomi micromax all just want to grab market buy low end quality products Hence go for GOOGLE .. Motorola is best other wise i would prefer Sony .... and Samsung is out of league ok (samshit) :p :) happy Moto",
            "date": "15 May 2015",
            "name": "Anuj Grover",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone when Flipkart given 15% and SBIs 10% Offer available , so got motoG2 for ~9900 INR .So far I didn't find any performance issues or App crashes .The main reason why I have chosen Moto G2 from other better spec phones (in paper) in this price range -Lenovo A6000 or Asus Zenphone is Moto G2's stock android skin . Pros -Display -Stock android 5.0.2 Lollipo -Design and easy one hand operation Cons -Could have been increased to 2390 similar to Moto E2 -No Preinstalled File manager apps (all the third party downloaded apps are ad supported , which i hate to use)",
            "date": "15 May 2015",
            "name": "Abin P A",
            "stars": "4 stars"
        },
        {
            "comment": "dear all, please do not buy any products from flipkart. they only sell the product and if there is a delay, they do not replace. over 15 days they are only trying to say that they will rectify the problem. this has not happened and neother they are replacing the product. the customer service team only sends a standard email stating we apologise for the inconvenience caused and we will shortly get back they do not give an email address or phone no i can escalate this to.",
            "date": "15 May 2015",
            "name": "Anil",
            "stars": "1 star"
        },
        {
            "comment": "1. No proper response from flipkart team 2. Without providing proper solution they have closed the return request. 3. No proper solution for new product 4. Better to buy from some other site",
            "date": "15 May 2015",
            "name": "Darshan Jadhav",
            "stars": "1 star"
        },
        {
            "comment": "2 April 2015 I Brought moto g 2 nd gen moblie through flipkart the phone is not working at present they show some issues like system lock will be occured due to phone boost it is not my fault.and i ask flipkart replacement is not possible to ur phone because u brought phone 40 days back.even i want to service center in my near locatio i,e Guntur area in Andra pradesh. in google i check the services center in Guntur area but they not show exact loction...can u plz provide exact service center and customer no in Guntur In ADHRA PRADESH.",
            "date": "15 May 2015",
            "name": "sumanth kota",
            "stars": "1 star"
        },
        {
            "comment": "i got it at RS 8729 special price from flipkart. battery performance with internet, gaming and texting upto 30 hrs. phone display beautiful; perfomance 9.5/10. camera 9.5/10. gaming 9/10. display 10/10.",
            "date": "15 May 2015",
            "name": "Deepanjan Mitra",
            "stars": "5 stars"
        },
        {
            "comment": "This is a ₹11,000 phone that you can enjoy for 4 months. If you can afford that, go for it. I heard good things about the Moto G 2nd gen phone, and bought two--one for myself and ome for my daugter. Flipkart service was prompt, no complaints there. The phone looks and feels beautiful but within four months of buying it, I could not hear well. I took it to the service centre, which was very far from my home. In Kolkata, Motorola's service centres are far from the city centre. And the service at the Diamond Harbour Road service centre is horrible. They couldn't care less that you are travelling more than an hour in terrible heat and humidity to get your new phone serviced. Once you have bought the phone, it is your worry even if this is well within the one-year warranty period of the phone. Worse, within a week of getting it serviced, the phone showed the same problem. Within a couple of days, it developed a new problem: the screen started heating up. Unfortunately for me, the second time I sent it to the service centre, my husband suddenly fell very ill and went into a coma. He was in ICU and I had no phone. Can you imagine how stressful that is? The service centre, however, was unfazed. They still took a week more to repair it. When it was done, I had to go and collect it, taking out half a day for this while my husband was still in hospital. The same day I collected it, I realised the problem of not being able to hear still persisted. Seven days later, the problem of the heated screen has started again. I have complained again, only I haven't had the time to take the phone to the service centre yet. Not once has Motorola offered to replace the phone. Even after three rounds of complaints within just 6 months of buying it. Once you buy their phone, it's your problem.",
            "date": "15 May 2015",
            "name": "Supriya Chatto...",
            "stars": "1 star"
        },
        {
            "comment": "Pros : Nice build quality, Best in this prize, 16 GB is more that enough also external slot is available, It can work if by accident you drop it or put into water for some time and wipe early. Cons : It hangs if you load so many applications. Reason is only 1 GB Ram, but once you restart it works fine. Heavy weight if you put cover on it. Bulky look. Overall you can not get better mobile than in this prize range.",
            "date": "15 May 2015",
            "name": "Ranjeet Patel",
            "stars": "4 stars"
        },
        {
            "comment": "Its a good purchase. the camera is very good. but phone is getting heated up while charging and while talking. Sometimes it reaches to 45 degree celcius. either you have to switch it off or you have to stop talking at that time.",
            "date": "15 May 2015",
            "name": "Ankita Siddhanta",
            "stars": "3 stars"
        },
        {
            "comment": "Worst quality phone, Worst battery backup.... Worst Camera... Phone Heats up very quickly...Worst service center...worst customer care.The worst company.II will give the negative 1000000000 rating if possible.",
            "date": "15 May 2015",
            "name": "Varun Kukreja",
            "stars": "1 star"
        },
        {
            "comment": "performance wise it was as expected from motorola, but the battery back up is not as expected. very much dissappointed about that. apart from that its a good pick.!",
            "date": "15 May 2015",
            "name": "Viknesh renjit",
            "stars": "4 stars"
        },
        {
            "comment": "Even if the battery is fully charged, In a time within 6 hours it's getting dried up, Need to improve the battery backup a lot.",
            "date": "15 May 2015",
            "name": "Soban",
            "stars": "1 star"
        },
        {
            "comment": "BROUGHT IT 1 YEAR BEFORE MOBILE IS GOOD STILL WORKING , BUT WHEN I WAS RECEIVED AT THE THERE IS SOME SCRATCHES ON SCREEN , SO GUYS BE ALERT ...............................",
            "date": "15 May 2015",
            "name": "pranesh R",
            "stars": "4 stars"
        },
        {
            "comment": "After buying please check whether second sim slot is working properly or not. Many people facing this issue with moto g and flipkart customer executive service is to worst hope flipkart will not make customers to loose hope on them.",
            "date": "15 May 2015",
            "name": "Uttej Seemakurty",
            "stars": "1 star"
        },
        {
            "comment": "well.... i purchased this phone a while ago via flipkart and again awesome delivery process. the phone is pretty awesome with great positives 1. price (11k) 2. hd screen 3.11gb internal user available 4.expandable upto 32 5.8mp cam 6.dual sim (i am a person who prefer dual sim) 7.good battery backup cons: 1.huge... will take time to get used to it. 2.well moto service isnt great as compared to other. 3.battery is not removable.(any issues u need a service point at the earliest) 4.1 gb RAM. (well i don''t expect wonders at this price but i always prefer more RAM) considering everythin i should say its a value for money phone with awesome features for a regular user. So, for a budget phone for 11-15k. Just dont think much and just go for it! :)",
            "date": "15 May 2015",
            "name": "bharat parakh",
            "stars": "4 stars"
        },
        {
            "comment": "all is best but front cam is not good and delivery with bluedart is best and overall about hand set seper product from moto",
            "date": "14 May 2015",
            "name": "veeresh kannur",
            "stars": "5 stars"
        },
        {
            "comment": "plz replace my moto g display and touch and software and hardware is not workin to proper time very poor set and b coz i am not stisfied this product",
            "date": "14 May 2015",
            "name": "ameer siddiqui",
            "stars": "1 star"
        },
        {
            "comment": "very good phone moto is best than all other chinese phones battery can withstand for a full day with heavy usage",
            "date": "14 May 2015",
            "name": "Madhan",
            "stars": "4 stars"
        },
        {
            "comment": "reduced price from 13000 to 11000 make it a good budget phone to have with.. prons .... good camera, fast processing cons.......look wise not so good. you cant show your style with it :)",
            "date": "14 May 2015",
            "name": "sharique",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this mobile 3 months before for my spouse earlier using a windows phone. thought it fell down from bus when i travelling and the windows phone was awesome only the screen got cracked. But replacing the screen was costly so i purchased this mobile. G2 is an average phone who fond of big screen at reasonable price. Pros: 1. Screen size is big 2. Believe this phone does not get much heat when u play game for long time 3. Camera is good but not much compared with Carl Zeiss powered windows phone but still photos are good. 4. Android kitkat / lollypop is good and rarely gets hangs or jerked. 5. Audio is good especially loudspeaker works like a speaker phone Cons 1.Poor battery life and the charger came with phone is poor it takes so much time to get charge the phone. battery drains quickly as i used with windows phone (lollipop draws power) 2. Headphone came with the mobile worth for 100 Rs only no effect.. i am using JBL to get more pleasnt sound 3. i feel lollipop os should be better, it should have a single place to see notifications and quick buttons.. first swipe to see notifications and second swipe to see the quick launch buttons 4. Android os is not good during incoming calls it displays incoming call notificaiton at top of screen which is irritating 5. display which should have been better, its just lcd not amoled screen, need to have more brightness sometimes Its a average phone and its okay for the bucks spent.",
            "date": "14 May 2015",
            "name": "JAYA KUMAR",
            "stars": "3 stars"
        },
        {
            "comment": "I got amazing phone in 10 K prize. thanks to flipkart for in time delivery. my favorite opps are gmail & camera. Photos & Video clarity amazing and able take pics nights with good clarity. only drawback is unable to remove multiple contacts in one time.",
            "date": "14 May 2015",
            "name": "Ram",
            "stars": "5 stars"
        },
        {
            "comment": "Go for it. Moto G2 is the best budget smartphone in the world. Performance is excellent.....Till now no lags or hangs..... It comes with Android Lollypop and if you want timely updates and pure stock android experience then i will definitely suggest you to go for it. Thank You Flipkart.",
            "date": "14 May 2015",
            "name": "Koustav Talukdar",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone, sensitive touch, clean OS! Fascinating product at an affordable price. It has a decently long lasting battery, much better than the previous Moto G. The interaction with the phone is smooth.",
            "date": "14 May 2015",
            "name": "Chinmay Jog",
            "stars": "4 stars"
        },
        {
            "comment": "i book my order on Monday but i did't received my product... so i am disappointed.... i need very immiditly pls can do it fast.........",
            "date": "14 May 2015",
            "name": "vinodh",
            "stars": "4 stars"
        },
        {
            "comment": "It's the best Mobile phone in this range with excellent features, very good camera quality (both front and back), good to have 16gb internal memory.. Overall Superbbb!!",
            "date": "14 May 2015",
            "name": "Anees Khan",
            "stars": "5 stars"
        },
        {
            "comment": "Good product but get struck for anroid 4.4 os some times,otherwise product,quality every thing good, i can refer my friends,",
            "date": "14 May 2015",
            "name": "Sudarsan V",
            "stars": "4 stars"
        },
        {
            "comment": "Great product and timely delivery by Flipkart",
            "date": "14 May 2015",
            "name": "Ranjith Nair",
            "stars": "5 stars"
        },
        {
            "comment": "hanging , battery exhausted not a handy mobile . now motorola is not manufacturing the product as earlier .. fade up",
            "date": "14 May 2015",
            "name": "raghav kumar",
            "stars": "1 star"
        },
        {
            "comment": "Touch quality is nice, processor response is slow (I should say pathetic). System hangs too often (forget about multitasking smart phone). Battery life is good but heats upto uncomfortable levels. Charger quality is bad. i was expecting a data cable as well, but MOTOROLA didn't bothered about PC suit and thus didn't provided the same. Looked good before I actually purchased it but I definitely consider it an avoidable option now.",
            "date": "14 May 2015",
            "name": "Abhijit Galav",
            "stars": "1 star"
        },
        {
            "comment": "Best phone at this price and quick delivery as well. Bought it for my mom and she is very very happy with this phone.",
            "date": "14 May 2015",
            "name": "Vatsal Raicha",
            "stars": "4 stars"
        },
        {
            "comment": "needs nothing 2 say,,,,,,,,,,,,,,its simply awesm product,,,, About earphone,,,,sound quality z gud,,,,bt its painful aftr about 1/2 an hour......... bt aftralll cell z awesm.............",
            "date": "14 May 2015",
            "name": "sudarshan kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Got problem on screen but not properly responding for replacement got worried not clarified till now",
            "date": "14 May 2015",
            "name": "srinivas",
            "stars": "1 star"
        },
        {
            "comment": "I am using moto g 2 gen from last two months. Fully satisfied with the phone Awesome Features. Fast processor Excellent wifi connectivity Good Battery Back up Camera clarity and video graphics is just superb Never hangs. All together its a treat to own this gadget in this price range.",
            "date": "13 May 2015",
            "name": "Debanjan",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone on flipkart in November 2014. The phone size and camera quality is good. However with time the phone gets hanged even after putting (16GB sd card) and the battery also gets drained very fast. As the makers said that it has a long battery life however after 6 months its getting hanged, battery gets drained easily and the speaker is not so loud as expected. I wish the screen brightness was better outdoor. But overall performance for surfing and other apps are fine. Its good for social networking as the screen size is just perfect.",
            "date": "13 May 2015",
            "name": "Urvashi Satpute",
            "stars": "4 stars"
        },
        {
            "comment": "i bought moto g 2 generation mobile from Flipkart in the month of April 20th ,when i got these worst mobile then only came to know this is a defective product from Motorola that is the reason why flipkart reduce mobile price Rs.13000.00/- to Rs 12000.00/-, after that i registered compliant on flipkart they promised to replace the new product, when i got the replace product from FLIPKART then only i came to know they offer me and send to me as old mobile ,now i face the same issue with this worst mobile,finally i got a conclusion FLIPKART cheated me,I lost Rs 12000.00/- I requesting you to dnt buy any mobile from flipkart ,",
            "date": "13 May 2015",
            "name": "siva kumar",
            "stars": "1 star"
        },
        {
            "comment": "A friend recommended this phone for my father in Nov 2014. He was very happy with the phone. When my Mother required a replacement to an ageing Samsung, I did not think twice to purchase this phone for her. She uses only one SIM, but worth it. Received this phone as overnight delivery when i was passing through Chennai. Got it the next day in time to gift it. Thank you Flipkart.",
            "date": "13 May 2015",
            "name": "Gaurang Guruna...",
            "stars": "5 stars"
        },
        {
            "comment": "The product is very good and up to the mark, price has valued, but only 1 problem I am facing as the product is hanging some times and some times the Touch screen does not work so have to restart the phone, other wise superb Phone. Expecting some more.",
            "date": "13 May 2015",
            "name": "Milind Patkar",
            "stars": "3 stars"
        },
        {
            "comment": "I had been using this phone for last Two Weeks and had never faced any problem. Earlier I was using a windows phone and bought this phone to experience the latest version of Android. The battery back up is bit low compared to my Lumia-720 , but the touch screen and fluidity for usage is excellent. All the apps run smoothly. Highly recommended by me...",
            "date": "13 May 2015",
            "name": "Ranjan Bose",
            "stars": "4 stars"
        },
        {
            "comment": "it was very good in the beginning,but after some rapid use,it was hanging a lot.With Flip kart return service,i got saved with a new one.TQ,rating is only for service of flipkart.For moto g 2nd 2.5 for 5",
            "date": "13 May 2015",
            "name": "vinu",
            "stars": "4 stars"
        },
        {
            "comment": "I am rating it as coz of the features it provides me with the price i got it. The processor is very good and there is no hidden apps running in the background which might eat battery or slow the process. The body look and feel is really great. For the first tym drain the battery completely and charge keeping the phone off. Once battery is calibrated its nice.But need to mention i don't play games .. i just use it for songs , whatsapp, FB and general youtube browsing. Overall i very satisfied !!!",
            "date": "13 May 2015",
            "name": "kanchan luha",
            "stars": "5 stars"
        },
        {
            "comment": "Guys this is one of the best smartphone i have used in recent time !!!!!!! Performance is good, looks kool with motorolla shells. Go grab it !!!!",
            "date": "13 May 2015",
            "name": "Dadapeer BK",
            "stars": "5 stars"
        },
        {
            "comment": "writing this review after using 4 months. Camera,Perfomance,Sound,Display,Battery Everything is Good. Best for the Daily Usage,",
            "date": "13 May 2015",
            "name": "SriRam Reddy P...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is an excellent product in terms of Performance & Mileage, Value for Money mobile. Excellent Photo quality, clear sound, light weight etc.,",
            "date": "13 May 2015",
            "name": "Ananda D",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen. my first Smartphone. After lot of search & waiting to lower the prices I bought the phone. I have not used all the features at optimum level, but whatever features I have used till now are really good. Photos are really nice. Only problem is battery life. Flipkart delivered the item within 48 hrs.",
            "date": "13 May 2015",
            "name": "Mohan",
            "stars": "4 stars"
        },
        {
            "comment": "They delivered a defective product then upon requesting replacement on 7th May, they gave a ETA as 1st Jun. Today its 13th May till now there is no sign of progress. Very disappointed with the service.",
            "date": "13 May 2015",
            "name": "vishwanath b",
            "stars": "1 star"
        },
        {
            "comment": "YOU MAY HAVE TO WAIT MORE THAN 1 MONTH TO USE YOUR PHONE. SO BEFORE BUYING MAKE SURE YOU HAVE OTHER ALTERNATIVE PHONE TO USE...! WHAT EVER YOU ASK CS@FLIPKART GIVES DUMB ANSWERS. i WROTE BELOW MAIL 20+ TIMES, I GOT AUTO GENERATED MAILS... THEY NEVER BOTHER ABOUT CUSTOMER ISSUE. EVEN SOME CALLS READS THE SAME AUTO-GENERATED MAIL AGAIN AND AGAIN. 1) This is a stable product (many times released from flipkart). Still how come these kind of damage products are shipping to customer. 2) Customer places Phone order because, some issue with his/her old phone. The received new product is cracked one...! *Now customer has to wait for 28Days....! * * Now customer has to buy new phone for these 28 days...????* 3) If these kind of situations arises what actions are taking to satisfy customer??? 4) Raised a complaint: 03 May, 2015: On this day product is available at Flipkart. When I ask them to ship the replacemnt... Product is unavailable. Is this is the customer service you people are doing??? ------------------------------------------------------------------------------------------------------------------ Hello, Order ID: OD102698025212023700 Product: Moto G (2nd Gen) Thank you for your response. Please note that as an online store, our sellers procure products to fulfill the requirements of many of our valued shoppers like you from different locations. This depends on the availability of products from their partnered vendors. The product was initially not in stock with the seller 'WS Retail'. However, the same is available and so we were able to arrange for a replacement. The delivery time frame for the above order is 24 business days. But we will ensure that the product is before this time. We understand that you have received a defective product. But we will ensure that a defect free product is delivered to you. However, if you find any issues with the product, kindly write to us immediately and we will assist you further. I request your kind understanding in this regards. Regards, Siddesh P. Flipkart Customer Support Response received from Seller: WS Retail",
            "date": "13 May 2015",
            "name": "Madhu CN",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this product after a very positive feed back from friend and really his feedback is on fact. But when i purchased this product it is totally different from that. The battery life is very poor. The phone get heated after few minutes of the use, I don't know what happen with this product. But in my view now this pose is worthless.",
            "date": "13 May 2015",
            "name": "Amit Kumar Rai",
            "stars": "1 star"
        },
        {
            "comment": "Would recommend this mobile to every one. Moto e 2nd Gen (4g) is a better option if only performance is needed as the camera is not as expected without flash, Other than battery backup this mobile is good for all the day to day tasks.",
            "date": "13 May 2015",
            "name": "Abhinay Bandi",
            "stars": "5 stars"
        },
        {
            "comment": "very very good device nd one more things please donot donot buy asus zenphone 5 its total waste of money my friend is crying daily",
            "date": "12 May 2015",
            "name": "mayank",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought this phone from flipkart gets it 5 days. Thanks flipkart for fast and proper delivery of my phone. Talking about phone It was great for this price range coming with latest updated Lollipop version. I am writing this review after using this phone for 2 months and everything was excellent. Runs smooth and no issue with its processor and RAM. Cameras are pretty good but auto HDR not taking pictures properly. Front camera is fine but take some time to adjust focus. Overall I am happy with this phone and I would recommend to buy this phone.",
            "date": "12 May 2015",
            "name": "Shaishav Jogani",
            "stars": "5 stars"
        },
        {
            "comment": "when i purchase that cell. after 4 days the price gone down. rely upset. i purchased in 13000k and know 11000k. as a user cell is rely awsome",
            "date": "12 May 2015",
            "name": "prashant",
            "stars": "5 stars"
        },
        {
            "comment": "Its a perfect blend of price with sheer performance. the phone is remarkably fast. The camera is very good and HD recording is also very clear. the battery life is strong enough for a days use. I have GPS, GPRS, wifi enabled and I am connected using whatsapp etc full time.",
            "date": "12 May 2015",
            "name": "ajeet jain",
            "stars": "5 stars"
        },
        {
            "comment": "For me this is awesome. working great.Though after updating to Lolypop this started some abnormal behavior, and had to do a lot of workaround.",
            "date": "12 May 2015",
            "name": "Saikat Chatterjee",
            "stars": "5 stars"
        },
        {
            "comment": "The phone looks good, feels good and performs well too ... But the only problem with this is its echo issue !! Yeah ... yours callers will be able to hear themselves ... over and over again ... over and over again !! :P Not sure if it was this particular piece which was defective or if all the phones have the same issue ... have asked a replacement from Flipkart now. If you want your callers to hang up in the first 20-30 seconds of the conversation ... go for this phone !! Trust me ... it does wonders that way ;)",
            "date": "12 May 2015",
            "name": "Harsha",
            "stars": "3 stars"
        },
        {
            "comment": "Product is OK but filpkart services are getting worst these days .One can only go for COD orders I think as the delivery person sitting 200 m from house find it extremely difficult to move his feet to such a miniscule distance and in the hot weather ine has to go to by own vehicle to take the Item .Real shame for such services .Only 1 star as the buying expoerience completely ruined due to such a bad experience .",
            "date": "12 May 2015",
            "name": "Deepesh Verma",
            "stars": "1 star"
        },
        {
            "comment": "in this price group , its good choice, who want to big and better screen , and both camera is great in outdoor snapping..and the best quality sound , its amazing to listen mp3 and viewing video on the screen.....at last main thing to know that its battery backup is not bad . .........i Requested that give the bigger battery in next gen.phone....to play with the whole day and night.............",
            "date": "12 May 2015",
            "name": "guru",
            "stars": "4 stars"
        },
        {
            "comment": "-0.5 for heating issue while using 3g network -0.5 average battery Initially, I rated 3 stars, now I increased the rating to four stars because i got this phone for 9900..........2000 off and 10% discount on sbi debit card Pros: 1.good camera quality 2.fast processor 3.Crisp 5' HD display(720p). 4.16 GB internal memory + Micro SD card slot. 5.Brilliant Display",
            "date": "12 May 2015",
            "name": "Uddhavraj Yadav",
            "stars": "4 stars"
        },
        {
            "comment": "Very good mobile in the prise range... Excellent cam quality. very fast until lolipop update... some battery issues with lolipop",
            "date": "12 May 2015",
            "name": "Mr.Cool",
            "stars": "4 stars"
        },
        {
            "comment": "I had choice between on HTC 620G and MotoG2 based on the best specification for the best affordable price. My heart was to HTC based on the reviews and cam. Atlast I was forced to switch to MotoG2 based on the price differences. I had a very bad experiences seeing the mobile delivered had a screen defect with bright white spot in the screen, which was disturbing and had to replace it immediately. To my disappointment I was put to delayed formalities and I had to wait for 1 week due to online check delay. Once done I had my Moto G2 replaced and found to be a good performer. Its a good choice for the price , i feel the camera is not to mark with 8 mp especially the quality is not very good when its taken with zoom. with all the price matters, I feel good with these thoughts.. overall a GOOD choice.",
            "date": "12 May 2015",
            "name": "Vijay Samuel",
            "stars": "4 stars"
        },
        {
            "comment": "Its really a very good product. I can use it for my office use, for gaming. It is simply awesome product at reasonable cost.",
            "date": "12 May 2015",
            "name": "Ashwini Patil",
            "stars": "5 stars"
        },
        {
            "comment": "I have used this mobile and ordered in Flipkart where the delivery is good and the mobile with good features at reasonable price. After buying this product please register your product at Motorola official website support and get the information about the security of the mobile as it has the best feature to trace(which other mobile doesn't have) your mobile in case if you lost it. Finally I can say that this mobile has good features which you can't get in any other brands. So I suggest people to go with it. Here is the mobile(Lenovo A6000 plus) which has best features than this mobile but I am not sure about the review on it as it is released at the month end of April. Its price(Lenovo A6000 plus) is also less in Flipkart",
            "date": "12 May 2015",
            "name": "Raghava",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2nd gen mobile phone future are very good but charging so poor only one day will be stand ed time ...",
            "date": "12 May 2015",
            "name": "Prasanth Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart service was good and I would rate 4.5 out of 5. Reason I didn't rate it 5 because I faced some issues with courier/logistic but at the end it was good. I used this phone with Kitkat for around 1 month and it was awesome but as soon as I upgrade it to Lolipop it became an ordinary phone. I don't know I should blame google to launch such a garbage IOS (specially google now launcher in Lolipop) or I should blame Motorola guys who simply pushed Lolipop to this phone without even testing it with Moto G2. At the end of the day I would say Phone is good at this price and if one can compromise with some lag and battery backup (which comes once phone gets upgraded to Lolipop) then go ahead.. Also Lolipop 5.0.2 has some bugs which I experience while using my phone. Have a good one.. :) Note: Overall rating is not for Flipkart, it's for the phone after using it for 6 months.",
            "date": "12 May 2015",
            "name": "Avnish Singh",
            "stars": "2 stars"
        },
        {
            "comment": "easy to use and its better than other samsung phone camera quality is good front camera is also good battery backup not to long",
            "date": "12 May 2015",
            "name": "Amritanshu",
            "stars": "4 stars"
        },
        {
            "comment": "nice phone with good looks...but this phone hangs a lot..even stock android app crashes a lot..i sold this phone after 6 months only. this was the only reason. otherwise looks wise nd sound quality is preety good...",
            "date": "12 May 2015",
            "name": "Sumit Sood",
            "stars": "2 stars"
        },
        {
            "comment": "the speaker quailty is dull , sound is not crisp. the plastic feel of the phone is not good too. sorry to say that i am not satisfied with the phone moto g 2nd gen. will return back this phone.",
            "date": "11 May 2015",
            "name": "hitesh",
            "stars": "2 stars"
        },
        {
            "comment": "Flipkart have always delivered all it items before time. Coming to this phone it is one hell of a phone the best one I have ever hade pro- very good camera nice design smooth touch very good performance play heavy games smoothly better interface than samsung, HTC, Sony cons I am still searching for it",
            "date": "11 May 2015",
            "name": "lalit bisht",
            "stars": "5 stars"
        },
        {
            "comment": "been 2months since i got this phone..its quite fast and works smoothly..the only trouble i noticed(which many others have faced too,i have searched in google :P)is that sometimes rarely the whole battery drains out,..its like 20% one second and the other second its 1% and wants to shut down..its quite bothering if i dont have the charger available right at that time...i guess like any smartphone u need to keep closing the apps u dont use..other than that its smooth and works well!",
            "date": "11 May 2015",
            "name": "Kpj Ratnababu",
            "stars": "4 stars"
        },
        {
            "comment": "A decent buy within 11K for users who want Motorola Brand and Build Quality Pros: - Smooth interface, decent speed (with less apps) and impeccable build quality. - Slo-mo feature in video mode - which I think no other brand offers within this price range - Will get all atleast 1 more update from Google - Feels nice to hold, due to the matte finish rear panel - Support and Service will be better than all other Chinese competitors - Rear snapper clicks some awesome snaps in daylight! - Decent front snapper Cons: - Heats up if you open multiple apps - I installed whatsapp, fb, instagram, zomato, bms, chrome, skype, soundcloud, twitter and a couple of games --> phone started behaving erratic and was freezing. Restarting the phone helped, but that's not what you want a multi-tasking phone to ask you to do? - 1GB RAM is not sufficient for people who like to install many social media apps. - Night shots are bad, even with the flash. - Using 2 SIM's can just make the phone a dud with multiple apps - No 4G (even Moto E has 4G now) I would say buy this phone if your purpose in only I/C and O/G with a couple of social media apps like WA, FB & Instagram. It would be wise to wait for the Moto G 3rd Gen, which I guess may boast a much needed 2GB RAM and 4G LTE!",
            "date": "11 May 2015",
            "name": "Bighneswar Sabat",
            "stars": "3 stars"
        },
        {
            "comment": "Almost good. but battery backup not satisfied others android ph. Camera quality is very well. Touch screen not bad. all over 4/5 point I given moto G2.",
            "date": "11 May 2015",
            "name": "Subhojit Mukhe...",
            "stars": "4 stars"
        },
        {
            "comment": "BATTARY IS NOT GUD BUT PERFORMANCE IS GUD .... BUT GOOD PHONE IN 11000 CONS - BATTARY BACKUP IS NOT GOOD FLIPKART TAKES LOT TIME TO DILIVER",
            "date": "11 May 2015",
            "name": "KANAV",
            "stars": "4 stars"
        },
        {
            "comment": "good value for money. must buy phone . but now a days many others mobiles are available with more faetures than this at low price than this",
            "date": "11 May 2015",
            "name": "lakshmi reddy",
            "stars": "4 stars"
        },
        {
            "comment": "Best Product to buy. Go for it. solves all issues with Moto e as well as 1st Gen Moto G.... Pay with SBI card and u get extra discounts",
            "date": "11 May 2015",
            "name": "??? ?????",
            "stars": "4 stars"
        },
        {
            "comment": "screen has a white dot issue ( dead pixel ) and flipkart customer service dont want to replace my defective phone,so i m advice to all buyer dont buy this phone....original moto g was amazing phone but this is not,dont buy at all cost...",
            "date": "11 May 2015",
            "name": "vimal patel",
            "stars": "1 star"
        },
        {
            "comment": "Moto is living up to it's reputation and Flipkart is doing an amazing job in making Moto again a popular phone amongst the people.",
            "date": "11 May 2015",
            "name": "SIDDHARTH MATHUR",
            "stars": "5 stars"
        },
        {
            "comment": "I'm writing this review after using it for 3 months. Its display was great and recently i updated to lollipop. Its working pretty awesome after the lollipop update. Good battery backup. performance of the phone was quite good. Only drawback with the phone was speaker quality.",
            "date": "11 May 2015",
            "name": "Naresh P",
            "stars": "4 stars"
        },
        {
            "comment": "the product was in not working condition and they hesitated to replace product .both the sim slots was not working and they were asking me to connect to internet and update their software then only they will accept replacement",
            "date": "11 May 2015",
            "name": "mathew PAUL",
            "stars": "1 star"
        },
        {
            "comment": "Good screen andngreat touch Good sound and clarity Loud speakers Good wifi range Good features Decent Camera Motorola specific features like assist and migrate are awesome! Battery life less than 18 hours when data and wifi are on Battery life less than 40 hours when data and wifi are off Battery is in built so if and when it has to be changed, it may be a problem Gets a little slow at times Contacts sometimes take 2 to 3 secs to respond after touch I suggest buying a good power bank on the go",
            "date": "11 May 2015",
            "name": "Anand Kurien",
            "stars": "4 stars"
        },
        {
            "comment": "worst service by flipkart ,I HAVE complained to flipkart but they cant even solve my problem till. now calling error problems,hanging",
            "date": "11 May 2015",
            "name": "harsha vardhan",
            "stars": "1 star"
        },
        {
            "comment": "Its nice phone with good brand value. overall a good performer. cameras are good, display, storage, design all are gud. only drawback i felt is battery backup. it does not last a day for low to medium use. I can say if you are a heavy user u have to charge it twice a day. one more issue is, screen feel hot when you make call and touch phone to your ears. give it 3.5 star.",
            "date": "11 May 2015",
            "name": "Hemant Patel",
            "stars": "4 stars"
        },
        {
            "comment": "got the device thru flipkart offer. pros: * corning gorilla glass - touch and display is good * comes with lollipop installed * camera is excellent * external Memory card option available * dual sim option cons: 1. tha main issue is BATTERY DRAIN - it drains within a day for normal usage (without wifi and data usage) might be due to lollipop os or gorill glass display 2. can not reduce the resolution of the camera u can take only 5MP and 8 MP photos for sending photos thru whatsapp and email, it will be better to have some resolution settings. 3. pre installed apps from lollipop dialer and messaging there is no template storage for messaging, which is available in every keyboard layout u had to install apps from google play store., its working in sms but not in whatsapp 4. no USB charger cable",
            "date": "11 May 2015",
            "name": "HARI",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G offers a combination of quality and performance garnished with a known brand at a very competitive price. Due to the Google umbrella, the Moto G buy becomes more compelling. Very much satisfied by its performance and looks.",
            "date": "11 May 2015",
            "name": "Saurabh Dimri",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is as good as you hope it would be except... the battery drains out very quickly when you're using internet. Also, the charger takes a hell lot of time to fully charge the phone. But, overall user experience is great, ease of use is excellent and the phone speakers are bang on! Worth every rupee.",
            "date": "11 May 2015",
            "name": "Neipekreizo Ke...",
            "stars": "5 stars"
        },
        {
            "comment": "this is amazing phone.camera quality is awesome.touch is faddu.simply say best budjet phone with amazing features",
            "date": "11 May 2015",
            "name": "rupesh nayak",
            "stars": "5 stars"
        },
        {
            "comment": "when iam trying lo connect earphone to my mobile sound coming from speakers not with earphones i think there is a problem with mobile earphone connection pin earpones are working properly because i checked with another mobile its working properly please resolve issue as soon as possible.",
            "date": "11 May 2015",
            "name": "aditya ganni",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this phone online from Flipkart on 4th May 2015 & I got it delivered on third day i.e 6th May 2015 Overall this is a good phone to buy with the price range of Rs.11000/- I would recommend this phone as the Camera Quality is excellent & overall Performance is Good with the Latest Android - 5.0 Lollipop. Something which need to improve is the Side Lock button & Volume Button which is very hard to press.",
            "date": "11 May 2015",
            "name": "Jitender SIngh",
            "stars": "4 stars"
        },
        {
            "comment": "the phone is really good. no hanging better camera good display, crisp sound. bigger screen, overall a value for money",
            "date": "11 May 2015",
            "name": "mohd ayaz akhtar",
            "stars": "5 stars"
        },
        {
            "comment": "battery! oh battery ! dont drain away so quickly Please do not include: HTML, references to other retailers, pricing, personal information, any profane, inflammatory or copyrighted comments, or any copied content.",
            "date": "11 May 2015",
            "name": "hary luitel",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 is one of the phones around. I love the speakers of this phone. though camera quality is not upto the mark but at this price , i will say - MOTO G2 ROCKS",
            "date": "10 May 2015",
            "name": "Mohit Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "every time when i charge it shows 100%. with in 10 mins battery shows low. what is this? again we restart the mobile it shows the proper battery level. every time it's happening. please try to solve the issue.",
            "date": "10 May 2015",
            "name": "khaddu m",
            "stars": "2 stars"
        },
        {
            "comment": "This is very good phone I suggest to buy....................................... .........................................",
            "date": "10 May 2015",
            "name": "RAMU BTS",
            "stars": "5 stars"
        },
        {
            "comment": "well this is an amazing phone worth every penny you pay for this masterpiece from moto... no 2nd thoughts go ahead ad buy this one... why pay more for other phones when u get soo much for too less :D",
            "date": "10 May 2015",
            "name": "Anirudh R",
            "stars": "5 stars"
        },
        {
            "comment": "Very Bad Experience With FlipKart. Don't buy anything from Flipkart. I ordered moto g 2nd generation from flipkart on 24th Apr. 2015.They delivered a defective mobile next day.After lot of hassle they agreed for replacement product. The replacement mobile was old. The Motorola seal was missing and they had used Sellotape as a seal. I had to request the replacement request again. The 3rd mobile was finally delivered on 7th May 2015. I am not sure whether this time they have delivered new/genuine mobile or not. -Vikram",
            "date": "10 May 2015",
            "name": "Vikram Kumar",
            "stars": "1 star"
        },
        {
            "comment": "EXCELLENT PRODUCT..ITS THE BEST SMARTPHONE I\"VE USED TILL NOW.CAN\"T SAY IT\"S THE BEST SMARTPHONE IN MARKET,BUT ITS REALLY WORTH FOR THE MONEY YOU PAYING,I MEAN FOR THIS PRICE U CAN\"T GET A BETTER PHONE THAN THIS. PROS: STOCK ANDRIOD[ANDROID L(5.0.2] GREAT USER EXPERIENCE NO LAG FAST AND SNAPPY CAMERA IS THE BEST LOOKS AND FEELS GOOD NICE DESIGN CONS: GETS HEATED UP A BIT AT THE TOPMOST PART WHILE SURFING INTERNET USING DATA PACK,WITH WIFI IT'S FINE..",
            "date": "10 May 2015",
            "name": "Joshua Johnson",
            "stars": "5 stars"
        },
        {
            "comment": "i am having issues with my phone. i also got it repaired as flipkart neglected to replace it. but still having camera problems and hanging issues, auto application shutdown, fast battery drainage.",
            "date": "10 May 2015",
            "name": "ashu chhillar",
            "stars": "1 star"
        },
        {
            "comment": "The phone is built up exceptionally well to give a flawless experience to the users. The Hardware and Software combination is lovely due to which there is no instance of the phone hanging inspite of multi tasking......I will recommend this phone as this one of the best within the Budget of 10K",
            "date": "10 May 2015",
            "name": "Ankit Porwal",
            "stars": "5 stars"
        },
        {
            "comment": "It is really a good product. Although I was expecting that it will support 4G as of new Moto E series. Overall it is worth compared to its price.",
            "date": "10 May 2015",
            "name": "Harshit Srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "This is a really nice product from Motorola. After using it for about 6 months I can say that it is amazing for daily usage but has a few minor drawbacks. The Pros and Cons are - Pros 1) Good battery life. Lasts for about 2 days with normal usage (1 day if you play a lot of games etc.) 2) Great Screen for watching Movies or YouTube and doesn't give a lot of glare. 3) Sturdy Build and feels really nice in your hands with the rubberised back. 4) Expandable storage 5) Amazing Android Experience 6) Good and responsive Touchscreen. Doesn't really require a screen guard but I would recommend you to use one. 7) Good sound quality. Its not Amazing but still, good speakers. Prefer to use Earphones 8) Fast Charging. You can get a full charge in 3 hours or less. Cons 1) 1 GB RAM isn't too great for a lot of heavy games. Gives lag if you have a lot of apps on multi-tasking. But if you have normal usage, its pretty good. 2) In-the-box Earphones are not so good. 3) Screen gets a lot of fingerprints unless you use a screen guard. 4) You probably cant get a lot of fancy Cases and Covers for it. All in all its worth its money and a really good product. If you want to play A LOT of games and movies and use a lot of apps, then you might need a better RAM. But for ordinary usage (music, social media, calling, a few movies, a few games, videos etc), its good enough.",
            "date": "10 May 2015",
            "name": "Ayush Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "the product is good............... the screen is excellent.................... and the feel of touch is nice.. .................. but the phone hangs frequently.............. can download many apps.. enjoying.. but sometimes... the battery is very poor............",
            "date": "10 May 2015",
            "name": "Suruthi Narayanan",
            "stars": "4 stars"
        },
        {
            "comment": "very good product value for money & battery back up good, amazing sped wonderful camera i am happy to purchase MOTO G2",
            "date": "10 May 2015",
            "name": "Yogeesh",
            "stars": "5 stars"
        },
        {
            "comment": "gud camera ,,,,,,,,,,,,,better than samsung ............... not very gud performance as comparison to ,,, mi ..",
            "date": "10 May 2015",
            "name": "harsh sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Many issues in Moto G 2nd generation.. Intially, phone start up got strucked then they do replacement. Now receiver unable to hear the voice.. It works only in headphones.. Guys dont buy this phone...",
            "date": "10 May 2015",
            "name": "Saravanakumar A S",
            "stars": "1 star"
        },
        {
            "comment": "> 3G Video Calling Not Sported > Major issue it drains battery when i enable mobile data I just got shocked when i tried to connect video calling option with 3G services i searched in settings and then i call moto customer care and there a lady start describing me about VOIP call (Sir, Please install skype or any other software like this then you will be able to video call, i said it's not a video call its different and i need to tell the person with i want to chat to install same software) Now come to other issue, so what i realize with my phone when i use internet by connecting with WIFI modem it works fine... which proves that no matter how many apps i installed in phone but as i enable mobile data, battery go down very fast in fact full charge phone goes 10% in 2 or 3 hr... i replaced it ones but the next set i got .... same issue :-) :-( :'(",
            "date": "10 May 2015",
            "name": "Somesh Srivastava",
            "stars": "3 stars"
        },
        {
            "comment": "Pros Moto G2...the comeback product for Motorola...one of their best creations...awesome features, decent looks, awesome touch sensitivity....I really liked the phone... Cons i was a little disappointed as its available for 9k now...i paid 14 k... the RAM is too small,1 GB ram these days is of no use...i have installed a booster, which actually clears the RAM Overall very happy 10/10",
            "date": "10 May 2015",
            "name": "Anand Marella",
            "stars": "5 stars"
        },
        {
            "comment": "I bought a phone one and a half month ago. Around 15 days ago the phone slipped out my pocket while i was sitting on a chair.The phone dropped from merely a height of 1/2 a feet and its screen got cracked.Its screen is so fragile that it should not be called as gorilla glass.",
            "date": "10 May 2015",
            "name": "SUJAY JAIN",
            "stars": "1 star"
        },
        {
            "comment": "mobile is best but in white colour mobile is out of stock so please in stock available this product in flipkart so you trying the available this product in a white colour",
            "date": "09 May 2015",
            "name": "PRADEEP GUPTA",
            "stars": "2 stars"
        },
        {
            "comment": "Using this phone from last 1 month and its working perfect according to my expectations... Awesome phone in this price .. Special thanks to Flipkart to deliver this in a day :)",
            "date": "09 May 2015",
            "name": "Piyush Sahu",
            "stars": "4 stars"
        },
        {
            "comment": "Defect piece: Mobile is getting over heated (while using the flash light & Camera). And support from Flipkart is also very bad.",
            "date": "09 May 2015",
            "name": "Nagappa",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone but it started hanging like other phones in 1 month only. it's features are awesome overall a good phone",
            "date": "09 May 2015",
            "name": "Madhav",
            "stars": "4 stars"
        },
        {
            "comment": "Never did i imagined that this would be so damn good looking, not at all cheap from any angle guys! Only issue - BATTERY!!! Gaming - its drains like crazy. Needs twice a charging per day if you are a serious gamer. Network - not quite difference, it doesn't matters if you are on wifi or 3g, draining time is the same. Entertainment - quite good while listening music but not while watching movies, still OK while watching a 20min TV series. Web Browsing/Multitasking - no issue at all. Takes about couple of hours max to charge it fully. Overall I would say not at all bad for a 2070mAh battery. Got Android Lollipop 5.0.2 straight out of the box.",
            "date": "09 May 2015",
            "name": "Akshit Hegde",
            "stars": "4 stars"
        },
        {
            "comment": "believe me when i say this that this phone is much better,though xiaomi and mmx have great specifiations on paper but in reality they tend to heat up and lag, great phone at this price. i got this for 9800rs. thanks to flipkart",
            "date": "09 May 2015",
            "name": "Aruvansh Nigam",
            "stars": "5 stars"
        },
        {
            "comment": "Using Moto G 2 for 2 weeks, it's battery is the worst one, it takes 4 hours to recharge it fully. Then takes another 4 hours to hit the zero mark. Internal Memory is not accessible through the default app available, You have install some other third party app to access your internal memory and SD card. Some unnecessary Google App is there, instead of the useful ones. Sound quality is also not good, if you want to watch a movie, you have to use a head phone, otherwise sound is not audible properly, that \"FULL STEREO SOUND\" is just an eye wash. While making a phone call the speaker sound is not audible from 0.5 ft distance properly. And if speaker is enabled, proximity sensor is not working. Didn't expect this type of quality from Motorola. Camera is good, but takes longer time to get the focus. Front camera angle is not that wide. Good thing is it's vibrant display. Before this I have used Samsung Y Duos, I though it(MOTO) would be better that this but not. Utterly disappointed.",
            "date": "09 May 2015",
            "name": "Soumi Mitra",
            "stars": "2 stars"
        },
        {
            "comment": "is their anything i can do abt it ?? my phone is dead three months after purchase, what do i do abt it . please suggest !",
            "date": "09 May 2015",
            "name": "Vikram Kothari",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone 10 days back and its rapid battery discharge has taken a toll now...I have just raised a return request. Its battery only last for max 4 hours after charging it to 100 % ...Today when i got up its battery was just 15 % and when i plugged in for charging it suddenly charged up to 100% after using for an hour , the phone got shut. Such a defective piece is this...Really sad with such a purchase from flipkart. This was my first purchase of an electronic item from flipkart and it resulted into such a disappointment .",
            "date": "09 May 2015",
            "name": "Prerna S",
            "stars": "1 star"
        },
        {
            "comment": "It seems they have sent a used phone to me. I got phone with lolipop android but all my friends received it with android kitkat and they updated it by their own. This has serious battery draining issue. Not at all satisfied with the purchase. Feel degraded. Gave five star so that they don't hide the review based on rating. Please beware. Flipkart is not genuine as before. Some news came that moto g2 is out of stock already and they are selling returned items by refurbishing it. Please beware flipkart is not as before.",
            "date": "09 May 2015",
            "name": "Kani",
            "stars": "5 stars"
        },
        {
            "comment": "excellent mobile phone, Lollipop at its best.. Battery is a concern.. very fast response with all functions. I like you Moto",
            "date": "09 May 2015",
            "name": "Vimal",
            "stars": "5 stars"
        },
        {
            "comment": "I must appreciate the excellent service of Flipkart. On Feb 11,2015, I ordered this mobile around 1.30 AM before going to bed and the mobile got delivered next morning around 11 AM. I could not ask for more.. And to me Moto G2 was the one of the value for money mobiles from a reliable manufacturer.",
            "date": "09 May 2015",
            "name": "Prasun",
            "stars": "5 stars"
        },
        {
            "comment": "nice product and delivered on time except the file manager is not there in the device. Camera is good",
            "date": "08 May 2015",
            "name": "Sree",
            "stars": "4 stars"
        },
        {
            "comment": "very good product, nice performance and good features.m stock android perform very well. gyro and compass very usefull.",
            "date": "08 May 2015",
            "name": "praveena k m",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone as compared to costly n not useful Samsung (Samsung phones lags a lot....) one may go for it.... but remember if battery drains to 0% then u need to hold the power key upto 2 min.....ur phone will be ON....",
            "date": "08 May 2015",
            "name": "Anand Aware",
            "stars": "5 stars"
        },
        {
            "comment": "1. GRAPHICS OF SAMSUNG GALAXY GRAND2 WILL NOT GET ANY CHANCE with compare to MOTO G2 GRAPHICS.I think the SAMSUNG GALAXY buyer will be jealous by hearing this.... but its real true, I've compared these two and found the difference. Graphics is too good in MOTO G2, after Lollipop upgrade the looks changed, Ambient display feature available which will adjust the brightness automatically according to the surrounding. 2.Battery backup awesome..at least 24 hours with 4 hours 3g usage in variable network. It will take exact 4 hours to charge fully from 0 percent to 100 percent, that means 25% charge gain in 1 hour. 3.Camera is of good quality. 4.Speaker quality is also very good. I've mentioned these all features of MOTO G2, and I believe in that price this is the best phone in market. Don't think a lot........just go for it and be happy :)",
            "date": "08 May 2015",
            "name": "Sujay Podder",
            "stars": "5 stars"
        },
        {
            "comment": "Packing was good& Delivery was superfast, got in less than 2 days! Phone finish is good n feel also, performance is also good. Its a go for it product!!! Flipkart delivery and customer care is good as always had a slight issue with phone got exchanged item in less than 2 days!!!!",
            "date": "08 May 2015",
            "name": "narendra jaggi",
            "stars": "5 stars"
        },
        {
            "comment": "phone is awesome but it takes 3 hours for 100% charge thats why 3 star, and got this phone at 9900 only. camera is good and front camera is also good battery will last 10 to 12 hours.",
            "date": "08 May 2015",
            "name": "MOHIT BIRLA",
            "stars": "3 stars"
        },
        {
            "comment": "All Good. Except limited battery power. Pros: 1. Screen Resolution Good. Screen size is enough & touch reliable. 2. OS once updated looks good. LIked It.(Keypad is like Apple iOS) 3. Positive for sound, phone call, internet connectivity & browsing, game playing. Cons: 1. Battery is worrisome. Mostly a day with good usage of Internet & gaming. 2. Need cover, otherwise camera lens affected.",
            "date": "08 May 2015",
            "name": "Sidhdarth Kavt...",
            "stars": "4 stars"
        },
        {
            "comment": "I will not review the product as there are many reviews here. I would like to comment on the flipkart support which I felt is pathetic. I am buying product on flipkart since a few years now, first time I had to actually seek the help from support as the phone delivered to me was defective. The touch screen was not at all working. First you get a mail from support to download/install some app for troubleshooting. Wonder how can one do it if the phone is not at all working?? Next you have to wait for the call from their technical people who are given the powers to accept/reject your replacement request. The worst part is if you happen to miss the call due to any reason, its your headache to call support again to schedule the callback. The support guys keep on asking to do some useless things which is difficult for a new person (new to technology) to do fearing he/she may damage the device in the process. I had to call in support 4 times in 4-5 days before my replacement was accepted. Think of the pain one goes through especially after paying the full amount for a defective piece. The worst part about this purchase was that I had gifted it to somebody. The real test for anything is in times of trouble. My first experience with the flip kart support had been terrible. My perception about flipkart has changed and I will think 100 times before placing an order again (if I decide to ever)",
            "date": "08 May 2015",
            "name": "abhishek kumar",
            "stars": "1 star"
        },
        {
            "comment": "i ordered motog2 in the offer 2000 off more than a month ago but the phone had cost me even more than its actual prize and its just lying like a toy. From the 2nd day of delivery its software was giving me problem. its display goes blank automatically. Flipkart's smartapp check was unable to find the problem and so they rejected my return request every time. They wasted my 1 month like this and then said that return policy is over so go to the service center where it was told to me that there was a bug in the software so they updated it. It worked well for 2 days and now again the same problem. Flipkart is neither replacing the cell not refunding my money and i m still with a moto g2 toy. At least toy works. Feeling like i donated 11k to flipkart.",
            "date": "08 May 2015",
            "name": "Alison Pereira",
            "stars": "1 star"
        },
        {
            "comment": "All the features are good, but heating too much. Going to return the mobile. Buy carefully. MOTO G 2nd gen white color mobile.",
            "date": "08 May 2015",
            "name": "Manju",
            "stars": "3 stars"
        },
        {
            "comment": "Works perfectly, smooth interface. Replaced samsung phone with this one. Nice build quality awesome cam, good hand grip and superb touch bads",
            "date": "08 May 2015",
            "name": "Bala",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone.Stylish back cover. Bought this phone 3 months back. Till now its good in performance.Sound is ok.",
            "date": "08 May 2015",
            "name": "Swati",
            "stars": "5 stars"
        },
        {
            "comment": "battery backup very poor , audio recording very low volume ,audiojack sound very low sound not good ,over all ok",
            "date": "08 May 2015",
            "name": "Yarramsetti Ti...",
            "stars": "4 stars"
        },
        {
            "comment": "Recieved a defective piece from flipkart and flipkart is processing it.. but after using Moto G 1st Gen for a year and Moto G(2nd Gen) for a week, I can say that Moto G(2nd Gen) is no way closer to Moto G(1st Gen).. This handset has a serious defect with microphone.. Moto G(2nd Gen) is a poor quality product both hardware wise and software wise.. screen not enough touch sensitive and we need to be press screen to select option - so it is a press screen not touch screen.. it has many other problems I cannot list on flipkart.. in one line I suggest others not to go for this faulty product from motorola - but flipkart as usual is good at its work.. giving 1 star only for Flipkart service and no stars for Motorola's Moto G(2nd Gen).. I would suggest flipkart not dump these waste motorola handsets and loose your customers.. for people reading this review - please don't waste your money like me..",
            "date": "08 May 2015",
            "name": "Abhinandan Kolkur",
            "stars": "1 star"
        },
        {
            "comment": "Only minus point in Moto G (2nd Gen), charging is very slow, 3 hrs for 50% charge. Apart from that happy with the quick delivery and the product itself",
            "date": "08 May 2015",
            "name": "Atul Sohal",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G...I bought it on 14th April 2015. Not even a month now and I am facing issues with music player. Every time you want to listen to music, you have to reboot the phone. Which as per me is a manufacturing defect but thanks to flipkart they have rejected for replacement of this handset. Hence will never recommend anyone to buy anything from Flipkart ever. Genuine Request to all..Don't buy anything damm thing from flipkart. And if anyone is facing any issues with them pull them to court....So that they don't fool around with ppl's hard earned money.",
            "date": "08 May 2015",
            "name": "Preeti Gandhe",
            "stars": "1 star"
        },
        {
            "comment": "I've been using this month for almost one and half month but from starting, when i'm calling there is some buzzing sound in speaker so I have requested a replacement but they have rejected my request saying that it's because of my sim card and asked me to change it and so did i change. But then also this buzzing sound continues and now i cant do anything because 30 days are over. Also its get easily heated while charging...otherwise this phone works fine if i neglect buzzing.",
            "date": "07 May 2015",
            "name": "Deep Gandhi",
            "stars": "3 stars"
        },
        {
            "comment": "Its a great phone. Came with 5.0.2 Lollipop OS. Awesome camera, battery life. Fully satisfied with the product.",
            "date": "07 May 2015",
            "name": "Ronak Rathod",
            "stars": "5 stars"
        },
        {
            "comment": "overall good phone in a price range available and works well after lollipop update except battery backup which is not that gr8.",
            "date": "07 May 2015",
            "name": "PRATEEK RASTOGI",
            "stars": "3 stars"
        },
        {
            "comment": "Worth for money, but the price fell down with two months post my purchase. People who are looking for stylish with effective price, go for it.",
            "date": "07 May 2015",
            "name": "Prem",
            "stars": "5 stars"
        },
        {
            "comment": "Ram is too low....unable to install more apps. So easily hangs. Battery is suddenly decrease. Still i meet some problem.....",
            "date": "07 May 2015",
            "name": "Hariharan Velu",
            "stars": "3 stars"
        },
        {
            "comment": "With just a few cons, this is the best phone ever in this price range. Pros: A Lotttttt, cant even complete in one list. Cons: With the new 5.0 update, it lags a bit but i guess will soon be okay with bug fixes Battery life is just okay And I've dropped my phone 5-6 times, but some news say its screen is weak nd breaks on falling.So, i guess u shud use back cover but some of my friends are using it without cover so its ur decision. I'll go with safe before sorry. So, overall a must buy, go for it without thinking twice!!! And last but not the least fli[kart's service was amazing....",
            "date": "07 May 2015",
            "name": "yuvraj singh",
            "stars": "4 stars"
        },
        {
            "comment": "Good Camera Good Updates... Gorilla Glass. Water Resistancccccce....................................................................................................................................................................................................................................................................................................................................................................................................................................................Expressed My Words In 100.",
            "date": "07 May 2015",
            "name": "Vishnu Rajesh",
            "stars": "4 stars"
        },
        {
            "comment": "using this product since 27th Apr ---it is taking tomuch of time to charge and not even giving stand more than 10hr with 2g support",
            "date": "07 May 2015",
            "name": "Jagadeeswara C",
            "stars": "1 star"
        },
        {
            "comment": "Hello Dear Friend,,, This Is Inform Too All Friend .....MOTO G 2 Is Very Very best Phone In This Year so Please Purchase In Moto G 2 in Flipkart ..",
            "date": "07 May 2015",
            "name": "RAVI PATEL",
            "stars": "5 stars"
        },
        {
            "comment": "Out standing product, overall great value for money, replaced the old phone with more than what we get from outside in shop. Great packaging and delivery by Flipkart which is as usual....",
            "date": "07 May 2015",
            "name": "Deepak",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is still the best budget smartphone you can buy today.Motorola's long list of seemingly modest improvements collectively add up to a device that's worth your attention",
            "date": "07 May 2015",
            "name": "Addy",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone and I feel it was best with this price in market... simply perfect phone. We are happy to buy it.",
            "date": "07 May 2015",
            "name": "Riya",
            "stars": "5 stars"
        },
        {
            "comment": "- Nice Front and Rear Camera, - Excellent display, - Good Music Quality, - Enough Screen Size, - Excellent Speed Disappointed with the headphones given with the phone.",
            "date": "07 May 2015",
            "name": "Alap Anerao",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this product for about a month, complained to Flipkart \"Twice\" that the product was sub-standard ( phone hangs on using multiple apps, touch is pathetic, battery life 2-3 hours on 3g etc) and was directed to Moto G care centre for the same. These highly helpful team of \"professionals\" at the centre told me that the product was liked by millions and I was a fool to think otherwise, i shouted and fought for my right and was told that that's the best they provide and the problem is figment of my imagination. Head Down I returned and am stuck with this phone. Moral: Please don't fall for the hype. never ever buy this pathetic product",
            "date": "07 May 2015",
            "name": "Sarthak Goyal",
            "stars": "1 star"
        },
        {
            "comment": "Moto g ( 2nd gen ) a good product .. But flipkart Sucks big time . 1. no proper response from so called costumer care .. ( always clueless ) 2. got my product 3 weeks after the promised date 3. SAME SHIT AGAIN -------- i placed a order for 2 moto e ( 2nd Gen ) . today is the promised date .. no product delivered ... called costumer care \" sir we will get back to you within 48 hours :) \" so in short Flipkart ( The online megastore ) fucks you with a smile on there face .",
            "date": "07 May 2015",
            "name": "Arjun Singh",
            "stars": "1 star"
        },
        {
            "comment": "Earlier delivery time within 5 days but know a days 25days i don't why. Please delivery within 3 days that will be superb.",
            "date": "07 May 2015",
            "name": "vinay kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Back Panel comes out automatically ,its loose fitted and Panel comes out easily.Other than that everything is fine",
            "date": "07 May 2015",
            "name": "Pradeep P.s.s",
            "stars": "4 stars"
        },
        {
            "comment": "courier service problem, package turn around the delivery point and then doorstep ( order for ongole but in step bangalore - hyderabad - vijayawada - ongole. then it takes 5 days for delivery bangalore to ongole it takes only 2 days for delivery",
            "date": "07 May 2015",
            "name": "subbu g",
            "stars": "3 stars"
        },
        {
            "comment": "My xperia c3 was stolen, thats when i planned to buy a phone under 15k range. Moto g (2nd gen) would be an apt choice. I wasnt wrong. The phone is flawless. Got it with Lolipop version. I bought it for Rs.12,999/-, 2days later i saw that the price was reduced to 10,999/- :( that was the only sad part. No doubt this phone stands as one of the best phones under 15k range. As far as phone for best selfies is concerned, well, Xperia C3 steals the show :) Also xperia c3 has better battery back up when compared to moto g2.",
            "date": "07 May 2015",
            "name": "Divya Rani",
            "stars": "4 stars"
        },
        {
            "comment": "i notice that sound of phone when calling are spread also hang the phone sometime. Otherwise it will be good",
            "date": "07 May 2015",
            "name": "Tushar",
            "stars": "2 stars"
        },
        {
            "comment": "its a good product. disappointing is next day after my purchase they reduced the price by 1000 :) its almost one month now, the phone has no problem, battery is ok.. but it hangs sometime if we do multitasking but not very frequently..",
            "date": "07 May 2015",
            "name": "Sam",
            "stars": "4 stars"
        },
        {
            "comment": "I had just started using it...one word...ITS AWESOME......Superfast Speed....User friendly Touch...Easy to Carry and Sharp Camera while Taking pictures",
            "date": "07 May 2015",
            "name": "Ankush",
            "stars": "5 stars"
        },
        {
            "comment": "The Gorilla glass is not upto the mark. Very bad quality. It just felt from 2 feet distance and was scattered into pieces. The service centre says it will cost around 5000 for glass replacement. After 5.0 update phone hangs very often",
            "date": "07 May 2015",
            "name": "anil behera",
            "stars": "4 stars"
        },
        {
            "comment": "Hi Flipkart Team, First of all I would like to thank Flipkart for the replacement. Story Begins: Got Moto X, fell down from cot, glass broke, cost of replacement a whooping 13,000. Bull Shit, throwed away. Dillema Begins: Confused between Apple, Motorola and Microsoft Lumia. Went to Apple Store and Reliance Store in Orion Mall, gone through all the mobiles from iPhone 6 to iPhone 4s, even though it was not under my budget. Went to Orion mall, wasted my car parking fees. This went on for 3 days. Finally decided to order Moto G 2nd Gen. Ordered from Flipkart on May 2nd, 11:00, (2 mobiles Moto G 2nd Gen and Moto E for same day delivery). Delivered on same day around 17:30. Found out dead pixel, requested for replacement. Got a call from flipkart on Sunday around 3 PM and finally replaced the phone the very next day itself. Hmmmmmmmm, now I am enjoying, chatting with my Friends. Phone review will be update shortly.",
            "date": "07 May 2015",
            "name": "Satish Dhinakaran",
            "stars": "5 stars"
        },
        {
            "comment": "at least minimum 3000mha battery is required for this big screen smart phone . Batter drain when connect to internet very fast.",
            "date": "07 May 2015",
            "name": "Theja",
            "stars": "3 stars"
        },
        {
            "comment": "Mobile is being struck every time and it is very slow process and the mobile is getting heat when we are talking to someone with this devise. I am really unsatisfied with this mobile except stylish look and light weight with good screen.",
            "date": "07 May 2015",
            "name": "Dr. Pabba",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered MOTO g 2nd gen after flipkart slash down proce to 10999. Got phone in 2-3 days. Quality of phone is SOO bad that you cant hear anything when on call. Called customer care for replacement but they turn down my request. Guys don't buy this lot looks like cheap quality or you will regret like me.",
            "date": "06 May 2015",
            "name": "Jahir Ahmad",
            "stars": "1 star"
        },
        {
            "comment": "Best choice in the range on 10k to 15k. No heating issues, best screen. Audio speakers are good but the headphones are not. Cam quality is good. Android Lollypop 5.0.2 runs smooth. Best service by Flipkart. Buy only if seller is WS RETAIL.",
            "date": "06 May 2015",
            "name": "Arshad S",
            "stars": "5 stars"
        },
        {
            "comment": "nice mobile good battery backup and fast processor, upgradeble kitkat to lalipop overall good specification",
            "date": "06 May 2015",
            "name": "suresh Thiruma...",
            "stars": "5 stars"
        },
        {
            "comment": "Some times Hanging and the Call Could not be make and break..other apps And applications are ok... at the Same time Poor Battery Backup..Charging 8 to 10 hrs only WithStand... without any browsing Call Making.., Just Like a standby time.... While Browse or Call making Battery Backup is Very Poor....",
            "date": "06 May 2015",
            "name": "KALIS",
            "stars": "4 stars"
        },
        {
            "comment": "If you looking for a budget smart phone, go for it. But if you are looking for a performance phone for HD gaming, lots of apps, heavy usage, go for some expensive fast phone",
            "date": "06 May 2015",
            "name": "Harshdeep",
            "stars": "5 stars"
        },
        {
            "comment": "Not surprisingly, for me, the stock android experience is far better than the customized or so called enhanced UIs that other brands pack their phones with. If the accessories were not so expensive and if it had come with a USB cable, the Moto G 2nd Gen would've been the perfect 2nd smartphone for me. I am not saying it can't be the first, it would've been but for the reasons stated before. Flipkart delivery was well before their stated date and I was kept informed about the status all along. Thumbs up to Flipkart for that.",
            "date": "06 May 2015",
            "name": "Amol",
            "stars": "4 stars"
        },
        {
            "comment": "So I got this mobile in March. I was really impressed with the build quality and features. Too good at this range. But on the 29th day from the date of delivery, I saw that the touches were not registered properly. Enabling the 'show touches' option, I noticed that touches were registered in three four places where I didn't touch at all. I immediately tried to file a return but the 'return product' link is gone! I sent a mail to Flipkart and two days after that (31st day) I was told since 30 days are gone they won't replace it and that I should go visit a service center. Way to go, FK! Reading the other reviews, it seems to me that FK just sent me a refurbished product.",
            "date": "06 May 2015",
            "name": "Abhisek Dutta",
            "stars": "1 star"
        },
        {
            "comment": "Good Smart phone. 100% value for money. Not faced any major tech issues, except some times network drops indicating exclamation symbol. Bad luck- within 2 days of product delivered, price dropped to 10k :-(",
            "date": "06 May 2015",
            "name": "Girish R",
            "stars": "4 stars"
        },
        {
            "comment": "A very good smart phone at economy range. worth the money. but the battery back up is very low. If you are online most of the day then you may have to recharge at least twice a day or carry a power bank handy. But for the battery back up the phone is very good with whatever specifics it comes with.",
            "date": "06 May 2015",
            "name": "beryl ernest",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought Moto G 2nd gen phone before 15 Day, and current time i have facing many Issues like Network drop issue, 3G connectivity issue.i have already Requested for replacement. The phone is good in this price, many user to get a good one.(one of my friends bought this phone during the initial sales and they never faced any issues). i think i got a used phone. PLEASE DON'T BUY IT.",
            "date": "06 May 2015",
            "name": "Mustak Ahmad",
            "stars": "1 star"
        },
        {
            "comment": "Overall mobile design, performance, battery etc. is good and its value for money from Motorola. As of now, not facing any problem of hanging, battery heating and so on.",
            "date": "06 May 2015",
            "name": "Suresh Badagi",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is an awesome phone with smooth screen and sufficient Ram and processor speed at this price level.. also I do not see and worthy alternative to this phone with any other trusted brands... its the best phone available in 11k.. i am giving 4 star only since I had to buy without discount..",
            "date": "06 May 2015",
            "name": "Vikash Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "The moto g2 display was problem within 30 days from receiving & using. There is no apps on the screen, only the blank screen ( like dark black colour).",
            "date": "06 May 2015",
            "name": "venugopal gopal",
            "stars": "2 stars"
        },
        {
            "comment": "I am using from last four days great experience with Moto G (2nd gen.) A game should be loaded inside the mobile in factory condition who is more attractive without loss of internet data in downloading of a gmaes.",
            "date": "06 May 2015",
            "name": "Ali",
            "stars": "5 stars"
        },
        {
            "comment": "I always prefer Flipkart when i opt online shopping, Because i've very good past experience with flipkart. Previously i've ordered MOTO G (first gen) den two MOTO G (second gen). They have very good service and i'm very much satisfied with their site as well as with their app (because its far easy to access than other online sites)",
            "date": "06 May 2015",
            "name": "anupam banerjee",
            "stars": "4 stars"
        },
        {
            "comment": "Poor Sound quality...it has been just 2 days....seems, to be some defect............................................................................................................................................................... disappointed",
            "date": "06 May 2015",
            "name": "Samir Bhatt",
            "stars": "1 star"
        },
        {
            "comment": "It is good product and camera clarity is awesome... battery back up is very low when you use gprs, if u dont use gprs then back up is ok.",
            "date": "06 May 2015",
            "name": "Sudhakar Rao T...",
            "stars": "5 stars"
        },
        {
            "comment": "Is loaded with the latest Android OS. The build quality is good and premium. If you are looking for a phone with ~5 inch display, good build quality, good camera(s), 16 GB ROM, No bloatware, from a trustable company(!) then look no further and buy this phone.",
            "date": "06 May 2015",
            "name": "Balachandran S",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I am using last two months this phone. Really good one. Lalipop 5.0.2 is really awesome. Everything is good comparing to other midrange mobiles. Flipkart delivery is in before on time.",
            "date": "06 May 2015",
            "name": "Jerald Regis",
            "stars": "4 stars"
        },
        {
            "comment": "worth for money..... go for it... motorola rockzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz.......................................................................................................",
            "date": "06 May 2015",
            "name": "santhosh msg",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart delivery service is really good. Got it within two business days. Phone has no problems.....come with pre installed lollipop.. smooth. Only negative aspect is bad quality earphones provided and no usb cable. But won't complain coz got such a beautiful phone for just 11k",
            "date": "06 May 2015",
            "name": "Kaushik Chakraborty",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome performance. Cool design. Fast android updates. Almost bare android. Snapdragon processor. What more can you ask for for this price?",
            "date": "06 May 2015",
            "name": "franjo",
            "stars": "5 stars"
        },
        {
            "comment": "Worst phone, it restarts very frequently and it is very very slow. I'll not suggest anyone to buy this phone.",
            "date": "06 May 2015",
            "name": "Ganesh",
            "stars": "1 star"
        },
        {
            "comment": "Moto G I used personal use. value of money. very good phone in budget. fast delivery from flipkart. camera clarity nice.",
            "date": "06 May 2015",
            "name": "Anwar",
            "stars": "5 stars"
        },
        {
            "comment": "WORTH THE MONEY Good phone...perfect display size...battery last long enough for me...12hrs full day use.... and excellent service by Flipkart :)",
            "date": "06 May 2015",
            "name": "Bharat J",
            "stars": "5 stars"
        },
        {
            "comment": "Looking is good and Performance is good ..while charing some heat is generate..................................................",
            "date": "06 May 2015",
            "name": "angadala chint...",
            "stars": "5 stars"
        },
        {
            "comment": "In this range this is the best you can have. Happy with the product but disappointed with the service. The delivery man was asking for bribe!! Can you believe it!!! Beware of them guys!! coming to the product. pros: 1. Good sound quality with dual speaker 2. Camera is awesome, front cam is also fine 3. Good hardware 4. Impressive design and UI 5. Sound clarity cons: 1. Battery could have been better 2. RAM could have been little much",
            "date": "06 May 2015",
            "name": "Saikat Guin",
            "stars": "4 stars"
        },
        {
            "comment": "I LIKE THE MOBILE A LOT. GOOD DISPLAY,POWER RETENTION, TOOLS, FEATURES ARE GREAT. NET RECEPTION AND SPEED ARE VERY GOOD. GOOD FOR WHATS AP, GOOGLE HANGOUTS. and 8 MP PRIMARY CAMERA COME WITH PICTURES ARE REAL AND WITH AWESOME ANDROID LOLLYPOP v5.0 OS",
            "date": "05 May 2015",
            "name": "Ramana KOLA",
            "stars": "5 stars"
        },
        {
            "comment": "AWESOME PHONE...........WITHOUT DOUBT YOU CAN GO FOR IT...............NO OTHER COMPETITOR AT THIS PRICE.............MOTOROLA ROCzzzzzzzzzzzzzzzzzzzzzzzzz",
            "date": "05 May 2015",
            "name": "SATHISH R",
            "stars": "5 stars"
        },
        {
            "comment": "Battery backup doesn't seems good. Battery Charging is fast. Good performance. ####################################### ####################################### ####################################### #######################################",
            "date": "05 May 2015",
            "name": "Joice Joseph",
            "stars": "4 stars"
        },
        {
            "comment": "I had been using this phone for last 5 months and I am having a great experience with Moto-G 2nd Generation. Its Android lollypop is very advanced and provides more features in O.S. The hardware is much durable and battery life is sufficient to support 3G internet browsing for 6-7 hours continuously. Camera clarity is excellent and the phone comes with a novel feature of continuous flash during video recording. Flipkart has an amazing delivery and customer service. To my surprise, after 5 days of my purchase I was informed by flipkart that I had been selected as one of the 100 lucky winners for full cash reward i.e. my cell phone was absolutely free!!! If you are really looking for a durable and advanced smart phone in a budget of 10-15K then MotoG is the right option. Lastly thanks to Flipkart for the Lucky Prize.",
            "date": "05 May 2015",
            "name": "Dr. Agrawal",
            "stars": "4 stars"
        },
        {
            "comment": "Product performance is good and satisfactory. Only problem is with the Power back up as it dry out in a day, if we are using internet (3G) or may last for max of 2 days.",
            "date": "05 May 2015",
            "name": "Manoj K Vemula",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is really awesome... Touch is amazing, speed is superb, sound quality is also good & rear camera too good. The only missing thing is data cable.",
            "date": "05 May 2015",
            "name": "Mrunal Gorad",
            "stars": "5 stars"
        },
        {
            "comment": "Its one of the best mobile in this price range. Been using it for more than 4 months..no issues observed..except they would have provided the USB adapter for charging.",
            "date": "05 May 2015",
            "name": "Amol Kharat",
            "stars": "5 stars"
        },
        {
            "comment": "I LIKE THE MOBILE A LOT. GOOD DISPLAY,POWER RETENTION, TOOLS, FEATURES ARE GREAT. NET RECEPTION AND SPEED ARE VERY GOOD. GOOD FOR WHATS AP, GOOGLE HANGOUTS. WOW .",
            "date": "05 May 2015",
            "name": "SREE KRISHNA V",
            "stars": "5 stars"
        },
        {
            "comment": "my box pack new mobile new charger not worck plz help me ne i am not satisfive plv caleck your prodec",
            "date": "05 May 2015",
            "name": "vijay bariya",
            "stars": "3 stars"
        },
        {
            "comment": "I have received product which was described by flipkart. nice to deal again with flipkart in future also.",
            "date": "05 May 2015",
            "name": "Rishi Karamwala",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is one my own favourite choice when it comes to Budget Phone. This phone is perfect combination of hardware and software configuration. The only drawback of this phone is not so noticeable such as battery is not so long lasting, slight heating problem but everything can be compromise in this price.",
            "date": "05 May 2015",
            "name": "manish sharan",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2nd gen is good but the seller sent defective product and box seal is not genuine its resealed, First time has bad experience with flipkart.",
            "date": "05 May 2015",
            "name": "Chandru",
            "stars": "1 star"
        },
        {
            "comment": "can't have better in this price band. only battery backup is somewhat on cons side else no complain. android lollypop, perfect camera, fabulous processor, nice touch, n upper market feel in just 12999. you can't ask for more as u get value for money n brand value too. motorola did it again.................",
            "date": "05 May 2015",
            "name": "dev arya",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G2ND GEN IS A WONDERFUL PHONE IN THIS PRICE RANGE . WHEN COMPARE TO OTHER BRANDS MOTO MAINTAINS PERFECT QUALITY WHAT THEY HAVE MENTIONED.",
            "date": "05 May 2015",
            "name": "jeevan k",
            "stars": "5 stars"
        },
        {
            "comment": "i receive this phone after 15 day of order, do not purchase this phone from flipkart, if you are going to pay instant then you can not get delivery soon , just purchase only COD, Do not pay by card or internet banking , i just contact with flipkart customer but i can't get perfect response, also gift packing is very bad , it's just flipkart marketing phone is gud bcz of google products Thanks to google & flipkart have to improve service otherwise they will be out of competition",
            "date": "05 May 2015",
            "name": "Dinesh Rabara",
            "stars": "1 star"
        },
        {
            "comment": "OK but little slow and in Mysore no authorized service center, if any problem no one response, spare also costly",
            "date": "05 May 2015",
            "name": "hemanth kumar N",
            "stars": "4 stars"
        },
        {
            "comment": "About delivery: Fast delivery by flipkart, thanks for it . About product: 100% genuine, as shown in image, good package. . good offer , got it for 10999. Thanks flipkart.",
            "date": "05 May 2015",
            "name": "Praveen Naik",
            "stars": "4 stars"
        },
        {
            "comment": "received a moto g2 damaged product, and placed the return request.. customer care guys called us and provided me the time slot for technical call from their end, but didnt receive any technical call on time and they scheduled multiple times and i explained the problem clearlyand followed their instructions to solve the issue, but the problem not yet solved, and wantedly they dragged the timelines to expire return policy(30 days). after that they simply informed me to contact service centre as the 30 days reurn policy was expired for my order. worst service by customer care and technical team. not at all happy. guys becarefull....",
            "date": "05 May 2015",
            "name": "shyamprasad balli",
            "stars": "1 star"
        },
        {
            "comment": "good packing with careful care of product. nice things is that we can track the place order. satifaction (cod) flipkart rrockzz bindas do onling shoping",
            "date": "05 May 2015",
            "name": "san",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this product for 6 months. It is working good. Great screen size and battery back is also good. Though charging is not good as other phones.",
            "date": "05 May 2015",
            "name": "Pankaj Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using it for the last 4-5 days and its working fine. Only concern is battery which does not last much if the internet is ON. Rest is fine. Response is good and smooth and lolipop update works nicely on this. Will update more after some days.",
            "date": "05 May 2015",
            "name": "Santanu",
            "stars": "4 stars"
        },
        {
            "comment": "Using it for more than 3 months. Value for money.Good piece. Battery in 3G mode is not good enough for day long use.",
            "date": "05 May 2015",
            "name": "Jayaraman",
            "stars": "5 stars"
        },
        {
            "comment": "Display : excellent Size : l x h ration very nice comfortable to handle Processer speed : Very nice,some what nice browsing i have compair with other standard mobile found motog is very nice and fast . RAM : no problem Handling grip : Thair is no problem excellent Battery backup : Everage not so bad not so good. Weight :All Motorola mobile comes in military grade so weight will be more .but can be handle.",
            "date": "05 May 2015",
            "name": "MAHENDRA VADGAMA",
            "stars": "5 stars"
        },
        {
            "comment": "I have Moto G (1st generation) and given to my sister and purchased this. Guys this is amazing mobile for the price tag. it is size of Nexus 5 and display quality and build quality is fantastic. I thought of buying china mobiles first but I took right decision to buy this.",
            "date": "05 May 2015",
            "name": "Abhilash Murar...",
            "stars": "5 stars"
        },
        {
            "comment": "All of us at home using the same phone ..... Good product and value for money. Ordered three phones however did not any loyalty discount. Flipkart should award the loyal customers.",
            "date": "05 May 2015",
            "name": "Avishkar Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone..Great ROI and great interface from flipkart to make things better..this is among the best brabded phones in this price bracket",
            "date": "05 May 2015",
            "name": "NIvesh",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone under Rs.12000. Much much better than phones of other big brands costing Rs 20000. Really value for money!!!!!",
            "date": "05 May 2015",
            "name": "Subodh Shinde",
            "stars": "5 stars"
        },
        {
            "comment": "it is a good purchase ,good camera quality,performance is good,only problem with this set it takes upto 3 hours to charge",
            "date": "05 May 2015",
            "name": "anonymous",
            "stars": "4 stars"
        },
        {
            "comment": "Good configuration for this price of 12K. Cons: * There is no USB cable. * Quality of the lock button & volume rocker is not so good. * Quality of headset is average. Pros: * Good resolution * Stylish design",
            "date": "05 May 2015",
            "name": "Ajith M A",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased the MOTO G mobile. It has lot of problems. I requested for replacement. But the customer care is not responding properly and without my permission they closed my return request.",
            "date": "04 May 2015",
            "name": "Rajesh S",
            "stars": "1 star"
        },
        {
            "comment": "Moto G(2nd Gen), I have bought this phone very recently. Performance and Quality are really good. Performance in really good. Good one at this price range. I like it.",
            "date": "04 May 2015",
            "name": "Muthu Krishnan",
            "stars": "5 stars"
        },
        {
            "comment": "Before buying this i used grand, and lg D686. UI is very poor programmed. lots of up gradation needed. 1thing i must say front camera is pretty good but battery performance is pathetic.",
            "date": "04 May 2015",
            "name": "Tridib Kumar Dey",
            "stars": "3 stars"
        },
        {
            "comment": "Very nice phone and pocket friendly with great features and huge screen size. The phone has a very fast processor which helps the phone to perform well without any hanging problem. In All great phone with great performance!!!! Keep it up !!!!",
            "date": "04 May 2015",
            "name": "Aadi...",
            "stars": "5 stars"
        },
        {
            "comment": "i was searching mobile under 10k .. in this budjut i have to go moto g2. and its satisfy me. but some drawbacks there. 1.BATTERY drains TOO FAST because its working on lollipop o.s, and only 2070 Mah battery....; 2.mobile is on charging,and using mobile data iam facing little bit heating issue.. WORTH money i think.....",
            "date": "04 May 2015",
            "name": "krishna chaitanya...",
            "stars": "4 stars"
        },
        {
            "comment": "very much satisfied with this mobile! awesome touch ! no problems with the battery,multitasking.Display is awesome.Easy to use with one hand. Best buy for the price tag",
            "date": "04 May 2015",
            "name": "Vamshi",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered 2 moto g's one is working fine, but the other one came with both sim slots broken I am still waiting for Flipkart to contact me despite calling their customer service number 3 times. This is actually pretty bad since motorola is only available via flipkart (The rating is not for the phone, but for the entire ordering/getting broken item and then having to wait)",
            "date": "04 May 2015",
            "name": "Rohit Kapur",
            "stars": "1 star"
        },
        {
            "comment": "I have used this product now over 3 months and it works well just that i noticed a few lag during gameplay that is because of the 1 GB ram.Battery backup is fine lasts a day with moderate usage & i just dont like the fact that it takes almost 3 hours to charge from 0 to 100%. Overall its a great product from Motorola.",
            "date": "04 May 2015",
            "name": "Paresh Padhy",
            "stars": "4 stars"
        },
        {
            "comment": "This is really outrageous that once flipkart delivered me the defected product which was having too much heating issue and now the piece which have been delivered to me after replacement is a piece of junk. I am trying to download various apps from google store. but this is not being completed. i have tried this on Wi-fi as well as on 3G connectivity. this is now really not acceptable. I don't want this piece of junk and i don't want any replacement. I want the refund of my money. The Moto G delivered by flipkartis not worth even a single Rupee.",
            "date": "04 May 2015",
            "name": "ANAND KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "reached all my expectations,the awestruck element are itz weight and rear cam....... only con in my view is the battery,,itz just 2070 mah",
            "date": "04 May 2015",
            "name": "Deepak katchi",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered Moto G 2nd gen, i received 1 but with a faulty charger, phone was not getting charged, i placed the replacement over the website, i got a message from flipkart stating that they will contact me by May 2nd by 3:00Pm, no one cared to call me, i callback they said i have to wait for the call from the technical team. I called flipkart next day then they said i will get a call within 4 hours, again no called, then i called them again n fortunately i got to speak to someone in technical team, and that guy was giving me gyan, i told him that i have tried using different chargers, but the phone is not taking the charge but that stubborn guy kept on saying go to your home call me i will help you bloody i told him it is the hardware issue how can u help me by telling me the settings. than at last i spoke to his Team leader and thank god that guy had some brains and understood my pain and processed the request for the replacement which will reach me bu May 8th. i paid 10days back and still i do not have the working phone with me. Pathetic Experience with Flipkart . Not at all a customer centric company",
            "date": "04 May 2015",
            "name": "Manish Gupta",
            "stars": "1 star"
        },
        {
            "comment": "It is a good product only for 10000 Rs.Because battery backup is not satisfactory at all.Lots of application are there.So battery backup facility should be Enhance.Camera(both still & vedio) are superb.Overall You can enjoy the product. Flipcart should not pressurize the customer to save there card details.It should be optional.",
            "date": "04 May 2015",
            "name": "Arindam Bhattacharya",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered MOTO G 2nd gen . After 5 days, got the phone which was not detecting the SIMs . After contacting customer care they did all type of trouble shooting by phone..taking all my balance and time. Told to download a software..when i was unable to load any sim to it..it really sucks.. After 10 days when requested to refund ..if they cant replace in time..same recorded messsage after long phone holds by customer care ..\" sir we are extremely sorry..and you will get update in 24 hrs ..now its 14 days ..extending the date of delivery and still with the defective peice... will go to consumer forum with this ... it sucks really ..advice to not to go for flipkart ..rather go for other sites .",
            "date": "04 May 2015",
            "name": "himanshu acharya",
            "stars": "1 star"
        },
        {
            "comment": "Good Phone but last just a day...less battery life.. Looks not that great...but its ok for its price range",
            "date": "04 May 2015",
            "name": "Prasanna Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "we just brought the mobile by believing that the flipkart is a good authenticate and genuine seller. But even iit will just escape when we have any trouble with the device and just wait to cross the 30days replacement period after which they are not responsible. Anyway its the best mobile ever had.",
            "date": "04 May 2015",
            "name": "vamshi krishna",
            "stars": "5 stars"
        },
        {
            "comment": "Satisfied with purchase from flipkart Great Deal recommended.... A++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++",
            "date": "04 May 2015",
            "name": "Nitin Bhalekar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the phone recently for 9899 rs. Its worth buying. Everything is awesome except the battery . Its taking almost 2.5 to 3hrs to full charge which is very bad. Also the battery will drain out in 6 to 7 hours if you use Internet.",
            "date": "04 May 2015",
            "name": "Venkat",
            "stars": "4 stars"
        },
        {
            "comment": "i had bought motto G2 1 month ago i found my battery get drained quickly after 15 days i requested to replace this phone but these people rejected my request and said that our software does'nt show that your phone has any kind of problem. so we wont replace.. these people are looting by selling faulted piece.",
            "date": "04 May 2015",
            "name": "Parth Patel",
            "stars": "1 star"
        },
        {
            "comment": "Very good phone! I have bought 3 of them for my family members. It has decent camera clarity, it doesn't hang much and also, the performance is good.",
            "date": "04 May 2015",
            "name": "Monica Tarwani",
            "stars": "4 stars"
        },
        {
            "comment": "Its being 6 months i am using this, no problem till now had a awsme phone, nice features with luving camera which is beating most brands, on this price budget. thanx to flipkart to give me worth of money......",
            "date": "04 May 2015",
            "name": "Yogesh boyal",
            "stars": "5 stars"
        },
        {
            "comment": "display is of poor quality, it will break in first drop itself. Even Karbonn mobiles can bear handful of drops.",
            "date": "04 May 2015",
            "name": "Divyashree",
            "stars": "1 star"
        },
        {
            "comment": "Hi WS Retail....... The product quality is very good....I have always trusted on you, for receiving good quality of product....highly recommended seller........giving very quick delivery..... I am always ready to purchase good quality products blindly from you....Thanks .....",
            "date": "04 May 2015",
            "name": "SANDIP GHANWAT",
            "stars": "5 stars"
        },
        {
            "comment": "Shape of the phone is very nice... Display quality is superb , processing & touch as also excellent...If you want to purchase it wait for sale.... you can get it in lesser price..",
            "date": "04 May 2015",
            "name": "Abdulla Ahmed",
            "stars": "5 stars"
        },
        {
            "comment": "phone has battery problem. & new phone lags too much.within 2 days of purchase battery drains in 2 hrs only.",
            "date": "04 May 2015",
            "name": "Rahul Singh",
            "stars": "1 star"
        },
        {
            "comment": "Was delivered on scheduled day. but it was never informed about the delivery time on the day of delivery and it came all of a sudden and the product was not delivered and due to unavailability of anyone to receive it. later with few arguments and delivery was arranged with in the same day..",
            "date": "03 May 2015",
            "name": "Kaustubh Maurya",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart service has come down... the charger came along with Moto G was not working. I raised a complaint to replace it.. It has been two months now, still they are replacing the charger.. Phone is a good buy.. But not sure whether Flipkart expects me to use the phone without a charger Rating for Flipkart service, phone charger and not for the phone as such.",
            "date": "03 May 2015",
            "name": "Hari Durai",
            "stars": "1 star"
        },
        {
            "comment": "delivery was not good at all. currier guy was not at all co-operative. not seen this kind of service anywhere. going forward will not order anything on flipcart.",
            "date": "03 May 2015",
            "name": "satish amrutwar",
            "stars": "2 stars"
        },
        {
            "comment": "Best phone i hv used undr this range. fully loaded,latest android,speakers are pretty loud,beautiful stylish design feels grt in hands.i will request for all others to bye one!!!",
            "date": "03 May 2015",
            "name": "Vivek",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is great, good looking, powerful hardware and clear sharp display. One thing about it's that the Security level of the phone is very high, which is usable too much. After all the thing i realized that the battery backup should be more. It's simply amazing...",
            "date": "03 May 2015",
            "name": "VISHAL SHARMA",
            "stars": "4 stars"
        }
    ]
}
