{
    "filpkart": [
        {
            "comment": "Just received the Moto G and i am not satisfied with the quality, it is an defective one. As small dots like stars are blinking at the bottom line and not at all satisfied. I called their customer care for the replacement but their response is worst.................",
            "date": "30 Oct 2014",
            "name": "P KANDA SAMY",
            "stars": "1 star"
        },
        {
            "comment": "The 'silence' functionality under the Avoid Interruptions' doesn't work. I think this is a serious flaw since being able to silence the phone is a very basic feature even in old-fashioned phones! A query related to accessories - how come you don't have a back grip cover for this phone?",
            "date": "30 Oct 2014",
            "name": "Saju Abraham",
            "stars": "3 stars"
        },
        {
            "comment": "Guarenteed to get the latest version of Android OS everytime when a new update is available. Runs Pure Android without any unnecessary mods and bloats done by other manufacturers like Samsung, Sony, HTC, etc. Coz of this, Moto G and G2 receives updates directly from Google, like the Nexus, Android One and Google Play Edition series of phones. As Moto G, G2, E and X are focussed on India and other 3rd world countries, it gives better Value for Money for Indian buyers compared to other non-Indian phone manufacturers.",
            "date": "30 Oct 2014",
            "name": "Rohan Philip",
            "stars": "5 stars"
        },
        {
            "comment": "i bought an moto g2 on 23 of October and in that there are some two ,three areas have dead pixels in the display don't buy this mobile my hard earn money is waste and i call to customer care they are not responding well they will say that you will get the replace by 4 to 5 working days and again they will ask for another 4 to 5 days total of 10 days to replace the product waste to time and money and i also suggest my friends also do not buy this product from flipkart i see almost 600 people have given 1 star and write the review of there problem so almost 600 people have affected by this including me god save me my hard earn money 12999",
            "date": "30 Oct 2014",
            "name": "chaitanya kvn",
            "stars": "1 star"
        },
        {
            "comment": "Awesome delivery by flip kart. Moto g2 is awesome in all aspects, but while zooming picture quality is not good this is the only cons which I could notice Those who have a budget of 10000 - 16000 go ahead and buy moto g,either spend extra upto 3000 or save upto 3000.",
            "date": "30 Oct 2014",
            "name": "Jai Ganesan N",
            "stars": "4 stars"
        },
        {
            "comment": "The product was awsoome it was delivered in time thanks to flipkart. The product stood to the reviews given by all the product testers and am happy for the purchase.",
            "date": "30 Oct 2014",
            "name": "EDWARD DIAS",
            "stars": "5 stars"
        },
        {
            "comment": "I received this phone from Flipkart within 3 days and that indeed is a delight. About the phone, arguably the best in its class and the pricing is very good. It is extremely easy to use and integrated Google, that makes life easy. My usage is limited to phone, email and a couple of basic apps like LinkedIn, Facebook, twitter etc. and they work flawlessly. Regarding charger, it would've been better had they also given the USB charger in addition to the electric one. Other than this, no complaints at all!",
            "date": "30 Oct 2014",
            "name": "Harsha Ramakri...",
            "stars": "4 stars"
        },
        {
            "comment": "The product is comparably good when compared to branded products available at this price. The product would've been GREAT & AWESOME (would've been everything anyone ever needed in a smartphone) if the following could be upgraded. >Primary camera 10 MP or above instead of 8MP avl. >Secondary camera 5 MP instead of 2 MP avl. >RAM....1.5 or above instead of 1 avl. >Expandable memory...64GB instead of 32 GB avl. >Battery.....min. 2500 or above.....currently it's low.",
            "date": "30 Oct 2014",
            "name": "JOY BANERJEE",
            "stars": "4 stars"
        },
        {
            "comment": "Guys just beware of my experience i faced. I have booked this Moto g with 10 % discount of SBI. After one week they them self cancelled the order and initiated my fund back with any intimation. After that they have sent an email saying unable to deliver the product to my pin code mentioned. Sorry for inconvenience. But why did they accepted order before?? Lesson : Don't believe this Indian Flipkart totally.",
            "date": "30 Oct 2014",
            "name": "Joshua Paul Me...",
            "stars": "1 star"
        },
        {
            "comment": "Ordered Moto G (1st Gen) in August but faced endless problems, so returned it and finally took 2nd Gen. After using 30 days i conclude: Minus- 1. Battery (Yes, all that u have heard about battery is absolutely correct) Have to charge it minimum 2 times a day. Hoping that ANDROID L solves the issue to a bearable extent. 2. Accessories are priced as if they have included an element of gold in them. 3. If u use a high ended app for 20 minutes and return to screen, it freezes for 5 sec. 4. Screen was much better in former model. 5. 80% of your RAM is consumed in default operations Plus- 1. Ultimate Android experience for 13000 bucks (believe me google services like map, etc cannot be enjoyed better in any other phone of this category) 2. Two mics solves the call quality issues 3. Cam has been drastically improved. 4. Screen size and icons looks way better than former model. 5. SD Card, speakers, etc are all good as specified in earlier reviews. So all in all, have a power bank and welcome to a whole new world of android",
            "date": "30 Oct 2014",
            "name": "Vivek Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "Got the phone from Flipkart. While the phone was good for a few days, it went dead one fine day. The phone is not working at all and the Motorola customer care asked to get it replaced by Flipkart. While there are no guarantees with electronics these days, but a lot of my friends have had issues with Motorola phones bought on flipkart. Probably the QA team at motorola India is not doing thorough checks on the phone and the service centre folks sound like lame ducks have no experience in hardware/software or a clue of what the problem is. Hopefully flipkart solves the problem soon!",
            "date": "30 Oct 2014",
            "name": "Sahil Jain",
            "stars": "1 star"
        },
        {
            "comment": "MOTO G 2 Contain with all good features but the battery is not even stand for one day. Charging battery will take 5 to 6 hrs to but not even stands for one day.Please upgrade your version with good battery .",
            "date": "30 Oct 2014",
            "name": "Dhivyan",
            "stars": "2 stars"
        },
        {
            "comment": "Very fast delivery by Flipkart Good camera Nice built quality Very good Display Bit of overheating during gaming, besides that best phone",
            "date": "30 Oct 2014",
            "name": "Midhun M",
            "stars": "5 stars"
        },
        {
            "comment": "It lags a bit. The reason being they have provided expandable storage, so the RAM isn't able to cope up with the output we require. Other than that my dad hasn't complained about anything.",
            "date": "30 Oct 2014",
            "name": "Manan Shah",
            "stars": "4 stars"
        },
        {
            "comment": "After using both first generation and second gen Moto G, i am writing this review. Sound quality: Moto G first gen. has better sound quality than second gen. both speakers are in front but for calling purpose sound in second gen. is louder than first gen . Camera quality : Moto G (2nd gen) beats the first gen by a good margin. Pixel density in Moto G (1st gen)-324ppi and in @nd gen... 294 ppi, but it doesnt make any difference. Design: Both are well designed but 1st gen is easy to grip and has better back finish. Volume and lock keys in second gen is not so comfortable to use as in 1st gen. Battery: Moto G (1st gen) has enough battery capacity according to its screen size but second generation is not upto mark @2070mah... it should have 2500 mah atleast. Touch: 2nd gen has smooth touch experience as compared to 1st gen. Overall both are good at their price point and its upto u that you want to use a 4.5 inch screen or 5 inch.",
            "date": "30 Oct 2014",
            "name": "saurav kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone for about 15 days..till now no no issues..i was worried about the battery at first, but it really surprised me. It lasts all day. Best phone ,best UI at this price",
            "date": "30 Oct 2014",
            "name": "Jaison Geevarghes...",
            "stars": "5 stars"
        },
        {
            "comment": "Good with internal storage of 16 gb, as compared to the price the performance of the cell is good..coming to the cam clarity is not good it must be some what better....",
            "date": "30 Oct 2014",
            "name": "Sai Kshirasagar",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile looks cool with 5 inch screen. I didn't like two speakers on the front but sound is very clear. Awesome mobile at superb price. Go for it..",
            "date": "30 Oct 2014",
            "name": "Prashanth Shinde",
            "stars": "5 stars"
        },
        {
            "comment": "MY FIRST REVIEW .... I never have shopped through flipkart, but as i want this phone i ordered MOTO G 2nd gen. through flipkart. It was delivered on the 4th day. Packing was good and product was seal packed very well. Motorola G 2nd is a great phone ,i realized after seeing the phone, nice build, and beautifully finished. It has 2 speakers one at the level of hearing( as usual) and other is at microphone level(which creates dual stereo). after using it for a day, i can strongly recommend this over zenfone5, mi3 . battery last for a day on continuous usage which i suppose is good. overall an awesome phone !!!",
            "date": "30 Oct 2014",
            "name": "Nikhil Shrivastava",
            "stars": "5 stars"
        },
        {
            "comment": "As usual superb delivery from Flipkart. Everything else fine except battery life and heat generated due to continuous use.",
            "date": "30 Oct 2014",
            "name": "Animesh Dutta",
            "stars": "4 stars"
        },
        {
            "comment": "Best Phone for the Price with Brand Name... (Motorola).. :) go for it...as no one will give u the latest android update and experience....",
            "date": "30 Oct 2014",
            "name": "Ramesh S. Karki",
            "stars": "5 stars"
        },
        {
            "comment": "i am really disappointed with MOTO G Battery Back up apart from that its good one, no hanging problem good display, sound quality also good. but its all about battery it runs only 6 hrs after charging for 3 hrs.",
            "date": "30 Oct 2014",
            "name": "Dilesh",
            "stars": "3 stars"
        },
        {
            "comment": "I am writing this review after using this handset for 1.5 months. 1st of all, kudos to Flipkart for their fast service and seriously some ultra tight packing. Now coming to the handset from Motorola. The handset looks amazing with it's 5 inch screen and dual front speakers grille. The rear finish looks good with the 8MP Cam, Flash and Moto Logo(with a slight dip) that feels good on touch and feel. Feels good, a tad heavy, when held. Build quality is good and sturdy. Under the hood. Well, I would say I am actually a bit disappointed with the specs provided. RAM configuration, Processor and Graphics all are the same as the 1st Gen handset. They should have been upgraded a bit. The screen size has been increased, and it does consumes the battery a bit more. This is till now the biggest disappointment in this handset. I don't have any games nor heavy apps. I use watsapp and zomato apps. Without doing anything extra and lowest level of brightness, playing no games(strictly), gps settings switched off always battery back up is mere 1.5days. Think if you have much more apps and games, it will drain down the battery within less than half a day. You can watch few videos in youtube and check the battery level. Performance: There are lags, yes. i have been facing lagging issues. It takes time to switch from apps to main screen, or even a worst experience I would say is, it hanged few times and the phone system froze. I had to restart the device. A big improvement needs in this section if Moto wants to go ahead with this series. Sound quality is good in the speakers, if you have a good headset/headphone, it does pretty good. Default Moto headsets provided are waste. Display is crisp and clear. Touch is responsive but again sometimes lagging interferes. Rear and Front CAM quality is pretty nice. Pic editing options are nice. You can also download Google Cam app for better enhancements. Call quality is good. Till now I didn't found any call drops. No extra bloatware. Some good apps are pre-installed from Motorola that are helpful. Build: 4/5 Cam: 3.5/5 Performance: 3/5 (Even though lagging issues are there) Battery backup: 2.5/5 (Should have been increased to atleast 2500 mAH from 2070) Sound: 4/5 Display: 3.5/5 Call quality: 3.5/5 UI response: 3/5 NB: I am not comparing this handset(except Moto G 1st Gen) with any other company made handset. You will get phones acc to your budget",
            "date": "30 Oct 2014",
            "name": "Subham Sonar",
            "stars": "4 stars"
        },
        {
            "comment": "first of all a good job done by flipkart for deliviring the phone so early. Coming to the phone, google did a good job by bringing a robust phone for a reasonable price The looks are good,camera's fine and the stock android ui is a joy. All in all moto g is good phone which adapts to the Indian market very well. If you want to buy this phone go for it but if u have a doubt have a look on the asus zenfone once. I hope this review helps.",
            "date": "30 Oct 2014",
            "name": "Kunal Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Overall great performence by moto g.good picture quality of camera.good looking and slim phone.I suggest to buy this phone.actualy which we need all those things is available in this phone.",
            "date": "30 Oct 2014",
            "name": "Sudipto Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is exceptional except battery Back up....I am fully satisfied with moto g2.Nice mobile according to price.its picture quality ,sound quality also good .Overall motto g2 is very good mobiles in its price.Its a value for money.",
            "date": "30 Oct 2014",
            "name": "Rams",
            "stars": "4 stars"
        },
        {
            "comment": "Hello people, I don't know y people out there r saying DAT dis phn has battery problem. I don't find any problems in battery in fact this phone is awesome at this price. Camera quality,touch sensation, and alert.assist and help app are its best for features. I thank FLIPKART for delivering this product before time as I requested them. Love to shop at FLIPKART.Good luck Hello Moto........",
            "date": "30 Oct 2014",
            "name": "SHASHANK BARANWAL",
            "stars": "5 stars"
        },
        {
            "comment": "The stock android makes you feel like that youre using nexus 5 . The interface is so similar to nexus 5 and smooth . This phone makes you fall in love very smooth UI awesome battery back up .",
            "date": "30 Oct 2014",
            "name": "Sudesh Gangadhar",
            "stars": "5 stars"
        },
        {
            "comment": "Its been a week I bought this phone, the only problem is battery... its getting drained very fast... not even one complete day... I'll have to carry the charger along with me all the time... rest all about the phone is fine I can say... If the same problem (battery) continues, I don't know how that can be rectified.",
            "date": "30 Oct 2014",
            "name": "harsha lingareddy",
            "stars": "3 stars"
        },
        {
            "comment": "Sufficient memory and processor for this mobile. Good clarity of camera with 8MP. Secondary camera also very useful for Skype. Very fast processing with applications. @One minus is data USB cable is not available with pack.",
            "date": "30 Oct 2014",
            "name": "KANNAN BALASUB...",
            "stars": "5 stars"
        },
        {
            "comment": "processor is speedy camera quality is nice good phone at this price should work on speaker audio quality no so fine else a nice phone",
            "date": "30 Oct 2014",
            "name": "Sam",
            "stars": "4 stars"
        },
        {
            "comment": "More than 1 month i searched so many Sites to find the Budget as well as Stylish Smartphone. Finally I Found Moto G (2nd Generation) is the Best Choice. This Phone is the cheapest one as compare to other brands with same Features. Pros: Display, Design, Sound, Speed, Memory, Dual Sim, Etc.... Cons: Decent battery Backup for Single day use (24hrs).",
            "date": "30 Oct 2014",
            "name": "Ramachandran K",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g and Moto G2 both mobile are very good. from my side both mobile 5 star. Best deal............................",
            "date": "30 Oct 2014",
            "name": "Girish Acharya",
            "stars": "5 stars"
        },
        {
            "comment": "when i opened the box and saw my phone...really awesome experience..look wise,performance wise..very good phone..display is really good...it's battery lasts only for one day..and if you use heavily then will have to charge two times a day.. overall MOTO G is awesome...",
            "date": "30 Oct 2014",
            "name": "gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "the new moto g has become better in features and performance than the the older version,i love this new moto g 2nd gen",
            "date": "30 Oct 2014",
            "name": "Himanshu Salhotra",
            "stars": "4 stars"
        },
        {
            "comment": "Splendid delivery! I got it within 2 days of ordering. Oh did I say 2 days? I meant 2 weeks. Two. Frikking. Weeks. One good thing I learned out of the countless messages I sent to Flipkart asking them what order status was that these folks respond FAST. I'm not saying the responses are particularly helpful, it's just good knowing that these people do give some damn. On to the product review.. Honestly, the only problem I found with the device was the fact that the notification light ONLY GLOWS in one color, white. This is not something that can be fixed by software modifications(sorry, rooters). Camera quality is sweet, Well, at least in well lighted conditions. Front camera is also decent enough to show all the ugly pimples in your face. Again, in well lighted conditions. The stock launcher is clean and fast. There's a catch though. You can't add any new pages in the homescreen. No biggie. Battery life is average-ish. I know a lot of people are complaining about the display and the ppi and all... but it's really not that bad. I'm not really a techno-enthusiast, i don't spend a whole lot of time comparing different phones and all, so maybe it's just me. But I really love the display. Keyboard. Keyboard has a noticable lag sometimes while using certain applications. It does disappear after some time, so that's kewl. The body is elegant. I mean, I'm holding this big-a** phone in my hand, and I'm telling myself I can't believe I bought it just for 13000 INR. So final verdict. If your budget allows it, buy it.",
            "date": "30 Oct 2014",
            "name": "Manu V",
            "stars": "4 stars"
        },
        {
            "comment": "It is really amazing phone. the amount you will paid for this phone it will definetely give you the better feature in comparison to other phone in that range.",
            "date": "30 Oct 2014",
            "name": "Kishan Sonkar",
            "stars": "5 stars"
        },
        {
            "comment": "HAPPY CUSTOMER :).......................................................................................................................",
            "date": "29 Oct 2014",
            "name": "Dr. Ekta Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome phone. A very good phone by motorola .It is very fast,processor is very good and so is the display. The LCD display does a very very very gud job.The camera is also nice but could have been better.The storage is also very good .All in all a very good phone in this range.",
            "date": "29 Oct 2014",
            "name": "Abhishek Naithani",
            "stars": "5 stars"
        },
        {
            "comment": "This handset is the same as Moto G 1st gen, except for a marginally bigger screen and front sterio speakers. And of course a little better camera. I got this so that I can receive latest Android updates for a pure Android experience. Or else could have gone for other cheaper and perhaps better phones like Xiaomi Redmi 1S or even Huawei Holly. But then they have customised Android and resptricted updates. 1GB RAM instead of 1GB would have added a little more value to this handset. It doesn't lags or hangs, but almost 80-85% of RAM is always consumed in running apps and system files in the background. Battery life hasn't impressed me much. Its just an average one. But a OK OK phone actually. I am quite happy though. So, if you are looking for the purest android experience and gauranteed future updates, then go for it.",
            "date": "29 Oct 2014",
            "name": "Anil Kumar Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g phone is simply superb.at this price point...but not go for white just buy black color.flipkart always rockz",
            "date": "29 Oct 2014",
            "name": "Dinesh Shanmug...",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered Moto g 2nd generation and received defective peace.I think flipkart is losing its standard.",
            "date": "29 Oct 2014",
            "name": "S Singh",
            "stars": "1 star"
        },
        {
            "comment": "SOUND (SPEAKER)- EXCELLENT SOUND(HEADPHONE)- AVERAGE CAMERA (PRIMARY)- VERY GOOD CAMERA(FRONT)- EXCELLENT INTERNET & APPS- VERY GOOD DISPLAY AND VIEW- EXCELLENT VIDEO - EXCELLENT DOCUMENTS -VERY GOOD BATTERY - VERY GOOD TOUCH- GOOD SENSOR - VERY EXCELLENT Overall the Motorola device is a complete smartphone surprisingly in just 12999/-.Anybody can collect it without any doubt.",
            "date": "29 Oct 2014",
            "name": "Mizanur Rahaman",
            "stars": "2 stars"
        },
        {
            "comment": "Awesome phone .looking very good and nice battery backup .some issues regarding his camera quality but not bad.I suggest people to buy this phone .ear phone is not so much good like HTC Sony and Samsung .this phone is regarding his battery. In this price this is a very good phone.",
            "date": "29 Oct 2014",
            "name": "Pkkkkk kk",
            "stars": "4 stars"
        },
        {
            "comment": "Worst service by flipkart..i received damaged product. There is an unbearable white patch on display screen and disturbed sound while making calls. I have requested 3 times to customer care for replacement but they rejected everytime.i have never paid flipkart for damaged product. order id OD201068260956328000, seller-WS retail order date- 20 oct, 2014 delivery date-24 oct,2014 return file- 25 oct, 2014",
            "date": "29 Oct 2014",
            "name": "Shikha Verma",
            "stars": "1 star"
        },
        {
            "comment": "Hello All, First of all Thanks to Flipkart for delivering so quick.Second, regarding the product fault dont just blame Flipkart as even they don't know what's inside the box.This is my fourth handset buying with Flipkart and the very first time was dissapointed with the delivery after using it , firstly with the brand and secondly with Flipkart as anyone would be for delivering such piece and thinking why me.I fond the product in faulty stage as one sim slot was not working but still Flipkart replaced the product with a brand new box pack,still after using 25 days, so thanks once again.When Flipkart says 30 days replacement guaranty they do. I bought this product after doing extensive research and comparison between several brands online. Now about the product review.I am using the product now from almost past 1 month and the review is based upon that. PRO'S: OS : Kitkat latest version Display : HD.Delivered what they said. Screen : Goriilla Glass.I used almost 15 days without any screen-guard but still couldn't find any scratch on the screen but It doesn't mean MOTO G doesn't need screen guard. WiFi : Signal Strength is too good.I was still able to connect to my wifi router when other devices failed to coonect at that range. Design : Feels good in hand. Camera : Does what it says.Takes quality pictures Speed; I didn't had issue till now opening 5-6 apps at the same time regardless of apps or games or anything. Network : Though its a dual sim phone, till now no issues with the network or call dropping. SIM Selection : You have an option for calling from one sim and sending messages and using data network from other sim.Even you have option for ask evrytime.But keep in mind that when you use one sim while talking or calling your other sim becomes unreachable. Battery: It gives better performance even i use it with full performance.But still u need to charge it after heavy use of 6-7 hrs. of callings,gamings and all other stuffs.If you use it only for calling 10-12 hrs. you will get at least with some percentage left. Sound Quality : Good whether its in call or listening songs(though dual speakers but you will not find much difference) Moto Assist : behaves as you behave.if you are in meetings set it and will not get disturbance...if you are sleeping set it will not disturb your sleep and other options. CON'S Headphone : Included headphone doesn't provide what expected.Sounds are low and you barely hear or listen anything except if luckily you are alone.When i use my other headphones like samsung tab's it sounds great.But you can't expect much at this price range. Features : If you are used to of Samsung user or any other brands you will find it with less features.It will take some time to used to all features of MOTO G and sometimes you might feel it was so easy to find in other devices.It doesnt mean it make it lesser than any other brand. Battery : Sometimes it might disappoint you when you are really in need.So better keep charger with you all the time as backup and also try not to use so much of apps and features which are not needed. Sim Slots : Micro Sims.If you don't have micro sim before buying or placing order please arrange it before.Or else you might have to cut you sims or have to use sim adapters which are not much of helpful. This review is based upon 28 days of using using now.If i will come to know anything which are needed to tell, will surely update.But till now, not all but almost Motorola has delivered what they are saying.Till then, if anyone who is looking for any smartphone at this price range i would really recommend it to anyone.",
            "date": "29 Oct 2014",
            "name": "Vineet Ranjan",
            "stars": "4 stars"
        },
        {
            "comment": "It's really nice mobile phone and worth to buy. At this price there is no other choice. I am happy with my mobile. Flipkart is very good in commitment.",
            "date": "29 Oct 2014",
            "name": "Shahid Jameel",
            "stars": "5 stars"
        },
        {
            "comment": "its my fourth moto g in family and the first 2nd generation moto g too. no flaws as usual so same review as my previous one. but one suggestion for moto makers, in their next launch they should increase ppi density as the screen has gone bigger and infact thebbattery too. as my moto g first gen is more brighter than moto g second gen. the battery obviously will also be used up with large screen so next time more boosted juice. leave reviews buy it to experience nd u will know why this beast is still much better than many of korean poops. at last about flipkart delivery...these people surprise everytime as it was to be delivered by November 4th bt i talked on 13th october before ordering tht its for my wife on birthday so i want on or before 24th october...they just said...sir u just order nd leave rest with us...i received it on 21st october on dhanteras...rather than supporting some foreign website i support indian company and they deserve it....",
            "date": "29 Oct 2014",
            "name": "vineet",
            "stars": "5 stars"
        },
        {
            "comment": "It's a very good mobile to avail for 13,000/-..I am very much impressed with all the options and features in Moto G2...Really a very good mobile to use.",
            "date": "29 Oct 2014",
            "name": "Konanki Hareesh",
            "stars": "4 stars"
        },
        {
            "comment": "I got everything I wanted within my budget. Very fast phone, camera is good. There is no con in this phone. Nice phone. So, close your eyes and buy it.",
            "date": "29 Oct 2014",
            "name": "Gurjeet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Just one word...Extraordinary.Great phone with great features.Friendly use.Great companion for me.Waiting for the Next Motto's.",
            "date": "29 Oct 2014",
            "name": "Sumeet Sudhir...",
            "stars": "5 stars"
        },
        {
            "comment": "I am fully satisfied with moto g2.Nice mobile according to price.its picture quality ,sound quality also good .Overall motto g2 is very good mobiles in its price.Its a value for money.",
            "date": "29 Oct 2014",
            "name": "jogeswar pasayat",
            "stars": "5 stars"
        },
        {
            "comment": "Great Phone.! Timely Delivery.! Getting full day battery backup on normal use with wifi, 15-20 calls, youtube usage and gaming. No heating issues till now. Has also got a very good build quality. No bundled usb cable is a bummer. Bundled earphones are a bummer!. Got the delivery with perfect packing. Overall Experience : Impressed!",
            "date": "29 Oct 2014",
            "name": "Sachin A B",
            "stars": "5 stars"
        },
        {
            "comment": "Likes - 1. Big Screen and resolution is very good 2. Fast responsive 3. Speaker is fantastic Could have been better- 1. Front camera resolution 2. Back cover is not so appealing",
            "date": "29 Oct 2014",
            "name": "Mainak Aich",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, I was very excited to buy this mobile got delivery 4 days before. friends I am entrepreneur and having heavy use of business tools like Mail, quick office and many more in short having heavy use of Internet. all the features are very good and useful except battery back-up. if your heavy use if net then you need to charge battery 3 times in day is only a drawback. other wise phone is awesome. Regards, Sachin",
            "date": "29 Oct 2014",
            "name": "Sachin Farfad...",
            "stars": "3 stars"
        },
        {
            "comment": "it is a best phone ever in this price range battery backup is good cemera qulity is also good overall a best deal for this price",
            "date": "29 Oct 2014",
            "name": "Amit Chaudhary",
            "stars": "5 stars"
        },
        {
            "comment": "Touch sense are good, very responsive, Over all value for money. Small concern is camera, when you take still most of the time blurred image is the outcome. Except that a good phone.",
            "date": "29 Oct 2014",
            "name": "Jebastin",
            "stars": "4 stars"
        },
        {
            "comment": "MotoG2 is an excelled device both in Hardware and Software area. It has super smooth touch and great response to the touch screen",
            "date": "29 Oct 2014",
            "name": "Ashish Wadhawan",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased and replaced this product 3 times from flipkart. Here are the issues, First time: Micro SIM slot not working Second time: Camera issue. Third time: Both the SIM card slots are not working My recommendation: I am not sure this is the issue with Motorola Moto G 2nd gen phone itself or is this issue with WS retailer who is sending defective product to flipkart. It is always suggested to purchase phone from the shop rather than online.",
            "date": "29 Oct 2014",
            "name": "RAJARAMA MAYYA M",
            "stars": "1 star"
        },
        {
            "comment": "The only thing which Motorola lack in this phone is the thickness should be less near to 7-8 mm. Rest everything is fine.",
            "date": "29 Oct 2014",
            "name": "Sumit Patil",
            "stars": "4 stars"
        },
        {
            "comment": "First of all, Thanks a ton to flipkart for a lightning fast delivery.Very much satisfied with the delivery and ease of track of my product. About the MOTO G2 , I was previously using HTC ONE which was for 34K and had mind blowing features. This time my budget was low and i was looking for the same feature as HTC one . I ordered this phone i was quite nervous but after using MOTO G2 i cant find any difference between these 2. MOTO G2 is such a power packed phone for such a low price . Spending every single penny on MOTO G2 is worth. Some people are afraid of the back cover thing , but let me tell you ,it is very durable just because it looks flexible does'nt mean its cheap plastic.If opting for any other phone at this price range is waste. My verdict is to go for MoTO G2. Thank you MOTOROLA & FLIPKART :)",
            "date": "29 Oct 2014",
            "name": "samir chaudhary",
            "stars": "5 stars"
        },
        {
            "comment": "This Phone is worth of price. Nice Build Quality, Battery backup is good( that other same range phones). Like Moto 1st Generation design more that this. I will recomend this phone.",
            "date": "29 Oct 2014",
            "name": "Amol Shelke",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchase from flipcart date 23/10/2014 Moto G 2nd gen and its touch screen is not working. When switched on phone before inserting SIM, it is showing the screen with a language to start with. When I touch on start button.Nothing is working. Even it is not getting switched off. Does anyone knows how to solve this problem?",
            "date": "29 Oct 2014",
            "name": "aslam malik",
            "stars": "1 star"
        },
        {
            "comment": "I got the Moto G 2nd gen mobile and I did not got the Airtel offer. Flipkart fellow told me to talk to Airtel, Airtel fellows asked to contact Flipkart. They are just passing the balls to each other. Phone is nice , but service and support suc*s from flipkart.",
            "date": "29 Oct 2014",
            "name": "rajeev",
            "stars": "1 star"
        },
        {
            "comment": "display 5/5 (5 inch display) sound quality 5/5 (front speaker with loud and clear) performance 5/5 camera 4.5/5 battery 5/5 (but takes too much time to charge) worth buying at this price.....",
            "date": "29 Oct 2014",
            "name": "Sagar",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone Worth buying. Has a good battery life.",
            "date": "29 Oct 2014",
            "name": "Farhad Vakil",
            "stars": "5 stars"
        },
        {
            "comment": "I have used moto g (1st gen) for 8 months impressed by its performance ordered G2 on 21st OCT as a dewali offer. from 23rd onward, got messages saying yout product will be delivered by 7 PM. But the delivery guy never showd up. Have called flipkart on 25th informing about the issue but they asked to wait untill 28 the last day of delivery. But now (29/10/14) the ordered have been cancelled. The whole process SUCKS as e-kart and flipkart are making fake offers and never care to deliver. Once flikart was good but now-a-days its service has been pathetic and customer service guys are sop arrogant and irresponsible they did not even care to track whats went wrong. I have desperately talked for 15 mins with one of their executive but she did not even had the idea what needs to be done. I am frustrated with FLIPKART guys. In current competitive market you choose to stand with unethical and irresponsible behavior, which will cost you heavily.",
            "date": "29 Oct 2014",
            "name": "Swati Sinha",
            "stars": "1 star"
        },
        {
            "comment": "It is really good phone as i gifted to my father on his aniversary . it has all smart phone quality and big screen ,good touch and camera quality is really good .",
            "date": "29 Oct 2014",
            "name": "sweta",
            "stars": "5 stars"
        },
        {
            "comment": "After a couple of replacements, got a phone that works better. My phone battery lasts hardly 15-16 hours, and takes half a day to charge, that too with location and bluetooth off. The worst part of this phone is very slow charger & less battery life. Otherwise it was a very good phone as far as speed and features goes. It's bad that Motorola has come up with an impractical combination!",
            "date": "29 Oct 2014",
            "name": "Avnish Midha",
            "stars": "3 stars"
        },
        {
            "comment": "Battery is not capable of holding power as per corresponding usage. Though you use it for 1-2 hrs continuously with internet, battery goes down atleast >60%. Within just 1 week my charger left connecting my Moto G2. But it was happily charging other lenevo/samsung products, except Moto...",
            "date": "29 Oct 2014",
            "name": "Ravikumar Ambad",
            "stars": "2 stars"
        },
        {
            "comment": "My Moto G (2nd gen) is heating too much during normal operations like talking, listing songs, and using camera etc. I have received it on October 22 and started using it from October 27, 2014 and facing this heating issue from day first. I have observed the same behavior in \"safe mode\" also. Temperature is touching 42°C. The upper back portion and the upper front portion of the screen got very hot after normal uses. It is not possible to take calls immediately after using the camera, as it is not possible to keep it near ears. Signal strength including the WiFi signals are excellent. There is no SD card. Observed the same behavior in “safe mode” also. I have updated the phone and reported this to Flipkart and now waiting for their response. On November 03, 2014 i have received the replacement against my problematic Moto G2. But the same issues are there in new piece of Moto G2. Its heating too much (44 °C) in normal operations. Now i think its an manufacturing defect because my friends are also facing the same issues in their newly received mobiles. Now this time i have requested Flipkart to return my whole money back and waiting for their response. On November 07, Filpkart team has accepted my request and got agreed to return my whole paid amount back to my account. As i have already done all the required R&D on this product, hence they have not asked me to perform the same again. They have collected the faulty device and will return the amount with in next 7 business days. Here I like to appreciate the kind of support i have received form team Flipkart. They are having a great customer support team.",
            "date": "29 Oct 2014",
            "name": "Vinod Sharma",
            "stars": "1 star"
        },
        {
            "comment": "This is just stock Android. I have changed from Xolo q700i Jelly Bean to this. it is disappointing in some respects. Pros: Excellent radio functionality as in the cell phone and Wifi signal reception good sturdy feel in holding. gorilla glass 3 sturdyness good camera - back and front camera good bluetooth connectivity no-frills stock android experience sound output in earphones and bluetooth is better than most devices excellent voice integration and responsiveness front speakers are loud cons: mostly OS based lacks many shortcuts Phone hangs some times phone has restarted itself 2 times in use of 1 week front speakers sound harsh in loud high quality songs LED notification has only one color -white as default phone could have been slimmer",
            "date": "29 Oct 2014",
            "name": "Rajesh Bhatia",
            "stars": "4 stars"
        },
        {
            "comment": "product is good, but it takes too much of time for charging the device, standard time is medium, ringtone volume is also medium.",
            "date": "29 Oct 2014",
            "name": "p murthy",
            "stars": "3 stars"
        },
        {
            "comment": "Before i buy this product, i have heard a lot of reviews that this mobile has heating problem. But i did not see any such kind of problem in my Moto G even if I switch on mobile data for hours. This is really an awesome product and worth the price.",
            "date": "29 Oct 2014",
            "name": "Abdul Kareem S...",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Good 8 MP primary camera and 2 MP secondary camera. Pictures clicked are perfect. 2. 5 inch screen with HD display looks good. 3. Easy to carry 4. Best for its PRICE. Cons: 1. PHONE HEATS UP for everything if used for more than 10 mins (while using any app for more than 10 mins - while using camera, while taking any call, downloading etc) 2. Worst heating problem is while talking. Your ears will start burning 3. EAR SPEAKER DISTORTION - Its of worst quality - Always distortion and irritating noise while having phone call 4. Taking long hours to gets charged up 5. Battery backup is not that good I replaced my first piece stating above problems. My new replaced piece too has the same problems. Its CONS are more than it PROS. MOTO G1 was great compared to G2.",
            "date": "29 Oct 2014",
            "name": "Muthuraja M",
            "stars": "2 stars"
        },
        {
            "comment": "Amazing Phone, and it is worth every Rs one pays. I migrated from a Black Berry and so this is my first experience with an Android phone. The set-up was quick and comprehensive, done is less than 15 minutes including most critical parameters. The Camera is good and at 8 Megapixels is handy when you are on the go and don't have your regular Camera.The Battery is good and in the past few days done some extensive usage- Music, Camera, Surfing etc and on a full charge holds itself through the day. The phone feels good in your hand, right size. Compared to iPhone 4 that my wife has this is certainly better. Strongly recommend this phone since it is \" Value for Money \"",
            "date": "29 Oct 2014",
            "name": "Ramadurai Ramaswamy",
            "stars": "5 stars"
        },
        {
            "comment": "I am just using Wi-Fi still battery drain within 2 hrs..! Too bad.. Overall the phone is okay in performance except for this reason. I am really if flipkart could accept the return.",
            "date": "29 Oct 2014",
            "name": "Krishna Challa",
            "stars": "2 stars"
        },
        {
            "comment": "good one.. worth buying, feeling good to use it:) amazing clarity with the camera and the touch is good.",
            "date": "29 Oct 2014",
            "name": "Prashanth Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased this phone from flipcart.com a week earlier. They gave delivery within two days from my order.Great. The phone is excellent within this price. Above all anyone can buy anything from this buyer without any hesitation.They are trustworthy. It is my feelings,anyway.",
            "date": "29 Oct 2014",
            "name": "Indrajit Pal",
            "stars": "4 stars"
        },
        {
            "comment": "All the specification are very good execpt battery.Because the battery drains very fast. 1.awesome specification 2.awesome picture quality. 3.out of 16 gb 12.79 gb is available. 4.micro sd slot and dual micro sim 5.front facing camera is average. 6.headset sound quality is too good. 7.call sound clarity is awesome. 8.display is very good 9.battery drains toooooooooo fast. 10.there is no data cable in the box.",
            "date": "29 Oct 2014",
            "name": "Somnath Das",
            "stars": "4 stars"
        },
        {
            "comment": "Buying a Micromax, Karbonn, Spice, Xolo, etc. is like investing in a share in stock market. Some are good, some are not, some go up, some go down, everything is a risk and full of surprises, some good, some bad. Buying this Moto G is like investing in a Fixed Deposit. No special profits / bonus / features. But no negative surprises either. You will get what is promised; a sturdy, reliable handset. Some things I noticed after using it for over 1 month: . Battery does take a longer time to charge . Menu buttons are on screen so you will effectively get 4.7 to 4.8 inches of usable screen space (unless the application goes fullscreen eg. images, video, games) . Although the online reviews say the phone does not lag, they say it after using it for 2-3 days. It does lag a little bit after I have installed some applications. But then I think most phones will lag after you have installed some applications. . NO BLOATWARE (Hello, 'Micromad', sorry, 'Micromax' are you listening???) . I think I believe in the policies / strategy / ideology of Motorola and hence I feel happy by using a Motorola phone which I don't think can be said about Micromax. . Motorola phones are well thought out and take user experience into account, which Micromad, sorry again, Micromax is trying so hard to ruin. . After considering all the specification of the competing phones, I think I ended up paying around Rs.1000 premium on this phone. But I think its worth the satisfaction & peace of mind.",
            "date": "29 Oct 2014",
            "name": "Ronak Dhakan",
            "stars": "5 stars"
        },
        {
            "comment": "Well this is not my first smart phone, but definitely a first in the 5 inch category or anything above 4 inch....and when i held the fone in my hands today for the first time, it felt great. The interface is good, specially after having seen Nexus 5 with my sister. Can't really compare both of these phones in terms of hardware, but seriously...in this price, this THE best fone...go for it guys. It looks good on the hands. Samsung fones have disappointed for a very long time now in terms of feel good factor. This is nice !",
            "date": "28 Oct 2014",
            "name": "Harshit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "camera quality for moto g 2nd gen is really bad. Asus zen 5 has really better camera quality for 8mp. so if camera is important for you then don't go for moto g2 but everything else is awesome. hardware quality, battery life is cool",
            "date": "28 Oct 2014",
            "name": "harsh awasthi",
            "stars": "5 stars"
        },
        {
            "comment": "amazing android product from motorola for the price. worth every penny of it. as mentioned by others, observation is- battery is troublesome and may last max a day with 3G on and less if you are into games. look and feel of white motog2 is great for the 13k smart phone.",
            "date": "28 Oct 2014",
            "name": "Akshat",
            "stars": "5 stars"
        },
        {
            "comment": "Really good phone value for money solid build quality and sound really impressed with the phone pictures taken with the phone cam is nice. custominsed it with a shell from daily objects the phone looks cool now. No major issue encountered sofar, looks like it is built to last",
            "date": "28 Oct 2014",
            "name": "Raj Rajendran",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Generation mobile received in good condition. My fried has suggested this mobile. It is worthy.",
            "date": "28 Oct 2014",
            "name": "Sankarappa Kak...",
            "stars": "5 stars"
        },
        {
            "comment": "Fully satisfied and amazing configuration.... Must go phone....I would recommend this phone over any of the phone in the market... amazing camera clarity and RAM is too good....",
            "date": "28 Oct 2014",
            "name": "Ankur Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Battery draining so fast in hot climate with 2g internet and very few calls. It is very good smart phone with poor battery backup.",
            "date": "28 Oct 2014",
            "name": "Naresh Kumar g",
            "stars": "3 stars"
        },
        {
            "comment": "The Phone is very good but heats on playing heavy games as asphalt 8 a bit. The game crashed for me once on playing it for about once every day in 5 days so pretty good i think. THE WORST PART OF THE PHONE IS ITS BATTERY LIFE IS REALLY POOR LIKE 3 HOURS AT MAX IF YOUR JUST WORKING ON THE PHONE.SO BEWARE if not a very good mobile with fluid motion for a good price",
            "date": "28 Oct 2014",
            "name": "RAVI KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "very good experience. it is delivered to me very soon. timing was excellent. product was also in very good condition.",
            "date": "28 Oct 2014",
            "name": "Abhay Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "THIS PRODUCT IS SO SO GOOD AND IT LOOKS AMAZING IN BLACK COLOR TOUCH IS TOO GOOD AND CAMERA CLEARITY IS SUPERB . GO FOR IT WITHOUT THINKING :):)",
            "date": "28 Oct 2014",
            "name": "DEEPAK",
            "stars": "5 stars"
        },
        {
            "comment": "Bought Moto G two days back i'm just exploring the phone everything is good the only problem that i see is heating of mobile after playing games.",
            "date": "28 Oct 2014",
            "name": "vikas shokeen",
            "stars": "4 stars"
        },
        {
            "comment": "Hi I have taken this Phone and the battery back up is very poor only 4 hours without using it for talking on stand by or using net it gives u only 4 hours of back up. Thinking if i will use it for talking will it work for 3 hours or not. Phone getting heated while charging and using net services. Hell battery and heating problem with the phone,.",
            "date": "28 Oct 2014",
            "name": "Monica Sharma",
            "stars": "1 star"
        },
        {
            "comment": "i recevied defect Mobile with one corner colour white and remaing Black colour. && charger and headset diffrent colour other than the phone. i raised request 3 days back till now its not resolved.",
            "date": "28 Oct 2014",
            "name": "Masumanna Poli...",
            "stars": "1 star"
        },
        {
            "comment": "Great Phone,, Awesome features at stunning price. U wont get a better phone at this price range. Hats off flipkart,, but i was expecting some free gifts though like some accessories or promos.",
            "date": "28 Oct 2014",
            "name": "Sohel Manna",
            "stars": "5 stars"
        },
        {
            "comment": "i m using moto g mobile now ......its my first androind mobile i was really excited to have it its been 1 week with moto g......i m having some problems its battery backup is not at all good as u mentioned ......it is draining in 5-6 hrs though i m not using wifi connection nor a 3g sim yet ......and the signal catching strength of the hand set is also bad ........and coming to the good ones the camera clarity is soo good and i liked it .......good service by flipkart and i only wonder abt these problems",
            "date": "28 Oct 2014",
            "name": "Mohan Darling",
            "stars": "4 stars"
        },
        {
            "comment": "though the product was in stock, it took 14 days to deliver the phone(that too in a place like mumbai) the reason i bought this through flipkart was because of the service they used to provide now it seems impossible very bad service by flipkart",
            "date": "28 Oct 2014",
            "name": "pankaj pandey",
            "stars": "1 star"
        },
        {
            "comment": "Moto g 2 is such a great phone for the price. The camera is excellent and the performance is superb.Eventhough Flipkart took some time to deliver, they are doing good with the offers.",
            "date": "28 Oct 2014",
            "name": "Sachin Murali",
            "stars": "5 stars"
        },
        {
            "comment": "good product from Motorola but moto g 2 should have made some changes in battery strength for its specifications",
            "date": "28 Oct 2014",
            "name": "Saikumar Mitta...",
            "stars": "4 stars"
        },
        {
            "comment": "After using Moto E I decide to go with moto g because in today's market no branded co. give u this type of future in this price. I had compared with all the other smart phone available in market but no one found lk moto g 2nd in this price. Moto g performance is excellent and as per my requirement.",
            "date": "28 Oct 2014",
            "name": "Bhavin Maniar",
            "stars": "5 stars"
        },
        {
            "comment": "I've Placed Order On 16-10-14 & Got It On 26-10-14 Still I'm Exploring The Phone, So Far Its Working Well, In Short Its Awesome & Justifiable With The Price. Impressed With FLIPKART's Service As Well, Hope To Shop More On FLIPKART.",
            "date": "28 Oct 2014",
            "name": "NARENDER SAHARAN",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from 15 days, i haven't seen any problem in it. people are talking about battery life is too min, but in this days i am using wi-fi for 18 hours every day , i didn't notice any probe about battery. It is worth of money guys in this segment,,,,,,,,,,,,,,,GO 4 it.",
            "date": "28 Oct 2014",
            "name": "Burhan Malek",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone for a month now,found it a quite good one according to the price but the one thing i did not like is the battery life.The battery drains very fast and also sometimes when i unlock the screen the touch does not works and then i have to lock the phone and then unlock it again.So sometimes it feels annoying.Coming to the performance the phone is the best even better than higher priced phones .Look-wise the black one is better than the white one as one of my friend has the white one.The applications works very good.The camera is also quite good as pictures look good on the phone.The camera application is not good so you have to install a third party camera application and also a third party music application as the phone has only google music player. So summarizing A GOOD PHONE AT THIS PRICE BUT NOT THE BEST ONE. We may find better specs phones cheaper than the MOTO G2.",
            "date": "28 Oct 2014",
            "name": "AKSHAT KUMAR SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "I am very very much satisfied with the service and the product flipkart had provided to me. Noticeable one, the superfast delivery.",
            "date": "28 Oct 2014",
            "name": "AJmal Nalakath",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Guys, The service through flipkart is good. But the product is not the same as described in all +Ve reviews from different sources. I ordered Moto G2 gen with lots of expectation as it was my 1st smart phone. But dejected not once, twice but thrice. Yes I have to replace the mobile for 3 times where all the 3 with unique issue. The 1st one had a deformity in screen where i couldn't spot as the mobile comes with protective guard after a couple of days when i view it against the light i could spot it FK . The 2nd piece is where 3.5mm Jack was very sensitive if i turn the earphone or any 3.5mm plug the music stops or pauses. * While playing asphalt 8 with medium graphic mode it just came out with a note the the app has unfortunately stopped. The 3rd and the final piece was something unique: The I couldn't add more than 2 alarm where the touch goes erratic or non responsive Has same issues as above with games. any video more than 5 to 10 minutes the screen turns white and whole phone hangs where the video getting saved but cannot be played. I.e the file not supported. Flipkart was understood the issue thrice and have done their best. where they gave me options of either replacement and refund of money. As a whole the phone's func is not up the specs. *defective pieces being regulated by WS retailer But the flipkart is doing its best for keeping its customers. I would recommend to buy any thing in flipkart but make sure its not from WS retailer.",
            "date": "28 Oct 2014",
            "name": "Rajesh",
            "stars": "3 stars"
        },
        {
            "comment": "Product is nice looking. Good battery backup. Good value for spent money. Good features as well. Photo clarity is very very good. It like play phone with features.",
            "date": "28 Oct 2014",
            "name": "Pavan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Before this device I have been using Sony xperia sp. I was very satisfied with that device. But this device or should I say pure android experience just rocks.",
            "date": "28 Oct 2014",
            "name": "Subhadip Chakr...",
            "stars": "4 stars"
        },
        {
            "comment": "its a really great phone at good price. but battery life is average one. main camera is great, secondary camera is so so. I have seen much better secondary camera at lowervprice in Micromax Canvas A1",
            "date": "28 Oct 2014",
            "name": "JOYDEEP GHATAK",
            "stars": "3 stars"
        },
        {
            "comment": "When I got this phone I had problems with incoming calls. I couldn't hear and had to keep switching on/off my phone every time when I get calls. Overall a good phone. Because of this problem I had to return it back. Replaced phone also I had the same problem. Quite disappointed at this turnout.",
            "date": "28 Oct 2014",
            "name": "DJ",
            "stars": "2 stars"
        },
        {
            "comment": "Very good at this price...no issue with the phone so far..very smooth...you get excellent android experience with moto g2...no lag...touch is awesome...Battery gets drain out in a day if you use apps a lot and data too..but that cant be the problem because u can get a powerbank at 500 -600 rs which is useful..picture clearity is good...overall a happy customer of flipkart...",
            "date": "28 Oct 2014",
            "name": "Joseph Gomes",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome home with great configuration in this price range. Also would like say thanks to the courier service to deliver the product before time.",
            "date": "28 Oct 2014",
            "name": "Sushil Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Hi recently i order 2 phones, but both are defective, if i use inside my room, i unable to get mobile signal. and charge also will come around 5 hours if we use continuesly. And most of the Applications we have to install maually, very less number of application is inbuild.",
            "date": "28 Oct 2014",
            "name": "John Wesley",
            "stars": "1 star"
        },
        {
            "comment": "Moto G-2 Sim 1 slot not working properly network disabled frequently i cant use dual sim in my phone using single sim only.(sim 1 slot problem kindly revert back soon for this issue).. sim 2 slot rocks with its performance(aircel and airtel cuted sim cards).. good mobile with better performance and best in class camera 8mp rocks with Led flash.. not full HD support but in this price its just awesome working with camera features.. gaming experience really good with touch response.. Stereo speakers awesome with sound clarity 3D stereo effect good in hands free. . battery drains within one day charger gets damn hot within a hour..",
            "date": "28 Oct 2014",
            "name": "Dhana prakash",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart did the very good job in replacement of Handset. One star is given due to Good Service from Flipkart and WS Retail. No starts for Phone. It was not expected to have such a bad product from Motorola. On first day it was not at all connecting 3G when I inserted SIM. After about 24 hours It is not at all detecting network in any of the SIM slot. And after factory reset setting It stopped connecting wi-fi as well. It lags on the basic functions of phone. One more worst thing is battery is connected to the phone and cant be removed separately. Takes much more time than expected for charging and heats when you charge for more than hour.",
            "date": "28 Oct 2014",
            "name": "Amol Dhamdhere",
            "stars": "1 star"
        },
        {
            "comment": "I am a satisfied user of first gen moto G for the last six month. The second gen of moto G also showed equal promise.Only, that probably, my piece proved to be a lemon. After two days the display started creating problem. Some areas of the screen would not respond to touches, wi-fi hotspot would work at its whim. Once, the display was gone completely for a day. I have asked for a replacement and awaiting it. I can only hope that this time it will be a good one. If it is not faulty then the phone is excellent one, just like its predecessor. Leaving the screen resolution which has been reduced a little, everything else is a little better than the first gen moto G. EDIT 30th october: I received the replacement yesterday.By today it is also showing up with similar problems. Some areas, specially on the top portion of the screen would not respond to touches.Now I am not sure what to do, should I go for a refund or ask for 3rd replacement! Edit 8th Nov: I have decided to get refund. I will try another phone, probably nexus 5. My conclusion is that ,no phone is bad if you get the fine one. In review of every phone I see some dissatisfied customers.One can only hope that the piece he gets will be a good one. Thats why I have given the rating of 5 star, in spite of having problems. Because if those particular problems were not there it would be a wonderful phone.",
            "date": "28 Oct 2014",
            "name": "Mani",
            "stars": "5 stars"
        },
        {
            "comment": "Pros : - Stereo speakers, sound quality, camera quality, processor speed, batter backup, usability everything is very good. Its quite light & easy to hold in 1 hand despite the 5 inch size. Cons : Plastic quality is not good. Screen color quality is quite whitish, even though clarity and sharpness is very good. I hope they make some app to increase the color.",
            "date": "28 Oct 2014",
            "name": "Ayan Sarkar",
            "stars": "4 stars"
        },
        {
            "comment": "Speed - 5 out of 5 Display - 4 out of 5 Design Quality - 5 out of 5 Camera - 4 out of 5 Battery - 3 out of 5 Overall Performance - 4 out of 5 (1 in 100 times phone freezes) Pros: 1. Call quality is awesome. 2. Dual SIM Support (Not yet used) 3. It has water resistant coating. 4. Apps are super fast. 5. RAM usage is good. 6. GPS locks the current location within 20 seconds. (Awesome) 7. Android Lollipop - Software Update will be coming soon. 8. Good Support from Motorola. Cons: 1. Battery performance is a big drawback in this mobile. Lasts only for 6-7 hrs after one time charge with moderate usage(though manageable). 2. Headphone could have been better.",
            "date": "28 Oct 2014",
            "name": "Rajan Balamurugan",
            "stars": "4 stars"
        },
        {
            "comment": "Your delhivery courier service ki maa ka b****da,....................................................",
            "date": "28 Oct 2014",
            "name": "Mayur Pataskar",
            "stars": "4 stars"
        },
        {
            "comment": "Guys just tell when you got the product was it seal packed wrapped in plastic, I mean the moto G box?? Because I got it with just a plastic seal...its screen guard to had bubble.. Second thing I noticed was the phones equalizer were set.. Both in headset and speaker mode..Is it the same with your devices?? My moto G 2nd gen's upper speaker has some problem.. It v cracks at even low volumes.. Even for a moto notification tone.. Even the call quality is not good vin earpiece.. It cracks all the time.. Otherwise the v phone's working is good.. Doesn't lag, runs smooth..3g,2g works fine so does on WiFi.. But I have called for replacement but they haven't replied.. I think I need to call them one more time..I'll give remaining stars later on when I get my replacement moto g2nd gen",
            "date": "28 Oct 2014",
            "name": "Palash Raut",
            "stars": "2 stars"
        },
        {
            "comment": "Highly disappointed due to this poor performance of the battery. I have used old Moto G and performance of battery is best one. But in Moto G 2nd gen, after full charged and evenif we didnt use internet, we could see battery getting discharged and can withstand upto 5h.",
            "date": "28 Oct 2014",
            "name": "Deepa",
            "stars": "1 star"
        },
        {
            "comment": "Was looking for an Android phone and found this phone to be nearly perfect for my use. I was looking for a phone that works for about a day without having to charge it, and this phone with a mid-budget level perfectly suits my needs. After having a bad experience earlier with flipkart on my earlier order, this order was fulfilled perfectly well. Even the courier (Delhivery- although has quite a lot of bad reviews on flipkart and google) seemed to deliver the package perfectly well, and within the promised time frame. The Phone: The display is brilliant, although it has a lower dpi when compared to its previous generation. The sound is good, but not brilliant. Doesn't really look like a huge 5inch phone, and fits in the pocket really well. Battery runs pretty well for a day, inspite of slightly heavy usage, and doesn't get warm/hot. After 2 days of use, I haven't really found any bad features on the phone. Will update if I find any.",
            "date": "28 Oct 2014",
            "name": "Phani Karamched",
            "stars": "5 stars"
        },
        {
            "comment": "the look, design, handling and performance of this mobile handset are excellent. it is the best smartphone in this price range",
            "date": "28 Oct 2014",
            "name": "ANKUR KUMAR PAL",
            "stars": "5 stars"
        },
        {
            "comment": "all are good but battery is big problem because it takes lots of time to taking full charge approx. 4-5 hours. and does not give more efficiency just ended in maximum 2-3 hour so i am in great problem with battery life. if battery would be removable then i change but it is non-removable so it is also a problem so without battery life this phone is empty box(dibba) for me...so please suggest me what to do for my mobile battery life.",
            "date": "28 Oct 2014",
            "name": "Vishal Kumar",
            "stars": "1 star"
        },
        {
            "comment": "A good mobile with handy size, good camera, 4.4 version with google talk is very nice, it make the phone easier to search, Email, SMS, where voice recognizes very fast , still needs fine tune up, but as on date it is ok.I am giving 4 star because battery take very long time to charges, I used the Sony Expedia , but one day software just coed off and is unable to repair",
            "date": "28 Oct 2014",
            "name": "Rohan Shiri",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G (2nd Gen) excellent product. Cost worthy, good performance. Larger screen than earlier version.",
            "date": "28 Oct 2014",
            "name": "Biswanath Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "This phone seems to be a good one in term of its look , the touchscreen ,camera .Everything seems to be fine but it doesnt't have a file manager which was really a silly thing to miss on a smart phone. I am writing this review because nobody has mentioned about this issue in the review. I am wondering how Moto has cheated ppl. I tried downloading a App for the same but you know nothing can match the native app for a smart phone... Even a Xenphone as a perfect UI and slim.",
            "date": "28 Oct 2014",
            "name": "karthi",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent phone at an affordable price. Have been using it for 3 days only but here is my initial observation on the only con I saw so far: Battery. I felt, it drains out pretty fast and may need 2 charges in a day for a moderate - high usage. I used it to play games and browse internet on WiFi and felt it drained out pretty fast! 1hr of watching video on Wifi ate up 30% of the battery! I'm not sure if it is normal. There was also little heating up of the handset but that is kind of excepted from all smartphones.",
            "date": "28 Oct 2014",
            "name": "Vinod",
            "stars": "4 stars"
        },
        {
            "comment": "This is d best phone i have ever purchased .Touch is very gud.Battery backup is quite satisfying . Heating is somewhat a problem of this phone , if u will play game for 1 hr continuously it gets heated. But overall u can go for this ...at this price this is d best option",
            "date": "28 Oct 2014",
            "name": "shubham verma",
            "stars": "5 stars"
        },
        {
            "comment": "1.The phone is well built. 2.Pure Android Experience makes it extremely fast and smooth(No Lag Or Frame drop). 3.Use of Samsung micro usb charger is advisable. 4.The sim slot is little bit hard to master put your sim in and push all the way through till you hear a double click. 5.The screen is extremely well built. 6.Impressive touch response. 7.Network speed is excellent. 8.Able to open multiple apps 9.Able to operate with one hand. 10.The volume rocker key is a little bit hard to operate. 11.Headphone sounds not so premium but considering the phone's budget it is acceptable. 12.Absence of NFC but seriously who needs one we can use wifi direct. On the whole I would like to conclude that it is the best smartphone when compared to other smartphones in this range and it will be updated to Android 5.0(guaranteed) and it is from google what else on can ask for in this budget.So go for it and own a moto!!!",
            "date": "28 Oct 2014",
            "name": "PHILEMON PHILIP",
            "stars": "5 stars"
        },
        {
            "comment": "nice mobile and flipkart service is also good. As of now no problem with mobile. Motorola has also done an excellent job.",
            "date": "28 Oct 2014",
            "name": "Gagan Saxena",
            "stars": "4 stars"
        },
        {
            "comment": "A awesome phone for the price. Well built and looks worth your every penny. Smooth as butter and even heavy apps run smooth.",
            "date": "28 Oct 2014",
            "name": "Edmund Biswas",
            "stars": "5 stars"
        },
        {
            "comment": "Hello everyone i bought dis phone 3 days earlier, And the one word il be using is \"TRUE AWESOME PHONE\" Pros 1.) Awesome display 720p, everything looks real and fantastic. 2.) Build quality (beleive me its gr8) 3.) Corning gorila glass 3 (im at peace cause of dis) 4.) Battery is very nice, worked two days (with very less usage) ....... CONS:- 1.) camera Not upto d mark but still a good cam, better den dose micromax nd all. 2.) Still searching. FINAL VERDICT For the budget this is d one and only best option, just go for it,/u wont regret @ all. Regards",
            "date": "28 Oct 2014",
            "name": "Umang Tahir",
            "stars": "5 stars"
        },
        {
            "comment": "Not good i am not satisfaction nothing to say more can you come n take my head phones return k na plz kindly take issu",
            "date": "27 Oct 2014",
            "name": "Gandhi",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g 2nd version 3 days ago and now there is front cam problem. whenever i open it says \"Camera error\" and gets off. I tried factory reset and all also other apps but same thing happens.please flipkart i want to replace this piece.",
            "date": "27 Oct 2014",
            "name": "Tushar Patil",
            "stars": "4 stars"
        },
        {
            "comment": "quiet intriguing at this price& best part got it on exchange and grt delivery..grt product only thing is usb cable not given&earphones were cheap..",
            "date": "27 Oct 2014",
            "name": "Chetan Panchal",
            "stars": "4 stars"
        },
        {
            "comment": "Hi Every one,Moto G 2nd genration is a best product of Motoral company in 13 K.But when we use first time voice clarity is almost fine,After some days volume not cleared and speakers are listening ruff sound.Any buddy suggest me what is the issue? Camer is So fine..",
            "date": "27 Oct 2014",
            "name": "Sudhansu Sekhar",
            "stars": "3 stars"
        },
        {
            "comment": "Such a unique service ! Thank you all in Flipkart !",
            "date": "27 Oct 2014",
            "name": "Padmanabhan N S",
            "stars": "5 stars"
        },
        {
            "comment": "Well, \"Delhivery\" logistics should be probably renamed 'DEAD'ivery. Slowest and the most sordid logistics ever. had to personally collect the phone from their warehouse coz they never seemed to respond nor deliver.. Flipkart better change their 3rd party logistics. Other than that the phone is really good, Better than what i had expected..had initial doubts whether to go for zenphone 5 or Moto G 2nd Gen.. After all the Research, i went for this phone and now no doubt that this is the better Phone.. Overall: Good Experience with Flipkart.. Disappointed with the Logistics..",
            "date": "27 Oct 2014",
            "name": "Krishna",
            "stars": "4 stars"
        },
        {
            "comment": "1. Battery is very good. but It doesn't last above 6 hours if you stay connected with 3G. 2. Display and camera quality are good with 8 MP camera. 3. Touch is not sensitive. Sometimes requires 2 or 3 touches to do an action 4. Mobile heats if continiously listening songs or playing games . Fake Offers & Demands --------------------------------- I bought 2 nos Moto G 2nd gen on very launch date 6th Sep 2014, 12.05 AM. The prices of covers and cases looks funny (you declared the customers as fools). I am provided with 50% off on cases & covers. Till now I didnt receive any sign of availing the offer. Called plenty of times with customer care and sent plenty of emails and got some irrelevance or improper response. Do you want the customers to wait more than 10 days and run behind you to avail the offer? Plenty of fraudulent things under Terms and condition. Saddest thing is it is not visible anywhere when you place the order. I promise this would be my last order in flipkart. If you guys keep on treat customers like idiots, soon you will lose them",
            "date": "27 Oct 2014",
            "name": "Devesh singh",
            "stars": "4 stars"
        },
        {
            "comment": "At first I liked it alot It has huge screen and good features But after few days I started having network connectivity problem , MicroSD card not detected properly. It is unmounted frequently and Charging the device takes lot of time .I contacted the customer care they told me to reset the mobiles factory setting which I did still it is not working properly.I changed the sim placed another sim still facing the problem .I have raised replacement issues but still no one has contacted me yet .",
            "date": "27 Oct 2014",
            "name": "Puja Ghorawat",
            "stars": "2 stars"
        },
        {
            "comment": "Nice phone, good features also not to forget awesome delivery time even in peak diwali season....good luck FIPKART....!",
            "date": "27 Oct 2014",
            "name": "RAJEEV TIWARI",
            "stars": "5 stars"
        },
        {
            "comment": "Writing this review after few weeks of usage of phone after purchase. Phone specs, performance, quality and build are good as per the price. Definitely would recommend this if your budget fall in its range.",
            "date": "27 Oct 2014",
            "name": "Kuldeep Rishi",
            "stars": "5 stars"
        },
        {
            "comment": "Value for money. one of the wonderful fone in this range. camera is good and battery also even after using multiple apps on 3g.",
            "date": "27 Oct 2014",
            "name": "Vijeesh CTK",
            "stars": "5 stars"
        },
        {
            "comment": "Would like to thank FLIPKART for delivering the mobile on time . I purchased 3 MOTO G 2nd Generation Mobiles and i was happy with the service.",
            "date": "27 Oct 2014",
            "name": "Saikanth Krishna",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto G 2nd Gen is easily one of the best mid range mobile in the market at this moment. It looks more than mid range. Its slick and neat. Though its a bit slippery, it still cosily fits in my palms. The processor is quick and multi tasking is good. I also loved the display, it has depth. The display depth reminded me of Nexus 5. All in all a great phone at a highly competitive price. Super value!!",
            "date": "27 Oct 2014",
            "name": "VikSpark",
            "stars": "5 stars"
        },
        {
            "comment": "excellent phone in this range even it is more faster than galaxy s5 i was shocked by its super fast response excellent performance BUT BUT camera lags a bit nd front camera lags in dim light thats the only con that i can figure out of this phone but overall a thumbs up for moto g2",
            "date": "27 Oct 2014",
            "name": "aditya vaidya",
            "stars": "5 stars"
        },
        {
            "comment": "I am in love with this one! Everything works perfectly fine except one issue, that is its getting heated very badly after taking 5-6 photos!! :O And its happening to mine one only! Have requested a replacement but haven't got any help yet! Flipkart please help me with this one!",
            "date": "27 Oct 2014",
            "name": "Ritashree Das",
            "stars": "5 stars"
        },
        {
            "comment": "Using this mobile since Sep 2014. Please find the pros and cons. Pros -Big display -Speakers are loud n clear -Good call quality -Best in performance no lagging till now Con's Battery performance is average Camera quality is average",
            "date": "27 Oct 2014",
            "name": "kameshkumar",
            "stars": "4 stars"
        },
        {
            "comment": "In this everything is good but battery backup is poor.Dono is that fault in only my mobile or others too.From the day one also the battery backup is not upto the satisfactory level.Leaving this everything is good & working fine :)",
            "date": "27 Oct 2014",
            "name": "Harsha C M",
            "stars": "4 stars"
        },
        {
            "comment": "Recently purchased. Flipkart's online purchase experience is remarkable. Quick response and tracking is very clearly explained step by step. Also get SMS alert for each stage of delivery. While I lived in USA I used to order items from Amamzon.com and Walmart.com. I thought online purchase will not be possible in India but Flipkart is beyond my imagination related to service. Only problem I could not find everything what I need online from India through Flipkart. Hopefully they may expand within the coming few years. Regarding MOTO- G 2nd Gen, it seems I got a very good phone for the price. For me 5 inch seems little big comparing to my iphone 4 what I used. I preferred a 4.5 in screen size because my palm is small. I liked the fatures with specification of MOTO G 2nd Gen and therefore I ordered it. I cannot give a perfect review at this time because it is too early to any thing. I will start using it all the time from next week. I have to get a new Micro SIM from the BSNL.. Temporarily I am using a cut to size SIM which I don't prefer. However based on the features, I would like to recommend this phone for those who are looking a good, mid-range ( below 15000/= ) smart phone. I also purchased a Motorola flip cover for the phone. It is very good, fit's perfect, but the price is little high for a flip cover!!.",
            "date": "27 Oct 2014",
            "name": "Sherly Manuel",
            "stars": "4 stars"
        },
        {
            "comment": "Worth for the money.Everything has its own pros and cons. All are good except Battery and data cable. 1.Battery charges very slowly.takes nearly 3 hours for full charge. Battery drains quickly even if you are not using internet. 2.Don't expect \"Data cable\" with this mobile as the company is not providing the same with this phone. Over all satisfied with the phone performance.",
            "date": "27 Oct 2014",
            "name": "jayasankar p",
            "stars": "5 stars"
        },
        {
            "comment": "very excellent product but one thing was disappoint. display was like, there are little bit of colours are faded away. even though it was HD screen. other than that very very very classy phone.",
            "date": "27 Oct 2014",
            "name": "Parth Patani",
            "stars": "4 stars"
        },
        {
            "comment": "good item good price worth working phone The Moto G 2nd Generation is the first smartphone in its class to offer a 5-inch HD display. Enjoy music and videos on this brilliant display that gives you sharp quality all the time. The phone is also protected with Corning Gorilla Glass which gives you extra protection from everyday scratches and scrapes",
            "date": "27 Oct 2014",
            "name": "anoop saini",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good phone, great Camera, Esp Front cam.Fast, No hanging issue.worth for 13k.Earphone not that good,still nice one.Perfect Style and design.",
            "date": "27 Oct 2014",
            "name": "Renu Lal",
            "stars": "5 stars"
        },
        {
            "comment": "I had recently bought Moto G2 handset, which is one of the best phone in Budget Smartphone Category. Specs of the phone are decent with the current price tag. Battery backup is good enough to serve you more than 24hrs of Mixed usage. Camera gives you Nice shots at Dim light also. Overall its a good offering from MOTOROLA.",
            "date": "27 Oct 2014",
            "name": "Vijay Goudar",
            "stars": "5 stars"
        },
        {
            "comment": "After a long waiting time nearly 1 month (b/c of courier service) ..... finally got my Moto G. After using it for 2 days.... worth for waiting",
            "date": "27 Oct 2014",
            "name": "Jatin Dhanani",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought recently 50 days back(12-9-2014) Moto G 2nd GEN , since that time i have been facing a problem i.e always it displays like 'location restriction is blocked ' i tried for solution but didnt get , after few days it keep on showing i was habituated. Yest day night (26-10-2014) It switched off itself , i tried to ON it, display light was showing with symbol M after 10 sec it went into sleep mode again after 10 sec light came, it is continue. service ppl said it has software prblm. \\",
            "date": "27 Oct 2014",
            "name": "Chiranjeevi",
            "stars": "1 star"
        },
        {
            "comment": "excellent phone,nice picture quality , have all the features required. overall a very good phone. one must have it.",
            "date": "27 Oct 2014",
            "name": "Anil Shah",
            "stars": "4 stars"
        },
        {
            "comment": "Heating up Battery discharge frequently. Delivery and service excellent Lot of background bugs running",
            "date": "27 Oct 2014",
            "name": "janakiraman v",
            "stars": "3 stars"
        },
        {
            "comment": "Am using moto g2 since one month,,,phone is really awesome,,it has good battery backup,,,good screen resolution,,,and even while playing ASphlat 8 game it not getting heat...i really like this phone,,,Thanks Moto for such a good product",
            "date": "27 Oct 2014",
            "name": "akhil muppa",
            "stars": "5 stars"
        },
        {
            "comment": "Hai l brought moto g 2 generation mobile and get the product what I except so I will give 5 stars to this application",
            "date": "27 Oct 2014",
            "name": "Mohammed Navid",
            "stars": "5 stars"
        },
        {
            "comment": "It's a good phone and is way better than the same price equivalents of Sony and Samsung....... I haven't used a zenfone 5 or mi3...... But it is a decent phone....... No lags..... Even games like MC5, most wanted, fifa, and real racing 3 are performing without any lag...... No heating issues..... The only trouble is that the phones battery drains real fast and also takes years to charge.... (almost 3 hours from 0 to 100%) ......:-( Other than that it's an awesome device.... :-)",
            "date": "27 Oct 2014",
            "name": "Jason Kirubakaran",
            "stars": "5 stars"
        },
        {
            "comment": "camera and speaker very nice but some heating problem charge not enough. overall feeling good. compare other phones this price range its very exceptional.",
            "date": "27 Oct 2014",
            "name": "Prabu raj",
            "stars": "4 stars"
        },
        {
            "comment": "Got this phone yesterday and hence writing the review. Really nice phone to use. It is user friendly, fast and does'nt hang. Pros: 1) Display is really good. 2) Touch quality is just awesome. 3) Speaker quality is much better than micromax and other samsung phones. 4) Call quality is best. 5) Camera is awesome. Pictures in dark background also look good. 6) Video quality is above par. Cons: 1) Battery life is not what I expected. It lasts for around 9-10 hrs with internet on, music and gaming. Need to install battery saver it seems. 2) They should have provided some more pre-installed apps like facebook, gtalk and folder browsing. Apart from these 2 drawbacks, this phone provides awesome user experience. Would recommend it to those who are looking for a good phone in medium budget :)",
            "date": "27 Oct 2014",
            "name": "Kshitij Deshpande",
            "stars": "4 stars"
        },
        {
            "comment": "i bought MOTO G(Gen2)mobile on big billion day with exchange of my old mobile. i was facing NETWORK SIGNAL detection issue in both(sim1 and sim2) slots and i got the new one as replacement. but second one also had the same problem in 1 sim slot. Worst quality . Ensure all the functions are working fine when u receive the item, atleast before replacement period.",
            "date": "27 Oct 2014",
            "name": "vivek garg",
            "stars": "1 star"
        },
        {
            "comment": "This is my first experience with Online Purchase for Rs over 1000/-. I was not sure and had doubts in mind even when I was ordering the Phone online. To my surprise, all my fears turned out be false. In fact , it has been a very pleasant experience . I really congratulate guys at Flipkart for the excellent show. You have really changed the perception of people like me who would still prefer walking to a store to purchase the Electronic Items. The delivery was done just 3 days after the booking than the tentative date (Which, I believe was 10 days after the boolking). I believe you guys are more conservative on the delivery date.My advise is to make it more dynamic than a static one based on the purchase of the item. Overall it is a wonderful experience and you would soon see me ordering more things on your site.",
            "date": "27 Oct 2014",
            "name": "Krishna Pappu",
            "stars": "4 stars"
        },
        {
            "comment": "For this range, this is probably a great deal. There maybe other phones that are better in spec than this one, but still to me this is a better deal - Pros: 1. Stock Android, plus this has great chances of getting updates from Google. 2. Since no UI extensions are there, if you like Android, you would love this too. 3. Nice feel of the phone. Light in weight 4. Pretty good ease of use 5. Good sound quality Cons 1. Battery lasts a day - but I guess all smartphones do the same. 2. Its not full HD",
            "date": "27 Oct 2014",
            "name": "Koushik Chakra...",
            "stars": "4 stars"
        },
        {
            "comment": "A good phone from Moto. Handy and light weight that Moto G 1st generation,but if you are a hard core internet user battery backup wont last for a day. you need to purchase power bank additionally to use the phone for a complete day.",
            "date": "27 Oct 2014",
            "name": "Karthick",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased a Moto G 2nd Gen. The service from Flipkart was excellent. The phone is really kool . But the Product Quality is a big issue. The Moto G which was delivered to me had some light showing through a minute gap on the panel. Flipkart replaced this in two days and all is well with the replaced phone. My niece also ordered the same phone. The delivered phone had white patch on the display. Now she has asked for a replacement. I feel that Motorola is shipping phones with defects or they are recycling phones rejected by customers and sending them to new customers. Which ever it is , Flipkart and Motorola needs to have a closer look at the quality of the phones being shipped.",
            "date": "27 Oct 2014",
            "name": "REJU SKARIA",
            "stars": "3 stars"
        },
        {
            "comment": "I received this phone on 25th Oct and its been 2 days now. Works just fine. No complaints. I think its the best deal available at this price.",
            "date": "27 Oct 2014",
            "name": "Sarah Lathiwala",
            "stars": "4 stars"
        },
        {
            "comment": "Features are good but there is heating problem with the phone.. I am satisfied with the Flipkart service but not with the Mobile handset.",
            "date": "27 Oct 2014",
            "name": "Piyush Koul",
            "stars": "2 stars"
        },
        {
            "comment": "This phone is good but some cons is there:- Speakars are not good noisy sound come Battary also not that much effective.",
            "date": "27 Oct 2014",
            "name": "Purnendu Sahu",
            "stars": "1 star"
        },
        {
            "comment": "Never seen such kind of worst shipping company. FIVE rating for phone but ZERO rating for shipping service. On 25th I got a message that the product is out for delivery at your door step but not delivered on that day. Customer care said that the courier boy went back from half of the way without any reason and will deliver it tomorrow. Next day again I got a message for delivery but didn't get my product till evening. At end I myself went to the Delhivery office and got the courier boy number and received my product on the way. Nice product by the way",
            "date": "27 Oct 2014",
            "name": "Saurabh Arora",
            "stars": "2 stars"
        },
        {
            "comment": "Got the phone on Big billion day.. Definitely one of the best phones esp in this budget.. PROS: 1.Camera Quality: ---------------------------- #A read a lot of reviews stating the camera is just good.. but for my surprise it is one of the best 8MPs.. #Even in Low-Light with Flash the noise is very low.. #Photos are stunningly vivid and crispy.. #Front cam also takes clean and bright images...good fr selfies.. #BUT the camera app is very buggy. Cant focus properly. Auto-Hdr doesnt work well.. But its not the camera's fault.. may be a software update or a diffrent app may fix them 2.Stereo Lound Speaker: ----------------- I have to elaborate on this part...What to expect and what not to.. #Expect RICH sound with good bass when placed nearby, like 1ft or 2ft.. i.e. when seeing a video or hearing songs when browsing... #Much Much better than usual MONO speakers.. you wont feel like hearing in a phone's LS.. bt as if frm a mini portable speaker #BUT dont expect super loudness. #When placed far away you wont find the stereo effect not the bass. #Lodness is surely above average but the quality degrades when we reach 75% of max volume. To summarize.. Its awesome when placed nearby.. Nice, when placed far.. Definitely a Loud phone.. 3.Call Quality -------------------- One of the LOUDEST phones i have ever used. Seriously.. Even in Noisiest streets I can hear crystal clear with my call volume set at just 60% or so... Also the voice clarity is rich..no static or call drops.. 4. Display: --------------- Bright,Crispy, Beautiful. I have not used many smartphones so I dont know in comparison with S4,Note,Z or whatever.. #The display is very bright.. I drive in my bike using GPS and I never struggled even when the sun is super bright.. SO good sunlight legibility.. #Yes it is using Moto G's same display but 294 PPI is more more than enough.. no one is gona use a microscope i guess.. #The pics are super vivid and crispy guys. #The lesser the PPI the lesser load on CPU so the same battery on Moto G could handle the extra screen real-estate. 5.Battery: --------------- I am not a Gamer but I do browsing a lot. With 3G On for around 4-5hrs and 1-2 hrs of call and messaging and hearing songs in LS the phone lasted me a day. This is more than enough for me. The charger is a bit slow. 6.Design --------------- Solid build quality. No squeaks in the back panel. Phone feels sturdy at the same time light on hands. I was using a 3.7incher and was worried abt getting a 5inch fone as I have to use both hands.. All the worrys flew away when I handled this device. Light weight, rubbery back, solid on hand.. cant get better.. Yes.. sometimes I need both the hands.. esp when pulling the notification panel or typing a web address in chrome... Google has to consider and redesign them so that key tasks are accessible from bottom right area itself.. I used Nova launcher and set gestures for notification panel and sorted out things... 7.Misc ------------------------- No heating issues on 3G or in calls..No idea on gaming.A cool device. There are few software glitches and bugs which google must fix..like.. Auto brightness is not well caliberated.. Auto-rotate creates a small pause when hearing songs as if it taxes the CPU... there are tiny lags occationaly even when less apps r installed.. Maybe Lollipo will fix all of them... We are one of the devices to taste Lollipop early.. whoo whooo...\\m/ So overall a very good product.. Carefully designed.. Scores well in both looks and performance.. A definite multimedia device in this budget.. Highly recommended for those who expect Value for Money...",
            "date": "27 Oct 2014",
            "name": "Shan Muga",
            "stars": "5 stars"
        },
        {
            "comment": "I am using it from last one month. No issue yet. good quality of hardware. 5'' display is awesome.Battery drains in 6-7 hr if used with 3G. No data cable provided with phone.",
            "date": "27 Oct 2014",
            "name": "Prasad Dhoble",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the phone on the big billion day. Although the delivery was quick but the package was poorly crushed. I had to go to the ECOM Express office to collect my delivery and there I saw how all the packages were manhandled and were being thrown away from here and there. This was not at all what I had expected from Flipkart. They should really do something about it. As far as the phone is concerned, it is a gr8 device and a bang for buck with the trust of a big brand like MOTOROLA. I have been using the product for like 3 weeks now and no issues so far. Luv the phone. Go for it!!!",
            "date": "27 Oct 2014",
            "name": "Prakhar",
            "stars": "4 stars"
        },
        {
            "comment": "i odered this phone on 20 th october and i got i on 27 this phone has good graphics and stunning voice quality with a vivid camera pictures and no lagging performance and with amazing display and a elegant body !! I am totally happy with this phone and its features !! It is worth it",
            "date": "27 Oct 2014",
            "name": "Pransur Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "Got the phone before 2days... its awesome !!..really luv it.. best buy in this range... only thing i find uncomfortable is the speaker.. when am in a call.. everyone around me can hear the conversation clearly...battery life is OK'...",
            "date": "27 Oct 2014",
            "name": "Priya Pinky",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G for the Known quality early this month. I had problems like some white spots in the display. I got the phone replaced within 10days from Flipkart for this problem. But the second phone i am having problem with the phone ear piece, there is lots of noise from the speaker. I am totally dissatisfied with Moto G quality. It is waste of my time to spend looking for Replacements from Flipkart. I didn't expect such a poor quality products from Flipkart.",
            "date": "27 Oct 2014",
            "name": "Loknath Natarajan",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased the phone 2 weeks ago. Its giving problem with flash (occured 3-4 times in 2 weeks). When I set flash to On mode and try capturing picture, camera sometimes hangs and flash remains in On state. Then if I try reopening the Camera, it asks me to Restart the phone. The flash doesn't Off while restarting. It gets off when I open the Camera again after restart. Back panel is also too tight to open for the first time which then gets slightly loose later. Anyways the other features are awesome.",
            "date": "27 Oct 2014",
            "name": "Pankaj Pawar",
            "stars": "3 stars"
        },
        {
            "comment": "I am a Windows Phone user and got this for my Mom. This one is excellent value for money and recommend it to everyone who wants all the major features at an economic price. The only drawback is with the colour of headphones and the charger. For a black piece, I got a white headphone and white charger. The quality of these accessories are very substandard too but for this price, small sacrifices are to be made! All in all a great buy.",
            "date": "27 Oct 2014",
            "name": "Abhinav Jain",
            "stars": "4 stars"
        },
        {
            "comment": "WORST SERVICE PROVIDED FROM FLIPKART. RECEIVED MY PRODUCT AFTER 10 DAYS. BUT VERY NICE MOBILE. GO FOR IT.",
            "date": "27 Oct 2014",
            "name": "KISHAN LAL",
            "stars": "5 stars"
        },
        {
            "comment": "its is good one at this cost. camera is good.. batery is average.. it longs for a day with limited use of net and unlimited music.. even it is 5 inch it is very handy.. some sort of disadvantages are there.. if i use my camera for a while the phone gets heated up. it supports otg. so u can use mouse keyboard pendrive. cast screen facility is also there. screen ontime is 4 hrs.. it should hav atleast 2750mah battery. it is upgradable upto android 5.0 lollipop. in my phone the battery saver is not working..it supports 1080p videos. front facing stereo speakers helps us in watchng videos.. quality is very good. it is a cost worthy phone..",
            "date": "27 Oct 2014",
            "name": "saravana kumar",
            "stars": "4 stars"
        },
        {
            "comment": "i purchase this mobile 3 months before. superb speed. nice camera view photo clarity is better than samsung mobile .",
            "date": "27 Oct 2014",
            "name": "Moorthy",
            "stars": "5 stars"
        },
        {
            "comment": "OD200850294158100100 order number i have purchase MOTO G 2nd gen in flipkart WS Seller ..I put a return request for problem with my mobile they can't response ...at now also..they send message i will call tomorrow next day send same msg..repetedly ..i have purchase so many items in WS Seller...but this time they are doing VERY VERY WORST Response..",
            "date": "27 Oct 2014",
            "name": "Narayana Yella...",
            "stars": "1 star"
        },
        {
            "comment": "hi I bought moto g 2 two weeks back. delivery took 4 days time. the display is good. doesn't hang. the voice clarity is good. camera and video quality is good. good gaming- temple run no lag battery- on an average it comes for a day. with high usage it will drain more quickly. problems- network signal less than my previous nokia phone. sometimes call drop I had no experience of charger heating as mentioned by others. over all I feel its a good phone",
            "date": "27 Oct 2014",
            "name": "dr girish p n",
            "stars": "4 stars"
        },
        {
            "comment": "Received the Product before expected delivery date and good condition. I am very much satisfied with this product.",
            "date": "27 Oct 2014",
            "name": "Madhu Murthy",
            "stars": "5 stars"
        },
        {
            "comment": "First of all of I would say if you want to buy a phone with 13k budget you should buy Moto G 2 gen. The design of phone is attractive with curvy shape. The HD display is also give smarter edge to this phone. The speed, internal memory, pre installed apps, moto alert app are awesome. For this price the phone is excellent. As you know every coin has two faces and same is also applicable here. 1. There is no data cable in the box. 2. The charger plug pin are not as Indian standard and you will face loose fitting during charging. 3. The menu display of apps is disappointing i.e. if you reach to last menu display you have to scroll again to reach to first display.",
            "date": "27 Oct 2014",
            "name": "Anil Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Returned as I could not even start for the first time. Not worth. No value for money. No value for money. No value for money.",
            "date": "27 Oct 2014",
            "name": "Kanik Sharma",
            "stars": "1 star"
        },
        {
            "comment": "best budget phone with awesome feature and getting android L.camera nice ,battery average.touch awesome.",
            "date": "27 Oct 2014",
            "name": "Rushi Trivedi",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered Moto-G 2nd Gen mobile (used SBI credit card to get 1250 cashback) at the time of booking it said delivery available to my home town, so I booked the mobile. Now they called me and said it is not possible to deliver to my address and they canceled the transaction, (I have already made some successful orders from flipkart to the same address earlier). If the product is not delivered to my home address I would have given another address at the time of booking.",
            "date": "27 Oct 2014",
            "name": "Balaji",
            "stars": "1 star"
        },
        {
            "comment": "I've bought this after thinking so much over other phones in the same range,its great with its storage,camera,3G n/w , call quality and battery backup. Only issue I faced with Clock,when we try to add new alarm slot it doesn't work for first time.Its very slow while adding new slot.It irritates a lot.",
            "date": "27 Oct 2014",
            "name": "Narasimha Murthy",
            "stars": "3 stars"
        },
        {
            "comment": "hi guys..am reviewing,after using it for 20days...awesoem phone,no lags..good performance..amazing touch and also display......the camera is superb good clicks outside...there are no heating issues with the phone which i am happy about....no lags on camera..overall awesome phone....",
            "date": "27 Oct 2014",
            "name": "vinay kumar",
            "stars": "4 stars"
        },
        {
            "comment": "At this price range moto gives his best and i am very satisfied this its processor they give me all features what i want in a mobile Camera is good front camera is also good touch is nice nad smooth dual speakers works perfect battery backup is good built quality is superb",
            "date": "27 Oct 2014",
            "name": "Shivam Singh",
            "stars": "5 stars"
        },
        {
            "comment": "There are more than 3000 reviews. I am just here to share my observations... My roomates have a zenfone 5and moto E and note 1. I have moto g2. The 294ppi display icons still dont come close to note 1 having 285ppi. I am not talking about quality. But the edges of text are crisper on note 1. It shouldnt be though. The same goes with zenfone5, A very close inspection tells that zenfone may have higher ppi but that is not the case too. So i am spectical about it. Coming to battery and charging, Using samsung and other chargers, The part near camera heats like hellll.. Sometimes, the input precision gets bad. You have to clear ram to get back to normal. Gorilla Glass 3 claims are odd... The moto E and moto g 2 both have a bad quality glass too than note1 having GG1. HOW IS THAT AGAIN POSSIBLE?? moto e display when pressed shows signs of display rainbows. Moto g2 doesnt... But scratch test using a small stone showed bad results for both moto phones than note1. The battery percentage does not fall uniformly.. In a gameplay of 15 minutes. It went from 67 to 63. But in next 15 minutes of standby it went to 54.. It always happens only after gaming consumption.",
            "date": "27 Oct 2014",
            "name": "gaurav raj",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product within 30 days i facing few problems 3 times i resetted my factory data reset i connected customer care more than 3 times",
            "date": "27 Oct 2014",
            "name": "SrinivasRagava...",
            "stars": "2 stars"
        },
        {
            "comment": "flipkart has lost customer trust. 21 days over and no delivery that billion day offer day is haunting me. boo mr. bansals'. both of u should be ashamed.",
            "date": "27 Oct 2014",
            "name": "tejaswi",
            "stars": "1 star"
        },
        {
            "comment": "I ordered MOTO G 2 mobile on 20th of october and received it on 22nd of october, full points to flipkart for delivering it before the expected time. I was so excited to use the mobile but my excitement come to an end when i found that the mobile i received was faulty(It has a dark black spot in the upper left side of the screen). The fault is a hardware fault. I called the customer care service of flipkart on 24th of october. The customer care guy told me that someone from technical team will call me within to days(before 26th) but on 26th(today) i get the message that they need more time to resolve my issue. I don't understand why flipkart want more time to resolve, this is not something that can be resolved over a call. Only replacement can resolve this issue. Flipkart: Please get it replaced as soon as possible.",
            "date": "26 Oct 2014",
            "name": "$umit",
            "stars": "3 stars"
        },
        {
            "comment": "This is One of the best Mid Range Phone in the market and Competitor for Samsung and other smart phone from the launch day you can guess how fast the stock was out of stock. I am using this Phone from 3 months I have not got any problem Like HANG, Battery lOW OR RESTART which I faced when I was using Samsung phone. Also network of MOTO G is very good So I am rating It has 5*. I will Recommend this Phone To every middle class People who can purchase Heavy Price Phone. The only think I dont Like about this Phone is Non Re moveable Battery, Rest All the best features, hoping Buy back Offer when new Phone's of Moto is launched...and Updates for MOTO G as well.",
            "date": "26 Oct 2014",
            "name": "Sadanand Tibile",
            "stars": "5 stars"
        },
        {
            "comment": "Product delivered on time just before diwali.. so i appreciate flipkart delivery... There was one problem with camera, it was not recording videos. I contacted customer service and they asked to restore to factory setting. i did that and it started working. apart from that mobile is working quite well.",
            "date": "26 Oct 2014",
            "name": "Jyoti Prakash...",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone, I dont think i need to give you the pro's or con's of this product since you can find an eternity of content on the web regarding moto g2. However I will give yout the pro's and con's of Flipkart's service. Pro's The order placement was easy The one day delivery is a wonder, got the phone within 22 hours of ordering. The tracking of order is easy. Con's You do not get any status update on your product when the flipkart systems are busy. You get the order delivered and after 4-5 hours the system shows that your order is in transit.",
            "date": "26 Oct 2014",
            "name": "Julian Bennet",
            "stars": "4 stars"
        },
        {
            "comment": "The delivery was made within a day and i love the phone and the battery lasts about one day eith moderate use(3G,internet,moderate gaming,chatting,calls) overall a good buy i would say..you wont regret.",
            "date": "26 Oct 2014",
            "name": "anuran",
            "stars": "4 stars"
        },
        {
            "comment": "USB cable not supplied No Bluetooth headset",
            "date": "26 Oct 2014",
            "name": "Damodar Shenoy",
            "stars": "3 stars"
        },
        {
            "comment": "#AWESOME mobile BUT #WORST charger 550 mah output its take too much time to charge. replace to 1A output charger charge too fast #cheap HEAPHONES. #BLINDLY BUY THIS MOBILE",
            "date": "26 Oct 2014",
            "name": "thameezu deen",
            "stars": "5 stars"
        },
        {
            "comment": "I would have rated the phone 5 stars but the major problem is with ringtones it rings late and waves between slow and high volume as result you tend to miss important notifications and calls.For many apps like fb,hangouts,messenger, it just doesn't ring. One cant use short and sweet ringtones due this problem. Its good for Nothing if you miss urgent calls throw such phone out from window, Phone is meant for ringing normally but this phone sucks same is the issue with Moto E, I have been trying to get some help from customer care but they are donkeys. I don't like the way the ringtone pattern is, its not absolutely ridiculous, waste of money buying a half dumb phone. I wont recommend anyone buy a ringtone dumb phone.",
            "date": "26 Oct 2014",
            "name": "Idris Andrabi...",
            "stars": "1 star"
        },
        {
            "comment": "Appearance wise this is cool but when it comes to performance wise it lags .RAM is not capable of handling multiple tasks (hangs a lot !!!) .Camera is good.Headsets are not up to the mark (I thought of buying a beats). Within 8 days of purchase the software crashed when I contacted the Customer care they said we will come to you within 2 days,but till this date no action has been taken ,worst customer care service .Then I rebooted it ,but again the software crashed (need more patience I would say ) I would suggest go for phones that provide service centers near you and NOT FOR MOTOROLA !!",
            "date": "26 Oct 2014",
            "name": "Anand Surya R",
            "stars": "1 star"
        },
        {
            "comment": "It is an awesome phn although battery backup is average but you will find this problem in every latest smartphones.",
            "date": "26 Oct 2014",
            "name": "Shaivyank Paterya",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is the best budget smartphone you can buy today. Sports a comfy design and a crisp 5-inch display. Very good Camera. Have been using this for almost a month now, very happy with the phone. Battery backup is almost 14-16 hours with moderate usage.Value for Money.",
            "date": "26 Oct 2014",
            "name": "Nitin Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product, everything is running smoothly. Timely delivery. You just need to replace the charger and headphone to make it ultimate. ------------------------------------------------------------------------------- Update on 06/04/2015: I am using this products for last 7 months. It becomes heating machine on data enabled mode. You just can't hold this phone while using data and location service. Slow in opening contacts and dial pad after 5.0 update which is not desired in a calling device. Other than these, everything is good. FYI, it supports OTG.",
            "date": "26 Oct 2014",
            "name": "Saikat Karmakar",
            "stars": "3 stars"
        },
        {
            "comment": "i got this phone yesterday.i quickly unboxed it.it also booted very quickly.i also downloaded lots of games and apps which were working fine and without any lag.its camera performance was also very good..but while charging its charger gets heated up very quickly bt overall moto g 2nd generation is a fabulous phone...",
            "date": "26 Oct 2014",
            "name": "vignesh pai",
            "stars": "5 stars"
        },
        {
            "comment": "I replaced this mobile for 3 times. am having the same issues, this mobile s always overheating. and we cant use the mob during charging, because the screen ll dance up n down and touch ll not work properly. and another issue is cal during cal if i got a cal from a person it will show like unknown number and am not at all satisfied with this product. please dont prefer it. THE ONLY THING I HAVE GIVEN TWO STARS IS BECAUSE OF THE FLIPKART SERVICE. but product does not worth for money and it has average battery life.",
            "date": "26 Oct 2014",
            "name": "VIVEK SRIDHAR",
            "stars": "2 stars"
        },
        {
            "comment": "Its my primary phone Good Things: 1. Camera is good but only in day light 2. System Updates are received faster 3. Built quality is good. I have dropped phone several times with a case protection. no scratch wear and tear Bad Things: 1. Terribly slow even slower than Moto e ( I own both &have compared with other Moto G also). I know the benchmarking and all. I know on bench marks it will be placed higher than moto e. But anyone just use both phone and compare moto e is noticeably faster. Its very laggy in short 2. Call quality is pathetic ( taking into account its 2014). Its so muffled cant recognize the words and sentences. Conclusion: 13k i think usability wise this phone is not so good",
            "date": "26 Oct 2014",
            "name": "Sagar Varule",
            "stars": "2 stars"
        },
        {
            "comment": "This instance has by far been the worst shopping experience i have ever had with flipkart or any other site for that matter. I ordered a Moto G (order no. - OD000945876499706200)in exchange for Nokia X3 - 02 on big billion day and a day after that ordered Xiomi MI3 (Order no. - OD000948904972772200). The courier guy came to my residence on 11th October with the order and to my surprise both orders were in same package(which should not have been the case as 1 of the item was under exchange). The battery of my return item Nokia X3 - 02 was not charged as the courier guy came without calling me, so i had no time to charge the battery. He said he cannot hand me over the order without confirming the IMEI no. of the exchange item. I said ok you wait, I will charge the device. He said I cannot wait and went back without handing me the order. I told him atleast hand me over the Xiomi MI3 for which i have paid in full and that is not under any exchange. he said I cannot as both have the same tracking ID. yesterday i got a message that my order has been cancelled. I want to know who authorised the cancellation of the order. This is sheer non sense on your part. I am highly irate. I have called the customer care atleast 10 times since yesterday. I even visiting your warehouse facility in Patparganj Industrial Area last evening. They also refused to hand me over my package for which i have paid full money. They said return is marked on the order and they cannot help me. Customer care says they also cannot help. and i have to order the product again. and when i tell them at xiomi mi3 is not available. they say its your problem and you have to wait for it to be available again. Now i dont know, you guys track my order and I want the Xiomi MI3 and I am not going to wait for. If this issue is not sorted out I assure you to take it to consumer court as the product i ordered for and paid in FULL by credit card was not handed over to me. Few things I want to know - 1. Why were 2 order clubbed under one ( when you knew 1 of them is under exchange) 2. How can you keep me from having something for which I have paid in full!! 3. Its been 12 days and I still dont have my handset. Just because of your silly mistake. I have suffered for so long. When will i receive my Moto G (2nd Gen) OR MI3???????????",
            "date": "26 Oct 2014",
            "name": "Varun Kalra",
            "stars": "1 star"
        },
        {
            "comment": "Phone was delivered on time as per promised date, in spite of the Big Billion Day rush. Kudos to Flipkart on that. Phone is very good for web-browsing, email, switching between multiple open applications. However, it looks like I got a defective piece. If you turn up the in-call volume to about 80% (which is required to listen in even a slightly noisy environment), the voice seems to crack badly - as if the earpiece diaphragm is torn (remember listening to audio on really cheap speakers, how it feels?). Same is much more true for Loud speaker. The call volume is low, but more than that, even for call to be audible in a relatively quiet house, the volume level needs to be set to about 80-90%, and there, the voice cracks much worse. It is unbearable. I tried various things: tried SIM cards of Airtel, Vodafone as well as Tata Docomo: all have full signal in my house, and all of them have the same issue. Important thing to note is: it is only call quality that is so poor. If you play Music or Videos, they play fine. Secondly, battery backup is terrible. With moderate usage, it does not last even 12-15 hours. That is in the first 1-2 days of usage (after full charge). If you browse continuously for about an hour or so, the battery will drain easily by 40% I have raised a return request with Flipkart due to defective earpiece & loudspeaker. I am hoping to get a refund.",
            "date": "26 Oct 2014",
            "name": "Kundan Burnwal",
            "stars": "1 star"
        },
        {
            "comment": "Product feedback: (After using for three weeks) 1) Camera is fabulous. Its is just amazing to click photos and very convenient to record videos and click selfies. Back camera looks unsafe as it is almost at edge. Design should have been secured this flaw. 2) 16GB Internal memory makes it convenient to install as many apps as you want. 3) Other specifications did not respond negatively 4) Processor lags at times. 5) Battery lasts for one day. Battery charging is a BIG PROBLEM. It takes more time to charge to deliver what it is giving. Feedback to Flipkart: My product was channelized through your warehouse in Bhiwandi town but you were not delivering product to people living in Bhiwandi. Ridiculous that I had to bother some body in a different location to receive the shipment.",
            "date": "26 Oct 2014",
            "name": "Kishor Chindam",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G (2nd Gen) is probably one of the best phone in this price range. Though its price is 3000 Rs. more than Asus zenfone 5 but its quality is way better than any phone in that range. Also it comes with out of the box kitkat 4.4.4 version with a guaranteed update for android L (now known as lollipop). A great flaw in flipkart: Don't ever use the services of Delhivery courier facility. It is probably the worst courier facility in terms of delivery time. It took them almost 2 weeks to deliver my simple order. Thumbs up for Google which is coming out with such great phone. Expecting Google to launch more such phone now with the advent of MOTO 360. Thanks a lot!!!",
            "date": "26 Oct 2014",
            "name": "Ninad Vartak",
            "stars": "3 stars"
        },
        {
            "comment": "This Product is good. Touch is wonderful, Worth in Price, Battery performance seems good as at least as of now in Full 3G/H+ it is giving battery backup more than 12 hours and in Wi-Fi it is even more. Thing which disappointed me is Indian Local Languages like Gujarati isn't supported, You cannot write or you can not even read Gujarati websites in the browser, So think on this point if you used to open local websites. Delivery took long long time + Address given to courier guy by seller was not accurate enough to track my location, He has to call me lot of time and I have to go and collect the product at some place mutually decided by Courier guy and me.. Pathetic..",
            "date": "26 Oct 2014",
            "name": "Tejas Barot",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this phone at that time i got a default piece but Flipkart returnet it in one week and i got the new Moto G2.. after using this mobile from last 15 days i must say it's best mobile ever. no lag nothing is happening and even i also checked water test 3 times on same mobile still it's working. youtube:3rd time water test .. just wrote this on youtube u got my video.",
            "date": "26 Oct 2014",
            "name": "Shahrukh Khan",
            "stars": "5 stars"
        },
        {
            "comment": "I am unable to hear callers voice , it happens very often . Looks like i got a defective set , I will ask to replace it . Also there is static noise when using the phone is connected to charger. Also I got white earphones and white charger with this mobile while the set is black!! Flipkart delivery was sooo slowww , I ordered the phone on 4th november and got it on 19th november. By LAST delivery date was extended 2 times. Really very annoying issue of calling, other wise phone is very nice",
            "date": "26 Oct 2014",
            "name": "Vineet Pratik",
            "stars": "1 star"
        },
        {
            "comment": "Writing this review after using this phone for 2 weeks, and guess what no heating issues I faced.Smooth as butter and Installed 25+ apps but still have 8 gb of rom left. PROS: 1.Better camera than the previous Moto G. 2.The screen is nice and is truly one water resistant one. 3.Speakers are nice they are STEREO and can make a difference while watching films 4.16 GB ROM+ 32 GB EXPANDABLE STORAGE, it is a game changer what more do you need. 5.Solid battery backup CONS: 1.Battery drains out when camera runs for 30+ mins. I DIDNT FOUND ANY MORE :P WORTH THE BUY GRAB THIS SOON",
            "date": "26 Oct 2014",
            "name": "Subhodeep Ghatak",
            "stars": "5 stars"
        },
        {
            "comment": "1GB RAM is too slow for KitKat. Just installed Candy Crush and Talking Tom, Mobile is hanging for every 5mins.",
            "date": "26 Oct 2014",
            "name": "srikanth",
            "stars": "1 star"
        },
        {
            "comment": "these phone is great. speed is good.. and battery is also good.. camera is just awesome.... overall great phone...",
            "date": "26 Oct 2014",
            "name": "Pushkar Moholkar",
            "stars": "4 stars"
        },
        {
            "comment": "My SIM disabling continuously, its is more irritating issue with my phone. I see many comments in Internet that IMEI number of MOTO G 2g is not registered yet. I don't know when this will resolved.....!",
            "date": "26 Oct 2014",
            "name": "Ramkumar Chand...",
            "stars": "1 star"
        },
        {
            "comment": "Hi Frnds, I recently purchased this phone. Its very nice in looks but I am facing lot of problem related to touch screen, On top of it Pathetic service from flipkart regarding returning and refunding. For Moto g2 I will give 4 starts out of 5 but for flipkart service its only 1 out of 5",
            "date": "25 Oct 2014",
            "name": "Bhushan",
            "stars": "4 stars"
        },
        {
            "comment": "I used to have a very good experience buying goods from flipkart. but this time when I ordered the moto g2 the product never arrived had to complain about this more than 3 times, after a week I get a message the shipment has been returned.",
            "date": "25 Oct 2014",
            "name": "Kishore Reddy",
            "stars": "1 star"
        },
        {
            "comment": "Delivery was very fast got in 1day.. Am gonna make it short.. Pros: Good cams both back and front Nice display Ok: Speakers Head phone Very sensitive touch BATTERY is attached to the phone Difficult while opening the back cover, you need to careful on this Cons: Very poor battery back up No usb Bad screen guard, you need to replace one",
            "date": "25 Oct 2014",
            "name": "L S",
            "stars": "3 stars"
        },
        {
            "comment": "flipkart's delivery is very good. but at first they delivered a defective product with speaker problem and worst battery life. but i replaced the defective product and got a good one but within 5 days i accidently dropped the phone and the phone display with gorilla glass 3 cracked . although this a great phone by leading company motorola. PROS: 1.excellent camera quality with 8mp 2.attractive look with various skins avialable in flipkart 3.good battery perfomance 4.great gaming perfomance with no sign of lag{device comes with 1gb ram} 5.faster internet browsing than samsung and nokia 6.HD display is very nice 7excellent touch screen CONS: 1. the phone gets slightly heated up while using 3G 2.accessories for the phone is quite costly 3.build quality is not superb BOTTOM LINE: I will recommend moto g[2nd gen] for my friends and relatives",
            "date": "25 Oct 2014",
            "name": "nishok avk",
            "stars": "4 stars"
        },
        {
            "comment": "Everyone tell me what a phone.........i really loved this phone, it is the real piece of Engineering. go for it",
            "date": "25 Oct 2014",
            "name": "Hemant Kumar M...",
            "stars": "5 stars"
        },
        {
            "comment": "Its a big disappoint for me buying this phone i am facing the 2 issues 1) Charger problem 2) Speaker problem Remaining all is ok",
            "date": "25 Oct 2014",
            "name": "GNV SATISH",
            "stars": "3 stars"
        },
        {
            "comment": "I say this because it is one of the most talked phone and a very compact in nature. Pros. Good display. dual sim. micro sd slot. upgradable to Android L and Lollipop when available. Great combination with google supported apps works relatively good. Cons. Camera does not focus near objects quickly. Speakers are not good(at high volumes). Other wise it is mind blowing.",
            "date": "25 Oct 2014",
            "name": "Puneeth keerthan",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after using this phone for a week. the phone is really good but it has problem with the accessories provided with it 1 the hands free provided does not have good volume quality(loudness) 2. the charger gets heated soon 3 too long charging time. 4 phone also gets heated soon. except this the phone has good features like 1 good speaker volume and also good sound 2 decent camera 3 good touch experience. 4 decent processor speed if possible preinstalled apps like file explorer and task manager should be given. N3",
            "date": "25 Oct 2014",
            "name": "Navroz Navodia",
            "stars": "4 stars"
        },
        {
            "comment": "Its being 2 months using this Phone. and I am happy to use it.. Just one things, its quite heavy in comparison to other phones, I used.",
            "date": "25 Oct 2014",
            "name": "Praveen Saini",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered moto g 2nd gen before diwali and expected delivery by 27th Oct, I received my phone on 24th Oct. Fast servcie and my phone works fine. Keep it up. I received my mobile on time and all the contents inside the box were proper. I am happy with the service provided.",
            "date": "25 Oct 2014",
            "name": "Gyaneshwar Mule",
            "stars": "5 stars"
        },
        {
            "comment": "It is my first smartphone. Mobile and charger is heating too much, mainly when I am taking videos and photos. Other than that every thing is working fine. I think there is need in improvement in voice quality, it's bit noisy.",
            "date": "25 Oct 2014",
            "name": "Rohit Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I did not expect this from motoroal. There is a small blue smudge on the top left corner of the new mobile. I would like to get a replacement. Otherwise the mobile seems to be good and has an excellent camera for its price. Have increased one star for quick response by the customer care cell and because an electronic item can have such problems which if replaced by the seller quickly is admirable. As of now flipkart has informed that they will do the replacement within 3 days. waiting for the same. As mentioned by the customer care it was stated that the problem will be resolved by 28th by 11.30 am. The first call itself came after the time and they suggested to install and try the software \"dead pixel detect\" from google play station. well it did not work and when I again called customer care they again took it as a fresh complaint stating the previous was resolved and have again changed the date to 31st. Excellent work flipkart. now i know how you guys state that you get the customer problem solved fast. you just give a suggestion and state that the problem is solved and if the suggestion does not work you take it as a fresh complaint.",
            "date": "25 Oct 2014",
            "name": "Prasanth Bhat",
            "stars": "1 star"
        },
        {
            "comment": "Very bad experience with Flipkart & totally disappointed with them this time. I have taken many electronic products from Flipkart.com & having such good hope & Trust on their services, but this time had worst experience. I was very much impressed with Moto G 2nd Gen & received from Flipkart. I noticed Back panel having issue as its not fixed properly & Battery backup issue's & raised complaint with Flipkart on 25th Oct'14. They have advised me within 2days will get call from tech team & they will resolve the issue. Unfortunately, no one contacted me & i have raised multiple complaints for these issues every 3days once, but so far no responses. Finally raised replacement request, they simple rejected without providing any valid reason for rejection. I can see lot of changes in customer care especially response comparative to previous experience, i use to get responses very effectively & timely for all these queries, but know totally am looking confidence & trust on Flipkart. Its near to month from 25th Oct, no response & no resolution.... Its really Disappointed. :( Looking for resolution...",
            "date": "25 Oct 2014",
            "name": "Balaji .",
            "stars": "1 star"
        },
        {
            "comment": "Firstly great delivery from Flipkart. The phone is amazing right from the presence in your hands, great touch quality, no heating up issues as I read at many places , amazing brightness and display, good rear camera with good formatting options . Well I would not say about the front one as its just 2 MP. Good UI. Cons -- Well I would say ppl using some custom Android phones will have a learning curve for the stock android here. Great deal under 13000 getting this phone.",
            "date": "25 Oct 2014",
            "name": "deep desai",
            "stars": "4 stars"
        },
        {
            "comment": "my second smart phone is motog2 and it is simple phone with the lots of new features simply have no words ooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo",
            "date": "25 Oct 2014",
            "name": "Raghav Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "in terms of usage the phone is better then any other phone in this price range. but in term of battery it is not so good motorola has to put some extra effort on battery to resolve battery issue.",
            "date": "25 Oct 2014",
            "name": "ravi singla",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart service is so damn super awsm Superb One day replacement Refund is so easy to have Just one line keep it up flipkart \\m/",
            "date": "25 Oct 2014",
            "name": "Insomaniac Harsh",
            "stars": "5 stars"
        },
        {
            "comment": "As claimed by the maker following features not able to find eCompass, Hall Effect Sensor, Accelerometer, Magnetometer, Proximity Sensor, Gyroscope, Ambient Light Sensor",
            "date": "25 Oct 2014",
            "name": "Balakrishnan",
            "stars": "3 stars"
        },
        {
            "comment": "Worth for Money! .................................................................................................................................",
            "date": "25 Oct 2014",
            "name": "Kishore",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered this as a gift and needed it to be delivered in time. The delivery was prompt and the product turned out to be better than expected.",
            "date": "25 Oct 2014",
            "name": "Ravinder Nain",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delivered it to wrong person and then I had to followup and run around to get it back. Very bad experience.",
            "date": "25 Oct 2014",
            "name": "Saurabh",
            "stars": "1 star"
        },
        {
            "comment": "For the Specs & price this phone is simply amazing I recommend this phone to people to don't want to spend a lot of money but sill get a packed up phone for a good price. check reviews on You-tube before buying",
            "date": "25 Oct 2014",
            "name": "Dujon Francis",
            "stars": "5 stars"
        },
        {
            "comment": "i request a replacement for moto g and they accepted and delivered a new moto g........its really a awesome samrtphone.... 8MP cam is rocking HD display high end graphic games playing smoothly and music is fantastic..........waiting for lillipop upgrade",
            "date": "25 Oct 2014",
            "name": "LoveLy Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone on 22/10/2014 and after using 2 days than i write review I use any apps like whatsapp, hike, Twitter, skype, even flipkart app too and other in built apps after using these at least 5 to 10 min it starting heat fast. Last and main if you use camera at least 2 min it heat up super fast in 1 min and due to heating problem full battery drop in 6 - 7 hours. I have no idea what mean of 'Flipkart Advantage' badge. Products tagged with the Flipkart Advantage badge are quality checked, i think 'Flipkart Advantage' badge no mean it not quality checked! Flipkart team fix this problem of my new phone, i'm too much frustrating with heating problem. I'm waiting your response!",
            "date": "25 Oct 2014",
            "name": "Prashant",
            "stars": "1 star"
        },
        {
            "comment": "hi flipkart, this is the second time i am complaining to you and i donot like it! first time was when my headphones with my moto g (2nd gen) was not working i got a call and you all replaced it after a week when i got the new phone i asked the person delivering whether u get a usb with it and he said yes. i dont have a usb connecting to any pc or laptop given to me within the box. if u say that it is attached to the charger wire..it is stuck my friend! i askd the guy can you remove it he said no maam its joint, moreover the end of the wire is also not working so technically i cannot charge my phone i have to use a diffent one! first the heaphones and now the charger! what is this nonsense..can you not give me proper wires with my phone so that i can be happy and actually recommend it to people??? Thank You, Radhika Sarda",
            "date": "24 Oct 2014",
            "name": "radhika sarda",
            "stars": "2 stars"
        },
        {
            "comment": "The product was delivered later by flipkart I ordered it on 6 October got it on 19 th Really bad by flipkart standards whose products reach me by 2-3 days I do understand there was additional load due to big billion day sales but this was very disappointing The phone itself is good !multitasking and battery life is really bad No lags whatsoever Performed beyond my expectations Is getting android lollipop officially :) 1 star less Because of late delivery",
            "date": "24 Oct 2014",
            "name": "techguru ROHIT...",
            "stars": "4 stars"
        },
        {
            "comment": "worst product sent by flipkart...please do not buy any thing else like this...it s best if u go on get in hands from shops.....they send replaced product to us...worst ever services by flipkart.....",
            "date": "24 Oct 2014",
            "name": "bala",
            "stars": "1 star"
        },
        {
            "comment": "awesome performance ....i had never ever seen really the speed will superb onee!!!! and also price one was very good but small struggle one s ..... charging time was tooo noisy and headphone isn't good for enough for this .....camera quality s tooo nice",
            "date": "24 Oct 2014",
            "name": "wasim fyrose",
            "stars": "4 stars"
        },
        {
            "comment": "Let Me tell U the Experience Is Awsm.... Noyhing Can beat It at tis Price... Camera:- 10/10Truly Awsmmm(Never Imagined) Front Camera LOoks Like the Back Camera!!! Screen:- No Question about it HD and 5' Screen And More Corning Gorilla Glass 3 Gaming:- I am Gamer.. So Let me tell u the internal memory(12.2GB) A hell Lot and Moreover Apps Can be Moved to sd Most of the apps.. Played Big Games like Asphalt8, Gta Vice city, PVZ2, Modern Combat 4 etc.. No LAG Awsm Gameplay. SOUND:- Dual Speakers Front.. Very Good Not Awsm... GOOGLE SUPPORT. Waiting For Android L.",
            "date": "24 Oct 2014",
            "name": "Utkarsh Ranjan",
            "stars": "5 stars"
        },
        {
            "comment": "specification wise its at par with all others in the same range, but performance wise it sucks, saying it after using two MOTO G2, had same issues in the first set provided by flipkart and the second one came with certain extra bonuses,,,, pros: 1. on paper a great phone to play with, great snappy processor, a GB of RAM, 8MP camera and all.. 2. Camera is good as compared to the previous version, but not the best in segment, but usable for me and for those who are not that camera junkie 3. Front speakers, loud speakers and timely updates of system softwares...the only 3 things that attracted ME...BUT YOU DON'T GET ATTRACTED..read all the reviews available at various forum, do proper researches and read the below if you have time :) cons: 1. You get less free RAM, game crashes again and again..for instance if you play asphalt8 on it, generally it starts the race and then crashes, but many times when it is not in mood it will crash the time you hit the start race button,, if it can not hold these kind of games then for what 1GB RAM is meant for, even Moto E is better than it in this section 2. heats up on 15 minutes continues use, whether it s gaming or any other app or just using the internet; 3. not meant for app lovers; if you install a lots of different app on the phone, this phone is strictly not for you, it onlly allows you to install upto 15-17 app, that too just basic apps not the heavy ones.... 4. every ones calling it cheaper nexus 5, YES it is cheaper but NOWHERE near NEXUS 5, in fact no where near CHota-Puraana moto G.... 5. another app crashing instance is of the PLAYmusic and man it is a major one, you scroll down at a certain speed and it crashes, you search for some random song and it crashes...the best developed music app certified by google crashes in such a great fashion....hail MOTO, Hail Flipkart and Hail hittttler, no offence :D buy it regret it feel free to curse the motorola and Flipkart (y) Statutaory warning: kisi ki kahi-suni baaton pe na jaayein, apna paisa kharch kare, pehle istemaal karein fir wishawas karein...",
            "date": "24 Oct 2014",
            "name": "Tushar Shrotriya",
            "stars": "2 stars"
        },
        {
            "comment": "It is smooothh. I had a samsung S3 before and the new moto g is much faster than the S3 and i'm thoroughly delighted. The stock android on this device works great and you wont feel any lag at all. The phone is fast but not that suited for multitasking given its 1 gb ram limitation. you cannot multitask running a game. The camera clicks beautiful photos and the slo mo video recordings are fun to look at. the build quality is top notch, the people who know about moto g would be the only ones guessing this device's price right. BEST phone BEST price. waiting for ANDROID LOLLIPOP update :D",
            "date": "24 Oct 2014",
            "name": "Rijul Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola has done an excellent job with g gen 2. Gifted to my wife and she was thrilled. Complain: Shipment by delivery was pedestrian to say the least. Got a txt \" Out for delivery\" on sat morning; ended up waiting for them to turn up but all in vain.",
            "date": "24 Oct 2014",
            "name": "Rohit Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 much awaited mobile for me. Almost after many days and nights of continous explore on different mobiles, I finally decided to bag one Moto G2. Lovely to hold , carry and dispay. The UI is just awesome folks. The rich interface, user friendly UI with cool presence, the logos, the colors, ease of access of any item - what not.. everything is fabulous. The speed , respose from web pages, desired output when performing something is truly responsive. Stunning display with updated Android platform helps me to stick to mobile always. The android syncs google account and helps you keep track of all notifications. very easy to install apps and so easy to access/run them. Dual SIM, front and rear camera with flash, good hardware specification and especially the solid body made me go crazy for it. This is truly unprecendented smartphone mobile below15k bucks. Would you like to experience the same? Then why late? Go and grab one for you and enjoy the beauty of smartphone only using Motoroll Moto G2.",
            "date": "24 Oct 2014",
            "name": "Laxman Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "excellent feeling to have a smart phone in our hands,and this motog2 has fulfilled all requirements.. ear piece is very poor.. charger is very very poor. flipkart delivery is par poor",
            "date": "24 Oct 2014",
            "name": "Prathipati Avinash",
            "stars": "4 stars"
        },
        {
            "comment": "This phone has everything that you demand after paying 12999..good display,good camera and good processor, only drawback is a little less RAM(it shud hv been 1.5gb) and battery life(only 2070 mAH). With an avg use the battery last only for 24 hrs..so U need to recharge it almost every day, call quality and reception is also good, can handle games like MC4, asphalt with ease..and motorola has already confirmed that moto g will get android 5.0 vefore winter break, which is something that places this device far ahead from all other smartphones in the race..",
            "date": "24 Oct 2014",
            "name": "apurva abhishek",
            "stars": "5 stars"
        },
        {
            "comment": "The best phone for 13K .... Its got everything . a good camera , 16 GB with memory card slot ... Everything thats required but the only problem is with the battery life ... its got the same battery as that of Moto G 1st gen but with a wider screen ... So battery consumption is at a faster rate .rest all is good",
            "date": "24 Oct 2014",
            "name": "Mahesh Kulkarni",
            "stars": "5 stars"
        },
        {
            "comment": "The screen guard doesn't have the google logo in white which gets faded on wiping or on regular usage, which now lefts the customer skeptic about whether it's a first hand or not. All Moto phones comes with this logo in white, which is left upon the user to wipe on usage. It's too early to talk about the functionality, as it is under use. Seems ok else.",
            "date": "24 Oct 2014",
            "name": "Rahul",
            "stars": "3 stars"
        },
        {
            "comment": "i'm reviewing this after using this 1 month. i used IPhone 5s aswell. Pros: Best performance for price,Slomo feature is awesome, best for listening music (excellent bass tested with xperia z both gave same bass performance), Stock android for snappy performance, Guaranteed upgrade to lollipop,awesome wifi range, excellent GPS with glonass, premium design, excellent noise cancellation,awesome display vibrant and vivid (excellent view angles), OTG support, nice multitasker , nice battery life, many more.. Cons: ram is some 850mb but its pretty enough for stock android, no USB cable provided, well thats it.. Finally its awesome phone ! can blindly go for it.. and many are reporting touch complaints in this reviews but it is false touch was snappy.. even better than Xperia Z.!",
            "date": "24 Oct 2014",
            "name": "cherry",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Delivery by flipkat I had ordered it on 16th oct & the delivery date was on 7th nov and i received it on 23 oct and phone is good but not excellent coz the batter drains very fast...",
            "date": "24 Oct 2014",
            "name": "Sudev Atgur",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone on 8th September, it reached me very fast. I started using it after 2-3 weeks. So roughly a month of usage now. It was all fine till today. It was running out of battery, so I put it on charge. Less than an hour, it told me it is charged. I knew that something is not right. Started using for another hour, now it has no charge. So, there are problems.",
            "date": "24 Oct 2014",
            "name": "Preethy Varma",
            "stars": "3 stars"
        },
        {
            "comment": "PLUS - Delivery and shipment, quite fast. PLUS - Seems to be quite good devices, speed, camera, touch, weight, sleek type. PLUS - Good package that comes with headphone with mic and power adapter. MINUS - 1GB ram is not sufficient enough, could have been atleast 2GB MINUS - The package does not comes with USB enabled connector/adapter, it just comes with power adapter only MINUS - For such a big 5 inch size device, the back cover quality is not sufficient enough. Overall I am satisfied with this moto g2 (I have been using apple for 5 yrs and moved to android now with this devices, so far no issues and limitation, worth for this money) !!",
            "date": "24 Oct 2014",
            "name": "Maurice Biche",
            "stars": "3 stars"
        },
        {
            "comment": "Very fast delivery by WS Retail..ordered on 19 October at 10 pm and got my phone on 22 Oct at 4 pm at Allahabad, Mobile is amazingly fast and look good. Sound quality is good. Internet surfing and playing YouTube video is smooth. Camera is also good. but one thing bother me is that APPS do not support PROXY server of my college although chrome is supporting. It need rooting of device to install proxy apps like proxy droid. anyway very good buy at this price.",
            "date": "24 Oct 2014",
            "name": "ashutosh KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I own a moto x which is comparable to my wife's moto g .. The screen is wider with 5inch .. Trust me the resolution of new moto g competes my moto x n only place where it fails is in producing colors .. Its seems faded a bit . but considering the cost its just too awesome and You can't make any difference until kept side by.. The built quality is quite excellent n not like a cheap Samsung phone plastics.. I am happy to exchange my wife's old Samsung s duos for this phone.. Thanks to flipkart for 2k cash back.. I am happy to float the laggy buggy phone .. Dont know how my wife managed to use the s duos for more than an year such a crappy phone.. Coming to battery section I see it gives a decent battery backup for 1day with screen on time of 3hours with WiFi on for at least 16hours and with browsing time 2hours n a little of gaming . I heard a lot of battery issues with moto g 2nd gen.. But it doesn't seem to be in my case.. browsing net.. I find 5inch screen is more handy for internet/games etc compared to my moto x 4.7 inch screen.. All in all the best phone with decent cost range..",
            "date": "24 Oct 2014",
            "name": "swaroop kavali",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent specifications with all requirements. I have researched about 1 month and finally choosen Moto g 2nd gen.",
            "date": "24 Oct 2014",
            "name": "Manjunath Sank...",
            "stars": "4 stars"
        },
        {
            "comment": "It is my 3rd Moto-G. Compare with moto g-1 its looks good in all. flip kart services and delivery were great. Thanks !!",
            "date": "24 Oct 2014",
            "name": "Pradeep Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Overall this phone is awesome but it gets heated just after 2-3 Min use. It heats up very soon just in calls or Picture clicking. I want replacement of this phone please arrange a replacement for this phone. i love this phone overall but only drawback is overheating.",
            "date": "24 Oct 2014",
            "name": "GAURAV ARORA",
            "stars": "1 star"
        },
        {
            "comment": "I've ordered the handset on 20th morning and received it on 22nd morning and made my diwali. I'm really happy with Flipkart delivery. However the phone is awesome. Camera is really good, I've used android phones and till now I'm satisfied with the battery backup. Yes but I think moto should have to give USB cable with the handset. But I must say if you're looking for a change you must go for it.",
            "date": "23 Oct 2014",
            "name": "Saksham Nigam",
            "stars": "5 stars"
        },
        {
            "comment": "The product was shiped fast. I couldn't explain how the Phone is when I first used on hands. motrola has done its best on releasing a buget Phone. I AM VERY MUCH SATISFIED...",
            "date": "23 Oct 2014",
            "name": "Joshua",
            "stars": "5 stars"
        },
        {
            "comment": "I have received a defective phone. It seems like it has a life of its own - it makes calls randomly, becomes unresponsive 90% of the times I use it, a few virtual buttons on the virtual keyboard don't work (this is a novel defect I have never come across before) and many more. I have asked for a replacement but flipkart hasn't responded yet. Quality of service has degraded I feel.",
            "date": "23 Oct 2014",
            "name": "S Roy",
            "stars": "1 star"
        },
        {
            "comment": "Phone is handy and looking good . Display is Good and touch is also sensitive. how ever some times feeling difficulty with fast play on touch. Sound is quite good to hear and iam extremely satisfied with sound. phone is not hanging and optiona are nice and user friendly. Finally when it comes to battery i filled it fully @ 5.30 AM iam journey for theentire day and it came to 20% @ night 9 o Clock. Finally about Service of Flipkart Its Worst I got phone after a Week even stock is available.and that too only for 200 kms Distance. For flipkart service iam giving only 1.5 point Rating.",
            "date": "23 Oct 2014",
            "name": "SabarinathReddy",
            "stars": "4 stars"
        },
        {
            "comment": "First of all thanks to flipkart for it's excellent delivery.I ordered it on the 15th of october and received it on 19th!!.I was been looking for a phone with good specs as well as durability in long run. And after searching for a month I finally decided to go for MOTO G(2nd Gen).The following are the pros and cons as well as the reality of this phone. Reality: 1.850 mb is the actual ram available 2.12.90 is the actual storage available.out of which 1gb is already occupied the pre-installed apps and system data. 2.It does have matte look which make it quite different and decent from most of 5 inch phones. 3.Charger is non-detachable.It doesn't come with data cable. Pros: 1.A very good IPS 720p display. 2.Good quality camera.both rear and front. 3.OTG functionality.You can mount most of usb drives like pendrives,mouse and mini keyboard. 4.Dual sim.micro only. 5.Ability to play many of large apps and games. 6.Antutu rating around 18000. 7.Android 4.4.4 which can be upgraded to android L. 8.Capacitive touch 9.Clear call receiving and making. 10.Dual and louder speaker Cons: 1.Doesn't come with pre installed file manager app. 2.Sound get distorted at high volume and sound quality both in earphone and speaker is average. 3.Sometimes sim is not detected. 4.Only high quality gamepad are recognised by OTG not any simple gamepad",
            "date": "23 Oct 2014",
            "name": "Bajranglal Tailor",
            "stars": "4 stars"
        },
        {
            "comment": "Its a good product but why a company like Google would ship something like this without a USB connector is beyond me. How does google think we will sync the exiting music and videos on our computer. As usual Flipkart has been great.",
            "date": "23 Oct 2014",
            "name": "Raj Bhat",
            "stars": "3 stars"
        },
        {
            "comment": "i brought moto g (2nd Gen) two days ago i used this phone for 20 min it is producing very much heat and bettery problem please replace it please call me 9040811540",
            "date": "23 Oct 2014",
            "name": "Venkata Kaja",
            "stars": "1 star"
        },
        {
            "comment": "We purchased moto G 2nd genreation. The battery was running out very fast and we are facing big difficulty by this. We had applied for the return of the phone on 13th of october, but till now none of them from your side came and returned the phone till now.daily they are postponing. I seen many sites but i had not seen this kind of customer service any of them. this is great black mark on the flipkart. so please do the needful ASAP. Thanks, Srinivas kommisetty 8978977797",
            "date": "23 Oct 2014",
            "name": "Srinivas",
            "stars": "1 star"
        },
        {
            "comment": "Dear flipkart, Stop fooling people with your stupid promises please shut ur stupid services now.. We dont need it..",
            "date": "23 Oct 2014",
            "name": "Pavan Kumar",
            "stars": "1 star"
        },
        {
            "comment": "plz dont buy moto phone it has bad services and it is worst .i recently bought moto g 2 generation from flipkart and after 1 month it was dropped and my screen was scattered when i went to service center they told that its parts are not available and it will cost around 6000 bullshit .dont buy this moto phone it has bad servicing.",
            "date": "23 Oct 2014",
            "name": "Kris New-Ray",
            "stars": "2 stars"
        },
        {
            "comment": "I bought the moto g (2nd gen) smartphone and found to be nice. Firstly, It is a very good phone with good video quality,sound n specially the wi-fi system is damn good. Till now I have not got any problem with the service. Only I want to include that battery time is less as expected when wi-fi or data connection is kept on. A great experince with moto g. Secondly, the delivery system (mainly the customer support of bluedart) is very very poor.So, a kind request to you to look after it.",
            "date": "23 Oct 2014",
            "name": "MANIKANTA BORAH",
            "stars": "5 stars"
        },
        {
            "comment": "I was not happy with this,too much heat coming, unable to make call while it heat coming, when we keep it at ear..the speaker heat was horrible..it burns my ear, And everytime application closing automatically Features are ok..but heat is too much if i use it for 30min just 30 min",
            "date": "23 Oct 2014",
            "name": "durgapratap",
            "stars": "2 stars"
        },
        {
            "comment": "I have taken this Moto G(2nd Gen). I liked the phone but main drawback in this phone is its battery backup. its taking more than 5 hrs to get 100% charging and not even getting 24 hrs to dry up battery. I don't know what to do whether i should replace or ... So please analyse before taking it.",
            "date": "23 Oct 2014",
            "name": "Suneel Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Moto g2 is one of THE best android smartphone under 20K. It has got all the basic elements of a premium smartphone.Although it hasn't got the best looks.. it surely is a value for money phone. The camera is good... if havin a dilemma about buying a smartphone for a low price.. this it it ..",
            "date": "23 Oct 2014",
            "name": "Aravind reddy",
            "stars": "5 stars"
        },
        {
            "comment": "all the features given in this phone are good. best phone in this price range. No such lags yet. I have been using this phone for 3 weeks now am very satisfied with it. The camera quality is not as good as sony or samsung. The pictures look real as they are and do not add extra effect as we see inexperia or samsung(have experimented on it). The secondary camera is really good no doubts about it. battery backup is fare. With rigorous use it will die out faster as is the feature with all smartphones.But with average use it lasts for a day.yes one thing i found surprising was there was no file manager application to see the contents of the extrnal card. But that is compensated with a file manager app from google play.",
            "date": "23 Oct 2014",
            "name": "Reema Khan",
            "stars": "5 stars"
        },
        {
            "comment": "Great Phone with a v good OS and many brand new features, grate to daily use. And the battery OMG!!! 16 hrs constant 3g data connection on and net surfing & downloading. WAO what a great camera with auto focus. In one word mind blowing phone.",
            "date": "23 Oct 2014",
            "name": "Sunny Batabyal",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is worth its cost. Got it on exchange for 11K during big billion day. Rating it for 4 due to battery capacity which is 2070mAh Had it been 2500mAh i would have given 5Star !!",
            "date": "23 Oct 2014",
            "name": "Ram",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered a Moto G 2nd gen on 6th oct, 2014 and received the same on 9th oct. I was immediately let down after first boot as the display had a blue line on its left side. other than that the phone was exceptional. hence I requested a replacement an received the replacement the next day of my request. Was happy with Flipkart CS and was happy to see the display was okay after first boot. But wen i tried to insert my sim card after initial charging there was another problem. the sim keeps coming out as it doesnt lock in the slot. was disappointed again as i cant use it as a phone but just as a media player. Both sim slot had the problem. I again requested a return. and after 2 days a sweet voice from flipkart told me she'll refund my money. I objected as it was a phone i needed. And after a lot of persuation she agreed to send a replacement. I received my third handset on 20th oct and wen i checked it also had the same problem. the sims wont lock. I'm otherwise happy with the set and i'd desperately like to keep the phone. But I'm afraid to order a replacement again as it may have worse faults. I'm really disappointed with Quality assurance of both Flipkart & Motorola. Do u think you can sell any crap to us customers? (two stars are for the prompt delivery & CS and 1 for the phone. the phone will get 2 more if i was able to insert a sim and use it as a phone)",
            "date": "23 Oct 2014",
            "name": "Ajith Mc",
            "stars": "3 stars"
        },
        {
            "comment": "my moto g is not opening its very bad so plz return my money or change aother mobile my oder no OD200964436468676500 oly i am used 5 days its to bad",
            "date": "23 Oct 2014",
            "name": "Sanjeev Mita",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g 2nd gen provides amazing features at quite a fair price when compared to similar phones from other brands. Android 4.4.4 runs butter smooth on the device and i have faced no lags during the 1 week that iv been using the phone. The battery issue is genuine. but nothing is wrong with the battery. It only needs to calibrate to display the proper battery percentage. So a couple of complete recycles of the battery should do the trick. I drained the battery full then charged it 100% and did this two times..now i have no issues with the battery..it lasts 1 full day and still has about 25% remaining. For the downsides.. a) it gets pretty warm near the camera while playing demanding games..even the screen gets hot while playing fruit ninja..something that also used to occur on my lumia 720. b) The ram could have been 1.5gb...and 360 security almost always shows about 70% used..but considering the device never lags i guess the 1 gb of ram does its job. c) i do wish the battery was removable but most phones are coming with non removable ones so that is fine. Apart from these i really have not faced any issues with it..and its quite a delight to use the phone. However with the likes of sony e3, lumia 730 and galaxy prime emerging into the scene i believe moto g 2nd gen faces a tough competition. It just goes to show no device can remain in the limelight for too long in this hugely advancing tech market.",
            "date": "23 Oct 2014",
            "name": "debarpan dan",
            "stars": "4 stars"
        },
        {
            "comment": "Such a worst experience in my flipkart ordered life...Please take a good remedy for that otherwise you are missing some valuable customers....",
            "date": "23 Oct 2014",
            "name": "Siva Sankar",
            "stars": "1 star"
        },
        {
            "comment": "This is an awesome phone for this price range. Only problem is that it heats up very fast and speaker clarity not good(like sparking sound) The inclusion of the microsd card is a very handy thing,,,,But never the less is it a good buy and worth the money",
            "date": "23 Oct 2014",
            "name": "Jobin Antony",
            "stars": "4 stars"
        },
        {
            "comment": "First of all Thanks to Flipkart u had replaced my mobile up to now no issues i am facing and coming to mobile its simply amazing :) I would recommend to buy this mobile if your budget is below 15k.",
            "date": "23 Oct 2014",
            "name": "Pavan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Don't buy any other phone under the sub category of rs.20000. But Moto G 2014 only. You will waste your extra money spent on other phone. Instead you can spend that money on memory card and good quality earphones.",
            "date": "23 Oct 2014",
            "name": "Hasu Patel",
            "stars": "5 stars"
        },
        {
            "comment": "peoples who r talking about battery let me tell u battery is well enough to survive a day software is awesome ram management is good overall a happy experience with this smartphone,......u will love this since u handover this",
            "date": "23 Oct 2014",
            "name": "ashish chowdhary",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is pretty good when compared to the 1st gen moto g. But still zenfone 5 is a bit better than this phone. I can see the display is vibrant in zenfone 5 and redmi 1s gives the same specification for just 6k. I can give 4 stars for this phone.",
            "date": "23 Oct 2014",
            "name": "Gokul Raj",
            "stars": "4 stars"
        },
        {
            "comment": "After comparing multiple phones, I had three phones in my list: Asus Zenfone 5, Micromax Canvas Nitro and Moto G2. I was totally confused and ended up with Moto G2 on 10% cashback offer. and today I had oppotunity to use Zenfone, and I'm totally satisfied with my Moto G2 in terms of its smooth performance, nice ppi, good camera, premium body looks, and mostly with the word \"Please exchange my Zenfone with your Moto G.. Plz plz plz \" ;) It really feel nice to have this phone, phone is worth toward it's value.. My suggestion \"Go For It\"...",
            "date": "23 Oct 2014",
            "name": "Niloy Datta",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best smartphone in this price range and it works very fine. If your budget is under 13,000, I would say go for Moto G (2nd Gen) without hesitation. I've already used Moto G (1st Gen) and just received this Moto G (2nd Gen) 2 weeks ago. Pros.: -Look and Design is very good. Nice carve shape & Smooth backside. -5\" HD Display,Nice,Fast, Crisp and Vivid. -The front Dual speakers are awesome, Loud n Clear, -Call quality is also nice it has 2 mics with Noise Cancellation (works fine) -No network problem in this model so far. - 8 MP main camera & 2 MP front. It takes amazing pictures so far both indoors and outdoors. -micro SD slot up to 32GB (great inclusion) -lag free latest Android 4.4.4 (kitkat) -Good processor & graphic speed You can play most of high end games. Multitasking is also very smooth -Wifi connectivity is good works nice. Con's -Video camera is good but not great. Please put \"Image Stabilization\" in next edition. -Battery performance is average. -Charger getting heated while doing charging. -Device also getting more heated with back covers. -Headphones are not good...Cheap and useless for me. -Data cable for is an essential need which can be fulfilled. -Some reflected lines you can clearly see in the screen on sunlight. This feel uncomfortable to see anything in device's screen on sunlight. At last great job Flipkart u have delivered my phone much earlier than I expected. Completely satisfied with the delivery service (depend on seller) and packing.",
            "date": "23 Oct 2014",
            "name": "Nimesh Patel",
            "stars": "4 stars"
        },
        {
            "comment": "Thank you flipkart thank you so much.... to deliver me the product before diwali... In love with the phone. Though I have not used it much till now coz of Micro Sim Issue but I loved the display and camera quality....",
            "date": "23 Oct 2014",
            "name": "Hina Kathuria...",
            "stars": "5 stars"
        },
        {
            "comment": "no need to read any more reviews. just go for it. this phone is a wonder at this price. Battery life is okay not as worse as people have mentioned in other reviews. Flipkart delivery was bad though, received the product after 7 days.",
            "date": "23 Oct 2014",
            "name": "manoj bindra",
            "stars": "5 stars"
        },
        {
            "comment": "The quality in this price !!! ... No comment on it.. If you are looking for something rely on with almost all the feature. then this is the one. I am using it for last one month and I am not finding any issue/feature to complain. Very Good Product",
            "date": "23 Oct 2014",
            "name": "Monaj Mondal",
            "stars": "5 stars"
        },
        {
            "comment": "Really bad service provided by flipkart,unlike what they claim.My Moto G 2 gets badly heated up externally,which has caused superficial burns to me.Flipkart tech team takes more than 4 days to revert back and resolve my issue.I feel cheated by flipkart as a customer.",
            "date": "23 Oct 2014",
            "name": "Clint",
            "stars": "1 star"
        },
        {
            "comment": "Since i bought the phone,i had put it on test for 3 weeks and i am writing this review after a thorough evaluation for 3 weeks. I checked for each and every thing in the phone like battery life, performance,multitasking, heavy games, video calls,camera etc etc. what i can say that the phone just fares well in every aspect. i am getting 5 hrs of on screen time which is nearly 18 hours battery backup on a single charge. The new update has made the phone more smooth and fixed a few bugs. The pure android experience is just awesome. i am loving it. :)",
            "date": "22 Oct 2014",
            "name": "Ashutosh Kumar Padhy",
            "stars": "5 stars"
        },
        {
            "comment": "i have both ASUS zenfone 5 ( 8 gb) and thisone but zenfone is far better than this... .................................................................................................................. ...........................................................................",
            "date": "22 Oct 2014",
            "name": "Tejas Patel",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered phone on Thursday and got on Sunday with normal delivery that too in patiala , so it is actually good, Now coming to phone , it is simply awesome phone , Pure android experience is like butter, followings are the biggest plus poinnts :- 1. HD 5 inch display with crisp colours 2. Quad core processor , handles high games very well. 3.Plays 1080p videos smoothly 4.8MP rear and 2MP front camera. 5. light in weight. I did not find any con in this phone as of now,,if u find , let me also know :)",
            "date": "22 Oct 2014",
            "name": "Yogesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "my moto g2 went blank by itself within a 3 days of delivery and now i cant even turn it back on. lets hope for replacement.",
            "date": "22 Oct 2014",
            "name": "Javed Mansuri",
            "stars": "1 star"
        },
        {
            "comment": "Good product from Motorola at this price... touch & camera quality is better comparing 1st gen.... Worth buying at this price......",
            "date": "22 Oct 2014",
            "name": "Rajan",
            "stars": "5 stars"
        },
        {
            "comment": "i have not received my order(moto g2) yet bt here status shows that it was delievered on 21st oct...................what is this",
            "date": "22 Oct 2014",
            "name": "RUBY KUMARI",
            "stars": "1 star"
        },
        {
            "comment": "Please don't buy Moto G2.I'm using mato g2 since 3week,it is heating like a molten rock while playing games and using internet,Both screen and back.Flipkart didn't take any action about my return request.",
            "date": "22 Oct 2014",
            "name": "Eldhose Ao",
            "stars": "1 star"
        },
        {
            "comment": "if you are fool then buy 2nd generation and if you are wise then buy 1st generation.screen resolution is very poor than 1st gen and performance is not upto mark.",
            "date": "22 Oct 2014",
            "name": "Ranjeet prasad",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone a week ago, I didnt face a single problem with this, This mobile works like a charm, and it is even getting the andriod L update what else do you want from a 13K budget phone? Simply outstanding!",
            "date": "22 Oct 2014",
            "name": "Gurpreet Kaur",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile phone is not turning up after 20 days. Logged case at flipkart but flipkart also not responding... Who is responsible for this.? I want a refund or replacement??? Flipkart disappointed me with their service.",
            "date": "22 Oct 2014",
            "name": "Anant Baddi",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this phone 3-4 weeks ago from flip kart and had done analysis for all pros and cons, here is my observations by comparing Samsung Galaxy - Pros - Good battery, Display is awesome, Camera is unbeatable....very good quality for pic and making movies, processing speed is far better than samsung Cons - Call recorder does not work which is my requirement. Folder can not create in gallery, can not delete multiple contracts in single shot. Over all good phone and worth for money.",
            "date": "22 Oct 2014",
            "name": "Ajay",
            "stars": "4 stars"
        },
        {
            "comment": "Just got my phone. Phone is good. Packaging was good. But the color of charger and headphones is white instead of black as my phone is black.",
            "date": "22 Oct 2014",
            "name": "satinder singh",
            "stars": "3 stars"
        },
        {
            "comment": "i ordered this phone and this phone worked correctly for some days... then the display started blinking after some regular of times! and this is the time where the screen went black! the phone is working but the screen isn't!!! i placed a return request and they said that they will contact me by 5:00p.m., 20th October,2014. But there isn't any call from them even after two days!!! worst freaking service..!",
            "date": "22 Oct 2014",
            "name": "Ridham Dabhi",
            "stars": "1 star"
        },
        {
            "comment": "My phone is not getting charged.I bought the phone moto g2 on the bigbillionday of flipkart.only 10 days have passed.now it is not getting charged.even though I use the charger provided by the company.",
            "date": "22 Oct 2014",
            "name": "surya",
            "stars": "2 stars"
        },
        {
            "comment": "I must say..Am very impressed with the service of Flipkart. I purchased Moto G2 by exchanging older smart phone on billion sale day. It was delivered in 3 days with excellent packing. My new mobile was having WIFI compatibility issue and I informed Flipkart about the same. They immediately offered replacement in 3 days time. This's my first purchase of mobile through online and It exceeded my expectations. Love Flipkart :-)",
            "date": "22 Oct 2014",
            "name": "Nandan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "On 1st day itself touch was not working and lags in between,don't forget Moto is bought by Lenovo so don't expect a good quality phone.Second flipkart's service has been worst they committed to resolve issue before 22nd October and later they didn't communicated. i didn't find appellate to complain to higher authorities. Please think before buying from flipkart and Motorola's inferior phones",
            "date": "22 Oct 2014",
            "name": "Abhishek Mali",
            "stars": "1 star"
        },
        {
            "comment": "Nice to have this phone. Less weigh and handy. Good resolution. Both front and rare cameras are okay (Good to get at this price).",
            "date": "22 Oct 2014",
            "name": "Anil Gatta",
            "stars": "4 stars"
        },
        {
            "comment": "This is my second Moto G (2nd Gen) from Flipkart. Placed order yesterday about 8:30 and I received the product today at 12:00PM. Fastest delivery I have ever seen. And yes the phone is exceptional in performance and design.Nothing more to write about the product. I have been recommending the phone to my friends and family since I bought my first Moto G (2nd Gen). Of course its not a perfect phone, but for the people who are looking for a good phone within INR 15,000.00, this is the best choice. Highly recommended.",
            "date": "22 Oct 2014",
            "name": "Joseph C.C",
            "stars": "5 stars"
        },
        {
            "comment": "Love this phone, cool display, light weight. and full value for money. Go for this, it has all the features of expensive phones.",
            "date": "22 Oct 2014",
            "name": "Puneet Vijay",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is very good. But the only problem is there is no search option for the contacts. That's very annoying. Except that? Everything is perfect. Specially the Cam. Value for money.",
            "date": "22 Oct 2014",
            "name": "Tarun kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i received mobile with accessory but charger is not working properly. What i do.?? Other accessory is good. Mobile also in good condition.",
            "date": "22 Oct 2014",
            "name": "Jay Maheta",
            "stars": "3 stars"
        },
        {
            "comment": "I got my black phone past week. After 1 week of use I can't get any issue with the phone. It's performance is incomparable to other leading brand like samsung and sony. This mobile is much worth able for the price 13k. You can't get any branded mobile with HD display, corning gorilla glass, water resistance, and assurance of Android L upgrade for price of 13000. Just close the eye and buy.........",
            "date": "22 Oct 2014",
            "name": "Vahid N",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: - An SD slot makes storage more comfortable - Bigger screen, off course good for all gamers - Better cam quality compared to previous edition - Slim and reduced weight makes better Cons: - Cam quality has to be improved by Moto as it would be better if Carl Zeiss are preferred with some additional cost Recommended for all users who don't depend of mobile cam as Moto needs to improve a lot on Camera feature.",
            "date": "22 Oct 2014",
            "name": "Rufus D",
            "stars": "4 stars"
        },
        {
            "comment": "since i ordered this phone during the festive season so i had to wait a little longer for the delivery of the phone but as usual the packing was good and didn't receive a defective piece as a few customers have complained. pros: * amazing build up as the phone looks awesome with its curvy edges and back. * despite having the same resolution as the previous moto g, the resolution of this is pretty good. * the processor and ram are ok as for now i haven't faced any problems regarding the same. * the rear camera is awesome with some amazing low light capturing abilities. the same can be said for the front camera which produces decent pics. the features included in the camera do full justice. * the most amazing thing about the phone is its sensors. the touch is brilliant and the motion sensors are awesome. * there is no heating problem either while playing games or charging. * moto assist and migrate apps are a good inclusion. * screen size is 5 inches so you enjoy videos and games quite comfortably. cons: * i don't know whether its a problem or not but the lock and volume keys are a bit rocky. it somehow gives you a feeling that they are loose but looks ok to me. if your budget lies in between 12k to 15k, this is the phone to spend money on. great work by motorola and google.",
            "date": "22 Oct 2014",
            "name": "Manish Jena",
            "stars": "5 stars"
        },
        {
            "comment": "its very nice ..best in the same price which provides quality with the quantity. Motorola is growing day by day in india Exceptionally well ,any day better than samsung,HTC(which i own) bought it for my father and he can easily use it",
            "date": "22 Oct 2014",
            "name": "aditya khimesra",
            "stars": "4 stars"
        },
        {
            "comment": "Wow... Moto g2 is just amazing, Display is exceptional..stereo speakers,camera and everything is just great. I wonder a better phone than this at this price... must appreciate flipkart delivary service too.",
            "date": "22 Oct 2014",
            "name": "Venkat Raghavan",
            "stars": "5 stars"
        },
        {
            "comment": "I brought my '' Moto G '' before 2 weeks ago & now my phone is completely dead. I registered complaint on 18 October for replace my phone but flipkart customer care is not responding till now, i trying to call flipkart customer care many times but they r giving me same answer they will call u within 48 hours ... still no call ... so please think before u buy from flipkart .......",
            "date": "22 Oct 2014",
            "name": "KIRAN PANCHAL",
            "stars": "1 star"
        },
        {
            "comment": "Best phone in the market(for its range.) . Easily provides a battery backup of 16-17 hrs under normal usage. Go for this phone if your budget is less than 15k.",
            "date": "22 Oct 2014",
            "name": "Anijay",
            "stars": "4 stars"
        },
        {
            "comment": "This has been a great experience with flipkart. On such a heavy sale pipeline, I received the mobile 10 Days before commitment date. As far as the handset is concerned, its looking nice and good one. The technical specs are quite good enough and explains itself the goodness of the gadgets. I have gifted this one to one of my friend. Once again thanks to the the whole team from Flip Kart to the delivery Chain.",
            "date": "22 Oct 2014",
            "name": "Mohammad Imran",
            "stars": "4 stars"
        },
        {
            "comment": "Well so far so good. Completely satisfied with the delivery service and packing which flipkart is so renowned of. Will review about phone a few months later",
            "date": "21 Oct 2014",
            "name": "Bishwanath Mukherjee",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on Friday and got on Monday. Speedy flipkart(WSRetail) delivery as ever. Phone looks amazing and happy with phone look and design as well touch screen. I will update you the detail review after experiencing the product. Overall its best in market.",
            "date": "21 Oct 2014",
            "name": "Viren Koradiya",
            "stars": "5 stars"
        },
        {
            "comment": "Sir, I have received my product but I have not received any bill of the same. So, I request you to process it as soon as possible.",
            "date": "21 Oct 2014",
            "name": "Ashish kumar Sahu",
            "stars": "2 stars"
        },
        {
            "comment": "awesome product.even bigger and better screen than previous edition.truely as described by the seller.i am writing this review after using the phone for 2days.the phone didn't hang even though i was using several applications simultaneously.the touch is much smoother and flawless. it definitely can be considered as the best one in its price segment.",
            "date": "21 Oct 2014",
            "name": "mohit sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Hi ..very excited after receiving the MOTO G awesom mobile but one dissappointment was charger not working and i expected USB cable in the box no usb cable and charge not working...",
            "date": "21 Oct 2014",
            "name": "Rangi Sai Teja",
            "stars": "5 stars"
        },
        {
            "comment": "i have already request to cancel my shipment 2 days before recving the product, but your courier person will given the product to my office recipetion. when we reach office so see the product and call your customer care team. she was saying that flipkart person have tacken the product. but till now no one have tacken that product. finnaly i need money plz return my money ASAP. this is my second Very Bad Experince ..first bad experince i purchase Samsung Grand on december 2013 that mobile totally burst not working properly.. Arpit",
            "date": "21 Oct 2014",
            "name": "Arpit Gupta",
            "stars": "1 star"
        },
        {
            "comment": "the basic feature of dual camera phones \" VIDEO CALLING ' is not possible with the phone using our cellular network, such a poor phone!!! very bad/",
            "date": "21 Oct 2014",
            "name": "Guruprasad Guru",
            "stars": "1 star"
        },
        {
            "comment": "I ordered the phone and got in 2 days. Thanks to Flipkart's Super fast service. Package was good. Got the device in perfect condition. No issues with device. Thanks for the good service. Kindly go for it, if you are looking a cool phone in reasonable amount.",
            "date": "21 Oct 2014",
            "name": "Charan CC",
            "stars": "5 stars"
        },
        {
            "comment": "As usual flipkart did very good job in there service. Got it delivered in 2 days. And about the product. Good product. Got the white one. 1. The design and looks are very elegant. 2. Display is very good. 3. Performance is smooth. Haven’t had a hitch till now. One reason could be because of the basic android version. One down side for that is very limited settings. For Samsung users it could be a trouble initially, but once you get used to you don’t find it bad at all. 4. Camera is decent if not extraordinary. 5. About the battery. When I recharged it for the first time it got heated up. But then on no heat issues till now. Battery life is not very great, but manageable. Overall for 13000 I would say it’s a good buy.",
            "date": "21 Oct 2014",
            "name": "Karthick",
            "stars": "4 stars"
        },
        {
            "comment": "If your on a budget and your looking for the best specs as well then this is the phone to pick up. Pros Good Battery (depends on internet usage) Good camera Ease of access Expandable memory (a good upgrade compared to the previous version) Cons heating",
            "date": "21 Oct 2014",
            "name": "N Fernandes",
            "stars": "4 stars"
        },
        {
            "comment": "Hi guys, I just brought the moto g2 and this phone is awesome ... Go for it without much thinking... And flipcart once again prove to me that it has the best service in the india than other competitors. Thanks to flipcart and Happy Diwali to all.",
            "date": "21 Oct 2014",
            "name": "Amol Suryawanshi",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone.......buy it without any hesitation... I personally used this product for 2 months.....",
            "date": "21 Oct 2014",
            "name": "Hardikkumar Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing product in this price range. You are guaranteed to be satisfied with this MOTO g2. Nice features, smooth UI, flawless experience.",
            "date": "21 Oct 2014",
            "name": "Amit Mukherjee",
            "stars": "4 stars"
        },
        {
            "comment": "This is good quality phone and fits well in hand though big. Good performance even with heavy games. Decent battery performance.",
            "date": "21 Oct 2014",
            "name": "moses mathew",
            "stars": "4 stars"
        },
        {
            "comment": "Order placed on 6th Oct, got delivered on 19th Oct. No proactive information shared in the meantime on the whereabouts of the order, the online tracking simply did not provide any update. Had to call customer care multiple times to get better updates but realized that they had no means to track the order status either and were never able to share a reliable expected delivery date - it simply kept moving ahead. The product packaging was average. The phone box itself was bubble wrapped for added safety. The old phone exchange process was seamless, no fuss. The delayed delivery did spoil the party.",
            "date": "21 Oct 2014",
            "name": "Anoop Maheshwari",
            "stars": "2 stars"
        },
        {
            "comment": "Instead of buying some junk samsung under 15k, I would say go for Moto G. It has got everything you are looking for in a smartphone",
            "date": "21 Oct 2014",
            "name": "Rupam Khaitan",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G2 on last Friday and it was delivered on Saturday itself !!. Thanks to Flipkart for the quick delivery!!. Moto G2 looks great, fit perfectly on hand and easy to use. Touch is smooth and display is quite good. I think they have concentrated on the features which can help them to complete in the market but lags the basic features. Battery dries too fast. I have to charge it twice a day :-(. Also there is a noise in the call audio, couldn't talk longer on this phone. I have raised return request to Flipkart to send the non-defective device. Hopefully will get it replaced!!. If Motorolla can fix these issues, It will be hard for others to beat it in this segment.",
            "date": "21 Oct 2014",
            "name": "Madhusudan GM",
            "stars": "3 stars"
        },
        {
            "comment": "The phone is great. All specs are awesome. Value for money. I am using this phone from past 2 weeks. Sound great, Display great, Camera good. From my side yeshh! Go for it.",
            "date": "21 Oct 2014",
            "name": "Kamal Khurana",
            "stars": "5 stars"
        },
        {
            "comment": "Recieved mobile set one week back but it is not getting updated to newer system verion i.e. 21.14.23. Already registererd my compalint, But Not recieved any callback from last one week.",
            "date": "21 Oct 2014",
            "name": "Supriya Pahwa",
            "stars": "1 star"
        },
        {
            "comment": "Kudos to flipkart for their service. I got the product in a day. Overall the phone is good with a battery life of a day, good speakers. The phone is not sturdy. A simple fall and there is a break in the display. Flipkart says that this product comes with a corning gorilla glass which gives extra protection. But, this is not true. The front glass broke with a small accidental fall. I had previously used Galaxy S2 which was pretty good and withstood many falls without any problem. From user experience, the phone is good but from durability aspect I do not recommend this phone.",
            "date": "21 Oct 2014",
            "name": "Hemanth Nagaraju",
            "stars": "1 star"
        },
        {
            "comment": "I liked Moto G2 , Pros : Good camera quality , Nice HD display , Good UI Cons : No Usb in box and charger pin to mobile is not smooth , difficult to insert",
            "date": "21 Oct 2014",
            "name": "Ajith Wali",
            "stars": "5 stars"
        },
        {
            "comment": "Hello everyone ....I ordered Moto G (2 gen.) on 25th September 2014....Delivered on 29th sep 2014 evening. I was not getting any type updation (delivery status) before 29th sep. So, poor delivery service. 1. Screen: Nice,Fast, crisp and vivid, but only 720p. With Snapdragon 400, I guess 720p makes more sense than 1080p. It is 5 inches in size but feels compact and usable in single hand. 2. Performance: Android 4.4.4 comes pre-installed. Lag-free so far. Runs Riptide GP pretty well. Should run all games meant for Snapdragon 400. MS Office, Facebook and Google Drive all work fast and fine. 3. Sound: The front dual speakers are awesome. Very nice sound. None of the other Motos (E/G/X) so far had this kind of fidelity. 4. Camera: 8 MP main cam & 2 MP front. Very good snaps so far both indoors and outdoors. Got only 20 mins to experiment :) 5. Call quality: 2 mics with noise cancellation and a loud speaker! Feels good. 6. Micro SD Slot: This is the greatest inclusion. Moto G sorely missed that. Good option. 7. What else do you want? :) C'mon guys what else do you expect from a phone at this price point? It won't cook your meals or solve your financial problems. Use it practically. It's a good deal. The Moto + Google combination is working out for the masses! Overall i can say Moto G2 phone is awesome in this Range. I am satisfied with this Phone. Thanxs 2 all.",
            "date": "21 Oct 2014",
            "name": "Pappu Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product. Flipkart delivery is amazing. I got one day delivery. Moto G hangs some time when we use camera.",
            "date": "21 Oct 2014",
            "name": "Pankaj Vavadiya",
            "stars": "4 stars"
        },
        {
            "comment": "At first the phone delivered to ME was defected some screen issues and hearing aid problem. But I got it replaced from Flipkart within 2-3 days. Overall I am impressed its a good budget phone, no lags, opening new windows is comfortable, battery life is up to the mark, camera is average.",
            "date": "21 Oct 2014",
            "name": "BHAVIN PATEL",
            "stars": "4 stars"
        },
        {
            "comment": "One of the best budget phones with specs to die for. Must buy if you're not an expensive yet unjustified brand lover. I've rooted the phone, more utility than the stock options. The only bit I wish they'd improved was battery. Drains much quickly than expected, not sure if it is something i've done or its a phone behaviour.",
            "date": "21 Oct 2014",
            "name": "Amod Indap",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone.. Bought on Flipkart Big Billion Day.. Till now its working almost with some minor issues which every android faces.",
            "date": "21 Oct 2014",
            "name": "Manoj Kumar Re...",
            "stars": "3 stars"
        },
        {
            "comment": "The Best Phone To Buy In 13000 Good Battery Backup Good Camera Quality Damn Good Sound Quality In Short Best Phone To Buy Perfect Delivery Timing As Promised",
            "date": "21 Oct 2014",
            "name": "Suket Vyas",
            "stars": "5 stars"
        },
        {
            "comment": "I just gone through the hardware ans software specifications of Moto G From internet and decided to buy without looking the product practically. No doubt the hardware of the phone is quite enough fast but Software is very very poor. Now I came to understand the failure of Mortrola and Nokia in the Market. The worst policies of the company have dropped them on the floor. In Moto G you cannot assign a different ringtone or wallpaper on different sim. You cannot set default sim to call. Every time you need to select the sim for calling. You cannot block a person from calling. If you upload a third party ringtone it does not repeat at all. It rings once only and gets mute. So many futures are quite missing if we compare with samsung. While attaching a photograph with contact you cannot crop the photo even. While display on calling photo is not being displayed properly. The worst software. I ready to return it with loss of Rs. 1000 or more.",
            "date": "21 Oct 2014",
            "name": "Balwinder Singh",
            "stars": "2 stars"
        },
        {
            "comment": "Product is very good Delivery is excellent.Only problem is it would've been better if i knew the product was coming one day before so that i could plan my day accordingly. Packaging of the product is poor. the bubble wrapper was not covered properly. Overall: very good experience with flipkart .",
            "date": "20 Oct 2014",
            "name": "rekha bhaskaran",
            "stars": "5 stars"
        },
        {
            "comment": "Quick Points: * battery drains too fast, but this issue has been fixed after a update provided by MOTO * Phone is not very good at RAM management. *Call drop rate is too high if talking over 3g network for voice call. * Front Cam is good for occasional selfies. *Decent display and design. * Is a decent package but not the best now. And last but not the least...as many other customers also said that flipkart is not good at its after sales service.. I have experienced it with several products earlier...so you are buying any product at your own risk and luck over flipkart. So, best of luck.!",
            "date": "20 Oct 2014",
            "name": "sudeep mishra",
            "stars": "4 stars"
        },
        {
            "comment": "Usualy i dont go for Motorola due to their quality issues. But after through review & placing a bet on my Money I bought this Cell. And i can say I wasn't disappointed at all. Its Fast like stock Andriod. Its 90% more of Stock Andriod & 10% of Moto Blotware. Resposiveness to commands given is good. Camera is Better than 1st Gen of Moto G.",
            "date": "20 Oct 2014",
            "name": "Avinash Kedia",
            "stars": "5 stars"
        },
        {
            "comment": "Bought it just 20 days back Look and design is very good but not happy with the performance. It keeps on hanging everytime. Camera has a lag; it hangs for 1 min after each click.",
            "date": "20 Oct 2014",
            "name": "anu",
            "stars": "2 stars"
        },
        {
            "comment": "i lke the product...very much and tanx fr filpkart fast delivery........ im much impressed with screen reeulotion and gaming.....and stero speakrs..... im much depressed with batery back up..... and charger gets heated alot......",
            "date": "20 Oct 2014",
            "name": "saayi teja",
            "stars": "4 stars"
        },
        {
            "comment": "Ram is 1GB but shows only around 800MB Merely its an alternate heater Its not as fast as it should have been in a Quad-core processor Battery runs down within 6hours of use Camera is good overall i would like to recommend it to you all",
            "date": "20 Oct 2014",
            "name": "Ketan Boro",
            "stars": "3 stars"
        },
        {
            "comment": "hi friends... after one month... iam giving my review.... mobile working very well..... but the problem with accessories.... Charger getting more heat while doing charging.....and head phones are not good...",
            "date": "20 Oct 2014",
            "name": "Satish Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "The performance is very good. The stocked android i very fast. Multitasking is very smooth. With reasonable usage the battery lasts for a day. Playing high end games for more than 20 minutes heats up the ear piece and back of the phone. Camera is average. The speakers provided are loud and clear.",
            "date": "20 Oct 2014",
            "name": "Karthik",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered Moto G ( 2nd Gen) on Last Friday, got prompt delivery on Saturday (18-10-2014) Fast and reliable service by flipcart!. Hope they will keep it up. Have been using the device for the last two days. The device is good in looks, camera is very good, no lag, Apps run smooth. Video quality is OK, though not excellent, weight of the device could have been reduced, gets slightly heated up while on Skype video call, but no complaints about call quality. Data cable for transferring files from computer is an essential need which can be fulfilled. Over all a Great Product for the price and additional discount of 10% on SBI Debit cards is an icing on the cake!",
            "date": "20 Oct 2014",
            "name": "Nagabhushan",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered product on 17th oct and delivery date given as 25th oct when iam ordering. But product delivered by 20 Oct.",
            "date": "20 Oct 2014",
            "name": "pavan kumar reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product. Got it before expected date of delivery. Good wifi connectivity. Good processor speed. Subway surfers, temple run, Asphalt 8 without any hang or stuck. Battery backup is not so good. This is my third day with this mobile and I charged it for 4 time till now ( I kept on playing for all three days with wifi turned on) Good camera quality. Wifi and internet 3g connectivity is not up to the mark. My laptop connectivity is better. display quality is very good. But the mobile look is not so great as it appears on the HD screen. It looks similar to samsung duos. Any how I bought a black flip cover for this ear phone which comes with in the box is not so good. So I cannot comment the sound quality and voice reception quality. I am planning to buy a new head set. Overall I am enjoying with this product.",
            "date": "20 Oct 2014",
            "name": "Karthik",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone for my dad. I was expecting one day delivery but the phone was delivered one day late despite being Flipkart First. Before giving it to my dad i used this phone for one week. Pros 1. Battery life is very good. Even while playing asphalt 8 the percentage of battery drained was fare less. 2. It doesn't need 2 gb ram. It was very efficient while multitasking. 3. The video quality is amazing. 4. Speakers are in front. 5. Notifications are loud which is very important 6. Call quality is absolutely awesome. You don' t need to put the phone on your ear. cons 1. As everyone I was expecting 2Gb ram. 2. Battery capacity could be more. I will recommend you to buy this phone. This phone has more than enough features available that are enough for lot of people. One thing that I noticed is if you go to a mobile shop and ask for a moto phone (that happens nothing to laugh about) they mock moto phone. My dad was told the android is not genuine and all kind of sale pitch they could have thrown. Please don't listen to them. This is a google phone and you know google is god.",
            "date": "20 Oct 2014",
            "name": "Devyani Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this on the Big B day. The exchange and the product delivery went smooth. The phone arrived well packed and protected. However, once I finished all the settings and tried to restart, the phone conked off and does not turn back on. Placed a request for a replacement request with Flipkart, but I must say I am very disappointed with the post sales support. They need a verification call to be completed before they can process the replacement and have been waiting for the phone to ring since the last 3 days. I have for now got myself an expensive paper weight.",
            "date": "20 Oct 2014",
            "name": "George Anthraper",
            "stars": "1 star"
        },
        {
            "comment": "First of all, i bought 2 Nos of Moto G2, first for my uncle and later for myself on 14th October 2014. For the first few days i noticed that the battery was draining way too fast compared to my 5'' Micromax Canvas 2 which lasted 18 hrs in comparison with 12 Hrs on Moto G2 with the same 2000 Mah battery. Yesterday onwards, 19th & 20th Oct, I noted that i'm not able to hear what the other person is saying irrespective of which sim i'm making/receiving the call. the other end person called me 4-5 times. i called him back 3-4 times. same issue.Only solution i found was to reboot which fixes it for some time. Then issue comes back. it has occurred now for 4 times in 2 days. Today i called up my uncle to know his feedback and i'm anxious to hear that he's facing the same issue. Are any others facing this issue? i'm planning for a refund if the issue is persisting.",
            "date": "20 Oct 2014",
            "name": "Anoop A.S",
            "stars": "2 stars"
        },
        {
            "comment": "flipkart does not honour their promise of delivering the product on time. i got my product 2 days later then the promise date, that too after calling customer care more than 20 times",
            "date": "20 Oct 2014",
            "name": "arvind thukral",
            "stars": "1 star"
        },
        {
            "comment": "In this phone only one negative point. it wall take more time for full Battery Charge. Overall phone is awesome.",
            "date": "20 Oct 2014",
            "name": "Anil Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I received a used mobile by flipkart. I received it from flipkart and open the box and immediately able to figure out that I received a used product as someone bought it, placed screen-guard on it (which is available in market) and returned it to flipkart and flipkart sold that product to me. Though I immediately placed the return request but I am extremely sad by this way of flipkart. Earlier I bought MOTO E from flipkart and well aware of packing and first look of the phone. This tricky game of the seller/ flipkart is really worst experience for me.",
            "date": "20 Oct 2014",
            "name": "Madhu S",
            "stars": "1 star"
        },
        {
            "comment": "Desire to order this since its launch on flipkart, received this in just five days after i order this, in well packaging. well condition, on the other hand Moto G 2nd gen is awesome worth every penny i spend on it. Great Screen despite of having only 720p Resolution on 5\" Screen it doesn't make me disappoint while looking at it, Good Stereo Speaker, Better Camera regardless of having only 8mp. good battery performance last me whole day on single charge with 2 Sim running. Forget the internal Specs Such As Processor And RAM it fulfills all average requirement of every and most android user and moreover it has stock android 4.4.4 installed on it which gives pure android experience without any lag, and 100% assurance of having Android L 5.0 update in upcoming days. thanks Flipkart and Happy Diwali.",
            "date": "20 Oct 2014",
            "name": "Chetan Salunke",
            "stars": "5 stars"
        },
        {
            "comment": "The packaging of the product has been good. And Speedy delivery. Pros; Design,Google,Display size Cons : Heating problem",
            "date": "20 Oct 2014",
            "name": "Murali",
            "stars": "5 stars"
        },
        {
            "comment": "Received the phone on time as usual the best service by flipkart... Had great experience with my new Moto G 2, used it for about a month and it was the best deal at reasonable price...... Great work Motorola....",
            "date": "20 Oct 2014",
            "name": "Yash Parikh",
            "stars": "5 stars"
        },
        {
            "comment": "PHONE DISPLAY IS GOOD CONNECTIVITY IS GOOD CAMERA IS BRILLIANT AUDIO IS GOOD BUT EARPHONE IS AVERAGE BATTERY PERFORMANCE IS VERY LAZY EVEN YOU USE WI-FI WITH IN ONE HRS YOU CAN LOSE 60-80 PERCENT BATTERY ONE BIG DRAW BACK IS TAKE 3 HRS FOR FULL CHARGING SO PLZ IF ORDER IT ORDER ALSO A POWER BANK THANKS",
            "date": "20 Oct 2014",
            "name": "Rahul Yadav",
            "stars": "3 stars"
        },
        {
            "comment": "Its really better choise for mid range and it has better camera .Shape also good one. I will recoments it for mid range option.",
            "date": "20 Oct 2014",
            "name": "sachin shah",
            "stars": "3 stars"
        },
        {
            "comment": "On the first delivery ear speaker was not working. Got it replaced, Flipkart helped me but after so many calls. Customer care portal can improve a lot by having real time updates in it. Thanks!",
            "date": "20 Oct 2014",
            "name": "ANKIT JAIN",
            "stars": "4 stars"
        },
        {
            "comment": "battery back up is moderate , takes long time to full charge cam , display , net speed , build quality is very good.",
            "date": "20 Oct 2014",
            "name": "ramkey",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered it at 9 Oct and got at 17 Oct thanq flipkart for delivering perfect piece no damage .. The only concs is phone is no option to select 3g only otherwise all aspects are good I will give it 5 star",
            "date": "20 Oct 2014",
            "name": "Avinash Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "resolution, camera clarity, stereo speakers 2, large screen, hd video capturing, secondary cam.,expandable upto 32 gb, inbuilt 16 gb, really the exceptional phone in exceptional price....",
            "date": "20 Oct 2014",
            "name": "sravan kumar p...",
            "stars": "5 stars"
        },
        {
            "comment": "good one but battery back up not good.battery back up should be 2600mah & ram 2GB requred .phone all future are good nice phone",
            "date": "20 Oct 2014",
            "name": "MITHUN SHAW",
            "stars": "4 stars"
        },
        {
            "comment": "Phone look was very good and processing speed also Good. But the battery was not good it give up with in four hour(If it's in use) .",
            "date": "20 Oct 2014",
            "name": "PANDIARAJAN NA...",
            "stars": "4 stars"
        },
        {
            "comment": "Hello everyone, today i am going to share with you my 1 month of experience using moto g (2nd gen). Pros: - Big screen with good resolution. - camera is great - includes many google inbuilt apps - 1 gb ram is sufficient if you are not a terrific gamer - light weight - battery backup is sufficient Cons: - Takes upto 2-3 hrs to get fully charged - Battery gets drained faster is data is on - gets i little bit of hot if used continuously for a long time Overall i would like to say that Moto G 2nd gen is a good mobile in the price, if your budget is that much. otherwise you can get some mobiles with same features at a very low cost but those may be like china mobiles and moto g 2 is a branded phone so those who have a good budget upto 13 k i would recommend them all to buy a moto g 2 because this is a good company phone and you can rely on it rather than buying china material like (xiomi mi3, red mi, asus). Thankyou",
            "date": "20 Oct 2014",
            "name": "Huzefa Hasan",
            "stars": "4 stars"
        },
        {
            "comment": "This product is far Good. I have been using both the generations of Moto G. The sound quality is Good. Camera Quality is Good. Battery Backup excellent can stay for 2 days in standby mode else 1 day. Overall quality is Good.",
            "date": "20 Oct 2014",
            "name": "Arun Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "mobile is awesome but charger is very normal.charging time is 3hours minimum its too late charging and charger also heating in during charge time.....otherwise awesome mobile.........",
            "date": "20 Oct 2014",
            "name": "prakash",
            "stars": "5 stars"
        },
        {
            "comment": "Well this is really not a product review ! This is review of Flipkart. Product booked on Billion day i.e.6th Oct and Flipkart committed delivery by 14th Oct. The product actually delivered on 19th October ! There was no updating about the delivery status and I had to complaint Flipkart customer care! This is really unexpected. So Flipkart eat as much you can digest ! When Logistics and order booking systems are not upto the mark, don't go for BILLION DAY gimmick to fool people and push them to mental agony. I will think twice now on wards before recommending anyone Flipkart.",
            "date": "20 Oct 2014",
            "name": "BASAB BHATTACH...",
            "stars": "1 star"
        },
        {
            "comment": "yes... the title is right... got the phone in 4 days... good packaging and service by Flipkart.. All the features works fine... Its an amazing experience with Moto G2.. I must say.. dont't think too much, just go for it.. Will review it again after some days of use for sure..",
            "date": "20 Oct 2014",
            "name": "Jay Pandya",
            "stars": "5 stars"
        },
        {
            "comment": "i have used the moto g 1st n now using moto g 2nd... both are great phones!!! motog 1st was not having sd slot but now 2nd has d option moto 2nd have 8mp cam but the qulity of pic is not that like expected frm a 8mp cam ... great processor. works nearly all games and apps without glitch .. battery backup less than moto 1st coz of bigger screen... perfect phone for the price range, quality built... recommend buying....",
            "date": "19 Oct 2014",
            "name": "arun anand",
            "stars": "4 stars"
        },
        {
            "comment": "Value for Money. The screen could have been better, otherwise all good.................................................................................",
            "date": "19 Oct 2014",
            "name": "Sudheesh KS",
            "stars": "4 stars"
        },
        {
            "comment": "Over heating of the phone after using any app for minimum 5 minutes. I want an explanation either from the seller or the company",
            "date": "19 Oct 2014",
            "name": "Chandra Sekhar...",
            "stars": "2 stars"
        },
        {
            "comment": "Beautifull Display Feels really good in hands. Awesome specs & a complete package In such a price bracket. Definitely a remarkable Device by Motorola. Feel Free to have it. Thumbs up!",
            "date": "19 Oct 2014",
            "name": "Shubham Tripathi",
            "stars": "5 stars"
        },
        {
            "comment": "instead of writing looong review , just wanna say few words... I was using samsung S3 for last 2.5 years... and now using moto g2 .. it is providing me almost same features of s3 plus good battery life, latest android, high speed connectivity and dual SIM for just 13K. i used mobile for calls, photos and internet.. So its best for me... !! Thanks to flipkart for speedy service...!!! u guys Rocks..!",
            "date": "19 Oct 2014",
            "name": "Amit Dani",
            "stars": "5 stars"
        },
        {
            "comment": "I am extremely disappointed by the flipkart delivery. I waited week plus but there was no status update. Flipkart disappointed made me to book another phone Asus Zenphone 5. Still the delivery is awaited.",
            "date": "19 Oct 2014",
            "name": "Naseem Shahjad...",
            "stars": "1 star"
        },
        {
            "comment": "flipkart sell second hand goods in sale. as I have order motog when we receive it looks like the box is opened earlier and outer box's sticker was not there...",
            "date": "19 Oct 2014",
            "name": "Niranjan Desai",
            "stars": "1 star"
        },
        {
            "comment": "* Good phone price wise * Battery drains out very fast, lasts only 6-7 hours if data enabled. * Mobile heats up. Especially when you charge it with power bank, it becomes really hot. * Picture quality not so good being an 8 MP camera it should click clear and sharp images. * No restart option - you have to switch the phone off and then switch it back on. ******After the latest update (kitkat to lollipop) the phone's battery performance has dropped drastically.....:( I have to charge the phone three times a day even when the locations, wifi are disabled.....I wonder what will happen if all the features are enabled.......",
            "date": "19 Oct 2014",
            "name": "Hans Chouhan",
            "stars": "3 stars"
        },
        {
            "comment": "Quality worth the price.You can go for the mobile if in need of mobile less than 15000 . Battery stands for one full day",
            "date": "19 Oct 2014",
            "name": "Aravind",
            "stars": "5 stars"
        },
        {
            "comment": "I got my Moto G on 16/10/2014 and now i find that the speaker of my phone is not working properly and it is creating noice while talking on phone and also while playing music, i asked for replacement and got confirmation that someone will call by 19/10/14, 1:30 PM and i received call but no one spoke on other line nearly for 30 sec and then i receive SMS that i will receive call by 20/10/14 what this practise indicates, I am not able to figure it out. Yesterday i also came to know that one of my friend has also bought Moto G and he has three times asked for replacement and each time the product supplied was defective. Very much afraid that i will be able to get genuine and flawless product or not. If i ignore defect the product has excellent performance",
            "date": "19 Oct 2014",
            "name": "Pawan Mundra",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent Delivery even in Festive season.. Ordered on 17th and it's delivered today i.e. 19th Oct 2014.",
            "date": "19 Oct 2014",
            "name": "Prateek Goyal",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone from last 2 week, its the finest mobile i ever used . looks awesome, fantastic feeling while holding phone, not a single lake at using android on this device. camera take good photos, front speaker sounds amazing. some issues with battery life it not stand even a day.. even if i am normal user.. but that don't matter as many other expensive phone do same..",
            "date": "19 Oct 2014",
            "name": "Ankit patel",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G brought back Motorola back into market. I must give credit to google. Nice and decent Phone for the Price. Pros: Decent Look Google Android Handy Cons: No as such problem faced Meets all basic needs (bluetooth, loudspeaker, 3G, wifi, hotspot, calling, messaging, light gaming, office work, good apps)",
            "date": "19 Oct 2014",
            "name": "Divanshu Singla",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered my MOTO G 2nd generation on 7th oct'2014 and received on 16th oct'2014 though it is my 1st Android set I'm happy with its feature looking forward for new apps to get installed. Those who are confused and are getting into the rumors please just ignore them at this price you are getting the bestest phone so hurry!!!! Go fast and buy it before its stock get over. Worrying about the camera??? its damm cool just touch anywhere it will gonna craze u ...........Take Selfies and upload them instantly without worrying about the battery. I'm so happy and excited............. Go friendz......before its too late",
            "date": "19 Oct 2014",
            "name": "Shraboni Dey",
            "stars": "5 stars"
        },
        {
            "comment": "first of all thanks to flipkart's amazing delivery service i got this phone one day ago..the first word came to my mind when i opened the box was \"wow\". love its sound, and its dual speakers create a nice feel together but i just have one question to all who bought this...sometimes while listening to music at high volume i feel that speakers are a bit \"fata huya\" i thought it is maybe becoz of the dual speakers it sounds a bit like that...but do u all feeling the same thing or its just me...please help me out here",
            "date": "19 Oct 2014",
            "name": "Nikunj Oza",
            "stars": "4 stars"
        },
        {
            "comment": "Can't expect more than Android Phone of this range. The packaging and delivery was awesome. I can't find any issues till now so it's a best phone I can get at this range.",
            "date": "19 Oct 2014",
            "name": "Vaibhav",
            "stars": "5 stars"
        },
        {
            "comment": "awesome phn in this price!!!! flipkart rocks!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "19 Oct 2014",
            "name": "Amit Sahare",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product with superb price tag and no performance lag. Only issue was with exchange was the vendor was asking for Phone+headset+charger+box+original Bill.......whereas flipkart had asked me to give only phone through email and even their contact center told the same thing.....After repeated follow ups with flipkart customer care the issue was resolved and we had to give phone+headset+charger and the product which was expected on 9th Oct...was finally handed oevr to me on 1th Oct.",
            "date": "19 Oct 2014",
            "name": "Prabhat Bhadouria",
            "stars": "2 stars"
        },
        {
            "comment": "Phone is just awesome. But delivery, this time flip got some issues. It got delivered only after 15 days :(",
            "date": "19 Oct 2014",
            "name": "arun nath",
            "stars": "4 stars"
        },
        {
            "comment": "good morning iam requesting to buy this product by emi process is there any possible by my request please give me reply of this question may i know this answer immediately to buy this phone",
            "date": "19 Oct 2014",
            "name": "k.nageswara rao",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on flipkart's Big billion day & was delivered in few days. It worked great for 2 days. But on 3rd day it started hanging itself & becomes unusable. I tried removing 2 games to see if it was causing any issues but it did not resolve the problem. Then finally I factory reset the phone, this too did not resolve the problem of hanging. It hangs for few minutes making the phone totally unusable. I checked with some of my office colleagues & they too faced the same problem with Moto G(2nd Gen) & they got it replaced. Was not expecting this from Moto, after all there were good reviews from all for this model.",
            "date": "19 Oct 2014",
            "name": "Saurabh Mistry",
            "stars": "1 star"
        },
        {
            "comment": "8mp camera is same as my grand neo 5mp camera. there is no extra feature compare with grand neo. only display is good. 4.4 kk is ok. but i think grand neo is much better than 2nd gen but delivery is very good. it takes only 36hrs. slow motion video is super",
            "date": "19 Oct 2014",
            "name": "maheswaran s",
            "stars": "3 stars"
        },
        {
            "comment": "i will buy the moto g ,IAM full disapointed the moto g (2 gen) ,becoz ,i was recived MOTO G , BUT ITS NOT WROKING ,NETWORK IS NOT CONECTED,I HAVE CHEAK, THE ALL THE SETTINGS,BUT NO USE,....I WAS COMLAINT THE, MOTO CUSTEMER CARE,THAY HAVE NOT RESPOCE TO ME.................IAM LOSSSSSSSSSS...FINALLY I REAPLACED , IAM WAITING FOR THE ..NEXT STEP................",
            "date": "19 Oct 2014",
            "name": "RANJITH (RAJESH B...",
            "stars": "1 star"
        },
        {
            "comment": "i have place the order for moto g 2nd gen, instrument come defective in terms of software. made call to flip kart, and they have replacement done in one call only..and before given time they did it.. its very good experience",
            "date": "19 Oct 2014",
            "name": "prakash mistry",
            "stars": "5 stars"
        },
        {
            "comment": "Right side of the Headphone not working properly. I think that the headphone is a damaged piece. I need to recover it...",
            "date": "19 Oct 2014",
            "name": "Sarath raj",
            "stars": "5 stars"
        },
        {
            "comment": "It is very excellent phone.till today i have not get any issues on this phone.I booked the phone same day when it was launched .It is nice phone below 15000.I was interested to purchase the mi 3 mobile.but i have tried for mi3 for 3-4 times.I didn't get a chance to order this product .thn i wnt for this phone .I thought it is not good.Then later on i came to know it is the best phone below 13k when i have used this phone.",
            "date": "19 Oct 2014",
            "name": "PRADEEP KUMAR...",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone delivered on 15th Oct and on 16th of Oct the touch Screen of the product stopped working. I immediately placed the request for Return. I am highly disappointed by the quality of product provided by Flipkart. I request Flipkart executive to Return the product and get a new piece delivered as soon as possible. :(",
            "date": "18 Oct 2014",
            "name": "Rahul Suneja",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2nd gen lives upto the expectations with a mid range specs. I think the battery is just fine lasts a day atleast. Flipkart delivery was good although I would have had liked some discount. They have kept the price constant. Maybe because it's in demand.",
            "date": "18 Oct 2014",
            "name": "Preyas Raval",
            "stars": "4 stars"
        },
        {
            "comment": "Ek Dum jakkaass ...Mobile He Yaar ... thnk u Flipkart .. 1. Big Display +Ips = Best Video.q ..Much Bettr Then Grand 2 2. dual Speakers .. Just Fills Like Muliplx .. 3. Loookkkkkkxxxxx .... Muuuuhhaaaaa................. :-* 4.Flipkart .. You Are Service is Not Like 3g its 30g .. Yaar .. Dilvry date se 15 day phele kyaa baat he yaar ... . ! .~~~~~~~~~ Who Want To buy this phone Dont Wait Just buy it .. ! Jay jay Garvi Gujarat .. Thnqx .. !",
            "date": "18 Oct 2014",
            "name": "Dhaval Prajapa...",
            "stars": "5 stars"
        },
        {
            "comment": "money refuend polesy very bad.................................................................................................................",
            "date": "18 Oct 2014",
            "name": "Subhas Maji",
            "stars": "1 star"
        },
        {
            "comment": "I recently purchased this phone. after getting my sim card cut to a micro sim, i was able to receive virtually no signal. so i went ahead and got an original micro sim. even that was not working properly. so i got my headset replaced. after getting my headset replace (within 2 days. kudos to flipkart) i found that my signal was strong, but 2g net wasn't working. after getting a 3g recharge, i found that my signal is once again way to weak to use. i STILL cannot access the internet. I have no idea of what i should do next. Anyone? flipkart? help.",
            "date": "18 Oct 2014",
            "name": "Amol Ahlawat",
            "stars": "3 stars"
        },
        {
            "comment": "This is very good Product by Motorola. Good Camera clarity with its 8 MP Camera and also very good speed while using internet on the Phone good product at a good rate by Motorola. I recommend this product to those who are looking for smartphone ranging around 13000.",
            "date": "18 Oct 2014",
            "name": "Yagneshwar Bhatt",
            "stars": "4 stars"
        },
        {
            "comment": "Being an ex- nexus 5 user, hardly any android phone in market can beat the experience. However, moto g with its features comes close. Touch and camera not of same quality but great value for money. If looking for a budget phone, go for it.",
            "date": "18 Oct 2014",
            "name": "Will purchase...",
            "stars": "5 stars"
        },
        {
            "comment": "bhoot lag karta h... not responding... not responding... shows each time..... flipkart replaced it 2 times but it is still lagging... and saying not responding.... finally i have decided to sell it on olx..",
            "date": "18 Oct 2014",
            "name": "MD PARVEJ ANSARI",
            "stars": "1 star"
        },
        {
            "comment": "Hi Everyone I'm Dinesh , I Purchased This Phone on Billion Day For 6999/- ... And the Packing and The delivery was Very Good... And Now Coming About The phone Which i have Bought... I Am Really I'm Amazed by the Phone's Performance.. Really Very Good Mobile , Camera Performance is Good and the screen looks very Impressive for the price and since i have been using this phone for about 3 day but i didn't even find a single lag in this phone even though i have installed lots of apps of about 3.2 GB but no lags so that's good and the Gaming Performance is decent , Storage is sufficient for me , it Supports Usb functionality etc... and coming about the cons 1 GB of RAM is not enough as the phones consumes of about 74% of my mobile (Ram Usage may Vary According to the User) , Ram could have been better thats all and nothing about cons about this device Finally i conclude that it is a very good budget phone that performs good for its price..Surely u Can go for this mobile...!!",
            "date": "18 Oct 2014",
            "name": "Dinesh Balaji M",
            "stars": "5 stars"
        },
        {
            "comment": "Good product with a HD Display ..,, And there is no lagging it just killing with android 4.4.2 (And Grantee Upgrade to 5.0) :) Pros: HD Display Camera Look and design Sound Volume and also speakers Touch Sensitive Preloaded Applications Front Camera Mic, etc..,, Cos: Battery Ram If you are a normal user For personal purpose i will highly recommended this Moto g2 .., For a Hard Core Gamers there is a battery problem only",
            "date": "18 Oct 2014",
            "name": "Aravind Devaraj",
            "stars": "4 stars"
        },
        {
            "comment": "They are not replying me. its very bad service. My phone is Auto Restart on every 2 hours. i m very disappointment from flipkart services.",
            "date": "18 Oct 2014",
            "name": "dhruval godhani",
            "stars": "1 star"
        },
        {
            "comment": "I am happy to receive the mobile from flipkart before the shipping date they initially mentioned. As I have gifted this phone to my mother I am happy it came before diwali. Flipkart is great!!! I ordered this product on big billion day with exchange offer but due to some technical glitch the price didn't reduced when during checkout, I tried 7-8 times but was unable to get the discount, however I ordered the phone and 2-3 days later i received a call from flipkart who said they apologize for the cause and provided me a discount of Rs. 1000/- due to inconvenience caused which actually make me happy. Now regarding the phone everything is good and the quality is what you expect from 20-25K phone. The performance of the phone is good nice proportions and white color looks killer in your hands. All the specifications indicate a great product which indeed it is. The main thing is the camera which i would like to discuss as it cannot be only specified my megapixels but rather needs a description. Pros: 1. First of all the camera has a good resolution and images are less noisy if viewed on a laptop screen. 2. Great performance of camera even in low light, which I didn't expected at this price point. A great camera for indoor photographs. ( for example the camera of MOTO G2 is better than Sony Xperia L which my wife uses) 2. Colors are natural and does not gives any artificial effect and the overall result is very appealing to eyes. Cons: 1. One minute drawback with the camera is that your hands need to be very sturdy for a perfect shot ( i guess there is no optical stabilization). As I use Nokia lumia 720 I am spoiled :) by the great camera performance which i have seen either in lumia or some high end phones like nexus (apprx. 30-35K). however one can download google camera app for a slightly better camera performance. 2. Front camera is average and not verry good. In all I would definitely recommend this product to anyone who has a tight budget constraint (i would say best phone under Rs. 20,000/-), instead of going to category B brands MOTOROLA gives a great package which ticks all the essentials + some extras.",
            "date": "18 Oct 2014",
            "name": "Arpit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile changed my perception that all budget android mobiles are laggy its awesome to handle this phone.Initially i thought it would weigh too much . Finally i would recomend ...go for it",
            "date": "18 Oct 2014",
            "name": "Dinesh Reddy M...",
            "stars": "5 stars"
        },
        {
            "comment": "i am satisfied with the overall features Cons data cable is not available in the box.data cable is essential accessories of a phone . i am wondering that it is not given(mind we are giving 12.999 INR ) for 6000 INR mobile itself they are giving 2 screen guard flip cover etc ,,,,,",
            "date": "18 Oct 2014",
            "name": "simbu",
            "stars": "4 stars"
        },
        {
            "comment": "Awsome delivery flipkart......just got within 3 days....... This phone is just awsome....... The camera is awsome Display is too awsome Front camera too awsome Battery is just amazing... In short this phone is a complete package Don't think anything just go for it............!!!! All the cons said by others are of no use... I didn't find any of them........ Good luck and just go for this one....... Awesome!!!!!",
            "date": "18 Oct 2014",
            "name": "Brijesh Sarin",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome Gadget with stunning response rocking Moto G 2 Gen Great Sound, Awesome Camera, Speaker r boom boom, no one can neglect this phone to buy..",
            "date": "18 Oct 2014",
            "name": "Narendra Bose",
            "stars": "5 stars"
        },
        {
            "comment": "Does LED light glow while charging ? Is it problem ? then how to fix it ? Product experts please do provide reply on this comment .",
            "date": "18 Oct 2014",
            "name": "Pratik Nandgao...",
            "stars": "4 stars"
        },
        {
            "comment": "the sound of the other person is very feeble and comes like cell is on speaker mode.the acute voice is missing.i have to dig my ear in the mobile speaker to hear clearly.may be a defective piece.rest everything looks good.battery backup is also very good. But motorola is no managing its service centers properly.Went today to a service center to repair my moto g 1 water damaged cell.it got shifted and address is not updated in site.had to travle full town.also if moto gs are not watre secure pls stop relating it to water repellant as there were more cases there.and cost for repair is 8000,which is the price of moto g 1 itself now.",
            "date": "18 Oct 2014",
            "name": "saurabh ghildiyal",
            "stars": "2 stars"
        },
        {
            "comment": "1) OVERHEATING is the main problem of moto g 2nd gen mobile. 2) as soon as i start internet this mobile starts OVERHEATING quickly and continuously. 3)OVERHEATING takes place during taking photographs, video shooting, playing Games on this mobile. 4)During charging of this mobile, the Charger and mobile both are OVERHEATING. 5) camera quality is poor. 6) Battery drains very fast and gets overheated very quickly. 7) moto g 2nd gen which I have received is defective mobile so I request flipkart to please help me , take this defective mobile back and please give me refund or replacement. this order in my lifetime is my first order with flipkart so I request flipkart to please give me refund or replacement, otherwise I will never buy any product from flipkart",
            "date": "18 Oct 2014",
            "name": "ABHIJEET ANILK...",
            "stars": "1 star"
        },
        {
            "comment": "very very nice phone got it late in varansi camera is good both sim support 3g very good display avg. battery",
            "date": "18 Oct 2014",
            "name": "Ashutosh Dash",
            "stars": "4 stars"
        },
        {
            "comment": "I have used this product since a month, haven't faced any major problems, except sometimes it gets stuck, need a restart; but I think this is the issue with all smart phones. Otherwise it is a good model, thank you to Motorola.",
            "date": "18 Oct 2014",
            "name": "Bhaskar Goud K...",
            "stars": "5 stars"
        },
        {
            "comment": "USB CABLE IS NOT IN BOX,NOT EVEN WITH CHARGER EXCEPT THIS ALL ARE GOOD ,I GOT MY PRODUCT WITHIN 2 DAYS.THANKS FLIPKART :)",
            "date": "18 Oct 2014",
            "name": "KESHAV",
            "stars": "4 stars"
        },
        {
            "comment": "it has a android 4.4.4 kitkat which can be upgraded to android 5.1 it has a 400 snapdragon quad core processor which is very fast it also had dual stereo speakers which are super all apps are very fast and they won't struck while we use them it has flash with 8 mp camera and secondary camera is 2 mp it have all google apps which we can't see in all mobiles because motorola is combined with the google company so,it's all about this mobile and so much to know about it",
            "date": "18 Oct 2014",
            "name": "yechuri kashyap",
            "stars": "4 stars"
        },
        {
            "comment": "Since buying xiaomi mi3 is very difficult )given flipkart's inefficiency in selling it). MotoG 2nd gen is a good buy at this price. it sure has a little extra in every specification as compared to motoG1. But moto g2 sure does provide much extra at that 1k price in case. Yes the phone with a bigger screen now feels little big when compared to motog 1. Even the speakers at front helps in case you have left the phone or bed. but the sound is not loud enough moreover sounds tend to break off sometimes. In short even after the more things provided by moto it still isnt as satisfactory as the 1st gen G. its an overall good phone a that pricepoint",
            "date": "18 Oct 2014",
            "name": "Anand Sankar",
            "stars": "3 stars"
        },
        {
            "comment": "The phone has everything you just want full of features and classifications.The battery of this phone must need to increased.Not poor but good battery.A very good feature just introduced in it is the Printing module added in it.So you can connect to your printer with Moto g by gettng Wifi facility and print your document from any where in home.....Micro - sim facility must be discarded by the company its a good headache for me....",
            "date": "18 Oct 2014",
            "name": "sachin makwana",
            "stars": "5 stars"
        },
        {
            "comment": "just amazing phone.......................................................................................",
            "date": "18 Oct 2014",
            "name": "Amit Hegde",
            "stars": "5 stars"
        },
        {
            "comment": "i got this one month back. and i am cmpltly satisfy with this mobile by motorola. great service by flipkart. it delivered within 3 days.",
            "date": "18 Oct 2014",
            "name": "Vinay Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone for 20 days and not for a single moment could stop my self loving it . Performance wise awesome no annoying lags or hangs . handy to use. Very good build quality . This phone has the original moto charm.",
            "date": "18 Oct 2014",
            "name": "Rahul Shrivastava",
            "stars": "5 stars"
        },
        {
            "comment": "Can anybody tell me if skullcandy headset is supported by this device or not? Also how to replace the SIM card from sim slot.",
            "date": "18 Oct 2014",
            "name": "Bishnu Dey",
            "stars": "3 stars"
        },
        {
            "comment": "i got defective piece of moto g.the touch of the phone suddenly stops working at many times and the speakers of the phone are too bad not able to hear clear voice at full volume.i have requested a return request. i hope flipkart will look into this problem and solve ASAP.All this problems are caused because i received a defective piece.But overall the phone is awesome",
            "date": "18 Oct 2014",
            "name": "shravan kalantry",
            "stars": "2 stars"
        },
        {
            "comment": "Flipkart has send my product through a worst courier service .From 2 days the product is roaming in Bangalore.and the Flipkart customer care is horrible,they are saying that my product will reach me in 14 days which is really disgusting.Why Flipkart is doing like this? next time onwards i wont buy any product from flipkart",
            "date": "18 Oct 2014",
            "name": "Raki Rakesh",
            "stars": "1 star"
        },
        {
            "comment": "Better than any other phone which relies in this segment . the phones comes with a great design and performance.As the samsung (market Dominant) lacks design in their phone.... every phone of samsung is same (in looks) wheather it is 5k or 50k ..... lets come back to phone .... pros.. 1- nice primary and secondary camera 2- Dual front speakers are Excellent 3-gaming performance is awersome.... can easily play high-end games 4-works smoothly...display is also great as per the review many says that it is a heater phone.......... but Really as per my experince Nothing is such like that !!!!!!! its a great phone in eevry manner.... CONS Find nothing such in a phone .....but Accesories of this are not to good...charger heats up very soon also the phone take too ,much time in charging( 3-4 h) .... the worse thing of this phone is it's earphone...By seeing them u will feel that it will not costs more than 100rs... made with cheap quality..... IT SEEMS THAT MOTOROLA HAS PUT ALL THE EFFORTS ON THEIR PHONE ... NOT ON ACCESSORIES ... FINAL VERDICT --- AFFORDABLE ,1000 TIMES BETTER THAN OTHER BRANDS (samsung,sony,htc) IN PRICE, LOOKS, PERFORMANCE etc... rating- 5/5( GO THROUGH IT )",
            "date": "18 Oct 2014",
            "name": "Harshit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best mobile handset of Motorola. I would like to recommend everyone to go for this phone rather than going and spending too much money on Moto X series. Camera quality and sound quality is excellent. I havent found any cons till now.",
            "date": "18 Oct 2014",
            "name": "Roshan kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The product is the good one. Its display clarity and camera clarity was very superb but it doesnot have File explosure to view files. But over all the product is worth to buy.",
            "date": "18 Oct 2014",
            "name": "Vijay Adike",
            "stars": "4 stars"
        },
        {
            "comment": "Hello Team Ordered moto g2 in a day delivery i wonder they did not call me and no message dissapointed totally",
            "date": "18 Oct 2014",
            "name": "BharathReddy Challa",
            "stars": "1 star"
        },
        {
            "comment": "it is a very good phone by motorola. battery is good camera is also very good dound quality is awesome.",
            "date": "18 Oct 2014",
            "name": "Amit Tyagi",
            "stars": "5 stars"
        },
        {
            "comment": "This is my first android phone, I migrated from iPhone. As per price offered for this its good. However The accessories are not good enough. Charger is having fixed attached cable instead of USB port, I had to buy a separate cable to let it charge from my laptop. Earphones are having poor quality, I still use my old iPhone Earphones. Good Point in the phone is its look, performance and price. Take it, You can buy some good earphones and charging cable to make it perfect.......",
            "date": "18 Oct 2014",
            "name": "Gagan Juneja",
            "stars": "2 stars"
        },
        {
            "comment": "I ordered it on oct 8th and got it in 16th october so,the delivery was a bit late...after getting the phone on 16 oct I was very much exited.i opened the box,the phone,charger,headset all was fine but no usb cord.... The phone amazing and its looks were great.... After using the phone for 2 days..... It was working very smoothly and sufer fast....the touch is excellent,display is great thanks to google and moto to make this exceptional phone at a exceptional price.... Pros:1.Sound quality good 2.1.2 ghz with quad core 3.kitkat and upgradable to android L 4.some good applications like moto alert which is needed in emergency... 5.trendy look 6.camera and front camera both are brilliant 7.corning gorrila glass 3 8.a very good budget phone. Cons: 1.1 gb ram 2.showing trouble while playing a voice message in whatts app 3.battery is up to the mark 4.no usb cord given with the box 5.not a removeable battery",
            "date": "18 Oct 2014",
            "name": "Srijan Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone. Totally worth the money. The perfomance is very good, the smoothness offered by it while making app and other transitions, reminds of Nexus devices. Have been longing for such performace since my very first smart phone. Its amazing to see even a 1.2GHz chip can perform so well. Thanks to Qualcomm and Motorola!! Cheers. :-)",
            "date": "18 Oct 2014",
            "name": "Anuj Rakani",
            "stars": "5 stars"
        },
        {
            "comment": "All the features are good and camera quality is awesome. The touch is good and the size fits into pocket well.",
            "date": "18 Oct 2014",
            "name": "Akanksha Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone with In-a-day-guarantee. After 2 days when i called flipkart that i have not received the product, the executive instead of being apologetic was giving excuses. If Flipkart couldn't deliver on time, then they should not have provided In-a-day-guarantee.",
            "date": "18 Oct 2014",
            "name": "Jatin",
            "stars": "1 star"
        },
        {
            "comment": "The motog 2nd Gen was delivered on time and kudos to the flipkart team. Purchased the phone on 22-09-2014. Today 18-10-2014, the phone is behaving unnaturally. Touch is not sensitive and also menu's are opened automatically and widgets are moving when i look into the phone. The issue may be with that particular piece, I have requested for return and hopefully the new piece will be a good one.",
            "date": "18 Oct 2014",
            "name": "Sajin S H",
            "stars": "3 stars"
        },
        {
            "comment": "very nice phone in this budget...sound,picture,performance all are v good...jst lv it....bt u hv to compromise on the battery at the last...",
            "date": "18 Oct 2014",
            "name": "ANURAG SHANDILYA",
            "stars": "4 stars"
        },
        {
            "comment": "Product is good. Features, build quality, value for money proposition and all the latest tech makes Moto g an excellent buy. Although, hands free is very cheap grade. Would need separate data cable for interfacing with PC. Phone, though feels premium, is a little too big because it's 5 inches screen. That said that makes watching videos n reading a pleasure. Just that it's not comfortable putting it in jeans and travelling or driving. I'm just making a point and not complaining. Flipkart service was pathetic this time and it took them 9 days to deliver despite raising so many request through mail n phone. I needed the phone urgently n they delivered it a day late. Would have given 5 stars but FK scored -1 hence 4*.",
            "date": "18 Oct 2014",
            "name": "Pradeep B",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G responce is soo fast & cool phone i never had before nice produt.Quad core speed - tried few games like Real racing, Riptide - ran smoothly. All these + Motorola + Google = awesome combo !!",
            "date": "18 Oct 2014",
            "name": "Yagya Krishnambal",
            "stars": "5 stars"
        },
        {
            "comment": "The Mobile Is Awesome all the features are amazing but please work on it's battery it so so weak and fall down so fast. Camera Is Best. Design is Look Awesome. Please change the color of accessories same as mobile. Make Mobile Battery Removable. Increase the RAM also. Buy this mobile go ahead...",
            "date": "18 Oct 2014",
            "name": "Allwin Manuel",
            "stars": "4 stars"
        },
        {
            "comment": "very nice seller & sent a quality material. delivered the product in short period. thanks to flipkart",
            "date": "18 Oct 2014",
            "name": "Annadani Hiremath",
            "stars": "5 stars"
        },
        {
            "comment": "Seller Review : On time, On date, Kudos ! Expected boxed item, Perfect Packing. Phone Review : - Moto G-2, Basic smart phone having all the features. - UI was good, Primary cam was OK, ****** FRONT Cam is Horrible i've Ever seen************* - Touch seems to Lag a bit compared to high pricing phones, but it's understandable coz of low cost. Final Review : Smart phone for ur Budget.",
            "date": "18 Oct 2014",
            "name": "Vigneshvar Adh...",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola's Moto 2ndG exemplifies the budget Android phone, good screen,internal memory 16 gb its good,valuable cost,no network or call drops,battery performance average",
            "date": "18 Oct 2014",
            "name": "GOPAL GUPTA",
            "stars": "5 stars"
        },
        {
            "comment": "This product is awesome. You will get all the mandatory features which are required in a good smartphone within your budget. But the delivery sucks. Flipkart sent it through Delhivery courier which sucks. If it would have been sent by eKart then it would have reached earlier.",
            "date": "17 Oct 2014",
            "name": "love sachdev",
            "stars": "4 stars"
        },
        {
            "comment": "All the features are good, Good battery, good Camera etc except one thing is that 3G does not work. There is no option of 3G(WCDMA) only feature. Even it's put in the 3G preferred mode also. 3G does not work. Changed 3 SIM(different operator) to check, Unfortunately Same in all operators case. Wht is this Motorola???????????????",
            "date": "17 Oct 2014",
            "name": "Rajib Buragohain",
            "stars": "2 stars"
        },
        {
            "comment": "One of the worst customer service forum this website has.. Bought this premium subscription which was of no use as the committed 24 hr delivery was not fulfilled. Had to chase the courier guy and cs team for this delivery. Sic of this webiste. This is the 13th mobile i had bought from this website and now feel very pathetic towards their customer and the way I was attended",
            "date": "17 Oct 2014",
            "name": "Andrew Charles",
            "stars": "1 star"
        },
        {
            "comment": "Very good smart phone for 13000 bucks really good. speed delivery, very good battery backup and cool and large display. latest android kitkat version.",
            "date": "17 Oct 2014",
            "name": "Gopakumar Sasi",
            "stars": "5 stars"
        },
        {
            "comment": "It was a worst exprience sicne my one order is canclled due to coustomer serveice now waiting for execuetion of new oreder",
            "date": "17 Oct 2014",
            "name": "Surendra Singh...",
            "stars": "1 star"
        },
        {
            "comment": "delivery was very next day... all was good except that wifi didn connect... sometime it detect sometimes it doesnot.. even after detecting, after restarting the saved device does not exist.... i had complained flipkart about it... and they have arranged for replacement... i planned to use this for diwali... but plans changed... very unfortunate on that...",
            "date": "17 Oct 2014",
            "name": "Kirubakaran Rv",
            "stars": "2 stars"
        },
        {
            "comment": "(after using the phone for amonth) this smartfone has pretty much every thing that one would want in this budget.... stunning display .... perfect size , fits perfectly in your hands........ awesome camera ... although it doesn't come up with high features but the camera quality is sharp and crisp...... And as to consider processor performance and gaming , ...... the moto g 2nd gen works smooth without any lags as much of my notice and most of the games work that too on highest graphics configuration..... Also considering the battery of the phone...... it gives you decent battery life , which wont leave you much disappointed unless you have high hopes from a 13k phone.......... on medium usage it might survive for a day and on high usage the battery fades away within 10 to 12 hours or less...... also for the first 2 days i notice that the signals totally dropped in between and after a minute or two it would come back..... but later the problem got fixed by itself ......... Also .....not to forget the stereo speakers give a loud and clear performance without any noise or anything of that sort.......... Anyways in short .... if you want all the best features in a smartfone at this range.... I suggest you better go for it..!",
            "date": "17 Oct 2014",
            "name": "syed Rayan",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered the phone 30 days back, the delivery service of the Flipkart was awesomeee. i just got the phone in 3 days from the date of booking and to say about the smart phone Moto g, it was good in performance but we cannot find all the features where we can find in other phones like Hiding unwanted applications in the menu, not getting full picture of contact when someone calls us. i was very disapointed in this feature, Cannot go to options of contacts in shortcuts need to go through the menu, Cannot surf internet when speaking on calls, Voice clarity is fine and music and Gaming effect is good.",
            "date": "17 Oct 2014",
            "name": "Sandeep Gundu",
            "stars": "3 stars"
        },
        {
            "comment": "I received my moto g2 after 2 days of order.but i have a prob. IN SIM 1 card slot the sim is not stable inside the slot it comes out again and again so I am using sim 2 card slot but all over performance THIS IS WHAT U NEED...!!",
            "date": "17 Oct 2014",
            "name": "haaris shah",
            "stars": "5 stars"
        },
        {
            "comment": "Worst service from flipkart!.....After using moto e I became a huge fan of motorola so when i lost my moto e I decided to upgrade to moto g2....It took 7 days for delivery...inspite of the delay i was so excited to open the box to find MOTO E in my package....I paid the price of g2 for e....Greatly disappointed. It took lot of convincing of the customer care guy to take back the package immediately...flipkart was humble enough to accept their goof up and returned my money immediately. I on the other hand will not buy anything from flipkart. I have cancelled my order...will search for some other mobile. will miss moto.",
            "date": "17 Oct 2014",
            "name": "Kaustubh Mahamine",
            "stars": "1 star"
        },
        {
            "comment": "It is a very good product, had order it for my brother, but older Moto G had better battery backup. With full 3G on, It lasts only 12-16 hours. My Moto E lasts more than 24 days with same usage. If you are not a heavy user then this would be best phone, if battery backup is not a problem!",
            "date": "17 Oct 2014",
            "name": "Rahul Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G responce is soo fast & cool phone i never had before nice produt. But i facing issue with Watsapp some time it stop working need update on this phone.. Else rest all working fine...",
            "date": "17 Oct 2014",
            "name": "pradeep katti",
            "stars": "5 stars"
        },
        {
            "comment": "i have brought this product a month ago product is good 1day or 1an half day battery some time(if GOOGLE was upgrading the phone y they did't thought about bigger battery???????) i felt that if it would have 2GB or 1.5GB RAM it would b more awesome but is this price range it in nice good thing---- Camera too gud screen look Big n Corning Gorilla Glass so so so nice (i hate screen guard and flip cover ) about bad thing i really can find anything my rating 4.5 stars (half star i have not given for battery but rember it a smartphone so less backup)",
            "date": "17 Oct 2014",
            "name": "Md Zishan Ahmad",
            "stars": "5 stars"
        },
        {
            "comment": "Cool phone with great features. Worth every rupee spent on it. However, this time Flipkart disappointing me with it's delivery turn around. Earlier, it delivered other ordered products by me within 2 to 3 days.",
            "date": "17 Oct 2014",
            "name": "Parvez HK",
            "stars": "4 stars"
        },
        {
            "comment": "Good performance Good camera Great battery life Excellent value for money Finally very happy using it post getting rid of Samsung Galaxy Grand",
            "date": "17 Oct 2014",
            "name": "Mahesh Kumar N",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using Moto g2, since a month ago, but not yet found any kind of technical defects. All the functions are working fine. Flipkart is doing it's job well, I received my phone in just 3 days. My cousin also bought Moto G2 from Flipkart as per my recommendation. In all, thank you Motorola & Flipkart for rendering good service to us.",
            "date": "17 Oct 2014",
            "name": "RASMI RANJAN N...",
            "stars": "4 stars"
        },
        {
            "comment": "Camera is not of good quality if the functions are concerned though picture is of good quality. Clarity, speed are all fine but usability as compared to other phone need to be improved.",
            "date": "17 Oct 2014",
            "name": "Jyoti Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "The product is good and meets expectations. Though the product got delivered by the date as mentioned by Flipkart, but the delivery courier service (delhivery.com) is too bad, the item moves for 2 days in bangalore from one place to another and then takes 3 days to deliver after reaching the destination.",
            "date": "17 Oct 2014",
            "name": "Raju Malkani",
            "stars": "3 stars"
        },
        {
            "comment": "I'm writing cons only. 1)Accessories color: I bought Black handset but I got plain white accessories. They don't look good at all. 2)Battery charging speed is quite low. Everything else is Awesome about this phone.",
            "date": "17 Oct 2014",
            "name": "Manmath Bagali",
            "stars": "4 stars"
        },
        {
            "comment": "All you have to do now is wait for Android L updates. Everything else is just perfect with this device.",
            "date": "17 Oct 2014",
            "name": "Vikas Lalwani",
            "stars": "5 stars"
        },
        {
            "comment": "first thanks to flipkart for providing genuine product with best customer experience. About the mobile. speed, camera quality (flash is available) everything is awesome. cant expect more than this at this price. instead of wasting 20 or 30 k. its a good buy which gives all the feel of android hign end and costly mobile",
            "date": "17 Oct 2014",
            "name": "selvakumar tha...",
            "stars": "5 stars"
        },
        {
            "comment": "Buttery smooth screen, pure 4.4.4 android OS, fantastic camera, 1 and a half day battery life, android L update.... What else do you want from a 13k phone. Just go for it without a second thought. You wont regret!",
            "date": "17 Oct 2014",
            "name": "Sharan S",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this from flipkart and I got it 3 days later. I am fully satisfied with the product. I would say \"Worth Buying\"",
            "date": "17 Oct 2014",
            "name": "Govind Samadram",
            "stars": "5 stars"
        },
        {
            "comment": "Good mobile in this price range. I have used this mobile for 15 days, major Problem I have faced is heat. > If I use 3G for 15 minutes phone gets heat, and if I play game for 5 minutes mobile heat is even worse, with this heat we can't talk in phone.",
            "date": "17 Oct 2014",
            "name": "Yashwanth Gaddam",
            "stars": "3 stars"
        },
        {
            "comment": "Got this phone yesterday, Quite disappointed by flipkart this time as it was told that the expected date of delivery is 24th of Oct'2014 but there was no call or text sent to me. The delivery guy left the package to some one else which normally does not happen with flipkart people. Speaking about phone, Only concern is the quality of accessories provided with this which is not of a very good quality. All the other features are good enough at this price.",
            "date": "17 Oct 2014",
            "name": "Raghav Sud",
            "stars": "4 stars"
        },
        {
            "comment": "Have used both the generation of Moto G, Its good in all aspect and so many review already mentioned Pros and cons hence not worth to mention again. Its better from 1st Gen MOTO G in terms of screen size, expandable memory and Camera. But time has changed from last launch this launch and various other option like Zenphone, MI3, RedMi etc are available with better configuration but I prefer it because it was tried and tested and available under exchange offer. Moto should have improve its RAM and processor chip set. Did not like Front speaker design.",
            "date": "17 Oct 2014",
            "name": "Vikas Nawal",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this phone on 06/10/2014 - Big day and received a defective piece on 08/10/2014 & requested for replacement on the same day.Till day I have not received my replacement mobile. From 08/10/2014 it is in transit till date,each time when I call customer care,they say same thing that your product is under shipment & expected in Perumbur hub...it wont even take 24 hours to reach from Bangalore to Chennai...mine is taking whole 8 days to reach my place...really fed up calling customer care guys.....one of my friend ordered the same MOTO G 2nd Gen two days back and he had received the same....but mine is still in transit.....it is SIN to ask for replacement.....this will be my final purchase with you.....at least deliver my replacement to the earliest......No reply even after calling many times to Customer care....at least refund my hard earned money....I can purchase from some other websites.",
            "date": "17 Oct 2014",
            "name": "Vignesh Veerasamy",
            "stars": "1 star"
        },
        {
            "comment": "i got this phone on exchange offer from flipkart , though the exchange offer sucks.. but the phone moto g is pretty good mediocre phone.it fits in my budget. features are pretty good but not comparable to high end phones but easily comparable to this phones price range. Battery life sucks Display is pretty good and clear No lags yet 5 inch screen is very good kitkat",
            "date": "17 Oct 2014",
            "name": "Anish An",
            "stars": "4 stars"
        },
        {
            "comment": "Bought Moto G - 2 a month ago. Features are awesome. Dual speaker adds a great volume to music and 3d effect. Was little dissatisfied with the Battery backup originally and requested for an exchange but found after regular use and charges for 15-20 days the battery now indeed has a full day back up after moderate use. 5 inch HD display give a great experience watching movies and playing games. Played high graphics games with no lags. So it you are looking for a brand phone with exceptional price. purchase the phone with your eyes closed.",
            "date": "17 Oct 2014",
            "name": "Prashant Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing experience. Good Mobile With Less Rate. Pros: 1.Camera Clearity 2.720p Video Recording HD 3.Streo speakers 4.Best Rate 5.HD clearity equals to I phone... 6.Charged within 2 Hours 7...8...etc... Cons: 1.Battery 2070 mAh can be raised..... Thanks You Flipkart for this deal..... :-):-)",
            "date": "17 Oct 2014",
            "name": "Arun K",
            "stars": "5 stars"
        },
        {
            "comment": "Well I'll keep things short. First kudos to flipkart for the amazing offer. now about the phone, its no doubt an amazing phone for the price.",
            "date": "17 Oct 2014",
            "name": "ABHISHEK BANERJEE",
            "stars": "5 stars"
        },
        {
            "comment": "This is another excellent phone from Motorola. I have 2 Moto G-1st gen in my family and now this. Really loved both the product. :-)",
            "date": "17 Oct 2014",
            "name": "Kaushik Mota",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd has number of limitations as compare to (Previous Version)Moto G(1st). 1.Touch Sensitivity is not better then Moto G(1st). 2.Icon size bigger then Moto G(1st) which makes it little odd. 3.Moto G(1st) has better look then Moto G(2nd). 4.Feels little bad then Moto G(1st). 5.Color quality of Moto G(1st) better then Moto G(2nd).",
            "date": "17 Oct 2014",
            "name": "Atul Kumar Singh",
            "stars": "2 stars"
        },
        {
            "comment": "WAIT....yaar aane doo!!...phir review denge. :p but, I've to say my best decision so far. i wouldn't regret for my each single penny spend on this product P.S Luv Moto company for making such beauty with advanced tech devices...\"THAT 2 IN A BUDGET PRICE!!!\" so all can have a high end technology for themselves",
            "date": "17 Oct 2014",
            "name": "ROHIT SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "Got phone delivered in one day, Thanks to flipkart Have good battery backup, considering the increase in screen size and keeping the 2070mAh battery same as MOTO G 1st gen Smooth transition between the apps No hang and fast response",
            "date": "17 Oct 2014",
            "name": "Jeevan",
            "stars": "5 stars"
        }
    ]
}
