{
    "filpkart": [
        {
            "comment": "I bought this phone in February with a lot of hopes and positive vibes as it was in the bestseller list back then(I don't know if its in there anymore). It came with android kit-kat and it worked just perfectly. DISAPPOINTMENTS : . I updated it to android lollipop back in april. The experience has been extremely disappointing after that. The phone hangs a lot, stops responding, behaves in a weird manner, touch screen lags and just forget about high end gaming experience as it does not even support the basic games properly now. Talking about the battery life, it does not even last a day so if you are planning to place an order then add a power bank in your cart too(its a must), which means another 2000 bucks. . Memory, 1 GB of ram is simply not enough for a lollipop update, I don't know any technicalities but it just does not feel enough. . I wanted a phone which handles multi-tasking well but it simply does not(same problem, hangs a lot). I have seen cheaper phones with the same configurations performing so well than this. . Heating issues(sometimes). . Speakers stop working after 10 minutes of music playback(headphones/earphones work just fine). . Camera focus, it just does not work. Every time I land up with an unfocused image. That's it. No more disappointments. :) shop safe :P",
            "date": "30 Sep 2015",
            "name": "Arun Chanchal",
            "stars": "1 star"
        },
        {
            "comment": "Have been using this for over 7-8 months ad have only good opinion for this. Its fast and looks great. Anyways there are not many games etc played on this device. Its being used for mails, whatsapp and fb. Its camera is awesome!",
            "date": "30 Sep 2015",
            "name": "Maneesh Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "very good mobile,speed battery and camera clearity is awsome,super mobile at this price ,can take mobile blindly without any hesitation",
            "date": "29 Sep 2015",
            "name": "DN VIJAY KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this phone succumbing to the reviews it raked in, but I fell into the unfortunate customer list, those bound to get a defective piece of a fast selling machine. The phone once got into sleep mode for long duration, never activates the display on clicking the power button. It then requires a restart. I thought Andriod 5.0.2 is the culprit, but turned out it’s not. The service center in Kochi is so pathetic that, for everything they will ask to replace motherboard, which I did. But the problem is still persisting. I have escalated this and waiting to hear from the manufacturer.",
            "date": "29 Sep 2015",
            "name": "Dhanesh",
            "stars": "1 star"
        },
        {
            "comment": "Mobile is not repaired since 25days, i have given my mobile to B2X service center on 5th september 2015 for charging related issue,they said collect your mobile on coming weekend (11th sept 2015) , but since then they are giving the reason that they dont have parts available right now,i have registered many complaints with motorola service center, they are also doing false promise they just used to give coming weekend date and the status will remain same , after so many escalation also, they are not bothered about customer. need to register a case against motorola and B2X, its mental torture for me. compalint number is Reference #150907-009508",
            "date": "29 Sep 2015",
            "name": "rakesh sharma",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g2 7 months back & i m very disappointed with mobile & their service.. With in 3 months I face camera problem..Bt I didn't repaired it after that I face battery problem.. Battery is not getting charged.. So I given cell to service centre & they take almost 40 days to repair.. I ask a spare mobile to use BT that also they didn't provide. After bringing back my mobile now I m facing problem with memory card 16 GB card is not detecting.. My friends also facing problem with their moto mobiles.. Don't buy this moto mobile its not worth.. All moto mobiles are same having lots of issues.. If u take a round in moto service centre u all find how many people coming with their moto mobile issues.. I m writing this review so that people should think twice b4 buy this moto mobiles",
            "date": "29 Sep 2015",
            "name": "rahul gurav",
            "stars": "1 star"
        },
        {
            "comment": "The phone is very good at this price tag compare to other product.phone camera and sound quality good and very nice.",
            "date": "29 Sep 2015",
            "name": "jigar patel",
            "stars": "5 stars"
        },
        {
            "comment": "It Seems that during call the person on opposite side can hear my voice but I cant hear him, this problem occurred after few months of use. It is happening unusually manner. It's just a headache.",
            "date": "28 Sep 2015",
            "name": "pankaj singh",
            "stars": "1 star"
        },
        {
            "comment": "The display is very poor in quality. Had to replace it twice at a great cost. I gave up the third time and bought a new mobile.",
            "date": "28 Sep 2015",
            "name": "Anuradha",
            "stars": "2 stars"
        },
        {
            "comment": "Phone display is not working....When I contact the Motorolla service centre, they are taking 1 months to repair the same....vary horrible experience with Motorolla & Flipkart...",
            "date": "28 Sep 2015",
            "name": "nishant pardhi",
            "stars": "1 star"
        },
        {
            "comment": "amazing product to buy but many not any more if you satisfy with 1GB RAM then it is a good option for you which saves ur some bucks but if you need your phone wid loads of apps to store then you must prefer MOTO GEN3 and the best thing about is that the cost is also not more than MOTO G2",
            "date": "27 Sep 2015",
            "name": "Jayesh Songara",
            "stars": "4 stars"
        },
        {
            "comment": "Bought it for my dad.. Its working absolutely fine from last 10 months or so.. Very good product from motorola... Nice configuration with this price...",
            "date": "27 Sep 2015",
            "name": "Abhishek Anand",
            "stars": "4 stars"
        },
        {
            "comment": "using it from last 3 months ....running smoothly ,no lags 1 gb ram is sufficient..even asphalt 8 run very smoothly....both camera are good battery backup also good for moderate user ends 22-24 hr",
            "date": "26 Sep 2015",
            "name": "ASHISH SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "The phone worked perfectly fine for 3 months. However, the phone's earpiece stopped working after that. Surprisingly, we are able to hear the caller's voice while calling through Skype, but regular calls are marred with no sound issue. Tried searching for a solution and got to know that a lot of other people too are facing similar issues with this phone. Haven't been able to find a solution yet. Seems like an android software issue. Planning to visit service center to get it working again.",
            "date": "25 Sep 2015",
            "name": "Dheeraj",
            "stars": "1 star"
        },
        {
            "comment": "I had purchased Moto G2 for my father. Unfortunately its display stopped working after couple of weeks of purchasing it so I took it to local authorized service center of Motorola. They took my phone, issued me job sheet and told me that they do not have required spare part in their stock so it will take around 10-12 days time in getting it repaired. I sent an email to Motorola same day requesting them to send required spare part to service center so my phone can be repaired sooner. I received an acknowledgment from them they the matter has been escalated to higher authorities. Neither service center received required part nor did I receive any reply from Motorola after that. I again sent two reminders to Motorola by email but all vain. It was September 10, 2015 when my phone was taken by service center and now it is September 25, 2015 but my phone is not fixed due to unavailability of required spare part and I do not see any sign of spare part coming. It is so negligence and ignorance of Motorola. I am surprised to see so worst level of customer service of Motorola. Details of service center are as below: Service note job # AMSAGR000252 GIN # GINAGR000261 ELS date & time September 10, 2015 6:07:25 PM Will Motorola officials pay attention on this or I made one of the biggest mistake of my life in purchasing Motorola device? Thank you!",
            "date": "25 Sep 2015",
            "name": "PANKAJ JAIN",
            "stars": "1 star"
        },
        {
            "comment": "I bought this product on march 2015 in have hardware problem at the time only i place return request but they call me for whats the problem i tell every thing whats are the problem finally they told me go to motorola service center they will fix the issu.next day i will go to service center they told me its a hardware problem this could not under the warrenty issu ypu have to pay money of 1000rs.both flipkart and motorola companies are escaping thier services.finally customer will loss the money. plzzz....dont buy the products in flipkart go for other online shopping sites.",
            "date": "25 Sep 2015",
            "name": "sriramadasu sa...",
            "stars": "1 star"
        },
        {
            "comment": "The MOTO G 2nd GEN mobile slow charging and getting hang, very worst condition in Battry charging, The battry will take to full charge around 5 hrs.........WORST Please dont buy this product...",
            "date": "25 Sep 2015",
            "name": "KUMARA BELURAIAH",
            "stars": "2 stars"
        },
        {
            "comment": "Phone is superb in every aspect. Build quality is great. Sometimes the phone gets over heated. Overall a good buy.",
            "date": "25 Sep 2015",
            "name": "mukesh sharma",
            "stars": "4 stars"
        },
        {
            "comment": "i like it and i want to have fun with it every moment and there are certain complications but don't worry they are negligible also my phone has a very good look my friends appreciate me for buying it",
            "date": "25 Sep 2015",
            "name": "srikanth reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I have used Moto e, Moto g and Moto g(2nd). performance and quality of all these phone was very good. So based on this good experience i decide to buy same phone moto g2 (2nd) for my wife but this time i disappointed very much from its display and camera quality. Although Motorolla has reduced it price as compare to last year but its quality reduction is more than its price. 1. Its display looks purple during standby mode. same can be easily differentiate. It feels like low cost chines phone. 2. A very thin wire mesh is present on screen (when see from side of display) 3. Touch is missing some time. 4. Camera quality is also degraded. 5. One of SIM holder not working properly and hold the SIM in four-five tries. It happens every time. I have both phones (Moto g2 2nd gen) purchased last year and second phone purchased last week. So above point are based on actual comparison between them.",
            "date": "24 Sep 2015",
            "name": "Parmod Sharma",
            "stars": "1 star"
        },
        {
            "comment": "I have ordered Motorola g(2nd gen) on June 11 2015.I got the delivery by 16th.On 7th July I placed an replacement request as there was a blue spot on the screen.I went to the service center, they told its gonna take atleast 20-30 days for repairing.Since not much days had passed so i got of asking for an replacement.once they rejected my request saying that it could be fixed by an SOFTWARE(how can a hardware problem be fixed by a software???). again i placed a request,then my request was confirmed.on 17th July 2015 i got the new phone.now on 21 September I am again facing problems.Now this time it is that my 2nd sim slot is not detecting the sim card. When i contacted the service center,they registered my complaint and told me that it will take 7 days to repair. after 2 days i get a call saying that no parts are available so its gonna take long to repair.I'm really disappointed by Motorola.",
            "date": "24 Sep 2015",
            "name": "shubham jain",
            "stars": "1 star"
        },
        {
            "comment": "Hi guys, I'm using this phone last 3months onward, battery back up very poor and some time it's hang. So I suggest for don't buy this phone. Worst battery.",
            "date": "24 Sep 2015",
            "name": "Sam",
            "stars": "1 star"
        },
        {
            "comment": "13k is really too much for this item. The camera is good only in day light and it not suits in night light. Touch sensitive is very good. I face hanging issues. Battery back up is not as expected, So far I'm not facing heating issues. We can go for 6k mobiles while comparing to this. If you want to go for a branded product you can go for it. Else try for Lava really good camera quality, no heating issues, no hanging issues",
            "date": "24 Sep 2015",
            "name": "Nazeera",
            "stars": "1 star"
        },
        {
            "comment": "back camera and recording are good.front camera is not so good but overall good experience.battery life is far better than similar range asus zenfone5",
            "date": "24 Sep 2015",
            "name": "Aishwarya Raj",
            "stars": "5 stars"
        },
        {
            "comment": "the mobile is absolutely worst piece that i got. The screen works as its own interst. I am not able to unlock the mobile. The power button is too inside and it is difficult to press that . The biggest challenge it the touch. Is there any way i can get it modified.",
            "date": "23 Sep 2015",
            "name": "Ch Siva Rama K...",
            "stars": "1 star"
        },
        {
            "comment": "Flipcart is promoting the product through false adverts. As fetured in your website\"The phone also features a water resistant coating which protects the phone from the inside out. Take a call wherever you are, even if there's a bit of rain\"... which is not at all mentioned in motorola's website. My phone (MotoG -2nd Gen.) got damaged inside out coz of water damage and now service centre guyz at Motorola are not providing any replacement (though it is in warrenty period- purchased on 10th June). So dear flipkart, have your QC Dept. have enough balls to provvide me a replacement?? At least have you enough guts to accept the thing that YOU ARE PROMOTING THE PRODUCT FALSELY??",
            "date": "23 Sep 2015",
            "name": "SANDIP DESHPANDE",
            "stars": "1 star"
        },
        {
            "comment": "in this price range no one can beat moto phones bcauz due to build in quality and software performance.....",
            "date": "23 Sep 2015",
            "name": "Raaz Ansr",
            "stars": "5 stars"
        },
        {
            "comment": "Pros Lollipop Out of the box Sensors Display but white looks some yellow Camera was just fine Speakers is good Calling Quality isGood Pure Android SloMo Video Cons No Customization 1GB RAM",
            "date": "21 Sep 2015",
            "name": "Suyash Chandra",
            "stars": "4 stars"
        },
        {
            "comment": "It is a nice phone under 10k. But with few -ve points. I bought it 2 months back. First piece had major problem with battery, it needed to charge 2-3 times a day also it used to hang a lot. I asked flipkart Motorola support to replace the phone, the test for phone performance was good but their suggestions to improve performance were very funny. They asked me to stop the apps that are using maximum RAM whenever I stop using those apps all the time. Is this the way to improve phone performance? Later on got replacement from flipkart. Second piece was working fine, until I updated the phone. After I updated the phone, the camera quality became worst, every image comes blurred. Phone takes 3-4 hours to charge completely. Now I'll need to factory reset the phone. Otherwise the phone is ok. I don't play any games but I do watch lots of videos on it. But I can't switch between multiple apps at a time otherwise it will hang. Pros: 1. Good camera quality 2. Nice touch screen 3. Video and Sound quality is good Cons: 1. Poor battery (drains faster) 2. 1GB RAM against 16GB internal memory is not enough at all. The phone hangs most of the time.",
            "date": "21 Sep 2015",
            "name": "Akshay Adhav",
            "stars": "3 stars"
        },
        {
            "comment": "1: Camera is good 2: Multi-tasking is fine, if you dont open up 10 apps at a time. 3: Nearly stock Android KK when bought (then updated to Lollipop) Good budget phone with sd card slot, dual sim, you cant ask for anything else.",
            "date": "21 Sep 2015",
            "name": "anmol ten",
            "stars": "5 stars"
        },
        {
            "comment": "You will get a lot of features with less price. 2GB ram is not sufficient for running multiple applications simultaneously and mobile will hangs for 10 secs. If battery got exhausted, It takes much time to recharge. Avoid battery to be exhausted fully. Standby backup is not bad.",
            "date": "20 Sep 2015",
            "name": "Pranaya Ranjan...",
            "stars": "4 stars"
        },
        {
            "comment": "The moto customer service was very very very veryyyyyyyyyy poor. I gave the phone in service center on AUGUST 8th 2015. Now iam celebrating 50 days function. They are intentionally late because i have warranty. Please buy the phone if you able to pay money for any problem in warranty also. So think once about the service before buying this mobile.",
            "date": "20 Sep 2015",
            "name": "RAJA 9966737770",
            "stars": "1 star"
        },
        {
            "comment": "I brought this Moto G to replace my secondary mobile moto G first Gen then next day Gen 3 was launched on flipkart i am happy with this mid range phone in budget but now as get 3 is avalable with waterproof i recommend to go for gen 3",
            "date": "20 Sep 2015",
            "name": "Anish Mandal",
            "stars": "4 stars"
        },
        {
            "comment": "Camera quality needs a lot improvement. The mobile is very grippy which i liked a lot, compact and looks elegant. Nice phone for 12k. Battery issues are there needs a lot improvement. Some of these improvements will help a lot.",
            "date": "20 Sep 2015",
            "name": "Harry P.S.",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone in april 2015. I preferred it over xiaomi because of the better overall experience. But few days back, I unintentionally inserted the micro usb charger in the wrong direction i.e. upside down which somehow damaged the charging port on the phone. I took it to service centre. They asked for ₹ 7500 to replace the whole motherboard! I realise it was my mistake but I think ₹ 7500 is too much for a phone which costs ₹ 9000 now. Feeling cheated.",
            "date": "20 Sep 2015",
            "name": "Sahib Singh",
            "stars": "1 star"
        },
        {
            "comment": "Sir, I had purchased moto g2, but now is not working how to exchange my mobile. mobile display is not come",
            "date": "20 Sep 2015",
            "name": "Bala Vijayan",
            "stars": "3 stars"
        },
        {
            "comment": "Motorola can never disappoint you. I bought this for my sister and she has been using this for 4 months now. No problem at all. They provide cool stuff at manageable cost. Taking about features this phone has all of it at this price. Comes with Andriod lollipop. Thanks flipkart :)",
            "date": "19 Sep 2015",
            "name": "Divya",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone after having listened to/read several reviews - as always, impeccable service in terms of delivery, from Flipkarts end in serving their Priority Customers (received the product in 1 day); however upon a few days of use, the product started to heat up significantly - perhaps the 1 GB RAM wasn't adept in coping with moderate multitasking. Requested for a refund but was met with a few disappointing customer service minions arguing their level of logic; however, some of the senior folks (special mentions to Mr. Venkatesh/Mr. Shiva) were able to rescue the situation and help with my refund. Thanks again Flipkart for restoring the consumers' belief in what is soon becoming a dependable brand for Indian e-Commerce! :)",
            "date": "19 Sep 2015",
            "name": "Imran Hassan",
            "stars": "3 stars"
        },
        {
            "comment": "bhosdiwale inlog ka delivery v chutiya jaisa tha... maha faltu delivery boy wo Home delivery ka shayad meaning nai janta FLIPKART mujhe majboor kia hai aisa hindi review dene ko defective mobile deliver kar k return v nai lete kamine .. inlog ka custumer executive sab dhang se baat v nai suntey had a bad experice with flipkart Shopping I think flipkart going down now a days they are providing bad service now a days I'M one of the old customer of Flipkart....first time I'm getting such a type of service",
            "date": "19 Sep 2015",
            "name": "Paritosh Ram",
            "stars": "1 star"
        },
        {
            "comment": "Excellent product and fast delivered, good services.Price is with in limits.Personnel data with google a/c I got it.Thank you very much.",
            "date": "19 Sep 2015",
            "name": "VENKATAPURAM SUDH...",
            "stars": "5 stars"
        },
        {
            "comment": "for the price of 9000... it is the best phone.great quality.. durable and motorola ka bharosa...cant be any better for this price",
            "date": "19 Sep 2015",
            "name": "Vansh Mehdiratta",
            "stars": "5 stars"
        },
        {
            "comment": "faulty product.. Memory card Slot not working ..i have to visit service center within a week .....VERY DISAPPOINTED",
            "date": "19 Sep 2015",
            "name": "Shrish Dicholkar",
            "stars": "1 star"
        },
        {
            "comment": "Good phone. Thanks to FLIPKART for before time delivery.Purchased in May 2015. Good camera, nice audio. and good screen resolution. Mobile gets heated in first few charging but no problem now.",
            "date": "19 Sep 2015",
            "name": "Shrikant",
            "stars": "4 stars"
        },
        {
            "comment": "best phone in its price range best camera best sound best video quality i have no regret buying this phone",
            "date": "19 Sep 2015",
            "name": "SHAH AHMED",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for almost a month. The phone performance is pathetic. No pros all cons. I mean it has all the basic features which now a days any android phone has but that is not what is expected from Motorola. Since day one the phone battery has been troubling me. It takes at least 4 hours of continuous charging to get fully charged and even after charging fully battery hardly lasts for a day. And all this crappy performance for a user like me who doesn't use phone for anything except internet surfing and whatsapp. On top of it I tried to put a return request over three times, but the response from Flipkart is pathetic and unexpected. I was told by customer care executive that it is normal for any android phone to take 4 hours to charge and battery back up of a day is normal too. Customer care executive also advised me not to use third party applications as it consumes more battery. Now that's a six...I mean if you can't use TP applications why would I buy a smart phone? A total wastage of money don't go for it",
            "date": "19 Sep 2015",
            "name": "Satyajit Lele",
            "stars": "1 star"
        },
        {
            "comment": "total dabba phone don't buy it, discharging very fast taking 3-4 hours to get full charge, hangs a lot while playing even simple games like subway and temple run. Its slowness will just irritate you and you want to throw it under running truck. Flipkart and Motorola are making fool of people by giving just a plastic box.",
            "date": "19 Sep 2015",
            "name": "avanish kumar",
            "stars": "1 star"
        },
        {
            "comment": "Ordered a new moto g 2nd gen .I Was very exited to get the phone as i got it under a offer at a price of 9899/- on 1 May 2015.( i am writing this review very late .) After i received the the new phone i unboxed it and the 1st thing i did was to switch on the phone, its display is vivid , crisp and very good. The video quality on the moto g2 was good.The new moto g2 feels really good to hold in hand and feels lighter.The camera is pretty good on the g2.Sound quality is pretty good on the moto g2. Also i like the way Flipkart ships the products :) Delivery & support is very good !!",
            "date": "19 Sep 2015",
            "name": "Sushant Sourav",
            "stars": "5 stars"
        },
        {
            "comment": "its been around some three months I have been using the phone, the major cons are the battery backup which is not so good(2070 mAh)it drains real fast and the phone seems to hang at times ,also the calls receiving isn't good (loud enough that the person sitting nearby you can hear the person on the other end of the phone although the hands free option isn't selected) I find the motog quite stylish though and the camera resolution gives really good images,",
            "date": "19 Sep 2015",
            "name": "aashish mallik",
            "stars": "4 stars"
        },
        {
            "comment": "Beauty with brains, moto g2 is truly a craftsmanship, crystal clear display, hd sound quality, fast processor, beautiful camera, touch is really amazing. No words to express its beauty with its fabulous features.",
            "date": "19 Sep 2015",
            "name": "Yaseen Khan",
            "stars": "5 stars"
        },
        {
            "comment": "no battery back up. it will show 100% charge with in 10 mins and battery low after 2 min. not able to take and make calls most of the time. some time its take years to run an app.",
            "date": "18 Sep 2015",
            "name": "Sijo Joseph",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased MOTO G (2nd Generation) on 26th May, 2015 but the handset giving so many problem in the span of 1-2 months. Very poor quality of battery, getting hot very earlier, calling sound quality not good. The major problem is with display it is continuously flukes when brightness kept at low level. When I capture the images with rear camera the images that I capture are not clear, they are blurred. Video shooting is also blurred. The biggest problem that I have faced that handset doesn't support 16 GB memory card however the handset supporting capacity is 32 GB (Very Funny). Anyways there are other minor problems that I won't describe here. I want to return the Handset to the company because I am not satisfied with the Handset & the Company service when I am investing Rs. 11000/- in a very CHEAP HANDSET. If any support & action is not taken against my review then I will approach to the CONSUMER COURT seeking reimbursement of Handset & other expenses regarding the problem.",
            "date": "18 Sep 2015",
            "name": "Nikhil G",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto G 2nd Gen 6 month back, performance is fine till now and it is one of the best phone at this price range. And the delivery by flipkart is also good, received the item within 2 days.",
            "date": "18 Sep 2015",
            "name": "Nabajit Saha",
            "stars": "4 stars"
        },
        {
            "comment": "this mobile not support video CALLING and charging should be less than two hours when using internet",
            "date": "18 Sep 2015",
            "name": "venkat",
            "stars": "3 stars"
        },
        {
            "comment": "Well..my experience was not good with this phone. It was very slow. Specially the dialer app which was slow most of the time. Sometime call will get connected and call display won't be coming on the phone screen.",
            "date": "18 Sep 2015",
            "name": "Himanshu Arora",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto G 2014 about an year before. The phone is pretty average. Nothing great about it. Given its price range this is what you could expect. The sound quality degraded after few months. The are only 2 service centers and the people are very less knowledgeable to fix such issues. The battery life is poor. Had to charge everyday for normal usage. If you switch on Mobile data for the whole day and turn on Whatsapp and email only the battery will go off even before the end of the day; Honestly, no heating issues etc. Camera was OK for me fit for purpose; I'm not a great game buff so havent tested gaming apps;",
            "date": "18 Sep 2015",
            "name": "Arun Srinivasan",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome experience.. Touch is also awosome... Gaming Experience is also awesome..... overall aaaaaaaaaaaaaaaaaawwwwwwwwwwwwwwwwwwwweeeeeeeeeeeeeeeeeeeeesssssssssssssssooooooooooooommmmmmmmmmmmmmeeeeeeeeeeeeeeeeeee..... luv u Moto..... Just enjoying it... also am going 2 fan of selfie.... Thank u Moto....",
            "date": "17 Sep 2015",
            "name": "Samrat Paul Ch...",
            "stars": "5 stars"
        },
        {
            "comment": "hang, hang, hang...I am using this mobile from last 2 months and I just suck off using this worst mobile ever. I had samsung galaxy s2. which is around 4 years old. that is still much better then this waste. Don't spoil your money. I am using only 3-4 extra apps facebook, flipkart, whatsapp and paytm only. I clear cache in every 3-4 hours. Still it gets hang. Sometime I don't see the icons of call, message, camera(initial screen) then I will have to restart the mobile. so many issues. I just updated new android version 5.0.2. I am giving single star because of it's camera but it doesn't deserve. There is nothing better to purchase some cheaper mobiles.",
            "date": "17 Sep 2015",
            "name": "Bhupendra Kano...",
            "stars": "1 star"
        },
        {
            "comment": "no comparison at all. only demerit point is battery backup. picture quality either from front or back camera is good. no signal problem. loud sound. sound quality in headphone is melodious.",
            "date": "17 Sep 2015",
            "name": "Banty Kumar Sao",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased Motor G2 in the last week of april this year(2015). The mobile is a value for money. Display quality, camera, performance e.t.c are good. The mobile does not hang unlike Samsung, may be because the stock android installed in moto. The battery back up is just okay for 1 day for voice calls and 1 to 2 hrs of data usage. But, if videos, data and apps are used extensively, power bank is a must. The stock android is a little user unfriendly, but the performance of the software obviates that small disadvantage and one would get used to the tricks easily. But, as i said in the beginning, the biggest plus point is that the mobile is value for the money (Rs.10K). We can throw it after one year and buy a new mobile with latest specs. I had used samsung for 2 years earlier that was bought at 25k and the comparison is very simple and obvious for me.",
            "date": "17 Sep 2015",
            "name": "Sujith V S",
            "stars": "4 stars"
        },
        {
            "comment": "just awesome. no comparission in price on in specs......... if you can stretch your budget a little bit go for 3rd gen",
            "date": "17 Sep 2015",
            "name": "Jeet Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "I have received wrong Invoice for the Phone, the IMEI numbers doesn't match. And the phone which I received has display issue. Not able to service the phone either due to the wrong IMEI number in Invoice.",
            "date": "17 Sep 2015",
            "name": "Arun Sekar",
            "stars": "1 star"
        },
        {
            "comment": "I had used this product for more than 9 months found no issue in this product. Really very good mobile it is!! Unfortunately i missed it in traffic and now i am reviewing this product. Any one if thinking of getting this product please go without hesitation. Some of guys think of 3G and 4G mobile but i feel now, 3G is better. After purchasing 4G mobile I have noticed that there is very fast Data consumption in 4G. However 4G gives good speed but there is only difference of 19-20 in 4G & 3G and now i feel my Moto G2nd gen was really better. Many of have written battery back is low but the more battery back means you are keeping higher risk in your pocket. In this product there is nothing like it last a whole working day and you can charge in night for next day. Also Flipkart service is really very good.",
            "date": "17 Sep 2015",
            "name": "RAJ KUMAR DUBEY",
            "stars": "5 stars"
        },
        {
            "comment": "Worst mobile by motorola. battery back very less. it eats battery without using the phone also. touch will not respond phone gets hanged. application will get closed while running. no option to restart the phone.",
            "date": "16 Sep 2015",
            "name": "Bharat Bhushan",
            "stars": "1 star"
        },
        {
            "comment": "The phone heats up too much too quickly even when peforming relatively simple tasks like surfing net. I do not play games orwatch movies in my phone but it still heats up too much and starts to hang. Not happy at all!!",
            "date": "16 Sep 2015",
            "name": "Supragya Shrestha",
            "stars": "2 stars"
        },
        {
            "comment": "It is getting hang after every action. This device should be banned from selling. Motorolla is charging 10,000 for nothing.",
            "date": "16 Sep 2015",
            "name": "Hiren",
            "stars": "1 star"
        },
        {
            "comment": "I am very much satisfied with the product. There is no battery complaints. There is no fault in the display. Its working fine after 3 months.",
            "date": "16 Sep 2015",
            "name": "Karthikeyan Mu...",
            "stars": "5 stars"
        },
        {
            "comment": "flipkart did very nice packing and moto g was in my hand within two day of order and cell is very nice no hang no lag problem and it is good for gaming. best cell in budget phone motorola is doing great job.",
            "date": "15 Sep 2015",
            "name": "Devin Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Dear all friends if you want to by smart phone in this price 10000.then i will suggest you to buy this phone.bcoz of this phone is very smooth with the stck android features and never hang n all. I am using this phone since 6 month till now i didnt get any issues.",
            "date": "15 Sep 2015",
            "name": "Awadheseh Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "it all the basic future you want , and you will not fill that you are missing something so go for it you will not retreat it is for sure , must buy phone it classic display and very good camera also has good looks so go for it",
            "date": "15 Sep 2015",
            "name": "IRSHAD SHAIKH",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is working fine... Battery life is not good.. get heated so much.... Camera is fine ... No data cable in accessories( i didn't noticed before ) so now i have to buy a data cable...",
            "date": "15 Sep 2015",
            "name": "Raju Bhakar",
            "stars": "4 stars"
        },
        {
            "comment": "it suddenly cast pink colour on the screen which lasts for 1-2 secs...many times....also sometimes it shows camera has stopped working",
            "date": "15 Sep 2015",
            "name": "Shashwat Dev",
            "stars": "2 stars"
        },
        {
            "comment": "It's a good device, but within 7 months the camera flash stopped working. It turns out this a typical issue with this device.",
            "date": "15 Sep 2015",
            "name": "Aastha Bansal",
            "stars": "3 stars"
        },
        {
            "comment": "Battery service as normal is 5 hours, in 3G its only 3-4 hours. All are good except battery life. Moto G is better than this phone.",
            "date": "15 Sep 2015",
            "name": "RAJ MALLICK",
            "stars": "1 star"
        },
        {
            "comment": "In offers Flipkart is promoting Airtel. But after sale I did not get double data offer from Airtel. I told this to Flipkart many times but they are not solving my problem. I don't understand why this people are doing false commitment to buyers only in India. Is it possible to cheat like this in other country. I have purchased moto G 2nd gen phone since 6 monthes back. I have repeatedly complained at both end ( flipkart & airtel) but no one is serious about their false commitment. This type cheap mentality cann't",
            "date": "15 Sep 2015",
            "name": "Gopal Choudhury",
            "stars": "1 star"
        },
        {
            "comment": "1.you really feel good. 2.perfect size 3.good battery life. 4.No issues up-to. 5.viewing angles are good.",
            "date": "14 Sep 2015",
            "name": "VINOD KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone in sept 2014. so this review is after one year usage! it runs like a charm, pure stock android experience n plenty of storage, no bloatwares! camera performance is decent.back panel has good rubber grip! cons: plays choppy 1080p videos. i updated this phone from kitkat 4.4.4 to lollipop 5.0.2, and the whole experience has changed, its now worst!!! 1)apps take time to open, and some of them crash n re-open even after closing them.:( 2)the deafult music player stops playing n closes in the middle when multitasking or sometimes wen minimized.com'on man! really? even default music play? also my favourite multifeature music app JETAUDIO crashes everytime when playing songs.!oh man! ! i didnot have any of this problems on kitkat! i hope lollipop 5.1.0 fixes this ,no official update is released! bottomline: stick to the default OS (as it is optimized for it). update to newer version only wen it is fully tested, stable and reviewed by others!!!! as and always.. mel",
            "date": "14 Sep 2015",
            "name": "Melwyn Gomes",
            "stars": "4 stars"
        },
        {
            "comment": "This set is totally a scrap. It hangs frequent, battery is not even lasting for 12 hours, network gets disconnected frequently. I trusted flipkart to but this product. But when i complaint about product and ask to return, they just given me troubleshooting step to format the phone just to pass 1 month replacement period. I am not even able to use this phone for proper calling due to hang and network issue. I will never trust flipkart in future now. This will be my last buy from flipkart. It was never expected from a brand like flipkart. Poor flipkart, poor moto. I just hate this product and now also flipkart. I could have gone for negative rating if it was there. I don't think they will publish this review. Regards, Chandan",
            "date": "14 Sep 2015",
            "name": "Chandan Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Using this handset since 3 months now. Battery backup is really poor. At times ,a full backup does not last more than 1 hour. Not a handset to recommend others.",
            "date": "13 Sep 2015",
            "name": "Shekar TK",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this mobile on 26/12/2014 My experience on this mobile For those who complaining battery bacup is low upgrade to lolipop os and please switch on the battery saver mode you will battery bacup upto 2 days Pros Fast processor , Highly Durable More apps can be installed As You get 16 Gb Internal memory Games are working seamlessly Water resistant Build quality is Good Lolipop upgradeble Cons Weight is more 155 gm No 4g/lte",
            "date": "13 Sep 2015",
            "name": "Varun",
            "stars": "5 stars"
        },
        {
            "comment": "delivery was in time I did not get Airtel 6 months free data usage which was given in the offers Battery gets discharged so quickly",
            "date": "13 Sep 2015",
            "name": "Siva Prasad",
            "stars": "2 stars"
        },
        {
            "comment": "I found only one con for this mobile. its the battery. its just 2070mah. I would say battery for such a good phone should be minimum of 2500mah and more than that. if you want a long battery life then you have to go for a power bank.",
            "date": "13 Sep 2015",
            "name": "Anil KD",
            "stars": "5 stars"
        },
        {
            "comment": "Whenever i use the camera, it heats instantly. whenever i keep my g2 in my pocket nd if theres a call coming, then i have to first off nd on the screen phone, nd sometimes the voice of reciever is not audible......... Battery drains out easily....",
            "date": "12 Sep 2015",
            "name": "Mayank K. Jaiswal",
            "stars": "3 stars"
        },
        {
            "comment": "I'm in love with this phone. I would have given 5 stars. But I give it 4 because I don't at all like the battery backup. They could have given a bit more powerful battery.",
            "date": "12 Sep 2015",
            "name": "Sounak Bera",
            "stars": "4 stars"
        },
        {
            "comment": "Been using this phone from last 9 months. i can only say that its just superb phone!!!!! No issues so far. Display is crystal clear. sound is super cool.",
            "date": "12 Sep 2015",
            "name": "Ajay Shinde",
            "stars": "5 stars"
        },
        {
            "comment": "Sim Slot 2 was not working. When gone to service centre told that they will look into this. After that got a call that it is damaged and for repair 1100/- else pay 175/- as investigation charges. Phone purchased in March 2015 and still under warranty. How one can damage inside the sim slot. It is like taking money by cheating customer. NO one should buy motorola phone.",
            "date": "12 Sep 2015",
            "name": "Robin Poddar",
            "stars": "1 star"
        },
        {
            "comment": "Have been using this phone for almost a year and has been a gem of a phone for the price provided! Its probably one of the best dual sim phones available on the market. Considering this has a stock Android installed, there have been no issues related to the phone hanging despite having multiple applications open in the background. Started seeing a bit of lag after upgrading the OS to Lollipop 5.0. As most of you might already be aware, the memory leak issue has been a major drag on the resources of the phone. Desperately awaiting the Lollipop 5.1 upgrade to fix the darn issue! The battery backup has been decent. It lasts for a day on standard usage including being on the W-fi for the whole day. The battery saver mode on the Lollipop OS is another boon in case you intend to travel for an extended period. Overall a really great buy!",
            "date": "12 Sep 2015",
            "name": "Jayasurya Menon",
            "stars": "5 stars"
        },
        {
            "comment": "Provided charger along with the mobile is not good. I need to push hard the same in mobile socket to charge. If I use any other charger to charge my mobile set that perfectly charging the device. Some what unsatisfied with this.",
            "date": "12 Sep 2015",
            "name": "Ramesh G",
            "stars": "3 stars"
        },
        {
            "comment": "very messy hand set no purcheg to all friend service center one time one issue agen time five issue is ready your so support for customer care for motorola is very disappoint support person tack to going to service center & my tack to service center no authorized direct to tack my issue for hand set 14/8/2015 deposit my set 1. display in line 2.tacking & internet using time heating 3. battery issue 4.gallery in open so black service center my hand set issue is show display damage & on off problem 4/9/2015 i am collect to se two day ok but calling time no sound ear re repair to set service center but 4 day ok re problem sound is damage & my set body damage for service center",
            "date": "12 Sep 2015",
            "name": "sandeep singh",
            "stars": "1 star"
        },
        {
            "comment": "good phone.... with less prrice/////// camera,,just superverb,,,,, nd sound of the fone......likeable",
            "date": "11 Sep 2015",
            "name": "govi",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from last 1 year but there is no issue no heating problem and camra is so better for selfi and pics. I am very happy with this phone. It have powerfull body because of I left down the phone but there is no scratch and no issue like other phones.",
            "date": "11 Sep 2015",
            "name": "VAIBHAV BHARDWAJ",
            "stars": "5 stars"
        },
        {
            "comment": "Lack of bloatware, stock UI and able processor makes this a great buy. The screen has a slight yellow tint. But with moto g3 in market, there is no sense in buying this product any more.",
            "date": "11 Sep 2015",
            "name": "Aswin.P",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this mobile(moto g2) from flipkart couple of months back. Main issues facing till date are during call the person on opposite side can hear my voice but I cant hear him, this problem is since i have bought the phone. More over caller is getting echo voice when ever he speaks. Also there is an issue with network connectivity. Initially i used Airtel sim, when ever call is dropped network signal also gets dropped. So, thought its an Airtel issue. Later moved to vodafone on mobile portability. Same issue again. I used to get more calls every day, every one complaints about these issues. I suggest dont ever buy any motorola mobiles",
            "date": "11 Sep 2015",
            "name": "Naresh",
            "stars": "1 star"
        },
        {
            "comment": "I was never a person who would buy any thing online, prefer going to the store to pick the stuff I wish to buy. As my friend suggested me to try buying product @ Flipkart I had decided to buy \"Moto G (2nd Generation)\". This is the worst phone, does not catch signals nor wifi. I feel I have a dummy phone in hand where I cant make calls nor check internet despite having 3G mobile data. The issue has got nothing to do with the mobile service provider as I have a Samsung phone and another number which works perfectly fine. As I am new to online shopping never realized I could return the product. Never thought Flipkart products are this bad. This is my first and last buy from Flipkart.",
            "date": "11 Sep 2015",
            "name": "Sudha Nookala",
            "stars": "1 star"
        },
        {
            "comment": "GOOD HARDWARE AND SOFTWARE AS AMERICAN PRODUCT SO PRIVACY IS AN ISSUE HOPE ONE DAY IT WILL MAKE IN INDIA 50 GB FREE CLOUD SPACE BUT USE CAREFULLY",
            "date": "10 Sep 2015",
            "name": "R VIEW",
            "stars": "4 stars"
        },
        {
            "comment": "8 MP Primary Camera and 2 MP Secondary Camera Dual Sim (GSM + GSM) 1.2 Ghz Qualcomm Quad Core Processor 1 GB RAM Android v4.4.4 (KitKat) OS 5 inch HD Screen Expandable Upto 32GB",
            "date": "10 Sep 2015",
            "name": "T Gouri Sankar...",
            "stars": "1 star"
        },
        {
            "comment": "Motorola has got the worst warranty agreement. I bought a MOTO G2 3 months ago...it developed charging problems and with time got very severe. It totally stopped charging about 10 days ago.The service center guys told me that charging port comes under physical damage and is hence not covered under warranty. but if the charging port is intact how can there be an external physical damage..on top of that they don't have their own service centers..you'll have to stand in line for hours before you finally get your chance. The customer care and service center people are rude and insensitive.I've used Samsung, Nokia in the past and i never faced any such issues before...Motorola is duping people with such frivolous warranty arrangements...their charging port is of inferior quality and they don't even want to cover it under their warranty.If a device is developing problems under normal usage, then they should be able to cover it under their warranty..They can advertise all they want on TV..but you can only know about the quality of a brand, when you approach their service center...and for me Motorola is among the worst in India...was planning to go for G3 but will never ever buy a moto and not recommend others to buy it..",
            "date": "10 Sep 2015",
            "name": "Manju Pauria",
            "stars": "1 star"
        },
        {
            "comment": "Moto 2 nd gen is very good cellphone,i love this product. now i am working all my net work with this cell ph",
            "date": "10 Sep 2015",
            "name": "MUKUL SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "Worst product. Its have all those problem which is possible for any andriod phone. Never buy. Its total waste of money",
            "date": "10 Sep 2015",
            "name": "Vikram Mishra",
            "stars": "1 star"
        },
        {
            "comment": "Delivery is fast... i know about this product and using from past one year. i bought another one for my father. one of the easy to use phone",
            "date": "10 Sep 2015",
            "name": "Hari",
            "stars": "5 stars"
        },
        {
            "comment": "An excellent mobile at a very reasonable price. Looks good, user friendly, takes good pics. Very good to surf the net too. I am planning to buy one more.",
            "date": "09 Sep 2015",
            "name": "Anis Rahman",
            "stars": "5 stars"
        },
        {
            "comment": "Actually I bought this product for my friend but some days I have used it before. Its very good mobile its touch & camera quality is very good. I was thinking to buy it again",
            "date": "09 Sep 2015",
            "name": "shridhar baban...",
            "stars": "5 stars"
        },
        {
            "comment": "Did my research & bought for my Brother !!! Grt product - thumbs up recommendations for Smart phone users. Till date the product is running grt , I Believe almost a year now !! Grt service by flipkart again ... & also got on a nice offer price!!!",
            "date": "09 Sep 2015",
            "name": "AK",
            "stars": "5 stars"
        },
        {
            "comment": "perfect product. Everything about the mobile is so good. Be it camera, display, battery life, smooth performance. A complete product and awesome delivery by flipkart.",
            "date": "09 Sep 2015",
            "name": "Sunit",
            "stars": "5 stars"
        },
        {
            "comment": "It is a smart phone for surfing internet, but photo is OK, not brilliant. Battery is good. Overall, very good performance and value for money.",
            "date": "08 Sep 2015",
            "name": "Bishan Sanyal",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is very good. Giving good performance from last one year. Motorola is doing very good work. Performance of the phone is awesome.",
            "date": "08 Sep 2015",
            "name": "Puneet Mudgal",
            "stars": "5 stars"
        },
        {
            "comment": "Worst product!!! I have order this product and 1st time I got defective piece and after so many follow up they replaced with another defective piece and they are not ready to accept that product is defective. I am bearing this Product...with heating problem and bad quality of front camera.",
            "date": "08 Sep 2015",
            "name": "Sanjay Kumar",
            "stars": "1 star"
        },
        {
            "comment": "The product received from Flipkart was gud. For me the battery withstand for one and half day. Touch screen is very soft. Suits with OTG pendrive. Over all i am satisfied with the model",
            "date": "08 Sep 2015",
            "name": "Naveen",
            "stars": "4 stars"
        },
        {
            "comment": "The Phone works smooth, I purchased it as a gift for my sister and i am happy she loved it. The best thing is the camera, which is upto the expectations.",
            "date": "08 Sep 2015",
            "name": "Shweta",
            "stars": "5 stars"
        },
        {
            "comment": "Having a bad experience with Moto G2. Right from day 1, phone is getting heated up while taking video for a minimum of 2 mins. Highly disappointed inspite of all the good reviews here.",
            "date": "08 Sep 2015",
            "name": "Sravanthi",
            "stars": "1 star"
        },
        {
            "comment": "I m using this Phone Since 2 months and There is not Single issues on the Phone so thanx to Seller Awesome Seller",
            "date": "08 Sep 2015",
            "name": "Digesh",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone from flipkart . The Phone came with some problems , after multiple times calling to flipkart then they replaced the phone finally. The phone is working well but my battery cannot last it for at least one day with minimum usage .If you travel long with this phone definately you need to carry power back up so bit irritating",
            "date": "08 Sep 2015",
            "name": "Raju Haridas",
            "stars": "3 stars"
        },
        {
            "comment": "First wanna thank flipkart for such an amazing service. The delivery was quick. The phone is awesome with all enhanced features. I simply loved it. Fully satisfied.",
            "date": "08 Sep 2015",
            "name": "Anjali Upreti",
            "stars": "4 stars"
        },
        {
            "comment": "I was excited about this buying mobile before buying. But after buying this mobile my opinion changed. Its a horrible mobile. It hangs more often. My only suggestion dont buy this phone. If you buy, you will regret it later!",
            "date": "08 Sep 2015",
            "name": "Subrahmanya Devadiga",
            "stars": "1 star"
        },
        {
            "comment": "I have used many android phones, but Moto g2 has disappointed me with respect to battery backup. The battery lasts only for 7-8 hrs if i have my mobile on data stand by. If you are looking for a better battery please dont go for this. Apart from this all other features are pretty good.",
            "date": "08 Sep 2015",
            "name": "Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome phone, Prompt delivery. Good display, Good Battery Backup. A bit outdated technology. But really worth for money.",
            "date": "07 Sep 2015",
            "name": "Sachin L S",
            "stars": "4 stars"
        },
        {
            "comment": "Very bright white color as I need. Came up with lolipop pre-installed version. Speakers are loud and very clear sound while talking on phone. Budgeted phone and must buy.",
            "date": "07 Sep 2015",
            "name": "Sanjay Mohnani",
            "stars": "5 stars"
        },
        {
            "comment": "No call recording software enable with device so don't buy it its waste of money. I already complain with Motorola care but they didn't take any steps on it. Pathetic service of Motorola care.",
            "date": "07 Sep 2015",
            "name": "Malay Pathak",
            "stars": "1 star"
        },
        {
            "comment": "This phone is user friendly. A lot of apps have helped me with office and personal work in just few minutes!",
            "date": "07 Sep 2015",
            "name": "Rajeshwari",
            "stars": "5 stars"
        },
        {
            "comment": "Purchase a year back....Still in good condition and working fine. This is a rugged phone. Best product I ever brought from flipkart.",
            "date": "07 Sep 2015",
            "name": "Pavan Kumar G",
            "stars": "5 stars"
        },
        {
            "comment": "i m facing problem with battery backup not even 2 hour of back up please don,t order it and the software problem is also present, and the service of this Motorola is very bad. the response of customer care is also very bad.",
            "date": "07 Sep 2015",
            "name": "Dr. Vinodkumar...",
            "stars": "1 star"
        },
        {
            "comment": "Totally recommend it. However hangs after sometime so take a call. I would advise to go for any other product.",
            "date": "06 Sep 2015",
            "name": "Charles David",
            "stars": "5 stars"
        },
        {
            "comment": "A perfect phone with apt configuration on this price. Good product to be gifted. And the delivery time was not too long.",
            "date": "06 Sep 2015",
            "name": "Abhishek",
            "stars": "4 stars"
        },
        {
            "comment": "Its worth every penny i have spent. quality of the material is also good. Pros:- 1. Screen size 2. Speed Cons:- 1. Camera quality",
            "date": "06 Sep 2015",
            "name": "Neil Iyer",
            "stars": "5 stars"
        },
        {
            "comment": "Great deal by flipkart must go for it.supereb!!! Must buy this phone if u have similar budgte as compare to other ,it have all leading point no any back point so guys close your eye and buy it !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "06 Sep 2015",
            "name": "AKHILESH KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "I gifted Moto g2 to my brother. He is very Happy with the product delivered. Initially bad product is delivered to him. But on a high priority Flipkart helped up in replacing the product asap. Great service by flipkart. I have very Happy with the product and service.",
            "date": "06 Sep 2015",
            "name": "Apoorv Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone in may end. Now its display is gone, i got it repaired from moto service centre in pune.after receiving the phone i tried using it. the display is performing on its own giving haphazard commands.avoid this product at all cost.",
            "date": "06 Sep 2015",
            "name": "gaurav shukla",
            "stars": "1 star"
        },
        {
            "comment": "Good mobile , having all the essential features. Till now working well. Design is good. Delivery is fast and good packaging.",
            "date": "06 Sep 2015",
            "name": "Sumi Sanyal",
            "stars": "4 stars"
        },
        {
            "comment": "Nice handset, I would rate it 5 star and using it since 10 months. As of now I did not face any major problem. Sound is good, camera is excellent and screen seems fantastic. What else one could expect in just 13 k.",
            "date": "05 Sep 2015",
            "name": "Amitesh Thakur...",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile is very good and we are happy with this, i m very lucky because of using this mobile, all my friends also using this mobile please use this mobile",
            "date": "05 Sep 2015",
            "name": "JESHWITH KONDRA",
            "stars": "5 stars"
        },
        {
            "comment": "If you want a phone that looks after you and want regular updates from Google. Then this the phone that suits your needs.I bought this phone after a lot of research.",
            "date": "05 Sep 2015",
            "name": "Arkodyuti Bhat...",
            "stars": "5 stars"
        },
        {
            "comment": "Have been using it for 10 months now, Has a big enough screen, decent camera, acceptable touch screen. The software upgrade sometime needs a visit to moto service centre which seem to be understaffed though helpful.They honor the warranty coverage wherever needed. Overall a quality product.",
            "date": "05 Sep 2015",
            "name": "Ashish Sethi",
            "stars": "4 stars"
        },
        {
            "comment": "it gets over heated in a short period of usage.Also the battery backup is not up to the mark as the company entitled.",
            "date": "05 Sep 2015",
            "name": "Shikhar Kaka",
            "stars": "3 stars"
        },
        {
            "comment": "Average performance,Processor little bit slow when you add memory card ,display & camera are good Flipkart service is very good,But courier person response is not good,Flipkart need to check these courier service & improve these services.",
            "date": "04 Sep 2015",
            "name": "B SivaReddy",
            "stars": "3 stars"
        },
        {
            "comment": "I have been using his phone for last 2 months now and have not faced a single problem yet................................................................................................................................................................",
            "date": "04 Sep 2015",
            "name": "M Ahi",
            "stars": "5 stars"
        },
        {
            "comment": "Good Phone overall ....................................................................................................................................................................................................................",
            "date": "04 Sep 2015",
            "name": "Anurag Chauhan",
            "stars": "4 stars"
        },
        {
            "comment": "Good product service..heavy weight....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "04 Sep 2015",
            "name": "Umesh SV",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased this product and received 2 days back. The phone is defective and the display is not working. I had requested for the replacement. but I got the call from the flipkart technical team and i can listen their voice clearly. But they are saying that they cant listen my voice so disconnecting the call and sending a message that they will call tomorrow. it was happening from last 2 days. It looks like they are making a drama and try to forcing me to use a defective product. It is very very bad from Flipkart.",
            "date": "04 Sep 2015",
            "name": "Sandeep Sharma",
            "stars": "1 star"
        },
        {
            "comment": "i m fully satisfied with the product quality. The best part of this phone is its Display which very impressive and sharp.",
            "date": "03 Sep 2015",
            "name": "SIMAB",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Phone.. Worth for price.. No other Company can offer such phn in this price.. Nice Camera and Speed.",
            "date": "03 Sep 2015",
            "name": "Abhimanyu Chopra",
            "stars": "4 stars"
        },
        {
            "comment": "I got this phone for my friend's mom. She wanted a good camera (first and foremost), a good 3G experience, good responsiveness and easy of use (she's not very tech savvy) from the phone. She got all she wanted. She is delighted at the camera. I have a 1st gen Moto G. If I have to take a new phone, I'll go for the 3rd Gen Moto G.",
            "date": "03 Sep 2015",
            "name": "Arunava Chatte...",
            "stars": "5 stars"
        },
        {
            "comment": "hanging hanging... irritated device with heat and poor performance.. completely waste of money battery backup is worse than worst..",
            "date": "03 Sep 2015",
            "name": "Mahesh",
            "stars": "3 stars"
        },
        {
            "comment": "Have you used this product? It's always better to review a product you have personally experienced. Educate your readers Provide a relevant, unbiased overview of the product. Readers are interested in the pros and the cons of the product. Be yourself, be informative Let your personality shine through, but it's equally important to provide facts to back up your opinion. Get your facts right! Nothing is worse than inaccurate information. If you're not really sure, research always helps. Stay concise Be creative but also remember to stay on topic. A catchy title will always get attention! Easy to read, easy on the eyes A quick edit and spell check will work wonders for your credibility. Also, break reviews into small, digestible paragraphs.",
            "date": "03 Sep 2015",
            "name": "Jeevanti bisht",
            "stars": "5 stars"
        },
        {
            "comment": "the product is nice and is very decent look at the back and when we look it from far away the mobile working under perfect condition without any lag that's nice nice product for a nice price tag",
            "date": "03 Sep 2015",
            "name": "ANAND",
            "stars": "5 stars"
        },
        {
            "comment": "very very worst response for courier persons this is my lost purchase of flipkart good bye flipkart very very worst response for courier persons this is my lost purchase of flipkart good bye flipkart very very worst response for courier persons this is my lost purchase of flipkart good bye flipkart",
            "date": "03 Sep 2015",
            "name": "SILAMBARASAN R",
            "stars": "1 star"
        },
        {
            "comment": "I have been using the product since last 6 months its really awesome.Never crashes ,response is fast, camera quality is ok ,signal reception is best. Battery is a slight problem drains out in a day.",
            "date": "03 Sep 2015",
            "name": "Satish Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Great comeback by motorola.. (y)",
            "date": "03 Sep 2015",
            "name": "Sanunath G",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is awesome ... wont multitask when the games are or heavy apps are on... which is still ok due to the limited ram...if ok with the same go for it else you should go for G3 with 2 gb ram...using it for more than 4 months now.",
            "date": "03 Sep 2015",
            "name": "Pravz",
            "stars": "5 stars"
        },
        {
            "comment": "it was very fast delivery in standard delivery and packing quality was good. i got so many product from flipkart, its goods experience every time.",
            "date": "02 Sep 2015",
            "name": "hardik babubhai",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using from past 6 months and it is awesome in performance... Battery support is good. Sound is excellent.you can buy without any doubts in ur head.",
            "date": "02 Sep 2015",
            "name": "Venkat V",
            "stars": "5 stars"
        },
        {
            "comment": "till it was in Kitkat it was working find but as it updated to Lolipop this become headache. Sound prob network issue touch not responding and battery pathetic from starting",
            "date": "02 Sep 2015",
            "name": "Joe Mathew",
            "stars": "1 star"
        },
        {
            "comment": "Very nice choice ....Should try, decent product for affordable price. Good features and camera clarity is awesome.",
            "date": "02 Sep 2015",
            "name": "shar",
            "stars": "4 stars"
        },
        {
            "comment": "Good quality phone and it is easy to use. But battery backup is very less after upgrading to Lollipop version.",
            "date": "02 Sep 2015",
            "name": "Adarsh Amara",
            "stars": "3 stars"
        },
        {
            "comment": "awsomeeeeeeeeeeeeeeee this phone is amazing.motorola has google support and it has brilliant viewing angles it runs with android L.motorola motp g2 is awarded first price for best budget smart phone in 2014 due to its popularity among the people",
            "date": "02 Sep 2015",
            "name": "aekka. abhishek",
            "stars": "5 stars"
        },
        {
            "comment": "My moto g2 is 2 months old and gets over heated whenever I use Youtube and other Internet related applications",
            "date": "02 Sep 2015",
            "name": "Abhinav Venkatesh V",
            "stars": "3 stars"
        },
        {
            "comment": "Moto have made a great revolution in smartphone market with high feature phone in reasonable prices, the same goes to moto G2 its a complete package with great features and the most amazing thing it comes in lollipop 5.1.1 which i guess every1 wants now a day, but i am little disappointed with 2 things one is the ram which shpuld have been increased till 2GB and the other thing is that moto doesn't provide any detachable cable with the charger so to transfer the data from the PC we need to buy another cable. But overall its a great phone to buy in just 10K.",
            "date": "02 Sep 2015",
            "name": "Amitav Talukdar",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this mobile three months back when the cost was 13000 which doesn't meet my expectations performance wise. Sometimes it will hangup for 2 to 3 minutes. One thing which like most is camera with awesome clarity. Speakers sound is very nice. Frequently facing signal problems. Overall it is okay with present cost.",
            "date": "02 Sep 2015",
            "name": "Dinakar",
            "stars": "3 stars"
        },
        {
            "comment": "cost: value for money quality: has many features, you will be exhausted about. Though hangs few times, not sure due to virus or over all processor & memory short comings Delivery: good",
            "date": "01 Sep 2015",
            "name": "Biswadip Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile doesnt work properly, extremely slow and doesnt worth buying. Except google's name it doesn't have anything to its credit",
            "date": "01 Sep 2015",
            "name": "ankit",
            "stars": "1 star"
        },
        {
            "comment": "This is worst/hopeless mobile model, hang everyday, battery drains within six-eight hours, contact list disappears every alternate day, sync won't work, only one store at city like Pune to support customer...................still you wanna buy? Rank ...........-5",
            "date": "01 Sep 2015",
            "name": "Prafulla V. Tayde",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone since last four months. I haven't encountered any problem yet. Body : Very nice & smooth Matte finishing, loved it... Software : Android 5.0 Lolly with very decent look, Like....it. Motorola Controls and apps : Very nice and assuaged. Very Nice device control by motorola mobility.... totally worth it Also camera and other hardware features are working very nice at their best...Hats Off motorola... The only problem I am facing is the insufficient battery back up...2070 mAh.. Must have had 3070 mAh at least at these so many features.... Rest, Beyond Approbation!!",
            "date": "01 Sep 2015",
            "name": "Rohit Raibagkar",
            "stars": "4 stars"
        },
        {
            "comment": "Just before 3 months i bought it and nw it sucks... !! it works very slowly nowadays.... just for opening whatsapp it takes a lot of time even when i use it daily... and for multitasking it will take minutes ....",
            "date": "01 Sep 2015",
            "name": "Vaibhav Jaiswal",
            "stars": "2 stars"
        },
        {
            "comment": "i ordered this phone n received a stolen handset! all this because of your carelessness. your courier partner is cheating on you and on customers also. i had to suffer a police case. he delivered me a stolen handset and your site hadn't informed me about any returns. no spport from your site. very disappointed. would never recommend any one to use flipkart. also your delivery date is not upto mark, it delayed my order for 5 days from date of expected delivery. very disappointed! huh!",
            "date": "31 Aug 2015",
            "name": "Diwansh Nagori",
            "stars": "1 star"
        },
        {
            "comment": "Absolute useless phone, there are many other good options available in the same range. I've been using it for past 12 days, requires to be charged at least twice a day, very slow charging, no back up. Other features are good but what would one do with a phone without a proper battery backup.",
            "date": "31 Aug 2015",
            "name": "ramesh kumar",
            "stars": "1 star"
        },
        {
            "comment": "Google has done justice to its project. Only issue encountered is after apps update, phone its hanged.",
            "date": "31 Aug 2015",
            "name": "Sarath",
            "stars": "4 stars"
        },
        {
            "comment": "Each and every specs are pro of Moto G2. The only issue faced is battery problem. Sometimes battery will discharge faster while using internet. Sometimes battery will drain quickly when it reaches 15% Except this problem every other features like camera, processor, display, touch all are Awesome. :-)",
            "date": "31 Aug 2015",
            "name": "BalaKumar Vijayar...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone it will never have any issue like Moto G-1st Gen but I was wrong and paying for my mistakes .I have been using this Moto G since last 4-5 months and for following issues I called customer care several times in vain. Then I escalated to Motorola India GM via Twitter , unexpectedly nobody cares. 1) Gyroscope not working properly to support VR ( Cardboard ) – Even tested on Moto G 3rd Gen , so don’t prefer that as well. 2) You will never get updates for Android ( still on 5.0.1 ) not even 5.1 3) I’m not enthusiast of games , but RAM performance is poor even in Moto G -3rd Gen 4) Customer care disconnects call in between discussion to sort out the problem 5) Customer care waiting time at least 5 min. Motorola doesn't deserve rating 1 however there is no any other option for below rating.",
            "date": "31 Aug 2015",
            "name": "manish pandey",
            "stars": "1 star"
        },
        {
            "comment": "This phone has problem with bettery. sometime it is overheated.Third class phone.I waste my money.Phone has heating issue. plus application hangs sometimes.not a good looking in design and camera quality is also not good as it should be.Dont buy it.I hate Motorola company. I will nerver buy phone of this company in future.",
            "date": "31 Aug 2015",
            "name": "Bhavesh Prajapati",
            "stars": "1 star"
        },
        {
            "comment": "i am facing lots of problems.. not working wifi sometime not working flash charging backup problem when i disable the wifi automatic wifi enable problam",
            "date": "30 Aug 2015",
            "name": "Ravi Reddi",
            "stars": "2 stars"
        },
        {
            "comment": "This is the worst phone i have ever come across in my life... using it is a nightmare.. the battery drains so quickly.. this shitty phones hangs like anything every time.. bought it for 13 grands and within 2 weeks it came down to 10 grands. it heats up real bad as it will melt in your pocket. i will never recommend this phone to anyone. BAD BAD BAD DEAL !!!!",
            "date": "30 Aug 2015",
            "name": "Aviral Jain",
            "stars": "1 star"
        },
        {
            "comment": "It's been around a month and a half since I purchased this phone,and here is my read on it: 1. The front and rear camera's are really good. 2. Battery is decent,although it drains faster when data is on,compared to WiFi. 3. Just to put it through the grinder,I installed a ton of applications in the starting and used them all at once, and the background apps did NOT serve to be a problem. 4. Charging time is a little on the higher side. Overall, I'd give this an 8/10.",
            "date": "30 Aug 2015",
            "name": "Afnaan Khan",
            "stars": "5 stars"
        },
        {
            "comment": "Earphone jack has issue. you will have to adjust your earphone to connect once phone goes older. I have seen same problem to othere Moto G sets.",
            "date": "30 Aug 2015",
            "name": "Abhishek Kanth",
            "stars": "3 stars"
        },
        {
            "comment": "Very weak battery, the phone performance is acceptable and good enough for a day to day use, I use exclusively for movies and call, I'm a ardent twitter fan.",
            "date": "30 Aug 2015",
            "name": "Bujji Baabu",
            "stars": "3 stars"
        },
        {
            "comment": "do not buy this phone, when i got my phone it has a blue spot then after 5 days i replaced my phone and got a new moto g2 the after few days again it has yellow line in middle of screen. guys do not buy this its phone there are more & good features phone at this price range.",
            "date": "30 Aug 2015",
            "name": "Shubham Yadav",
            "stars": "1 star"
        },
        {
            "comment": "value for the money, 2 gb ram good user interference nice camera stock android feeling expandable memory up to 32gb",
            "date": "30 Aug 2015",
            "name": "praveen totada",
            "stars": "5 stars"
        },
        {
            "comment": "I have brought this phone 4 months back ...it is very good at performance and design but only thing was heating problem..",
            "date": "29 Aug 2015",
            "name": "Spk",
            "stars": "3 stars"
        },
        {
            "comment": "this is the worst mobile that i ever use. except camera nothing is there in this phone. this ph is not having gorilla display it is completely waste one. when it fell down with out a second your glass will break even for small distance also. over heating is there even for less usage also. dont but moto mobiles.",
            "date": "29 Aug 2015",
            "name": "dont buy",
            "stars": "1 star"
        },
        {
            "comment": "3 points only for flipkart Service, Zero point for Moto G, High SAR value, gets heated, very poor battery, Stupidity to buy the set",
            "date": "29 Aug 2015",
            "name": "Rohit Arora",
            "stars": "3 stars"
        },
        {
            "comment": "This is the best phone with lowest price. I have installed many applications with out using memory card because its internal memory is 16GB and we can use 12GB for storage and application. And the camera clarity is very good where as video clarity is Awsm.",
            "date": "29 Aug 2015",
            "name": "Indrajeet Singh",
            "stars": "4 stars"
        },
        {
            "comment": "One of the coolest device at this price range. you may get products of higher configurations than Moto G2 but finally the build quality and butter smooth performance matters for the users. i rate 5/5 for its Build quality and Overall Performance.. Thanks Flipkart for Delivering before 48hr, though i opted for an normal delivery..",
            "date": "29 Aug 2015",
            "name": "Rajesh",
            "stars": "5 stars"
        },
        {
            "comment": "I have used it. It is nice. A good product value for money. I have been searching for a good product for a long time and ended up with MOTOG... I am happy.",
            "date": "28 Aug 2015",
            "name": "Karthik",
            "stars": "5 stars"
        },
        {
            "comment": "Hi frnds, flip-kart is fast delivery for high cost products. I Bought moto g2 from flipkart, first three months working well , but after that am getting some issues with phone.like while picking a cal it will struck some time and voice will be not able to here. its taking too much time to take full charging . cost wise little bit high. lot of mobiles is available for same cost.",
            "date": "28 Aug 2015",
            "name": "M Rammohan Reddy",
            "stars": "2 stars"
        },
        {
            "comment": "Great fone, does its job well, however had moto given a better battery, this would have been brand killer fone. My wife uses this fone and she is happy with performance given the money that has been paid, but charging .... charging....charging.... and charging...",
            "date": "28 Aug 2015",
            "name": "Piyush A",
            "stars": "4 stars"
        },
        {
            "comment": "Since last 5 months I am using it without any problem. Built quality is good. Love this phone in its price range.",
            "date": "28 Aug 2015",
            "name": "Abhijit Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "* Super cool and sleek design. [gave a wow feeling when i opened the box.................... * Crisp 5' HD display(720p).................... * Camera - 8MP takes pics with good clarity; 2MP - great selfie....................... * Speakers - Simply superb - L… (Expand)......................",
            "date": "28 Aug 2015",
            "name": "rakesh kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Hi I think my review on this product does not matters a lot now as 3rd generation is for sale. But still for those who still want to invest in 2nd generation awesome product specially in current rate. it hangs some times now after 6 or 7 months usage of my phone. because i use it very hard and hard. my other Friends who are using same phone they are saying their phone is working well. about warranty status. they takes time but still they do the work well. but for sure i want to let you know mic and speakers are attached with motherboard for those who are not good for technical knowledge once your warranty is over you have to change the board inside the phone even if your mic stops working or your speaker stops working.",
            "date": "28 Aug 2015",
            "name": "Kushal Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is good, but the Batter is too bad... If you use mobile data the max battery will stand for is 12-14 hrs.. You should always carry a power bank with you ..",
            "date": "28 Aug 2015",
            "name": "Ashok DuraiRajan",
            "stars": "3 stars"
        },
        {
            "comment": "Am facing issue with call option.Sometimes when i try to call, the call button doesn't work. Mobile is also getting hanged frequently.Battery backup is also poor .Except these problems everything else is fine.",
            "date": "28 Aug 2015",
            "name": "navya mantripr...",
            "stars": "2 stars"
        },
        {
            "comment": "i buy this mobile ..and also use...touch problem ,hung..automatic off some time.....mere pura paisa pani me gaya...fist time problem huya to ..flipkat change kardia ..uske fir se problem huya ...",
            "date": "28 Aug 2015",
            "name": "Habiba khatun",
            "stars": "1 star"
        },
        {
            "comment": "Moto G is quit a good product but still it lacks many times and many times it hangs. Performance is fulfill as mentioned. Camera is good. Battery Backup problem while suffering Internet. I would suggest Dont Buy this",
            "date": "27 Aug 2015",
            "name": "Narendra Dhaker",
            "stars": "2 stars"
        },
        {
            "comment": "The moto g2 was really awesome and i had no issues....and got the parcel a little late..bt the phones experience was awesome",
            "date": "27 Aug 2015",
            "name": "Unnati Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "This is a good budget phone, will recommend this to all. Nice performance and battery backup. Very user friendly easy GUI features. It has has good camera and the touch response is very good.",
            "date": "27 Aug 2015",
            "name": "Shodhan Pujari",
            "stars": "5 stars"
        },
        {
            "comment": "been using this phone from 6 months and no problems seen so far. recommend for others than samsung which hangs.",
            "date": "27 Aug 2015",
            "name": "Narayan",
            "stars": "4 stars"
        },
        {
            "comment": "Battery is an issue here!! Otherwise is a worth to go for. value for money.. camera is solid and never hangs much for a decent use.",
            "date": "27 Aug 2015",
            "name": "GAURAV SHARMA",
            "stars": "4 stars"
        },
        {
            "comment": "request you to please send OTA updates for this Moto G2, as the existing 5.0 is extreme slow and making this powerfull phone into useless device.",
            "date": "27 Aug 2015",
            "name": "Hemraj Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile will be hanging for every 2 to 3 days, battery back is worst, please don't purchase. it is waste of money and time browsing for this Moto G2 and service provided by flipkart is worse than nothing.",
            "date": "27 Aug 2015",
            "name": "Rakesh",
            "stars": "2 stars"
        },
        {
            "comment": "Worst battery back up, Worst experiences with android 5.0 Heating problem Poor quality accessories(both charger and earphone)- slow performance when charger plugged in BELIEVE ME YOU WILL HATE ANY MOTOROLA PRODUCTS AFTER 3-4 MONTHS OF USAGE",
            "date": "26 Aug 2015",
            "name": "mukesh gupta",
            "stars": "1 star"
        },
        {
            "comment": "This phone is class in this range. There is slight heating problem. The battery lasts long even with exhaustive use.",
            "date": "26 Aug 2015",
            "name": "Gautam",
            "stars": "5 stars"
        },
        {
            "comment": "very poor product... not satisfy., sound speaker problem in calling. this is my 2th moto g2 phone after replacement first one. Wastage of money",
            "date": "26 Aug 2015",
            "name": "Ravi Kumar",
            "stars": "1 star"
        },
        {
            "comment": "I am really not with Moto G 2 with in 3 months i got problem many times. When i getting call i am unable to see which person is calling.",
            "date": "26 Aug 2015",
            "name": "Mallesh",
            "stars": "1 star"
        },
        {
            "comment": "According to my choice and review this stuff so called Moto G 2nd Gen is not that bad for the people those who want a smart phone in low price this is the best option to go for it. Otherwise those who can effort other good smart phones they can ope for it because they are other huge varieties of excellent smartphones in the market.",
            "date": "26 Aug 2015",
            "name": "KJ Alex",
            "stars": "4 stars"
        },
        {
            "comment": "Bad services by flipkart but nice phone. Phone is good. It was pain purchasing anything on flipkart and they just cancel the request because there seller had done something or there fault.",
            "date": "26 Aug 2015",
            "name": "Anand Ravi",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased the phone after i saw the model taken by my friend. This model has both the things - Hardware & software. Phone finish , clarity , camera , user interface is totally in a finished format.. And the most important - only android software , Just use it .. You will never regret this purchase for sure. Price is utmost comfortable with phone features...",
            "date": "26 Aug 2015",
            "name": "Amod , Pune",
            "stars": "5 stars"
        },
        {
            "comment": "I found this phone at very good discount and excellent condition. very happy with the services of the product. found some problem and immediately Flipakrt people supported nicely. thank you flipakrt for providing excellent product with great discount.",
            "date": "26 Aug 2015",
            "name": "Priyanka Jadon",
            "stars": "5 stars"
        },
        {
            "comment": "bought it for my uncle and have been working like charm. product is for those people who use phone for normal things.",
            "date": "26 Aug 2015",
            "name": "Tashi Tsering",
            "stars": "4 stars"
        },
        {
            "comment": "Pros 1) Good camera Quality 2) Hardly any Lag 3) Value for price 4) Expandable memory Cons 1) Biggest problem is Battery Issue since it is draining in 5-6 Hours if we are using 3G continuously. They could have increase the battery Mah.",
            "date": "26 Aug 2015",
            "name": "Anjan Miglani",
            "stars": "3 stars"
        },
        {
            "comment": "More than just value for money phone. Too good camera. Too good OS & hardware performance. However, displays slight lag with high-end games, but that is acceptable with 1 GB RAM.",
            "date": "26 Aug 2015",
            "name": "omkar dhulap",
            "stars": "4 stars"
        },
        {
            "comment": "thanks for the flipkart team for the superfast delivery this phone has no lags or stucks. sound quality isexcellent due to the front spekers . both cameras are good",
            "date": "26 Aug 2015",
            "name": "Georgy Paul",
            "stars": "4 stars"
        },
        {
            "comment": "worth purchasing this mobile...best thing is touch screen experience.....and camera and ROM having 16 GB however Asus phone also good in this budjet... both MOTOROLA ..and ASUS..are good",
            "date": "26 Aug 2015",
            "name": "Deep",
            "stars": "5 stars"
        },
        {
            "comment": "Everything seems to be best for the money you paid, but touch screen has some issue and I have given for repair after four months of purchase ... You will find many reference for touch issue if you search in google.... Moto should look in to this in next release... 1. battery should have been bit higher capacity or efficient battery saver would have been enhanced this phone further...",
            "date": "26 Aug 2015",
            "name": "Sudhakar R",
            "stars": "3 stars"
        },
        {
            "comment": "it s an waste model very worst and dead slow its working never buy these type of mobiles actually i bought morethan 3 mobiles its working dead slow and waste mobile it not working faster and some time hangout the mobile all the apps not working sometimes its waste dont buy these models of moto versions",
            "date": "25 Aug 2015",
            "name": "saravana Gurun...",
            "stars": "1 star"
        },
        {
            "comment": "After using Moto G (2nd Gen) I would like to review my rating . It should be 4.5 instead of my previous rating of 3.",
            "date": "25 Aug 2015",
            "name": "Jayanta Biswas",
            "stars": "3 stars"
        },
        {
            "comment": "I have been using this phone for over 9 months now and havent had a single issue till now. Absolute beast.",
            "date": "25 Aug 2015",
            "name": "Pushkar Adhikari",
            "stars": "5 stars"
        },
        {
            "comment": "I am facing below issues with Moto G2. I am writing this review after using one and half month • 2nd SIM slot not working • Heating • Mobile hang every time Please do not buy this phone",
            "date": "25 Aug 2015",
            "name": "Anil",
            "stars": "1 star"
        },
        {
            "comment": "Its simply awesome.All features are good and no lag.Sound quality is so good.Best phone under 13 k.Totally Worth of money.",
            "date": "25 Aug 2015",
            "name": "asutosh Behera",
            "stars": "5 stars"
        },
        {
            "comment": "Needless to say it is a good phone. But the camera quality is not good having an 8 MP camera the pics you take are full of noise, no details & apps take a hell lot of RAM space. Major drawback (at least for me) is it doesn't support SIM contacts you have to import them in phone (as like in iphone & windows) I guess it is because of Android 5.0 update. Motorola should provide Android 5.1 update to it.",
            "date": "25 Aug 2015",
            "name": "hemant kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Incredible phone & nice service by Flipkart now just one line, close your eyes & buy Moto G3 without second thought.",
            "date": "24 Aug 2015",
            "name": "Vishal Jha",
            "stars": "5 stars"
        },
        {
            "comment": "I am disappointed with this phone. I have been using moto g since its first gen release date, and was happy with the performance of the first gen. But when I moved to the 2nd gen by exchange offer, I felt cheated. I have ordered a total of 5 moto g for my family and friends from my account within last 2 months, and all of them are unhappy with the performance. Desperately waiting for an Android Lollipop 5.1 update, with a hope that the issued would be solved. Dont take a risk to order this phone.",
            "date": "24 Aug 2015",
            "name": "siddharth sahani",
            "stars": "1 star"
        },
        {
            "comment": "Hello All, This is a pathetic product from motorola, it is very slow in response and has very poor battery back up. I got the product delivered on 27th may 2015 and today i.e 24/08/2015 i.e within 3 month i am facing battery issue. The battery hardly lasts for 4-5 hours even if you are not using it and your wifi etc are off. extremely disappointed. Was using micromax before. i feel micromax has done a better job in providing stable phones.",
            "date": "24 Aug 2015",
            "name": "Rohan Sourav S...",
            "stars": "1 star"
        },
        {
            "comment": "Great phone in this price range category ....actually I hav e used iPhone 4,4s, 5 but for this little price it's great enough .......",
            "date": "24 Aug 2015",
            "name": "Great phone I...",
            "stars": "5 stars"
        },
        {
            "comment": "Value for money...............................................................................................................................................",
            "date": "24 Aug 2015",
            "name": "Vel",
            "stars": "5 stars"
        },
        {
            "comment": "nobody responding in service center they take 45days to respond . and mobile is working is very slow automatically battery going to 0%",
            "date": "24 Aug 2015",
            "name": "satya",
            "stars": "1 star"
        },
        {
            "comment": "Within 4 months, my MotoG display is not working properly.though it is in warranty and never damaged piece, the Service center has denied to repair the phone telling they are closing the service center in Vadodara, Gujarat. so now there is no service center in 100km range. then, i visited ahmedabad service center on last saturday, which was also closed. seems Motorola is closing service centers.",
            "date": "24 Aug 2015",
            "name": "PRS",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this for my wife and liked the product. build quality is decent with nice camera at front and back price could have been bit lower comparing to other models available in market with higher specifications",
            "date": "24 Aug 2015",
            "name": "Manpreet Singh",
            "stars": "4 stars"
        },
        {
            "comment": "ye jo mobile he vo 2 months ke baad iske issue create hote hai flipcart ko call kiya to vo log apne hath upar uthate hai to aone ko hi service center ke chakkar katne padte hai mere sath aise hua hai",
            "date": "24 Aug 2015",
            "name": "Satish Karbate",
            "stars": "1 star"
        },
        {
            "comment": "i using this phone more than 3 months worst battery life ..i hate this phone due to discharge of battery too fast..i bought this due to performance and also for battery life..im going to moto care due to worst battery life..they must take a action for this performance another any of them tell wht can i do??? for increase the battery life :-(",
            "date": "24 Aug 2015",
            "name": "vinoth kumar",
            "stars": "1 star"
        },
        {
            "comment": "moto G has many features compared to other phones but the problem is heating when video or audio is played for 10 mins phone becomes heat.that is major problem..",
            "date": "24 Aug 2015",
            "name": "muneendra babu",
            "stars": "3 stars"
        },
        {
            "comment": "all the moto phones available on offer seems to be defective. There speakers have problem, the touch doesn't work properly, battery gets discharged quickly. Plz stay away from these ones.",
            "date": "24 Aug 2015",
            "name": "AK",
            "stars": "2 stars"
        },
        {
            "comment": "Actually this product deserve 5 star but i have 4 for this, and because i brought this for 11k and about a week later they were selling this for 10k. Otherwise product is excellent, no complaints at all.",
            "date": "24 Aug 2015",
            "name": "PIYUSH TIWARI",
            "stars": "4 stars"
        },
        {
            "comment": "cons: lagging problem .full charging time : 5 hours poor battery backup. pros: good camera .........................................................................................................................................................................................................................",
            "date": "23 Aug 2015",
            "name": "aniket",
            "stars": "1 star"
        },
        {
            "comment": "Being 1GB RAM, it doesn't feels like one. Camera is REAL 8MP and awesome clarity(use Google Camera). Handles Injustice, Asphalt8, WWE Immortals like butter. Its the best phone to buy!!!",
            "date": "23 Aug 2015",
            "name": "vipintejwani",
            "stars": "5 stars"
        },
        {
            "comment": "Battery quality too poor dischaging very fast and also it takes 4 hrs to charge with the motorolla charger Same ringtone for both the sim in a dual sim cell unbelievable other functions are also too complicated File manager, voice recorder not preinstalled Camera quality is very good overall an average mobile phone not up to the expectations from a comoany like Motorolls",
            "date": "23 Aug 2015",
            "name": "Khalid Birajdar",
            "stars": "3 stars"
        },
        {
            "comment": "Dont buy from flipkart.return policy not applicable.hanging problem.poor performance and response,i am irritated with this.plz dont buy..",
            "date": "23 Aug 2015",
            "name": "Phaneendra kumar",
            "stars": "5 stars"
        },
        {
            "comment": "when i asked for the defected product return. c.care persons asked me ,have you done the software update?i told no. immediately, she rejected my return request, and told me to update software........ very bad service from c.care. with out hearing the problem of the buyer with the product. shame one you!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "23 Aug 2015",
            "name": "midhun george",
            "stars": "1 star"
        },
        {
            "comment": "Guys in am using moto g2 and its a excellent phone and user friendly. Most important feature of phone is it dose not get hanged list other company mobiles.",
            "date": "23 Aug 2015",
            "name": "Mahaveer Jain",
            "stars": "5 stars"
        },
        {
            "comment": "every thing is fine but processor is a bit low,also little heatup on charging when net is on and all ther feature is awesome.",
            "date": "23 Aug 2015",
            "name": "Swyam Singh",
            "stars": "4 stars"
        },
        {
            "comment": "very poor service ......................................................................................................................................................",
            "date": "23 Aug 2015",
            "name": "k sp",
            "stars": "1 star"
        },
        {
            "comment": "I had ordered Moto G2 on 24th June 2015 by exchanging Moto G1. Problem started from 2nd week onwards (extreme heating and restarting). I had requested Flipkart for a replacement and they have called back to perform remote diagnostic tests and concluded saying the mobile is proper and they canceled my replacement request. The heating problem started and again requested and they rejected by saying lame things. Third time also same thing happened and I stopped calling Flipkart people because I got pissed off. I said to Flipkart customer care every time, please replace this mobile within one month as per the replacement policy otherwise if I call 2nd month you will say replacement policy is period has crossed. Same thing happened now, today my mobile got heated up and all the data is lost. I called Flipkart and said the same thing, and as anticipated they replied what I had expected. They said, as per flipkart replacement policy we can’t give you any replacement or refund because this is 2nd month. After this, I have called Motorola customer care explained the problem, they told that I can get refund because I have raised complaint within one month as per Flipkart replacement policy. This Flipkart people are not accepting my request which is unethical by giving faulty mobile to me and gaming me until the first month is over and now denying replacing the phone because it is the second month. Any way I will not keep quite till they will refund money or replace my fault Moto 2nd G mobile. I am registering complaint in consumer court. I will flood this cheating news all over the Internet so that other consumers are aware of this tactic when they get a faulty product.",
            "date": "22 Aug 2015",
            "name": "vikram raju re...",
            "stars": "1 star"
        },
        {
            "comment": "The battery provided with the phone is not working properly and requires charging within usage of some minutes",
            "date": "22 Aug 2015",
            "name": "Ruchira",
            "stars": "1 star"
        },
        {
            "comment": "The service centre of moto is full of idiots. They work on one problem and they generate another one. No accountability is taken from Motorola as well . Every time I tried to complain they say please approach to the service centre. I will not recommend it to any one. phone is initially gud but once you have a need to repair it you are done.",
            "date": "22 Aug 2015",
            "name": "Abhishek Chatu...",
            "stars": "1 star"
        },
        {
            "comment": "PHONE IS FREQUENTLY GETS HANGED. SOMETIMES SOME APPLICATIONS ARE NOT WORKING. VERY IRRITATED. NEED TO CHECK WITH SERVICE CENTER SOON,",
            "date": "22 Aug 2015",
            "name": "Raja Sekar M",
            "stars": "2 stars"
        },
        {
            "comment": "I have received the product last month along with Moto E 2nd Generation. While the Moto E started to give trouble right from the beginning, the problem with Moto G started recently. Screen blackout was happening every now and then and I had to get it rectified. So new buyers please be very careful when you buy mobile from Flpkart and the seller WS Retail.",
            "date": "22 Aug 2015",
            "name": "Soumya Sarkar",
            "stars": "1 star"
        },
        {
            "comment": "the speakers are very bad n echoes whenever you increase the volume while on call. dont expect to listen anything clearly if u happen to turn on the loudspeaker",
            "date": "22 Aug 2015",
            "name": "Trina",
            "stars": "1 star"
        },
        {
            "comment": "Never expected this from Motorola. The device is not able to handle basic operations properly, some of the bugs are: 1. Contact list gets deleted(when contacted with Motorola Customer Care - they said it is not repairable, format your device and take backup. Even after formatting the problem still persists. On pressing the issue Flipkart replaced the device, but the problem is still there in the second device. 2. Many a times while receiving an incoming call, neither the screen-light turns on nor the screen-lock gets unlocked, one can only hear the ringtone. 3. Even when you delete an event in the calender, it appears until on restarts the device.",
            "date": "22 Aug 2015",
            "name": "Kunal Arora",
            "stars": "1 star"
        },
        {
            "comment": "Never expected this from Motorola. The device is not able to handle basic operations properly, some of the bugs are: 1. Contact list gets deleted (when contact with Motorola customer care - they said it is un-repairable, format your phone and take backup. Even after formatting,the problem still persists. On pressing the issue Flipkart replaced the device, but the problem is still there in the second device. 2. Many a times while receiving an incoming call, neither the screen-light turns on nor the screen-lock gets unlocked, one can only hear the ringtone. 3. Even when you delete an event in the calender, it appears until you restart the device",
            "date": "22 Aug 2015",
            "name": "Kunal Arora",
            "stars": "1 star"
        },
        {
            "comment": "its a fantastic phone .. it never hangs ....nd camera and sound is just stupendous .. a must take at 13k .... nd intorduction of usb wire charger is really cool with two phone chrging simutaneously ... happy to buy it",
            "date": "22 Aug 2015",
            "name": "PRASHANT SHUKLA",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 is very bad conditions . networking problems, sound problems my advice is not purchase this mobile set.",
            "date": "22 Aug 2015",
            "name": "aman singh",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the phone on 12-Aug-2015 and it was delivered on 18-Aug-2015. The phone display has some problem, the brightness level is much below the standards of regular MotoG2 handset. Also there is yellow tint in the display. I requested for a replacement, Flipkart technician called me and asked to install a SmartCheck application. With this application they did few display tests and did not find a problem. How can someone test the phone display remotely and conclude there are no problems. The display brightness is extremely low, at minimum level it is almost invisible. Extremely Disappointed with Flipkart return policy, will think twice before I use next Flipkart service. If you are one among those who get a defective item through Flipkart you are unlucky, strictly avoid electronic items thorough Flipkart.",
            "date": "22 Aug 2015",
            "name": "Shaz Ahamed",
            "stars": "1 star"
        },
        {
            "comment": "battery withstand only for 3 hrs dont buy it plsss''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''",
            "date": "22 Aug 2015",
            "name": "SURYA PRAKASH.S",
            "stars": "1 star"
        },
        {
            "comment": "the best one i got for 10 k. this phone worked well for me i usually play games ,so this phone supported all games without any issues especially mortal kombat X . pros 1.nice body design for rough and tough use. 2.good camera front and back 3.smooth touch 4.can perform high end gamings without any issues or lag . 5.can play full hd videos without errors cons 1.charger colour is white 2.ear phones must be improved a lot (i bought a new skull candy ) as they cause lot of pain after using for long time",
            "date": "21 Aug 2015",
            "name": "HARSHA",
            "stars": "5 stars"
        },
        {
            "comment": "Almost just two months after purchasing this phone, I could not hear or make a call as no sound was there. I need to use the earphones to hear or make a call.",
            "date": "21 Aug 2015",
            "name": "Nilesh",
            "stars": "1 star"
        },
        {
            "comment": "accessory of mobile is to be available at My location.because i m unable to order screen guard and flip cover. Due to delivery vendor nonavailability",
            "date": "21 Aug 2015",
            "name": "Nandkishor Dhakad",
            "stars": "5 stars"
        },
        {
            "comment": "amazing phone. camera superb no hanging handy phone sound quality is best battery backup is not better but it good",
            "date": "21 Aug 2015",
            "name": "Nishant Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "1.Battery backup is very less. 2.can do video call for 30minutes not hanging even with multiple applications",
            "date": "21 Aug 2015",
            "name": "justin Jacob",
            "stars": "3 stars"
        },
        {
            "comment": "One of the best android phones with all the features and power that you need at a great price. Works smoothly.",
            "date": "21 Aug 2015",
            "name": "Rahul Dole",
            "stars": "5 stars"
        },
        {
            "comment": "Stylish and handy... Worth every penny.... Very good touch pad.... camera also works good... One looking for a good phone withing 10K should definitely consider this model.",
            "date": "21 Aug 2015",
            "name": "Sandeep Jaiswal",
            "stars": "5 stars"
        },
        {
            "comment": "Although the phone is good but performance is average only. The RAM is eaten up by most of the google services running in background. But the phone is decent for its price range.",
            "date": "21 Aug 2015",
            "name": "Gautam",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product in reduced and affordable price. Camera pic and video quality is very very good. Battery backup is also good. Handy and the product look is good.",
            "date": "21 Aug 2015",
            "name": "Jugal Sonar",
            "stars": "5 stars"
        },
        {
            "comment": "gud one..............cool camera.........white colour mob is classy too.........but after 4 months its getting hang",
            "date": "21 Aug 2015",
            "name": "kanchi",
            "stars": "4 stars"
        },
        {
            "comment": "over all cell is good and have a cool look but the thing is on the day I received this the price is cut down by 2000/- if you are cutting down the price you should intimate buyers...not satisfied with this",
            "date": "21 Aug 2015",
            "name": "Neeraj",
            "stars": "4 stars"
        },
        {
            "comment": "Cons 1. Call quality is poor. 2. Speed is also not good. I runs like a phone of 512 mb RAM. Pros 1. Battery is awesome. 2. Screen quality is outstanding. 3. Touch response is very good. 4. Colour reproduction is the best part of it. 5. Moto software are good. 6. Build Quality is Super Class. Design and look are best in class. Should not be priced above 9000 INR.",
            "date": "21 Aug 2015",
            "name": "Pawan Kumar Rai",
            "stars": "4 stars"
        },
        {
            "comment": "Good product in reduced and affordable price. Camera pic and video quality is too good. Battery backup is decent. Handy and the product look is good.",
            "date": "21 Aug 2015",
            "name": "Reddy Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "this is good but it is getting heat. the voice app which will receive your voice to pick up the call is not working",
            "date": "21 Aug 2015",
            "name": "Akshay Pradhan",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone with good features. The only problem I feel is with battery but that has been overcome in the next model (Moto G3). Apart from it no problem with the phone.",
            "date": "21 Aug 2015",
            "name": "Gaurav Gangani",
            "stars": "5 stars"
        },
        {
            "comment": "Gifted one to my mother last year and she really likes it and enjoys using it. I personally have used it, for its cost its a great buy.",
            "date": "21 Aug 2015",
            "name": "Sambit Tripathy",
            "stars": "5 stars"
        },
        {
            "comment": "I want to upgrade my Moto g2 with Moto g3,please help me out, i'm not getting any option. i called several times to Flipkart Representative but they are unable to help me out.",
            "date": "21 Aug 2015",
            "name": "Abhishek",
            "stars": "1 star"
        },
        {
            "comment": "Firstly the phone is very excellent, the graphics done extremely well in high graphics and high end game without lag which I've played and battery backup was excellent thanks to snapdragon's optimised processor. Flipkart delivery was done instantly. I've ordered on Wednesday and received the same day. Excellent flipkart do well!!!!",
            "date": "21 Aug 2015",
            "name": "S.Balaji",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart finally did not deliver this product. They have literally cheated in processing this order. I have ordered this product when I had three offers for which I got the phone for an unbelivable price of Rs.7000/-. But they have cancelled this order without any intimation. This was a big disappointment....................",
            "date": "20 Aug 2015",
            "name": "Madhu Alampalli",
            "stars": "1 star"
        },
        {
            "comment": "Battery problem and Hangs alot. I suggest do not buy this product from flipkart. They are supplying poor quality. I asked for replacement but flipkart rejected my request.",
            "date": "20 Aug 2015",
            "name": "Bharat Shara",
            "stars": "1 star"
        },
        {
            "comment": "I bought motoG 2nd generation in the month of June. Phone having problem with battery. charging Time is 6 hrs & exhaustion time is also less. So please check this feature before buying it. Camera is OK.",
            "date": "20 Aug 2015",
            "name": "RS CHANDRA",
            "stars": "2 stars"
        },
        {
            "comment": "Well.. I bought this phone in Oct-14...close to one year...this phone has shown all its dark colours..... hangs on and off.....needs battery charge 3 times a day.....do not run properly if a movie is stored...gets switched off...whenever it feels like....the speed of the phone has reduced approx 90%........... Very poor phone....not recommended... Hey flipkart...keep a negative rating as well.......",
            "date": "20 Aug 2015",
            "name": "Shruti Saksena",
            "stars": "1 star"
        },
        {
            "comment": "Within two months this is the second issue I came across with the device ...not expected this kind of quality from moto.",
            "date": "20 Aug 2015",
            "name": "Ravindra",
            "stars": "3 stars"
        },
        {
            "comment": "In my past 5 months of experience with Moto G 2, i was satisfied with the performance of the mobile and its processing spead. But one thing that was not fine in my last 5 months of usuage was the battery. From the very first day it takes nearly 3 to 4hrs to get fully charged. It was very bad when compared to other mobiles of this range because other mobiles getting fully changed by 1hr or within 2hrs. But i am worried that i got some defective pice since other Moto G 2nd generation users dont face this issue while changing the mobile. Also the battery was draining fastly when we play online games (ratio was like if you play 10 mins in online then 10 to 15 % charge will be lost). But if you not using internet the battery serves nicely for 2 days. But when using net and that too online games its draining very much faster.",
            "date": "20 Aug 2015",
            "name": "Dhinagar K D",
            "stars": "3 stars"
        },
        {
            "comment": "Superb phone I always like to have it. Awesome clarity of camera. Display is good. smooth and fast performance as well battery back is also good.",
            "date": "20 Aug 2015",
            "name": "Divyesh Makwana",
            "stars": "5 stars"
        },
        {
            "comment": "good performance thank u flip kart & Motorola i am fully satisfied with my new gadget i prefer this gadget for my friends also",
            "date": "20 Aug 2015",
            "name": "Dinesh M",
            "stars": "5 stars"
        },
        {
            "comment": "hi, I ordered this phone and its not bad, the display could have been better but call quality is very good. It does lag a bit sometimes. but the biggest problem I've is with the quality, its not even been four months since i bought this phone but the display got shattered immediately after i dropped it. On contacting motorola regarding warranty I was told display is not covered in warranty and it would cost me approx 6000 rs to get it fixed. And now I'm regretting not buying a phone with gorilla glass. My suggestion skip this phone for a one with gorilla glass or get an insurance.",
            "date": "20 Aug 2015",
            "name": "Bhimani",
            "stars": "2 stars"
        },
        {
            "comment": "I recieved a defective product, the phone is overheating and now when i installed whatsapp from google play the phone started to freeze and after restarting the phone the screen is also weird, half of the touch is non responsive. I opened the back panel and its got this blackish thing near the sim tray. thankgod its under 30 day warranty when this started happening. Now lets see how well flipkart handles my shitty device they gave me.",
            "date": "20 Aug 2015",
            "name": "vasav chawla",
            "stars": "1 star"
        },
        {
            "comment": "A perfect Gift for someone special. :) Its already a very well known phone and I need not write much about it! Pros and cons are also widely known. I had ordered it for a close friend and she is loving the gift. :)",
            "date": "20 Aug 2015",
            "name": "Deep Dand",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone in flipkart after 40 days this phone was not working it was switched off i take it to servise center after 7 days they said mother board problem we have change mother board it takes 15 days still did not recived phone from service center still they are telling 3 days pleace dont buy it",
            "date": "20 Aug 2015",
            "name": "Jaideep Deepu",
            "stars": "1 star"
        },
        {
            "comment": "I have used this phone with like maximum load, with almost all big games and it give best performance. On battery it might be slight drawback. battery is almost good. If you are looking for some phone with at least two days backup then you might feel drawback. Overall best phone in this budget.",
            "date": "19 Aug 2015",
            "name": "Kandarp Bisen",
            "stars": "5 stars"
        },
        {
            "comment": "nice product from moto.all features are are superb.i really love this product very much. camera=9/10 display=9.5/10 software=10/10 updates=8/10",
            "date": "19 Aug 2015",
            "name": "Abishek TN",
            "stars": "5 stars"
        },
        {
            "comment": "After buying this Moto G 2nd Gen, I have found the issues in past 6 months usage. 1. From second month I am facing network issues, I got service done once, again the network problem started in 20 days, 2. There is no proper service center (they have hired some third party office to service motorola mobiles). These third party service centers lack time maintanance, proper infrastructure, always faces network issues. 3. When I went to get the service done, found that many people are facing the similar issues. 4. Only 3 service centers through out hyderabad(place where i live), so you have to travel large distances to reach.",
            "date": "19 Aug 2015",
            "name": "Shasha vali Mo...",
            "stars": "1 star"
        },
        {
            "comment": "Good phone but there is a hanging problem some times it's goes hang overall I like it. Rear camera is very good but there is no any file manager application pre installed with this phone, you need to download any file manager app from play store.",
            "date": "19 Aug 2015",
            "name": "Rajeev Ranjan",
            "stars": "4 stars"
        },
        {
            "comment": "The phone and features of the Moto G2 is very good and picture quality is excellent. But the packing f the item is very poor",
            "date": "19 Aug 2015",
            "name": "Bipinchandra",
            "stars": "4 stars"
        },
        {
            "comment": "very good sound system, battery good but not best. heating problem. take too much time to charge. over alll very good phone",
            "date": "19 Aug 2015",
            "name": "avijit kole",
            "stars": "5 stars"
        },
        {
            "comment": "Had issues with the handset and received replacement however, with the replaced handset as well was facing more issues than the previous one. Issues are: 1. Call drops 2. Screen freezes 3. Heating up issues and the list goes on. Didn't expect such product from Moto stable however, seems to be an issue and don't think can be immediately resolved. Don't waste time buying this handset.",
            "date": "19 Aug 2015",
            "name": "Sanjeet Singh...",
            "stars": "1 star"
        },
        {
            "comment": "The Phone I received was perfectly packed and wrapped carefully. The phone has no issues and works fine. Great Seller @WS Retail",
            "date": "19 Aug 2015",
            "name": "Nikhilesh Mana...",
            "stars": "5 stars"
        },
        {
            "comment": "bets in price range. got stolen unfortunately. will look for another one maybe next gen. but I loved this one till I had it. fell down so many times and once from bike @ 70kph nothing except few scratches. Best phone I had under 15k",
            "date": "19 Aug 2015",
            "name": "Vasudev Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "its been more than 8 months... not even a single issue...yeah but now its a bit slow compared to when it was new...but that's ignorable.",
            "date": "19 Aug 2015",
            "name": "Amitava Chakraborty",
            "stars": "5 stars"
        },
        {
            "comment": "Its a really cool phone. If u could raise your budget by a few thousands then go for Moto g3 Instead .:)",
            "date": "19 Aug 2015",
            "name": "Kunal Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone for 10K, not worth even 5K, there are so many phones from chinese vendors which is way better and cheaper then this... Major issues UI lags, only 1 GB of RAM, in my case my touch screen became unresponsive after 15 days... not at all worth it... go for any phone of asus, lenovo, xiaomi they are far better",
            "date": "19 Aug 2015",
            "name": "Kirti Maheshwari",
            "stars": "1 star"
        },
        {
            "comment": "Fine product i have ordered in flipkart, this is a nice phone and got an update too from android Fine product i have ordered in flipkart, this is a nice phone and got an update too from android",
            "date": "19 Aug 2015",
            "name": "Suresh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Please don't by this phone. Reasons : Very slow Heating issues Takes 3hrs to charge App crashes by itself. I wish i could give negative ratings! My all hard earned money has been wasted. You can only feel my pain once you use it :\\",
            "date": "18 Aug 2015",
            "name": "Harsh Mehta",
            "stars": "1 star"
        },
        {
            "comment": "VERY GOOD MOBILE THERE IS NO HANGING PROBLEM , SPEED IS GOOD AND LITE IN WEIGHT EASY ACCESS TO CONTACTS , NO COLOR MESS UP , NICELY DESIGNED",
            "date": "18 Aug 2015",
            "name": "KULKARNI",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is awesome. with great feature in it. camera clearity also good and battery backup is good",
            "date": "18 Aug 2015",
            "name": "harshu m m",
            "stars": "4 stars"
        },
        {
            "comment": "##This one star rating is not for the product## I am sitting overseas and I ordered a Moto G for my parents back in India. Flipkart proudly announced it's delivery well in advance, but doesn't it care about the authenticity about the recipient too? The delivery boys care even less. They do not even ask for the identity of the recipient. When I tracked my shipment (which was directed to an educational institution), I find the order status as delivered & that the recipient has signed my dad's name, which is not true! My dad was not even there at that time & someone impersonated him & the agents just need a signature in their delivery sheet's column. Now I don't know who has the shipment. We are frantically searching for it. Flipkart please take note of this & don't think your job is done once you have shipped the item from your warehouse. It is YOUR responsibility to see it through. Otherwise, there will be a shower of 1/5 star ratings and such reviews from disappointed consumers like myself.",
            "date": "18 Aug 2015",
            "name": "Harish Krishnamoo...",
            "stars": "1 star"
        },
        {
            "comment": "i m using this phone since 4 months. there is no problem except charging time. this is ultimate phone for this range. this phone fulfills all the desires at the range of 20k in just 10k. very smooth operating & its color & hd quality is mind blowing. sound is also good. only headphones are bullshit. it is good for normal user so, moto G2 Rocking..................!!!",
            "date": "18 Aug 2015",
            "name": "Yogesh G",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: This is an awesome handset i got.. Awesome camera quality that no one can match.. Music player is also good.. Just one advise: If you are complaining for battery issue, just keep a note, always charge the phone 100% and you will see the difference.",
            "date": "18 Aug 2015",
            "name": "Sumit Mahajan",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased it, nice phone. for such a price the the phone is excellent. no lags, no hanging problem, am using more than 20 downloaded application in this phone including asphalt 8.",
            "date": "18 Aug 2015",
            "name": "Arunlal P",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchased the product and get delivered to me in defective condition. nothing happened as i have reported for the same within 7 days. worst i will be post on all social media about the same.",
            "date": "18 Aug 2015",
            "name": "Ravi Bhola",
            "stars": "1 star"
        },
        {
            "comment": "With utmost displeasure i would like to state that I am extremely unhappy with the service being provided for Motorola phones. I bought a moto G 2nd generation phone on 13th April 2015 and exactly 4 months later my mobile phone is not in working condition anymore. It has just become a toy, a toy of worth Rs 12000/-. Although the mobile is within the warranty period I have been told by the Motorola customer care that they wont be able to repair the same as the main board has been damaged and falls under liquid damage category. But the truth is that I kept my phone always in a safe place and it was never kept in any kind of compromising position. My questions and concerns regarding Motorola phone services are very serious as Rs 12000/- is not a joke. Everybody works hard for every single penny they earn. My phone was not exposed to any kind of liquid and it turns out to be really annoying when I hear that my phone will not fall under warranty. I am sick and tired of this warranty policy terms and conditions bla bla bla. I am a Ph.D scholar in Jadavpur University and one thing is for sure that I won’t suggest the Motorola phones to anybody in future. Another thing is that we buy phones depending on reveiws of the mobile phones out here and find that one out of many has complaints or has given a low rating but the fact is that u will face the problem once you have bought the phone because it has got the worst service of all Thanking You Yours Sincerely Sukalpa Choudhury",
            "date": "18 Aug 2015",
            "name": "Sukalpa Choudhury",
            "stars": "1 star"
        },
        {
            "comment": "look is good. works well. but front camera is not good. battery lasts upto one day. over all a good product.",
            "date": "18 Aug 2015",
            "name": "shrutima",
            "stars": "4 stars"
        },
        {
            "comment": "It is the best phone I had purchased till date, Gaming is superb, No hanging, battery back up is ok and but only one problem is the headset it is the old one not matching to the standard of motorola.",
            "date": "18 Aug 2015",
            "name": "Gopakumar Sasi",
            "stars": "5 stars"
        },
        {
            "comment": "Battery is poor. It will too worse where signal is not there. Better go with moto g 3rd gen as it is having sufficient power.",
            "date": "18 Aug 2015",
            "name": "Murugan K",
            "stars": "3 stars"
        },
        {
            "comment": "This is my second purchase of Moto G (2nd gen). This time I went for the white colour and it looks much better than its black counterpart. Go for it. Though there have been a lot of phones like Xiaomi, One Plus One, Mi 4, I would prefer Moto. Many of my friends are having Moto phone and we call ourselves the \"Moto Mitras\".",
            "date": "18 Aug 2015",
            "name": "A Majali",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is awesome with respect to features and specs but after the new update in os there is lagging and the system has become bit slow otherwise ok",
            "date": "18 Aug 2015",
            "name": "PANKAJ VERMA",
            "stars": "4 stars"
        },
        {
            "comment": "This is not good phone because i got problem in this phone within 2 months from purchase and after that i went to service center to resolve the problem but they are taking too much time to repair/resolve the problem. after ten days i didn't get any information regarding my phone from service centre. Speaker problem, Power On-Off problem....",
            "date": "18 Aug 2015",
            "name": "pramod pandit",
            "stars": "1 star"
        },
        {
            "comment": "Dear Viewers & readers, 1 Before time deliver, 2 The product had manufacturing defect i.e. SIM 1 Slot was not working, - the instrument was replaced in 3 days. 3 There is no File manager app need to download from google play 4 No memo app, need to download from google play 5 battery works for 12 hours with full day internet (DATA & WIFI), 4 hours talk time",
            "date": "18 Aug 2015",
            "name": "ALOK BHANDARI",
            "stars": "3 stars"
        },
        {
            "comment": "This phone is third class, 1. Battery 2. Hanging 3. Camera 4. Sound problem when calling.",
            "date": "18 Aug 2015",
            "name": "Pragnesh Patel",
            "stars": "1 star"
        },
        {
            "comment": "its great phone for that budget of under 10000 nice camera, great sound :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :) :)",
            "date": "17 Aug 2015",
            "name": "Sri",
            "stars": "5 stars"
        },
        {
            "comment": "Good product yaar ,, stock android with lollipop update .no bloatware therefore no hanging problem. *********************************************************",
            "date": "17 Aug 2015",
            "name": "Vishal",
            "stars": "5 stars"
        },
        {
            "comment": "i was using my phone from day first it start showing exclamation mark beside the network , i tried to connect to internet but it was not even sending a single whatsapp message which hardly few kbs but its not working i was thinking it may be due to monsoon but even after few days when monsoon stop ,its not working ,even on same place my another lg phone was working with same network (aircel) when i decided to return , but when i click on return button it not showing return option but only replacement when i choose replacement ,and after 2 days they call me to install an application in moto g2 ,, for quick chk but i tried to tell them its not getting to connect internet how can i download and install aps , how can i do so i said it can not be done now because its not getting connect to internet call me few minutes later i will connect it with my neighbour wifi but , i didnt know that they will call after one days ,,, mistakenly i was busy in an conference so i could not recieve the call , now that call is again postponed again for next day ,,, can u please say in will u replace or not ,,i have even hardrest and reboot my phone twice but the network still not working , please reply soon i request the replacement at 15 august , and my 30 day replacement warranty will void at 24 august ,, ,,if i m getting postive responce , then its first and last shoping in flipkart for me and my family ,my frnd ,and my whole locality ,because i dont want to let them feel ,,what i m feeling now",
            "date": "17 Aug 2015",
            "name": "hamid",
            "stars": "1 star"
        },
        {
            "comment": "Very decent at affordable price and features are matching to my required.Speed of this 2 G 2nd Gen Mobile is quite fast",
            "date": "17 Aug 2015",
            "name": "SATPAL SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "Battery was very worst and its performance also not better go another option this totally not good",
            "date": "17 Aug 2015",
            "name": "Kathick",
            "stars": "2 stars"
        },
        {
            "comment": "IN this Budget One of the Best Phone...Dont expect much from this Phone , If you are looking for average android phone , you can go for this.",
            "date": "17 Aug 2015",
            "name": "Naveen",
            "stars": "4 stars"
        },
        {
            "comment": "3 stars are for service only. Product is nice. The thing is My Moto's bottom speaker stopped working after 10 months of use, thats ok, coz minor hardware issues are normal. I called the moto service centre. I just wanted to know if i will get my handset repaired in one day. And for my surprise when i asked if they are having Moto G2 speaker, the service guy replied show me the phone then only i can tell.. i repeated its a Moto g2... But still he said i have to see the phone. Means service centre guy dont know which handset is moto G2.. Awesome... Moto...",
            "date": "17 Aug 2015",
            "name": "Anuj Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Mobile was delivered quickly, The phone worked well for few days. Once the phone is locked after some time the screen freezes and unable to unlock the phone. The phone works, but cannot see the display, hence it is of no use. Have to restart the phone using long press after which all the app restart and all the data is lost, especially WhatsApp data.",
            "date": "17 Aug 2015",
            "name": "Harshad Patwardhan",
            "stars": "2 stars"
        },
        {
            "comment": "I brought this moto g mobile 3 months back.... But know i have some problems in mic. I cannot hear voice will i attending call. After i power off and on my mobile it working fine for few days and again repeating same problem.....",
            "date": "17 Aug 2015",
            "name": "vinoth ganesan",
            "stars": "4 stars"
        },
        {
            "comment": "Very good phone with awesome features as compared to other smatphone within this price range. Best buy and thanks Flipkart for prompt delivery and package",
            "date": "17 Aug 2015",
            "name": "Radhika Sivana...",
            "stars": "4 stars"
        },
        {
            "comment": "i can say a good smart phone for your daily need basis. but it hangs a lot on dual sim usage, dual account settings and on gaming that very simple game like (Candy crush Saga). Overall it s a good deal. but hanging issue is a big headache.",
            "date": "17 Aug 2015",
            "name": "Sibani",
            "stars": "3 stars"
        },
        {
            "comment": "moto failed to provide a good product n case of motog2 worse smart phone. never go for the product , go for g3",
            "date": "17 Aug 2015",
            "name": "jatin bahel",
            "stars": "1 star"
        },
        {
            "comment": "Have been using since 8 days, first two days it was good where Surfing Through Wi-Fi. Mobile took 3 hours to charge fully, while surfing on Mobile Data plan it was really pathetic performance... battery is draining like if you surf for 2 hours continuously you need to put charging for 3 more hours. Except battery everything is very Good... Worst battery performance... Totally dissatisfied.",
            "date": "17 Aug 2015",
            "name": "Shravan",
            "stars": "1 star"
        },
        {
            "comment": "I got my moto g 2nd gen on 10th- july-2015 I am experiencing strange issues , Sometimes When someone calls me i am unable to hear anything for callers side , switching from earpiece to speakers also gives no sound. It happens quite often , but randomly , and once it happens , even if I make a call i am unable to hear anything. Restarting the phone fixes the issue , but after sometime it comes back automatically and is very annoying. Justed wanted to know if other moto G2 users also have the same issue or is it just me , with a defective handset .",
            "date": "17 Aug 2015",
            "name": "Johnpaul",
            "stars": "1 star"
        },
        {
            "comment": "Its really a painful phone. Phone get hanged like hell. Many times you cant pick an emergency call due to your phone get hanged. Many apps cant open many times as screen turned into black. This is the worst phone ever i have used. Wish i can give a Negative star for this phone.",
            "date": "17 Aug 2015",
            "name": "Jishnu",
            "stars": "1 star"
        },
        {
            "comment": "I upgraded to lolipop. Works like a charm. No complain so far wit any feature. Looks classy too. Best phone for students. Good camera quality. Highly responsive interface.",
            "date": "17 Aug 2015",
            "name": "Pankaj Roy",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered and delivered promptly from Flipkart and easy transaction. Good deal and good phone but outdated soon",
            "date": "16 Aug 2015",
            "name": "Bala",
            "stars": "4 stars"
        },
        {
            "comment": "Good one.......I have brought this.....Using it from last two months.....Thanks a lot to flipkart and Motorola........",
            "date": "16 Aug 2015",
            "name": "RAJESH RAJAN",
            "stars": "4 stars"
        },
        {
            "comment": "I recived my cell phone on 15th june 2015 at 10999rs. and after 1 week price decrease it come to 7999rs..bc u should have inform us atlist once..neway m satisfied with Moto G2 good",
            "date": "16 Aug 2015",
            "name": "Devendra dolas",
            "stars": "5 stars"
        },
        {
            "comment": "There are other options but with Moto G you will have no problems as it is strong, fast with a good battery. Hardware: Very strong build, I dropped this a dozen times already and not a scratch on this. Every thing works. Performance: Very Fast, No lag even after installing 40 to 50 apps. If you are into games, the like of Asphalt 8 run super fast. The phone doesn't heat up. Camera: Both cameras are nice, though the LED flash is an LED flash (won't light up the whole room). Battery lasts a day with heavy use.",
            "date": "16 Aug 2015",
            "name": "Jaisal Sanghvi",
            "stars": "5 stars"
        },
        {
            "comment": "it turned extremely bad for me, battery is not lasting for even 4 hrs when it is just kept idle[no talks,no data on, no wifi usage].complete waste of money.",
            "date": "16 Aug 2015",
            "name": "kk",
            "stars": "1 star"
        },
        {
            "comment": "I can't give a smiley 5 for this phone. Moto-E is far better than its G variant. With total 4 GB Moto E is an excellent phone operating at 1GB RAM, however G is not at all upto expectation in terms of its speed, it lags slightly and heats up while downloading apps and games. it's undoubtedly a sleek and matte finish handset, while its back panel is weaker than E variant. I think it should operate at 2 GB ram with a battery charger with a USB port cable and may be a good phone then. I also wonder whether the 16 GB storage is there or not!! comparing Moto E with similar applications and lot of games in it, I think 16 GB capacity is not virtually available in the system! Flipkart needs to verify and review it technically.",
            "date": "16 Aug 2015",
            "name": "Sudesh Kumar A.S.",
            "stars": "3 stars"
        },
        {
            "comment": "worst battery backup i have ever seen... battery discharged very fast and cant sustained for even 6 hours..",
            "date": "16 Aug 2015",
            "name": "prabhakar mahour",
            "stars": "3 stars"
        },
        {
            "comment": "IAM USING THIS MOBILE FOR LAST 3 MONTHS,TILL NOW I FOUND NO PROBLEM.CAMERA IS THE BEST FEATURE OF THIS MOBILE.AFTER WATCHING THE PHOTO PRINTS I WAS SHOCKED.SOME PICS WERE BETTER THAN PHOTO STUDIO PICS",
            "date": "16 Aug 2015",
            "name": "vikram penumaka",
            "stars": "4 stars"
        },
        {
            "comment": "Actually Lacks good battery life as was in G1 more it should b with data onoroff option in home screen camera is awsome and a distortion free feel",
            "date": "16 Aug 2015",
            "name": "Shubham Jadhav",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is wonderfull ! The internet works perfectly. Is really fast. System is fast at all except when you use many applictions in background. Battery life is great. Quick multi tasking. Loud speakers. Premium look and large 5'0 screen let u use it freely. 8mp camara is also captures best of our memories. Love to use Motorola moto g2.",
            "date": "16 Aug 2015",
            "name": "Sachin Jadhav",
            "stars": "4 stars"
        },
        {
            "comment": "moto g secong generation confrom me to return request as soon as posible done?////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////",
            "date": "16 Aug 2015",
            "name": "pasha pasha",
            "stars": "1 star"
        },
        {
            "comment": "Phone is fantastic no doubt but price should be lower, there are many good phone available in market cheaper than it. Good display stock android feels premium corning gorilla glass but low RAM",
            "date": "16 Aug 2015",
            "name": "Ashutosh kumar",
            "stars": "4 stars"
        },
        {
            "comment": "This phone has an excellent camera but I am not happy with its battery life. Also, if slows down considerably after you load it with a few apps.",
            "date": "15 Aug 2015",
            "name": "Jagdish Bhat",
            "stars": "3 stars"
        },
        {
            "comment": "Battery Draining problem. RAM Consumption very high after lollipop Update. Touch is not as smooth as expected. Better go for REDMI 2 at this Price range.(cheaper one) I purchased it for 13K... and Motorola disappointed me. What to say about FLIPKART... they sell only faulty products.. pathetic",
            "date": "15 Aug 2015",
            "name": "Shashank Mishra",
            "stars": "1 star"
        },
        {
            "comment": "It might not be the best smartphone if you look at hardware configuration.But its the best in the market in user experiance.",
            "date": "15 Aug 2015",
            "name": "nishant Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "No Battery Backup, Discharges in 3 hours. After Talking 5 mins, phone gets Heated so much. If you play game for a while then you can cook a Omblet, or Boil your water. Complete waste of Money.",
            "date": "15 Aug 2015",
            "name": "Raju Bathineni",
            "stars": "1 star"
        },
        {
            "comment": "I am reviewing this product after 4 month of use. pros 1.i am using heavy internet on this phone but after that no hanging issue. 2.best ever class camera 3.best handling 4. enough memeory 5.better performance after using too many apps cons. poor battery",
            "date": "15 Aug 2015",
            "name": "Praveen Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I hope no need to explain anything about this phone. Great phone, great camera, best in this price range.",
            "date": "15 Aug 2015",
            "name": "Srikanth V",
            "stars": "5 stars"
        },
        {
            "comment": "Prices have dropped almost 40% after i bought. Felt cheated. But product quality is very good and is working as expected.",
            "date": "15 Aug 2015",
            "name": "Nagesh Yadiki",
            "stars": "5 stars"
        },
        {
            "comment": "This has review has been long due, so I'll get right to it. The moto G (2nd Gen) that i had purchased about a week ago abruptly stopped working due to a battery issue (after calling up various service centers with a little bit of research) - reason being the battery could not hold a full charge for more than 4 hours - Even on standby. I had requested Flipkart for a return/exchange which got rejected - tried the second time and got rejected again, hope the 3rd times the charm. Buyers - a word of advice, please do take the reviews seriously before purchasing a discounted product on flipkart. Especially when to comes to purchasing electronics.",
            "date": "15 Aug 2015",
            "name": "Allen Dayal",
            "stars": "1 star"
        },
        {
            "comment": "It is a good product at this price and I recommend it to my friends. But always there is more expectations as I felt that if the RAM is 2 GB and battery is at least 2800 mAh, it would be outstanding with little more cost. Display is quite good and in normal use I found there is no lagging while playing games except some hi end stuff. Audio is very clear but headphone is difficult use for long time as there is no soft bud which can plug into the ear hole.",
            "date": "15 Aug 2015",
            "name": "Chinmoy Debnath",
            "stars": "4 stars"
        },
        {
            "comment": "Internet not working properly, most of the time applications were hanging. It is very tiring phone. games are not working properly. Sometimes it created a big problem for me.",
            "date": "15 Aug 2015",
            "name": "Shashank",
            "stars": "1 star"
        },
        {
            "comment": "Purchased product Months back, as of now it is going good. Flipkart provides nice products and has good return policy too.",
            "date": "15 Aug 2015",
            "name": "Bilal Mir",
            "stars": "4 stars"
        },
        {
            "comment": "very nice features ,awesome battery backup got 1 st one in mid December 2014 had sound problem & sim slot problem 2nd ordered in late January 2015 had display problem & got replacement in feb 2015 on 7th august that replacement was totally dead in morning sometime after full charge(no water ingress) deposited it in service center(rourkela,odisha) on 10th aug, they could not identify the problem and kept the device giving me 8 to 10 days time to repair.i am calling them to ask them the problem and when will i get it but their service center no is switched off.such bad manufacturing practices that in 9 months i am forced to use 3 defective phones .",
            "date": "14 Aug 2015",
            "name": "Utkal JENA",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered this phone in July and I am writing this review after using this around one month. After reading many reviews I was in confusion that should I order Moto G2 or not as many gave negative reviews.. but finally I ordered and the mobile came before its schedule date i.e. 7 days before and the mobile is working very good. no problem in speed. Storage is around 12 gb so you can install as many apps as you want.. no problem with any game Camera is very good...selfie is also very good I'll definitely suggest this for anyone if his budget is under 10000 rs",
            "date": "14 Aug 2015",
            "name": "Roshan Khan",
            "stars": "5 stars"
        },
        {
            "comment": "No proper response from FLIPKART customer care. They are ill treating when I requested for return and I did 3 times still no reponse from them. Very bad online experience :( ...",
            "date": "14 Aug 2015",
            "name": "Yuvaraj P",
            "stars": "1 star"
        },
        {
            "comment": "This is the best phone i ever had. Very nice built quality, updated android lolipop software, good speaker, best user interface. feel like premium phone",
            "date": "14 Aug 2015",
            "name": "VINOD PARIHAR",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered it for a friend's mom and selected 1 day delivery. There is no doubt in the product but one day delivery was not done.",
            "date": "14 Aug 2015",
            "name": "Barun Bikash S...",
            "stars": "5 stars"
        },
        {
            "comment": "after few months processing becomes slow and its problematic, sometimes features stop working and a restart is needed for the same",
            "date": "14 Aug 2015",
            "name": "amit",
            "stars": "2 stars"
        },
        {
            "comment": "This mobile may not have a top notch spec compared to some other mobile with same price tag. But definitely it has a solid build quality and reliable than any other mobile with the same price tag. Works prefect as expected no heating issues. Battery is not that great which is asusual with most smartphones. If you are average user (not gaming or too much of 3g usage) it can last till you go to bed. Camera performs descend @ day light but and performs poor @ low light. Only 720p HD video and not 1080p video. If you are a android freak you can find lot of custom rom to play around with it..",
            "date": "14 Aug 2015",
            "name": "Samuel James",
            "stars": "4 stars"
        },
        {
            "comment": "This phone has everything what I was looking for. Its a power packed phone with quality and performance. Now my family has all MOTOs - G, G2 and G3 :-)",
            "date": "14 Aug 2015",
            "name": "Sumit Gavhankar",
            "stars": "5 stars"
        },
        {
            "comment": "worst service from flip kart .i purchased moto g2 20 days back.its having loud speaker problem and some soft ware issues .i raised replacement request 3 to 4 times .they are not approving finally they telling that u contact nearest Motorola service center .then why this flip kart people assuring that 30 days replacement .its not flip kart its flop kart.i am really not happy with service of flip kart.its very worst now a days .",
            "date": "14 Aug 2015",
            "name": "Chiranjeevi",
            "stars": "1 star"
        },
        {
            "comment": "I placed the order in exchange scheme, and paid money by credit card. I have read and checked all term and condition before placing order. when flipkart guys comes to pick my old mobile, then its saying they can't accept mobile if its screen is damage. I said its not mention in term and condition while placing order. I called customer care to understand this issue. they told me to check \"how exchange work\" section before placing the order. i asked why its not mentions in terms and condition. i also asked to register complaint to avoide this kind of issue. I wanted to share my experience with flipkart to avoid this kind of issue repeat with other person.",
            "date": "14 Aug 2015",
            "name": "Saurabh Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I got this product at 8099 and you can not expect any thing better than this at this price.At first impression itself i liked the phone and its features are also impressive. many of my friends are having this phone and i was also planning to get the phone and i got the best deal on Flipkart on 8th august. Overall i'm happy after getting this phone and would like to purchase next version in future as well.",
            "date": "14 Aug 2015",
            "name": "Rahul Ranjan",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone on Jan'15 and was really impressed with the performance. But it started slowing down after 4-5 months. I will try to list out the pros & cons Positive: 1. Awesome display at this price. The pixel density and the scratch proof screen is really value for money. 2. The camera quality in outdoor is superb, for indoor it's average. 3. Touch screen sensitivity is also very good. 4. Few utilities like Moto Assist & Alert are really useful. 5 Negative: 1. RAM is 1G only. So at start it might seem to be enough but later when you have 2-3 open apps the performance starts degrading. 2. Battery is not strong enough to survive one day of moderate usage. (Gaming excluded) 3. The earphone sucks bigtime plus no volume control option. So considering the Moto g3 out in the market and price dropping down, it is indeed a great choice in this price range. But again after 4-5 months the performance degrades drastically.",
            "date": "14 Aug 2015",
            "name": "Gaurab Bose",
            "stars": "4 stars"
        },
        {
            "comment": "hollow every body overall performance is very nice. But first issue which I am regularly facing is that when I restart my phone it shows error that \"unfortunately, the process.com android.phone stoped\" after this all my contacts & call logs get deleted. I have received phone on 27.06.2015. When I fond this thing is happening I have requested to return my phone to Flipkart for software issue. Then I received call from Flipakart I have been told to reset the phone. I have done accordingly & it worked for 10-15 days. But now still I am facing the same issue. And now I can't return the phone as 30 days are over. Second one is when enable \"Adaptive Brightness\" it doesn't work at all.I don't know what exact happens but brightness remains the same as it is in dark room also and in lighted room also. I am giving ratings on the basis of above issue faced by me but as I said above all other things are working properly but due to first issue some times I feel irritating.",
            "date": "13 Aug 2015",
            "name": "Prasad Navare",
            "stars": "3 stars"
        },
        {
            "comment": "When I bought it, was working great but just after a few days itself the phone started hanging. Then came issues with calling- had to press the call button multiple times and if that too didn't help had to switch it off and switch on again. Fed up of it. Called flipkart today but seems there server is down. No issues, Kindly replace the phone or else upgrade it to Moto G 3 or its parent company-Lenovo K 3. Looking forward to resolving this issue asap.",
            "date": "13 Aug 2015",
            "name": "Avi",
            "stars": "1 star"
        },
        {
            "comment": "sd card is not working.. ortherwise everything is gud performance ok camera is nyc could anyone plss tell ho to exchange the phone using warranty",
            "date": "13 Aug 2015",
            "name": "Upendra Behera",
            "stars": "4 stars"
        },
        {
            "comment": "I've been using this phone for a while now. This is an excellent phone for its price range. I'd recommend this phone to anyone who is looking to buy a phone in this price range.",
            "date": "13 Aug 2015",
            "name": "shubham srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for my uncle and he is happy to have this master piece from moto...improved performance with great look and feel....happy to buy this phone...Keep it up Motorola....",
            "date": "13 Aug 2015",
            "name": "Shantanu jain",
            "stars": "5 stars"
        },
        {
            "comment": "The main purpose of phone is to have uninterrupted conversations but my Moto G goes to mute in between conversations. The product was purchased in June and not valid for return. If the product is not good, what can Flipkart do? But I am expecting Flipkart to call me within the next 24 hours and replace this phone as I did the transaction through Flipkart. If I don't receive a call from Flipkart team, this will be my last transaction on Flipkart and Wish them Good Luck.",
            "date": "13 Aug 2015",
            "name": "GCD",
            "stars": "1 star"
        },
        {
            "comment": "i purchased this item 3 days ago,, and phone hacks a lot,, moreover applications also crashing,,sound quality is loud but little blur while playing songs,,it take very long charging time,,battery drain out very quickly,,,",
            "date": "13 Aug 2015",
            "name": "ashu",
            "stars": "3 stars"
        },
        {
            "comment": "Good product in competitive price but again what is your requirement? It may not fulfill all your requirement. Sound is not good. But yes, compared to price it's just 1.5 times of expectation.",
            "date": "13 Aug 2015",
            "name": "Sudipta Chandra",
            "stars": "4 stars"
        },
        {
            "comment": "This is an amazing phone available at this price, much better than any other brands. Very happy with the product.",
            "date": "13 Aug 2015",
            "name": "Arun Vijapur",
            "stars": "5 stars"
        },
        {
            "comment": "I had purchased this product with lot of expectations. while it really met (or exceeded) those expectations mostly, it failed on some of the basic features - led to real disappointment. The positive things first: - Really good grip and smart look - Google apps smartly integrated - Very competitively priced - Excellent picture and video quality, shoots really well in low light conditions - Hard scratch proof screen (so u need not even put a screen cover) - Enough storage space and dual SIM slots - Big screen size to fit in all the most used apps and notifications Now the negatives: - The battery life is a real showdown - have to charge everday irrespective of use - Not possible to personalise ringtone - SMS does not have one of the most useful feature - 'drafts' - No touch screen feature to turn the phone to silent / vibrating mode - Poor quality head phones - The charger should have detachable data cable - Creating profiles is not possible - Turns slow when multiple applications are used Though I would still rate this in the mid range of the scale given that it helped me to upgrade in terms of the enhancements I was looking for in a smart phone. Let me know in case any of you disagree with me or finds this review helpful.",
            "date": "13 Aug 2015",
            "name": "sreerup roy",
            "stars": "3 stars"
        },
        {
            "comment": "Nice Phone in this price range. Camera Quality is good. Faster Delivery by Flipkart. Performance is fine.",
            "date": "13 Aug 2015",
            "name": "uma biradar",
            "stars": "4 stars"
        },
        {
            "comment": "I was a big fan of moto E hence purchased moto g 2 but this phone is not a mobile it's a heater. you can iron your clothes with it. you will feel horrible when talking to someone in moto g 2 it gets heated a lot. while charging, listening to songs, playing games, charging and whenever screen is on or any other program you opened and forget it to close the phone becomes a heater",
            "date": "13 Aug 2015",
            "name": "Niraj Pandey",
            "stars": "1 star"
        },
        {
            "comment": "Very good phone and awesome delivery by the Seller.... Received the product in just 17 hours time from ordering......",
            "date": "13 Aug 2015",
            "name": "Praveen George",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 3 rd gen is very fast .better to launch moto e 3rd gen it helps alot to low medium class people",
            "date": "13 Aug 2015",
            "name": "theresamma",
            "stars": "4 stars"
        },
        {
            "comment": "its a good mobile phone. when you hold it in your hands,you can feel the quality. Camera is good even in low light situation. Good sound quality it won't rattle even when it is played in full sound. nice display. only -ve is that it is 2nd gen anyway it works fine for me, i like it very well. i don't think i need an upgrade now.",
            "date": "13 Aug 2015",
            "name": "Aaron",
            "stars": "5 stars"
        },
        {
            "comment": "I am satisfied with its quality and performance. The quick service of flipkart is also appreciable. I have exchange my old phone. The guy who has come to pick was very courteous and helpful.",
            "date": "13 Aug 2015",
            "name": "Ashish Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2 is very good mobile . The phone is awesome in looks and functionality. I found a problem during call the person on opposite side can hear my voice but I cant hear. I thought this is an ordinary problem but it's not, It happens many times. The call doesn't work unless and until I restarts the phone,",
            "date": "13 Aug 2015",
            "name": "Archana Singh",
            "stars": "4 stars"
        },
        {
            "comment": "As all know that it's a good product but only the problem is battery 2000mah. They have modified it in Moto G 3. Thanks",
            "date": "13 Aug 2015",
            "name": "GURMEET SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "I got this product replaced ( as I faced an issue within a month of purchase ) but even the replaced product is showing me the same issue. Issue : The error shows SIM Slot cannot be detected. The same SIM is functional in other cell phones.",
            "date": "13 Aug 2015",
            "name": "Nimish Tendulkar",
            "stars": "1 star"
        },
        {
            "comment": "good for use and nice mobile. everyone can bye it.its internet access is very fast to use.moto g is a good mobile phone.i use it",
            "date": "13 Aug 2015",
            "name": "bikash",
            "stars": "4 stars"
        },
        {
            "comment": "I gifted it to my parents .They are quite happy with the phone.excellent camera . easy accessibility .",
            "date": "12 Aug 2015",
            "name": "Anu Kuriakose",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it in exchange with my old phone. This is one of the best phone at this price range. But now I would suggest you to go for Moto G(3rd Generation)",
            "date": "12 Aug 2015",
            "name": "Narayan Nandeda",
            "stars": "5 stars"
        },
        {
            "comment": "Good product and prompt delivery. Enjoyable experience with Flipkart. Would recommend the same to others",
            "date": "12 Aug 2015",
            "name": "Dr R Srinivasan",
            "stars": "5 stars"
        },
        {
            "comment": "Looks like moto g2 which are now in sale are left over products, more likely factory refurbished products and low quality product which moto g2 machines can produce. One vivid evidence is Display appears yellowish in color. I am not able to see white color in display at all. Not sure about if part inside are of good quality. All those who are going to purchasing moto g2 thinking it is a quality product, you are wrong. Moto g2 was a quality product, not anymore. Dont purchase remains.",
            "date": "12 Aug 2015",
            "name": "Gopinath P",
            "stars": "1 star"
        },
        {
            "comment": "I am using this from one month onwards. I am very thankful to flipkart for the awesome delivery. I didn't get any heat issues from this. I am very satisfied and looking forward to buy Moto G 3rd Gen.",
            "date": "12 Aug 2015",
            "name": "Raj Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased the product on Dec'14 and after 07 months of use, suddenly it was not getting ON. Since it was under warranty, I contacted flipkart for authorized service center in Allahabad which is nearest city from my location. I was told by flipkart that SRK Electronics is the authorized service center in allahabad. Once I reached there, I came to know that the service center has been closed since very long. There was another address mentioned there which was claimed to be authorized one. Therefore I visited there, after examining the mobile I was told that since the mobile has been water damaged so warranty will not be covered and Rs 450 would be charged. It was also informed that if more that 450/- would be the repair cost then prior permission would be taken from me. Next day when I contacted service center, I was told to collect the mobile. After reaching there they told that it would cost Rs5500/- as repair cost of the mobile. I refused to give such huge amount and take back my mobile unrepaired. Once again I contacted flipkart for giving wrong address of service center and services I received and requested flipkart to collect my mobile for repair as it is there fault for giving wrong address. Flipkart refused to do so and gave me address of another service center. I did not expect from Flipkart for providing such bad service for their flagship product. I will definitely escalate the matter for their poor after sales services to customer. THIS IS MY LAST PURCHASE FROM FLIPKART. GOOD BYE",
            "date": "12 Aug 2015",
            "name": "VIBHU",
            "stars": "1 star"
        },
        {
            "comment": "Very much disappointed with Flipkart. They are ready to deliver the product on the same for a new one. But i received the products with some defects and requested for replacement. To accept the replacement, buyer needs to wait for 48 Hours. After approval buyer needs to wait for 11 working days to get a replacement. When i try to order a same product it still shows the options for ON SAME DAY DELIVERY.",
            "date": "12 Aug 2015",
            "name": "Rizwan",
            "stars": "1 star"
        },
        {
            "comment": "after one month its screen got black and mobile is in dead condition. Now customer support will take 25-30 day to repair :-(",
            "date": "12 Aug 2015",
            "name": "KD",
            "stars": "2 stars"
        },
        {
            "comment": "Using since almost 8 months, Excellent Call clarity, good camera, good performance on this price, Good build quality. Low battery life after upgrading to Lollipop",
            "date": "12 Aug 2015",
            "name": "Suresh G",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is awesome in looks and functionality. No heating, no lagging. Camera both front and rear are very good. no problem whatsoever. Go for it. Moto Rocks.",
            "date": "12 Aug 2015",
            "name": "jitendra yadav",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered 2 Moto G2 mobiles on cash on delivery... but the pieces which i have got are deffective pieces... its automatically switching off n the display isn't coming properly!! I would like to return or exchange my mobiles.",
            "date": "12 Aug 2015",
            "name": "Salla Harita",
            "stars": "1 star"
        },
        {
            "comment": "Batter backup was not good not even 12 ever since i bought this phone.Except the batter issue, Screen quality & everything is good.",
            "date": "12 Aug 2015",
            "name": "sudheer",
            "stars": "3 stars"
        },
        {
            "comment": "jitna chaho utna buy karo.only on flipkart.best android phone with good camera and display quality. best of all",
            "date": "12 Aug 2015",
            "name": "DEEPAK KUMAR JENA",
            "stars": "5 stars"
        },
        {
            "comment": "No match of this Moto G2ndGen phone anywhere...But besides all the best things, the problem of hanging/heating and fast battery discharge continues...",
            "date": "12 Aug 2015",
            "name": "Arun Aggarwal",
            "stars": "3 stars"
        },
        {
            "comment": "I was soooooo disappointed with this phone. It lags bigtime, hangs while multitasking and has speaker problems as well. And I thought there was a problem with my phone, so I got it exchanged. But the performance of the new phone was the same as well. PLEASE STAY AWAY FROM THIS MOBILE!!",
            "date": "12 Aug 2015",
            "name": "Vishesh PB",
            "stars": "1 star"
        },
        {
            "comment": "moto g 2nd gen is a very good device but current os 5.0.2 is a big issue still now there is no update new so beware of that thing other wise set is very good",
            "date": "12 Aug 2015",
            "name": "Amit Majumder",
            "stars": "4 stars"
        },
        {
            "comment": "it was fast and responsive when i bought it. After using it for 5 months my view changed. its lagging and big time and occasionally hangs as well. But i guess reason is 1GB RAM. Apps are getting heavier with each update and takes lots of processing and RAM. Battery life is very average and does not perform well in 3G environment. My verdict : NoW Moto G3 is out with 2 GB of ram on 16GB modle and 13 MP cam , go for it",
            "date": "12 Aug 2015",
            "name": "Abhishek Pandey",
            "stars": "3 stars"
        },
        {
            "comment": "As i got in offer so functinally its too good , camera good battery good app support was good only 1gb ram lacks to support high end apps.",
            "date": "12 Aug 2015",
            "name": "Prakash Gawate",
            "stars": "5 stars"
        },
        {
            "comment": "Pros.. Battery just comes for a 1.5 days for Moderate user (with WIFI and 3g always enabled), If the battery would have been more than 2500 mAh, would have been very good. In one word Good Quality for the give price Sathish",
            "date": "12 Aug 2015",
            "name": "Sathish Kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "I was a moto gen-1 user first. I was very happy with that product. After an year I purchased this phone . I am sorry to say that but this phone isn't that good than moto G1. The phone was dead slow. I tried to reach the flipkart support and requested for an exchange. I got a call from them and they asked me to install an app which will run few tests and show them my phone condition. I was asked to do a factory reset and told that if the issue is still persisting then we will accept the exchange. I accepted it and when I did a factory reset the phone the problem remains the same. This time when I requested an exchange. I got a call from the customer support and the guy who called me this time was awesome. HE ACTUALLY TOLD ME TO RUN A SINGLE APP AT A TIME AND ASKED ME TO CLOSE ALL OTHER BACKGROUND ACTIVITY. I was thunderstruck with his statement. I explained him that even my number-pad shows up after 5-10 seconds when I want to dial a number but he was not even listening to my statements. I also told him that I have used both the generations of moto G and I would know if something is wrong with the devices. At last he told me to go to Motorola service center and give a check there.If they are accepting that this phone has problem then FLIPKART WILL ACCEPT THE EXCHANGE. I have lost confidence on this site after this purchase.",
            "date": "12 Aug 2015",
            "name": "Laxmi Narayana",
            "stars": "1 star"
        },
        {
            "comment": "battery life is poor rest all all features r good screen is very huge rest all is superb..ram is ok-ok",
            "date": "12 Aug 2015",
            "name": "Hari",
            "stars": "3 stars"
        },
        {
            "comment": "This is very useful than other mobiles i.e price, software, Camara, voice, bluetooth, wifi etc.,okkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk",
            "date": "11 Aug 2015",
            "name": "durga rao n v v",
            "stars": "5 stars"
        },
        {
            "comment": "some apps and display features hault sometimes and needs to restart again ...Also it is quite weighty.!!But good to buy in this range..!",
            "date": "11 Aug 2015",
            "name": "Vikram",
            "stars": "4 stars"
        },
        {
            "comment": "There are many but tiny defect with the mobile. No proper response from Flipkart. .",
            "date": "11 Aug 2015",
            "name": "Ganesh B",
            "stars": "1 star"
        },
        {
            "comment": "I recived my product in Jan'15 and since Mar'15 I started getting numerous problem. I contacted many a times with the Motorala persons they provided me the same solution and names of service centres. i Restored my system n upgraded the Android Software many a times but it didnt help. I just had shifted to another city so finding the service centre was itself a great problem , still at last i manged to find a Service Centre of Motorola and gave it for servicing which took more than 2 weeks . Even after so much of suffering i m still strugglelling with the device .. Motorola is a trusted Co. because of its good Quality of products but in my case i can't write a single good word .. i was thinking of opting for 3rd gen too when i bought this product but i dont think its a good idea any more",
            "date": "11 Aug 2015",
            "name": "Avnni",
            "stars": "1 star"
        },
        {
            "comment": "moto rockzzzzzzzzzzzzzzz.touch is simply superb. gaming was sooo good. wish when it release moto g4.. battery is only thing i felt bad",
            "date": "11 Aug 2015",
            "name": "jai chandra reddy",
            "stars": "5 stars"
        },
        {
            "comment": "after upgrading to android L phone getting hang very frequently, even the basic apps also stops working. Factory reseat didn't help out.",
            "date": "11 Aug 2015",
            "name": "ashish singh",
            "stars": "1 star"
        },
        {
            "comment": "bad. bad condition after 1 month of purchase. needs to be charged twice a day. and gets heated up very quickly. Worst piece from Flipkart and WS retail shop",
            "date": "11 Aug 2015",
            "name": "Divyanshu Singh",
            "stars": "1 star"
        },
        {
            "comment": "I was a big fan of MOTO G2 and G3 before two experiences I have faced recently. 1) in two months mother boards needed to be replaced due to technical issues and overheating !! 2) I have given MOTO G2 in service from last 1 week and still the customer care is given same answer that it will take minimum 15 days as part is not dispatched by the respective authority..!!, They gave assurance that part has been ordered on the same day only but delay is from authority side..! If you compare with any other companies, they all give assurance that mobile will be repaired within 5 days. How can we survive without a good mobile for 3 weeks if you do not have same kind of smart alternate mobile option..?? I tried to contact authority also, but no reply I have received... !! This is the most worst service I have seen in my life and I was thinking to buy MOTO G3 in exchange but rather going with MOTOROLA it is good to go with other company if company can not understand its responsibility to provide sufficient on-time service.",
            "date": "11 Aug 2015",
            "name": "Bhavik Mehta",
            "stars": "2 stars"
        },
        {
            "comment": "If you are a selfi lover must get this phone front cam is the best among all phones tested till now in this range",
            "date": "11 Aug 2015",
            "name": "Sunny Brar",
            "stars": "5 stars"
        },
        {
            "comment": "I liked this phone as it is worth buying and fast in processing as well as latest version with high pixels image quality camera and pre installed apps and last but not the least very user friendly.",
            "date": "11 Aug 2015",
            "name": "XXXX",
            "stars": "4 stars"
        },
        {
            "comment": "writing the review after 15 days PROS:- 1) best camera front as well rear 2) touch & appearnce is best 3) specifications are BEST compared to cost 1) the worst battery life & very slow charging 2) featured are less compared to samsung 3) low quality headphones with mobile 4) no usb",
            "date": "11 Aug 2015",
            "name": "prashant derle",
            "stars": "3 stars"
        },
        {
            "comment": "If Budget is a constraint but still need a Quality product, then no need to look beyond this phone.. Great value for Money",
            "date": "11 Aug 2015",
            "name": "Rushabh Shah",
            "stars": "4 stars"
        },
        {
            "comment": "I am very much satisfied with this phone.. its above 5 months of using it and still no complain. nice product",
            "date": "11 Aug 2015",
            "name": "Neha",
            "stars": "4 stars"
        },
        {
            "comment": "very nice its oprating very good.but.now better than this mobile other mobiles arrived so i suggested buy the advance feature mobiles purchase",
            "date": "11 Aug 2015",
            "name": "Aluvala Srinivas",
            "stars": "3 stars"
        },
        {
            "comment": "I bought MOTO G 2nd gen on 10th july 2015, got the delivery on time but the product was faulty , Motorola technician came and told me that the fault cant be fixed and asked to return the product to flipkart. I did so and flipkart said they will replace it with a new one , which they did but the new moto g box was tempered. I refused to take it and asked them to replace it , they replaced it again and sent me a new phone but this time the packing was worst then before, seal broken and then to cover it a fake seal had been put which was not neat at all , a 1st class kid would tape it better then them. I again refused to take the product and finally after a month of trauma they refunded my money. I am highly disappointed with Flipkart for such a shabby deal. They should have a check on their vendors and make sure their customer gets unused phones and not the replaced products. When I contacted Motorola they said if moto g product has more then one colored strip on the box that means it had already been replaced by some other buyer and in both the cases boxes had 3 and 4 strips respectively. Please be aware of such frauds as you will be spending your hard earned money and I bet, you will not like a replaced product delivered to you.Unfortunately there is no Zero rating.",
            "date": "11 Aug 2015",
            "name": "jayant kumar",
            "stars": "1 star"
        },
        {
            "comment": "Very good from motorola. Very fast delivery by Flipkart. Overall very much satisfied with the phone and flipkart service.",
            "date": "11 Aug 2015",
            "name": "Vishal Garach",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 nd gen is a nice phone . i also refer to all of u to buy this phone . its really a awesomw phone",
            "date": "11 Aug 2015",
            "name": "muhammed hashim .h",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone 3 months back.....from 1 month it started making problems.....low battery backup is inherent drawback.....and then volume and power buttons started making problems....mow volume down button is gone.....worst thing is motorola service .....they are only to squeeze blood out of the customer....they say that phone is having issue with switch and we will change the whole motherboard.....which will cost you 80% of the cost of phone...... Therefore if you want harassment yourself then go for motorola.....",
            "date": "11 Aug 2015",
            "name": "Nitish Vishwak...",
            "stars": "1 star"
        },
        {
            "comment": "They delivered me a faulty device, when I requested for a replacement of that they couldn’t deliver to the requested address. After the first attempt, their customer care executive done from their end to make sure the deliver it to updated address. After 1 week when it came for delivery it went again to the old address. After 2 and half weeks this exercise, they understood there is a separate team handle this kind of escalation, they promised I will get a call from them and they will address this concern. They send me mail and messages promising date and time. After waiting 5 days, nothing happened. When I called back the executive, he saying the same story about of team. This time he saying 24 hours, but he doesn’t know what is the next course of action if it didn’t happens from them. After eating on my money, not even a single person shows any sort of responsibility. They just keep on pushing things… now it’s been more than a month I’m carrying a faulty product.",
            "date": "11 Aug 2015",
            "name": "Adersh RP",
            "stars": "1 star"
        },
        {
            "comment": "I have book the moto g (2nd Gen). this mobile with in time i have deliver. so i m so happy now.and service is too good.and easy to process now.",
            "date": "11 Aug 2015",
            "name": "Rohit Sarag",
            "stars": "5 stars"
        },
        {
            "comment": "Seems like Motorola did it again. Good job! Superb camera and water resistance affordable at this price... g3 rocks.",
            "date": "11 Aug 2015",
            "name": "Charul Varshney",
            "stars": "4 stars"
        },
        {
            "comment": "kitkat was fine, but lollipop ruined the phone very laggy & horriblr battery , battery drains very fast even on airplane mode almost 10% in an hour, even if all apps are closed & phone is on airplane mode",
            "date": "11 Aug 2015",
            "name": "Vineet Sharma",
            "stars": "2 stars"
        },
        {
            "comment": "I am a mobile phone enthusiast and have used multiple phones over time. Moto G 2014 is the best phone among them considering the stability and reliability. Since its a near stock version of android, things feel more optimized. Its fast and smooth comparing almost all other phones in that price range. Only negative factor about this product is its high SAR value.",
            "date": "11 Aug 2015",
            "name": "Dheeraj Dilip",
            "stars": "5 stars"
        },
        {
            "comment": "Main culprit is the 1gb RAM...Every problem I have due to this...It's just a average gadget in this price segment.",
            "date": "11 Aug 2015",
            "name": "Dhananjay Adhi...",
            "stars": "3 stars"
        },
        {
            "comment": "I have ordered this phone on 22nd June 2015 and in very first month my mobile screen got FADED, thanks to flip kart the have given me replacement but again same problem with this mobile screen start blinking while using Google chrome, phone get slow. I beg Flip Kart, if they replace my MOTO G2 with upgraded phone and i am ready to pay difference amount.",
            "date": "11 Aug 2015",
            "name": "MohammedNoor Bora",
            "stars": "1 star"
        },
        {
            "comment": "It does all i want it to do. I am not into gaming , battery lasts one day which is what i was looking for. The only thing i miss is no infrared , cant use it as a remote.",
            "date": "10 Aug 2015",
            "name": "Dheeraj Gurbani",
            "stars": "4 stars"
        },
        {
            "comment": "Would any one know how to set volume of Dialed number. I am unable to here the other call Please help me to set.",
            "date": "10 Aug 2015",
            "name": "Kavita N",
            "stars": "3 stars"
        },
        {
            "comment": "Few are below issues which i had faced. 1. Back side is burning - when i start using internet. Not sure when it will get burst. 2. Sometime the receiver of the call cannot hear my voice. I feel trapped & its a pathetic experience by purchasing a worst ever item from flipkart.",
            "date": "10 Aug 2015",
            "name": "Fazal Mohd",
            "stars": "1 star"
        },
        {
            "comment": "I opted for one day delivery as my previous phone died. I have been using the phone since a week. The phone is too good. its a definite go-go !",
            "date": "10 Aug 2015",
            "name": "shivendra rawat",
            "stars": "5 stars"
        },
        {
            "comment": "The first moto G2 bought by me faced technical issues within three months. namely, issues with unresponsiveness and lag. and a month later the same was totally unusable. Assuming that the issues were caused by my usage habits, i bought a second moto G2, which worked well for 5 months following which the phone suddenly switched off and would not start again. This time however, i took it to a moto care centre where they want me to change the Logic board. which they themselves claim is hard to replace and will cost about 80% of the price of the phone. However, the phone is still under warranty but the moto care centre says the logic board is not covered under the warranty. I have been hearing rumors of Flipkart selling low quality and even used phones to customers. after being a loyal customer for such a long time. I am starting to consider believing the rumors. Absolutely disgusted by the after sales by motorola. I agree that the phone is very good, but that. is only if it actually works. The warranty is truly namesake, The right thing for you guys to do would be to replace my device. It doesn't seem to be much to ask for. Regards, Vishwajeet Suresh.",
            "date": "10 Aug 2015",
            "name": "Vishwajeet Suresh",
            "stars": "1 star"
        },
        {
            "comment": "This is the first time I bought something from flipkart because people say it was good. But it is proved that online shopping is the biggest fraud business running now. I had bought a Moto G2 phone from you, that phone is not at a good make, I don't know if there is some manufacturing defect, it sometimes doesn't take signals, gets heat up, couldn't even play a nice game or watch a movie. I have tried to return that and again worst service. The website shows what is the progress what you are doing but guess what you guys are not actually not doing anything. I had tried to call so many times every time it's busy n busy and when you guys call you disconnect the call in 2 rings and when i ring back it doesn't connect. And finally today i get the message that it has been rejected. I now understood why people say don't buy from flipkart. I was so happy that I was getting a new phone and paid with cash. But, will never this to anyone.Now it's a waste phone. Best advice, never to online shopping, go to the store, see the phone, touch the product you want to buy and only then when you like it then buy it. Avoid Online Shopping.",
            "date": "10 Aug 2015",
            "name": "Raghav",
            "stars": "1 star"
        },
        {
            "comment": "moto g 2 gen is very poor battery not work properly battery not take load and very difculty face in battery backup",
            "date": "10 Aug 2015",
            "name": "purushottam kumar",
            "stars": "1 star"
        },
        {
            "comment": "Its not the best , its good only.. Brought one 2 months ago.Received with a Lollypop update. I'm not discussing abt the pros.. Almost every other users have discussed it by now.. I'm now sharing cons that I've been experiencing. > The phone lacks performance in its most basic feature, calling.. Its a little slow process when we try to call someone. > Apps can't be installed from sd card. I'm not experiencing any over heating prblm or battery drainage until now.. If u r a normal user with moderate browsing,gaming etc . This is enough.",
            "date": "10 Aug 2015",
            "name": "Sarang Dev",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome Phone, great features & wonderful delivery services from Flipkart. Thanks i am buying few more to gift my buddies.",
            "date": "10 Aug 2015",
            "name": "Dido Sen",
            "stars": "5 stars"
        },
        {
            "comment": "mobile has battery issues and hanging everytime for only 4-5 apps even though it is 16gb packed memory, sometimes some features are not working properly ,totally whole piece has issues.",
            "date": "10 Aug 2015",
            "name": "ajay sourav",
            "stars": "1 star"
        },
        {
            "comment": "Pro's: Camera & Picture quality Screen Size and ease of use with one hand. Con's: Charger - poor quality and takes hell lot of time to charge. Better use USB charging. Battery Backup Poor / cheap earphones in box. Audio output is low compared to other branded mobiles. Flip cover from Moto is pathetic... I guess flikart is china flips on this brand name... Really pathetic Initially you will not face problems, but on usage for months (6/7) u will start seeing that your mobile hangs and strucks frequently.",
            "date": "09 Aug 2015",
            "name": "VivekVardhan V...",
            "stars": "3 stars"
        },
        {
            "comment": "I was not expecting the product will be defective,as i am regular flipkart customer and having 100% faith on flipkart . I am expecting the positive response from you end",
            "date": "09 Aug 2015",
            "name": "Dr.Deepak",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone from Google.I love it specially it camera quality and very fast delivery...I will advice to go for it if you want to phone under 10000...........",
            "date": "09 Aug 2015",
            "name": "Charnjeet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "i have brought this phone for my mother as her birthday gift. Happy to hear that she was pleased and found no faults. The phone as an amazing boot up speed it starts in like 20-25 sec in avg. I found that the phone had no pre installed apps it was fully empty as for that dept. When i opened the pack the box contained only a replaceable screen guard with the tying other than that there was no screen guard his was not expected. Camera is exceptional the contrast and brightness is adjustable so not bad at all. takes practice to get some accurate stills. Sound is good pretty amazing and has good clarity, the ear buds provided in the box seem to do a fair job excellent for calls but not up to mark on music. so over all happie with the buy",
            "date": "09 Aug 2015",
            "name": "Akash S",
            "stars": "4 stars"
        },
        {
            "comment": "Great product, Met the expectation, camera is nice, touch is much better. User friendly and light weight",
            "date": "09 Aug 2015",
            "name": "rajni",
            "stars": "4 stars"
        },
        {
            "comment": "quality phone in better price....gud battery backup..rear camera was awesome...front camera not worthable",
            "date": "09 Aug 2015",
            "name": "Ramkumar IT",
            "stars": "4 stars"
        },
        {
            "comment": "this might not be a very useful rewiew ,but i am expressing my satisfaction on timely delivery and the usability of the product... by using it for one month i have not experienced any problem and is being appreciated for my new amazing phone from many..",
            "date": "09 Aug 2015",
            "name": "Gopakumar cs",
            "stars": "4 stars"
        },
        {
            "comment": "the moto g is not charging . please kindly replace the mobile phone. order no. - OD202947639797250800",
            "date": "09 Aug 2015",
            "name": "Ashutosh",
            "stars": "3 stars"
        },
        {
            "comment": "moto g 2nd generation to maintained good quality and relibility and durability and most attractive and capturing the indian market via flipkart",
            "date": "08 Aug 2015",
            "name": "Komirishetty S...",
            "stars": "5 stars"
        },
        {
            "comment": "Not working correctly after 3 months - Issue with battery, full charged battery even deplete within seconds. - Problems with APP, not compatible - Voice clarity of calls not good Taken to service centre....upset with phone...will not buy next time",
            "date": "08 Aug 2015",
            "name": "Mahinder Singh",
            "stars": "1 star"
        },
        {
            "comment": "from the first impression i am happy with the performance. value for money, handy design, look and feel perfect.",
            "date": "08 Aug 2015",
            "name": "Mahesh Nair",
            "stars": "4 stars"
        },
        {
            "comment": "not satisfied with motorola service and flipkart service motherboard faulty and the same not available with service center",
            "date": "07 Aug 2015",
            "name": "Harpreet Singh",
            "stars": "1 star"
        },
        {
            "comment": "The Phone is fantastic. The delivery was very quick and prompt. I have bought this phone for my father and he uses this smartphone very easily",
            "date": "07 Aug 2015",
            "name": "Venus Shah",
            "stars": "5 stars"
        },
        {
            "comment": "Slow, in fact, pathetically slow. Hangs when I stream YouTube through Bluetooth speakers. Can't handle apps like gaana. Never in my life have I been fed-up with my phone within months of buying it!",
            "date": "07 Aug 2015",
            "name": "Ankush Sethi",
            "stars": "2 stars"
        },
        {
            "comment": "Had the battery been of more capacity, this would have been the best phone in the market. G3 hopefully should not have this drawback. Having said that, its still an awesome buy if you dont want any stupid headaches from your phone. Pros outweighs cons by far. Happy to use this product.",
            "date": "07 Aug 2015",
            "name": "Tarun",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is not worth the money. You may get a new type of phone with cool looks, and Android 5.0.2 lolipop but to be specific it starts malfunctioning after 3 to 4 months. Screen becomes less responsive. Phone hangs frequently. camera looses clarity. RAM is not enough as per the phone functionalities. It should have been 1.5 to 2 GB. But yes one thing can be praised of it is that it handles 2 sim very effectivly. Also the speakers are designed much better and are loud & clear. Go for other options if you have instead buying this one. Overall Satisfactory!",
            "date": "07 Aug 2015",
            "name": "Apoorva Chitra...",
            "stars": "3 stars"
        },
        {
            "comment": "I bought the phone and after certain time of usage here is my feedback Cons: 1. Phone get extremely hot whenever multiple apps are active or data is enabled. It can be used of cooking Pros: Nice looks and feel. Good delivery.",
            "date": "07 Aug 2015",
            "name": "Rakesh Gulati",
            "stars": "1 star"
        },
        {
            "comment": "Superb Mobile but call quality is poor : This is my honest review on Moto G3rd gen Bought this phone with lot of expectations only to be disappointed!!! Although this phone seems to be a good package for 13K, after using it for 5 days, I felt I wasted 13K on this one. Call clarity is very poor and also there is buzzing sound in the background. It hurts when basic feature of call clarity itself is poor. I felt call clarity is far better in other low cost handsets compared to this one. Overall, I would not recommend this phone to anyone who is looking for good voice clarity. Advantages: Build quality Superb Camera superb Battery back up Good",
            "date": "07 Aug 2015",
            "name": "Vineet Shukla",
            "stars": "3 stars"
        },
        {
            "comment": "Writing this review after 6 months of buying.. The phone has become sluggish now and the battery life is bad.. I feel the screen and camera are the best part in this phone.. Gorilla glass is handling the minor scratches well. no visible scratches so far on the screen.. Descent speakers .",
            "date": "06 Aug 2015",
            "name": "Biju",
            "stars": "3 stars"
        },
        {
            "comment": "I am having the impression of Moto G which is very good phone but G2 really disappointed me and found few bad experiences. after 2-3months 1. while in the call, the device is getting over heated (might be battery part) 2. Touch sensitivity is bad and some time it will not work, need to reboot it again. 3. I had bad experience while browsing battery is draining, even phone is fully charged in the morning. 4.i charging my phone full after 1hr the battery icon shows 1%, after reset your phone your battery %is shows 60%..(sometimes)",
            "date": "06 Aug 2015",
            "name": "pradeep",
            "stars": "1 star"
        },
        {
            "comment": "Mobile is overall good as this was my first motorola phone, but the battery needs to be charged twice in a day...so if I am out for a day need to think twice on using my data pack or else the phone is dead end of the day. So one star less..... Second star less as I received a faulty piece first from flipkart when ordered was delivered and had to return it back... I suggest motorola should also provide a USB charger instead of direct attached cable so we can charge it from laptop.",
            "date": "06 Aug 2015",
            "name": "AD",
            "stars": "3 stars"
        },
        {
            "comment": "good phone at this price point of 10000, buy with confident. Good camera quality in day time, attractive design and latest OS",
            "date": "06 Aug 2015",
            "name": "DrMithilesh Nayak",
            "stars": "4 stars"
        },
        {
            "comment": "1- phone has got good body and its back panel gives you a holding grip ... 2- next is its battery ..battery backup is good... 3- beacuse of 1 gb ram phone is superfast . 4-moto has worked very fine 5- yess camera is what i was waiting for .. camera quality is superb ...i took the photos use the flash ..& the front camera is also good 6- processor is good and i think lag problem with big heavy games willl end",
            "date": "06 Aug 2015",
            "name": "laliteswar",
            "stars": "5 stars"
        },
        {
            "comment": "I USED THIS MOBILE FOR 5 MONTHS NOW MY MOBILE IS IN HYDERABAD SERVICING CENTER. ACTUALLY, I AM FROM KAKINADA I GOT A PROBLEM TO THE MICE I SHOWED IT RAJAHMUNDRY THEY DIDNT RESPONDED WELL AFTER COMPLAINING THEY GAVE ME MY MOBILE BACK IAFTER ONE WEEK AND NOW MY MICE IS COMPLETELY GONE I WENT TO HYDERABAD AND GAVE MY MOBILE TO THEM THEY YOUR PHONE MOTHERBOARD GONE AND THEY TELL ME WE WANT 2 WEEKS OF TIME NOW I DONT HAVE MOBILE PHONE.I ONLY BOUGHT 5 MOTO G 2ND PHONES TO MY FRIENDS NOW I AM FEELING VERY BAD ABOUT WHAT I HAVE DONE",
            "date": "06 Aug 2015",
            "name": "Ravi Raj",
            "stars": "2 stars"
        },
        {
            "comment": "nice phone. but got ruined once updated . Now there are more better options are available like in samsung which are pretty better than this , in this price range only & also now they had launch moto g3 which is a far better option to go for. ALL ANDROID PHONES ARE SAME. SUCKS AFTER ONE YEAR GO FOR IOS ITD BETTER THOUGH ITS EXPENSIVE",
            "date": "06 Aug 2015",
            "name": "MUKUND MADHAV",
            "stars": "2 stars"
        },
        {
            "comment": "Touch screen is not working and the assistance given is no use. Say no to flipkart in mobile online.",
            "date": "06 Aug 2015",
            "name": "Deepak",
            "stars": "1 star"
        },
        {
            "comment": "Got damaged in 1 month 1 week, horrible customer care, now neither i can return nor can i repair. total waste.",
            "date": "06 Aug 2015",
            "name": "Anjani Prasad",
            "stars": "1 star"
        },
        {
            "comment": "not fully Satisfaction this product, poor battery backup.. hanging problem etc. i am disappointing this product...",
            "date": "06 Aug 2015",
            "name": "Farhan Sheikh",
            "stars": "2 stars"
        },
        {
            "comment": "Excellent phone. Wonderful buying experience from Flipkart / WS Retail. Very good phone at this price range. I love the stereo speakers in front.",
            "date": "06 Aug 2015",
            "name": "Krishnamurthy...",
            "stars": "5 stars"
        },
        {
            "comment": "To be frank there is something happening in the product manufacturing side. After 30 days correctly the problem starting Display problem Not able to view the display once the screen is locked by power button. And very high heat emmission in the speaker side. Worst situation to handle. Very much disappointed. Bye",
            "date": "05 Aug 2015",
            "name": "NAVIN THANGAVEL",
            "stars": "1 star"
        },
        {
            "comment": "when compared to other android mobiles, moto g2 is very best, as it is very hard and it can resist from cracks formation.",
            "date": "05 Aug 2015",
            "name": "Santosh Gullipalli",
            "stars": "5 stars"
        },
        {
            "comment": "Worst Mobile; No Battery life , less than 12 hours. Most of the features not there which is available in the 5233 Hangs Internet is major issue, an exclamatory icon comes near network and then it does not try to re-connect Some times complete networks goes off for 1 or 2 mins and comes back later. As i have turned on the missed call alerts daily i get 2 to 3 alert saying they tried reaching you. That means that network was not getting captured properly by moto g2 Dont think its network issue, because i am using Airtel. Totally a worst mobile , better to buy honor mobiles",
            "date": "05 Aug 2015",
            "name": "Ashwath",
            "stars": "1 star"
        },
        {
            "comment": "Complete value for your money and excellent features at this rate... We love this product. UI is simply superb!",
            "date": "05 Aug 2015",
            "name": "AppajiRao PVS",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone based one of my friends recommendation,as he is using this phone for last 9 months.I placed the order on 8th July and received the item on 14th July.From the next day morning itself issues started.In the morning,the phone display was not turning ON even if i press the power button,but the notification light was blinking and I tried to call to this mobile from my friends no.The phone was ringing but the display was not getting ON.I forcely rebooted the phone to turn on the display!!. I thought that it was due to some settings problem and I approached the friend who is having MotoG2 phone.I tried to find the setting issue all the settings in my phone was same as his phone..We restored the factory settings according to the instructions from Motorola customer support team...but the problem still persists..so I requested for replacement on 5th August and waiting for reply from the flipkart.Another issue which i have noticed in my phone is the speaker noise while we calling..there is some disturbing noise in my phone while we calling.It is also getting heated during calling.",
            "date": "05 Aug 2015",
            "name": "RAJEESH R",
            "stars": "1 star"
        },
        {
            "comment": "Product packing is very good and i am very much satisfied with this product. Flipkart service was excellent because i got this product in just two days even though i ordered through CASH ON DELIVERY option. Thanks flipkart for your good service....",
            "date": "05 Aug 2015",
            "name": "Suresh Kumar T...",
            "stars": "5 stars"
        },
        {
            "comment": "I am using Moto G (2nd Generation) for last 6 months. It is very good product. Value for money. It is only little heavier than other equivalent products.",
            "date": "05 Aug 2015",
            "name": "Kalyan",
            "stars": "4 stars"
        },
        {
            "comment": "mobile is very good and its having a small problem that after the battery comes to 30% within few seconds it shows 1%.",
            "date": "05 Aug 2015",
            "name": "Jai Jai Krishnan",
            "stars": "3 stars"
        },
        {
            "comment": "It has everything that one might want to have in an Android phone. Also the look is very sophisticated. 1 GB RAM is the downside but thats fine too. I got it for 8000 in exchange for my Micromax Doodle phone. BTW I have switched from my iPhone 5S and made this my Primary Phone as we all fought for Freedom long back and you are never free with an iPhone. In fact, in my opinion you pay apple a huge amount only to be enslaved by them. In this price range it is the best phone, in fact even people who have budget for 15K should by this one on the 3rd generation.",
            "date": "05 Aug 2015",
            "name": "Chandan Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "First of all, i'm very happy with the service of flipkart, in-terms of their speedy & safe delivery of the product, \"guys you rock!\". And secondly about the phone, this is one of the amazing phone from Motorola, well versed with all the android features which would definitely enhance your smart phone usage experience. This phone comes preloaded with Lollipop version of android which lets you experience the rich features of all the Google products. The only thing i regret is, flipkart launched the Moto g3 version right after i bought Moto g2, \"Damn it!\". Never mind, i'm cherishing my moment with this new phone. Last but not the least, flipkart, keep on doing the good work. Thank you.",
            "date": "05 Aug 2015",
            "name": "Sharan Thalange",
            "stars": "5 stars"
        },
        {
            "comment": "I want to give 3.5/5 but thats not an option so 3 Its almost 4 months since I am using this phone. U can rely on my opinion though I am not an expert but an avid user of smartphones and a techno geek and have used mobile with almost all platforms Windows, Android and IOS. So heres the review for Moto G 2nd Gen - 1. Looks: Awesome. 2. Battery : Lasts only 12-14 hours with normal usage (whatsapp, games, internet surfing, etc) 3. Camera Rear: Very Good for outdoor photos with sufficient lighting, but not very good in dim light. The in-built camera app is superb, has manual focus, HDR, panorama. 4. Camera Front : Perfect for selfie (who needs 5MP for selfie this 2MP is enough) 5. Performance : LAGS A LOT. U load it with apps and it will start lagging. The 1GB RAM cant do much work I guess. Also I think its not the phone but the Lollipop Android OS which makes it slow. 6. Display : Superb. Amazing picture quality. Watch HD videos u will enjoy watching it on G2 7. Built : Very well built. U can always trust Motorola for its strong hardware (just like Nokia). It fall down twice or maybe thrice but this Corning Gorilla 3 with Scratch proof Glass is superb nothing happened not even a scratch. Conclusion : For normal mobile usage (girls and elders) G2 is the best smartphone in this price range, but if u are an avid user (tech savvy guys like me) then better go for Moto G 3rd Gen.",
            "date": "04 Aug 2015",
            "name": "Pratik Pattewar",
            "stars": "3 stars"
        },
        {
            "comment": "Dear sir, pls dont buy a moto g 2, its very hanging, battery is very tempered above 48 degree using a camera.. this is my second mobile flipkart (moto g 2) the new mobile also again the same problem..... Flipkart again sending the 3 mobile.",
            "date": "04 Aug 2015",
            "name": "Venkatesh Venkat",
            "stars": "1 star"
        },
        {
            "comment": "i wants to exchange this mobile to moto g 3rd generation..so how can i do that?and i have alll accessories in tip top working condition..and no damage to my this moto g 2nd generation..so please tell me that how can i exchange this mobile..?as soon as possible..",
            "date": "04 Aug 2015",
            "name": "Kishan Dalasaniya",
            "stars": "3 stars"
        },
        {
            "comment": "The phone and the features are good but there is a bright white sopt on the top-right side of the display. Was it checked before delivering ?",
            "date": "04 Aug 2015",
            "name": "Preeti B",
            "stars": "4 stars"
        },
        {
            "comment": "Best competitor for Google phones with all stock features and also contains additional features of Motorola .",
            "date": "04 Aug 2015",
            "name": "pravsp12",
            "stars": "5 stars"
        },
        {
            "comment": "I had an issue in mic initialy but they checked in smart check and the report it it 100% good . again I face the same problem . but they refuse it replace again . after that i provide it to moto gservice center but they said internel board damaged we need to replace .but flipkart cant aceept it so please aware to buy costly mobile in flip kart rating :0",
            "date": "04 Aug 2015",
            "name": "Arun R",
            "stars": "1 star"
        },
        {
            "comment": "Excellent product at affordable price. Pros- Looks,Display, Camera, Scratch resistant screen,Android Lolipop without lags. Cons- Charging time is long, charger is not great, 1 GB RAM sometimes lags a little",
            "date": "04 Aug 2015",
            "name": "Dr. Snehashish...",
            "stars": "4 stars"
        },
        {
            "comment": "very good product within 10k...",
            "date": "04 Aug 2015",
            "name": "Apa",
            "stars": "5 stars"
        },
        {
            "comment": "PHONE FEATURES ARE VERY NICE WORK PROPERLY CAMERA IS AWESOME BUT IN NIGHT THE FLASH IS REFLECT ON ACTUAL PHOTO DISTRUB THE CLEARITY OF PHOTO. WE CANT DELETE THE CONTACK BY MARKING, :(",
            "date": "04 Aug 2015",
            "name": "jacky jones",
            "stars": "5 stars"
        },
        {
            "comment": "The Best phone i gould get in a budget of 10k. Dropped it on the very second day of purchase haha. The screen is a lil delicate than i thought the Gorilla glass to be, it got a tiny kink immediately. I used the phone without a memory card for a week, it was slowing down but once I put in a 16 gig card it was all super fast and smooth. The phone still slows down a bit now and then maybe i need to empty cache and delete some pics. but a great phone, haven't tried the waterproofnees yes, but id recommend.",
            "date": "04 Aug 2015",
            "name": "D_PAKBMX",
            "stars": "5 stars"
        },
        {
            "comment": "thanks to flipkart for one day delivery but paying extra Rs 90. the moto g2 is awesome phone...i love to shop from flipkart and using an extraordinary low budget from motorola,,,thank to motoro for making such type of devices",
            "date": "04 Aug 2015",
            "name": "Sarfaraz Habib",
            "stars": "5 stars"
        },
        {
            "comment": "camera and screen clarity is good, but i got a defected piece where i didnt .",
            "date": "04 Aug 2015",
            "name": "screen defect",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto-G 2 gen for my mother. She started using it after 15 days of delivery. From 2nd day onward, this phone started behaving abnormally. Its touch is is not working. Also it hangs for hours, even my mom is unable to restart it. Sometime the whole screen goes blank. Initially I told my mom that this may be some temporary issue and will be solved after restoring the phone to factory settings, but even after that the phone is kaput. I have raised a request for replacement of the phone. Its almost more than a week, but there is no progress. Initially some technical expert from Flipkart contacted and told that they will do the debugging and asked to install some software but after that nobody contacted, then someone from Flipkart called and told that they will be delivery a new phone and will take back the old one. Afterwards there's no progress, nobody is contacting us. This is really unprofessional behavior from Flipkart's end. I have bought so many phones earlier from Flipkart and there war no issue in delivery, but now when they have exchange the phone, they do not bother to contact the customer. This is really worst experience which I have faced while using e-commerce online service.",
            "date": "03 Aug 2015",
            "name": "Hem Tiwari",
            "stars": "1 star"
        },
        {
            "comment": "heating issues guys.............. i brought this product in last 20 days back. flipkart does not response for this issues",
            "date": "03 Aug 2015",
            "name": "Anil Nemagond",
            "stars": "3 stars"
        },
        {
            "comment": "I've been using the Moto G for quite sometime now and feel its an overall value for money product. I'd recommend looking for other options in the same price range, if you wish to use multiple applications simultaneously, since the phone starts to hang a bit. That is obvious with a 1GB RAM though. Otherwise the usage is pretty smooth with a decent look and feel. Go for it if you're looking for a budget phone with the latest version of Android and a good customer service response. Cheers!",
            "date": "03 Aug 2015",
            "name": "Shobhit Srivas...",
            "stars": "4 stars"
        },
        {
            "comment": "Bought the phone in March 2015. Mother board crashed within 2 months. It was replaced by service centre free of cost due to warranty period. Even then it still has problems. It hangs all the time & it does not recieve any signal, due to which the sim card needs to be removed & put back all the time. As the mother board crashed, all data, including songs & photos got erased. Unable to recieve calls!! Called flipkart and they cooly said that as the 30 day replacement period is over, nothing can be done about it. No help from their side! Bought it at Rs.12000/-. DO NOT BUY THIS PHONE, IT IS TOO OVERHYPED!!! Have a Samsung A7 & it is an awesome phone!!! Giving a 1 star as I have to give a rating. Otherwise is it zero!",
            "date": "03 Aug 2015",
            "name": "Vrinda Ganesh",
            "stars": "1 star"
        },
        {
            "comment": "moto g2 is impressive when it comes on camera but battery is the real pain. Takes longer than usual to charge and discharges easily as well. Touch is not effective while charging which reduces the usability while it is getting charged. Have been using samsung from last 4 years and feel that moto lacks behind in touch and battery.",
            "date": "03 Aug 2015",
            "name": "Shruti",
            "stars": "2 stars"
        },
        {
            "comment": "Plus ******* Touch and Display Camera Minus: Battter is too poor. ============ Takes more than 6 hours to full charge and drains very fast(less that 5 HRS in 3G) Network connectivity =============== No 3G only option available. Not possible to have a 3G good experience in this phone. Intermittently switches to 2G and , not possible to use 3G inside Home/Office",
            "date": "03 Aug 2015",
            "name": "Sanjay",
            "stars": "1 star"
        },
        {
            "comment": "very good product and it is very stylesh phone its very easy to use alos but battry power is tittle bit less please improve that if u do its best for ever",
            "date": "03 Aug 2015",
            "name": "akhil",
            "stars": "5 stars"
        },
        {
            "comment": "please don't buy this phone voice quality is too poor while calling in same network, gaming experience is worst front camera is not up to the mark worst phone by Motorola",
            "date": "03 Aug 2015",
            "name": "kedar",
            "stars": "1 star"
        },
        {
            "comment": "wrost phone ever.... i got damage phone from flipkart after so may try they replace my phone. i was happy but bad luck for 2nd time. once again i got damage phone. bad service.",
            "date": "03 Aug 2015",
            "name": "Raj Solanki",
            "stars": "1 star"
        },
        {
            "comment": "hi dont buy this battery backup is very bad. Please improve this on battery. Motorola is making money by launching with versions by changing small features.",
            "date": "03 Aug 2015",
            "name": "vitthal",
            "stars": "3 stars"
        },
        {
            "comment": "I had received the Moto G phone with the a defective charger. I asked for the new charger, but the Flipkart refused my request, and just returned Rs.400 to my wallet (which can be used only buy stuffs from WS retail!!!), as the cost for the charger. I may get a charger for Rs 400 from any local manufacturer (from the Flipkart web itself), but I feel cheated because I prefer to have a charger from the same Moto G, which generally cost more than 1000. And it is not even available to buy. I have been a frequent buyer from Flipkart, and now began to look for other online sellers. The message I got from Flipkart. \"Replacement (Return ID: 25252921) - REJECTED We're sorry. We are unable to process your replacement request. Reason : The seller has provided you with an alternative solution to your problem. Please refer to flipkart return policy\"",
            "date": "03 Aug 2015",
            "name": "Sukumar Vellakkal",
            "stars": "2 stars"
        },
        {
            "comment": "Had ordered this for my friend and flipkart delivered efficiently as usual. Opted for standard delivery and was delivered in 5 days. No issues with packaging or product as such.",
            "date": "03 Aug 2015",
            "name": "Umesh Dewal",
            "stars": "5 stars"
        },
        {
            "comment": "I bought Moto G 2nd Gen on April and its working good Camera 8MP very good, memory 16 gb its not 16 GB its 12.79 GB Overall moto g 2nd gen is nice phone but battery 2070 mah is not enough",
            "date": "03 Aug 2015",
            "name": "Vineet Vanherte",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile screen is bad, speakers are not working properly , charger is defective piece. please don't buy products which we can get on exchange. and the customer care ppl are so slow, i lodges complaint of Thursday till today its not resolved. Flipkart please buck up",
            "date": "03 Aug 2015",
            "name": "Lakhitha",
            "stars": "1 star"
        },
        {
            "comment": "1. dont buy it, i just sold it from the 15 days of my purchase 2. \"No Return\" option in flip-kart. they told they can only exchange if there is any exact issue. 3. Battery was charging very slow, i think the problem is with charger. 4. headphones were worst.",
            "date": "03 Aug 2015",
            "name": "vidya sagar",
            "stars": "1 star"
        }
    ]
}
