{
    "filpkart": [
        {
            "comment": "I am Bought the Moto G, it is Very Nice phone, good Camera, Good battery backup & upgradable to lollypop version, Thanks for Flifkart",
            "date": "11 Apr 2015",
            "name": "Mohan Raju",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd is a wonderfull product. You can feel the genuine android only in motorolla with this lowest price.",
            "date": "11 Apr 2015",
            "name": "RIDHAM GAJERA",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Motog2 around 6 months back ..works very well,,no lags even when you playing games like Fifa15,Nova 3....Thanks to motorola....Leader of Android Phones",
            "date": "11 Apr 2015",
            "name": "prateek mishra",
            "stars": "5 stars"
        },
        {
            "comment": "No doubt this product is again a great hit from Motorola. As being Moto G(1st Gen) owner I see this thing as a fully packed package. You get exactly value for money product without compromising quality. Till now faced no issues or problems works like a charm.",
            "date": "11 Apr 2015",
            "name": "Apoorva Rai",
            "stars": "5 stars"
        },
        {
            "comment": "there was offer as we get 1 gb data for 2 month on airtel while buying moto g 2nd gen but i dsidnt get",
            "date": "11 Apr 2015",
            "name": "apurva jha",
            "stars": "2 stars"
        },
        {
            "comment": "Pros: Firstly Thanks to flipkart for delivering the product much before than its delivery date... Secondly,The Build quality of MOTO G is excellent,it looks like a premium quality phone when you see the initial impression Thirdly,It is a stock android phone which you would expect to get upgraded Android L(lollipop) Finally,Adding SD card slot which is a major upgrade observed in moto G2 Cons: 1.During the peak volume,the speakers produce a distorted noise 2.Slow charging & not happy with moto charger & avg head phones 3.Fast discharging(After Android L update) need to keep overnight charging & battery backup would be hardly from 22 hrs to 24 hrs. 4.over usage of Apps (esp Asphault 8 & other bloatware apps)causes too much heat at the back side of the phone. Considering overall aspects I would strongly suggest moto G if you are looking for a mid range budget android phones.",
            "date": "10 Apr 2015",
            "name": "MLP NITHIN",
            "stars": "4 stars"
        },
        {
            "comment": "Great Product.... must by this..... I Am using this phone for 6 months, but still now no any single issue\\problem occurred with mobile... and it is compatible to all updates given by google.... Really I love my phone.....",
            "date": "10 Apr 2015",
            "name": "Ganesh Ingle",
            "stars": "5 stars"
        },
        {
            "comment": "The battery back up of this mobile is just useless it drains fast... the next minus point is screen glass.. this mobile slips down from my pant pocket and totally broken and i went to service center they told that it costs 6750/- ( i just shocked) and told that screen glass not covered in warranty... Many Many times my old smartphone LG optimus Hub slips down but never broken till know thus the quality of Gorilla glass which given by LG... Those who are ready to purchase this mobile please think one more time....",
            "date": "10 Apr 2015",
            "name": "HEBBARE MUNI V...",
            "stars": "1 star"
        },
        {
            "comment": "It's a very nice product, but little slow after being upgraded to lollipop. Apart from that 5 * for speakers, display, picture quality (try in the presence of sun light) reliable, durable. Replaceable back cover and it's vibrant colors makes it more sexier..............",
            "date": "10 Apr 2015",
            "name": "Vasanth S R",
            "stars": "5 stars"
        },
        {
            "comment": "Pros -5\" display -front speakers are loud n clear -connectivity issue solved -8MP camera takes amazing pictures -micro SD slot up to 32gb Con's -No cons for now",
            "date": "10 Apr 2015",
            "name": "Prathmesh Verekar",
            "stars": "5 stars"
        },
        {
            "comment": "I'm using my moto G 2nd generation for months. I have updated to lollipop. I am at present facing a problem with screen flickering on a continuous basis. This does not happen in lock screen. It still happens in safe mode as well...",
            "date": "10 Apr 2015",
            "name": "Amith..",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought this phone 2 months back. Phone over all is good but my charging port is not working properly. It is like i have to adjust it many times then it will start charging. Don't know the problem is with hardware or what?",
            "date": "10 Apr 2015",
            "name": "parveen kacktwana",
            "stars": "4 stars"
        },
        {
            "comment": "At this budjet this phone is so good.Good speed , no lagging in processing , Camera quality is very good,audio sound is so clear and loud.Good one at this budject......... SO GO FOR IT.......",
            "date": "10 Apr 2015",
            "name": "Smarak Sovan",
            "stars": "5 stars"
        },
        {
            "comment": "This product was delivered quickly and in mint condition. But then this is to be expected as it was from WS Retail. The phone itself holds up pretty well. Its robust and seems durable. Have already dropped it a few times, and have only noticed a slight scuff in the middle. This was the result of the phone falling face down on to the floor of an auto rickshaw. Yet the phone behaves as expected. It was slightly unresponsive from day one though, but this I attribute to the phones designs flaws and not an actual defficiency with the product sold.",
            "date": "10 Apr 2015",
            "name": "Varun",
            "stars": "5 stars"
        },
        {
            "comment": "i was very excited b4 purchasing it ..bt after purchasing i felt so many problems with this mobile..there is no one who can resolve my issue neither flipkart nor motorola....such a bad",
            "date": "10 Apr 2015",
            "name": "Rajeev",
            "stars": "2 stars"
        },
        {
            "comment": "i m buy this phone in Dec 2014. best feature of this phone is(1) camera quality (2) inbuilt 16 GB (3) look wise 4 star. some bed phone in (1) battery life not good i give you 3 star only (2) phone hang some time. over all is best in Rs 13000. it worth.",
            "date": "10 Apr 2015",
            "name": "umang",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent Phone with all the features you wan't in it. Display Music & accessibility is good. Music might be a bit more better but it's fine. The major demerit of Moto G2 is it's battery.Everything is fine except battery back up. All in all excellent value for money & Rs 13000 best phone in this category with Lollipop update.",
            "date": "10 Apr 2015",
            "name": "Siddhant Ray",
            "stars": "5 stars"
        },
        {
            "comment": "battery goes off really fast. sometimes, even when the phone is untouched the battery comes down in few seconds.. finally dead! just the battery is an issue in this or else the phone is really nice!! :) so i ll rate it 3.5 out of 5",
            "date": "10 Apr 2015",
            "name": "kajal raghuwanshi",
            "stars": "3 stars"
        },
        {
            "comment": "I was very pleased with the handset that I have received. I have been using it for quite a while now and I am very satisfied with it. The only issue is the persistent lag in the phone over a period of time but that is the Android 5.0.2 issue which will be fixed once the 5.1 update comes out. Overall the battery life and the camera picture quality is quite good for a phone at this price range.",
            "date": "10 Apr 2015",
            "name": "Sushant Rawal",
            "stars": "5 stars"
        },
        {
            "comment": "Working really well from couple of weeks. great product in great price.Happy to have it. product nailed all features provided.",
            "date": "10 Apr 2015",
            "name": "Sumit Bisht",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is overall good in its range. Cons (specially with its accessories): 1) No laptop connector with mobile. 2) Charging time is very high, preferred to buy another high power charger. 3) Charger is of very low power, means (Output: 550 mAH, which is equivalent to Nokia Base model charger), that makes it heated always.",
            "date": "10 Apr 2015",
            "name": "Rohit",
            "stars": "3 stars"
        },
        {
            "comment": "good and excellent product. no negative impacts on the seller ad a well as the product purchased from his shop. thanks for the quick resonse",
            "date": "10 Apr 2015",
            "name": "karthik",
            "stars": "4 stars"
        },
        {
            "comment": "hey guys moto g is water resistant. the meaning of water resistant by motorola people is it can resist only 1 or 2 drops of water. not more than that. if it is more that 2 drops they are not responsible. my mobile accidentally fell in water and within 3 seconds i took it out. and now it is not working. screen is k but touch is not working. moto service centre guy said both touch and mother board damaged. need to replace those 2. it means except cover everything wil be new in mobile. and it costs 6000 /- for changing those. so guys plz beware against water.",
            "date": "10 Apr 2015",
            "name": "balakrishna pr...",
            "stars": "2 stars"
        },
        {
            "comment": "This is first android phone for me and is very userfrienly and fast in response. But one thing found was the battery which drains faster when use. For eg. if it is 60% and when we browse or see something in phone its battery reduces per minute 45 %, 40% slowly slowly reduces. Battery life still to be improved in MOTO G2.",
            "date": "10 Apr 2015",
            "name": "Libith Whitley Lazar",
            "stars": "2 stars"
        },
        {
            "comment": "Nice phone with good camera. Processer , RAM all are good. Little bit battery is concered with moto g 2nd gen. Delivery timing of flipkart is amazing.",
            "date": "09 Apr 2015",
            "name": "RAJU YADAV",
            "stars": "3 stars"
        },
        {
            "comment": "Kudos to Ekart I got this item in 2-days very fast service and awesome product. Keep up the good work and plz give proper training to your CSA",
            "date": "09 Apr 2015",
            "name": "Shantanu Sinha",
            "stars": "5 stars"
        },
        {
            "comment": "this is a best mobile every i used. I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's",
            "date": "09 Apr 2015",
            "name": "Nikhlesh Jhawar",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone since 8 months no lagging supports everything good voice clarity got lollipop update very fast good look all over 5 star",
            "date": "09 Apr 2015",
            "name": "Ravi",
            "stars": "5 stars"
        },
        {
            "comment": "NICE PRODUCTS AND NICE PHONE DUAL SOUND VERY GOOD EVERYTHING IS NICE IN THIS PHONE AND DISPLAY IS GOOD ALSO NICE PHONE",
            "date": "09 Apr 2015",
            "name": "Sonu Saini",
            "stars": "5 stars"
        },
        {
            "comment": "very good looking phone with good hardware. phone software is awesome. performance is very nice but battery is very poor.",
            "date": "09 Apr 2015",
            "name": "vikas kumar",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased moto G 2nd Gen, on 17/03/2015 and am facing an issue in mobile data connection which is getting switched on automatically. I have complaind regarding same on 29/03/2015 and have followed all the steps instructed and still my concern is not resolved. Now Flip kart expects me to visit a service centre which is not near by and they have clearly DENEID to take the product back or do a exchange or pay back when there is a issue in my mobile. So friends my question is why sholud i take a brand new mobile to a service centre to get the confirmation. Video posted is the proof. Still they are least bothered to resolve my concern where i never wanted a exchange but only to get my concern resolve and they have completely failed in doing so. Flip kart has made my days worse and disgusting and the customer support OMG they know only one line \"Please conctact service centre\". Is the producted delivered by Flip Kart to me is a fake one and thats the reason i guess they are denying. It can happen with you make your choices wisely.",
            "date": "09 Apr 2015",
            "name": "Vsrmadhan Vsrmadhan",
            "stars": "1 star"
        },
        {
            "comment": "It is the best mid range phone in the market. HD quality is awesome. speed is fantastic while browsing internet.",
            "date": "09 Apr 2015",
            "name": "Motog",
            "stars": "5 stars"
        },
        {
            "comment": "Good Phone in this category. Pros: Display is good Camera is ok Speakers Are good. Cons: Built quality is not good. Plastic feel.",
            "date": "09 Apr 2015",
            "name": "Sohail",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 i received having a manufacturing defect then i gone for a replacement request and after so much calls and verifications my replacement request was accepted.i am to say So So thanks to flipkart for their understanding ...............they replaced my moto g2 and ultimately i received a good one. No doubt 5 stars are not enough for Flipkart & Moto service. ....................Thanks buddy.",
            "date": "09 Apr 2015",
            "name": "Anand Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Good one obviously but in my mobile memory card is not working, i don't no why and charging is not so good.",
            "date": "09 Apr 2015",
            "name": "Chennuri Satwik",
            "stars": "3 stars"
        },
        {
            "comment": "i got this product only one day after order. I hats off to Flipkart every person for their great work. such a nice service. considering this Moto G2 product , I am new user for smart phone. i don't know any knowledge in smart phone. this phone is like .............. great thing. considering all my friend there review it an every brand mobile killer. its any ow-some product, so many friend now using moto g2 , now every one waiting for moto G3 product.",
            "date": "09 Apr 2015",
            "name": "shashikumar",
            "stars": "5 stars"
        },
        {
            "comment": "The device worked quite well initially as expected. Installing lollipop, however, has brought a lot of pains. Battery consumption has gone up drastically. The phone hangs at times. Display goes off while switching between apps for a moment. There are some android specific bugs too, like the alerts don't open the app when the phone is being used. So you have to manually open the app. Same way when you get a call while using the phone, you get the notification on the top, but tapping on it doesn't do anything. I have to lock the screen, wait for the normal call reception view to come up and then receive the call. Also the phone hangs in the middle of continued usage. On the good side, battery consumption while talking to someone is very less, speakers are very loud and still clear, display quality is good and although the screen is broad, the phone is still very handy.",
            "date": "09 Apr 2015",
            "name": "Shryans Mittal",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased a Redmi note and Moto G 2nd Gen almost the same time period.. Any day Moto G is better.. Redmi is having so many complaints.. Specialy with the screen. I have a yellow tint on the screen of my redmi.",
            "date": "09 Apr 2015",
            "name": "mel",
            "stars": "5 stars"
        },
        {
            "comment": "I've been using this phone since 5 days and it's good. But, the Ear Piece gives a cracking/bursting sound and is not clear.",
            "date": "09 Apr 2015",
            "name": "Subramanyam Pa...",
            "stars": "4 stars"
        },
        {
            "comment": "After using this phone for 3-4 days i am giving this review. I dont talk about the spec.that you can see from flipkart..The most exiting thing about the phone is i got the latest lollipop version out of the box. Experience: 1) No Lags during Gamin and multitasking. 2)Camera lens is better in this price 3)In low light condition it works good too. 4)16 Gb internal is quit enough 5).Dual speaker works good. 6.)Processor speed is not bad 7)No unnessecery apps is preloaded. Overall Good Phone on This Price",
            "date": "09 Apr 2015",
            "name": "Review is impo...",
            "stars": "4 stars"
        },
        {
            "comment": "I'm hardcore phone user I used to play HD Games, 3G/Wifi Connectivity 24x7, App Test etc...I purchased MOTO G2 during APP Sale, luckily I got it in INR 9899/- :) and product delivered to me before time...Flipkart Service is awesome 5/5...now about the phone I'm using phone from last 10 days without any lag playing games like Asphalt 8: Airbone, Modern Combat 5, Real Racing 3, Overkill 3, Subway Surf, Temple Run Oz(on high graphic), BB Racing etc and believe me game performance is AWESOME on GPU Adreno 305, 450 MHz Single Core games running smoothly but in Modern Combat 5 there is bit lag very low that you can't even notice...I had installed 50+ Apps most of the app are battery draining app like KIK, MESSENGER, WECHAT etc then too am getting battery backup of 16-18hours using 3G/Wifi Service...TILL NOW NO LAG, NO BATTERY ISSUES. Moto G2 camera is doing decent job video quality is perfect no one can get better in this price range. The only reason I'm giving 4 star is that cheap accessories Charger(Piece of shit take 4 hours to completely charge 2070mAH battery and worst thing is that if you're using phone while charging your phone won't get charged if you're using box charger WTF :x), Headphone worst quality I can better headphone is just INR200, and last there is no USB Cable in the BOX. NOTE (MUST READ): At the starting i was having battery issue like battery percentage was not accurate like battery percentage get stuck at 80% and remains to 80% for 2-3hours then suddenly drops to 51% ...also battery was draining quickly so i performed some tweaks to get better battery life ... 1. I cleared Cache Partition on my device 2. Calibrated Battery 3. Disabled Google Apps which are of no use. Now am getting 16-18hours battery backup. Cons: 1. Low Battery only 2070mAh for 5inch screen 2. 1GB RAM :( i need more 3. Low light camera performance",
            "date": "09 Apr 2015",
            "name": "Awaara",
            "stars": "4 stars"
        },
        {
            "comment": "Delivered in 3 days... Its a beast phone guys... don't go for cheap phones with great specs go for motorola's any mobile...because all of them are great...",
            "date": "09 Apr 2015",
            "name": "Ryan Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Excellent display. 2. Latest android version and in future too, will get updates before few high end phones. 3. No lag whatsover, good for multi-tasking. 4. Camera is improved as compared to 1st gen. Cons: 1 Battery lasts around 1 day.(kinda expected from smartphones). All over a great purchase !!!!",
            "date": "08 Apr 2015",
            "name": "Ayan",
            "stars": "4 stars"
        },
        {
            "comment": "perfect mobile for budget techno savvy. Will appreciate Flipkart for its perfection in delivery , tracking and other services.",
            "date": "08 Apr 2015",
            "name": "Bhavin Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "After upgrading to lollipop, the undergoes micro-stutters while app launching and app drawer, delayed app launching(e.g. youtube), poor battery saver and lagging UI while using low demanding games such as piano tiles!",
            "date": "08 Apr 2015",
            "name": "Sandeep Chandel",
            "stars": "2 stars"
        },
        {
            "comment": "Giving my review after 15 days of use. Phone specification/look is good - I can give 5 star rating for this. The problem is battery - I can give 2 star for battery life. I hope Motorola will give a better battery in future phone. The worst thing is they are not providing micro USB charging cable to charge it from laptop USB port and they do not have any recommendation to buy any 3rd party charger also. So, if you are normal user, you may go for it. But, if you are heavy user (wifi + dual sim + 2g/3g), never ever go for it (if they are giving free also do not go for it). My over all rating would be 3 star. Hello Motorola, please grow up....",
            "date": "08 Apr 2015",
            "name": "Jyotiranjan Rout",
            "stars": "3 stars"
        },
        {
            "comment": "Got my phone in March the phone looked really great with the looks and performance wise but just in 8 days my phone had some 3 weird lines on the display which appears to be the new issue for the phone complained about it as soon as possible and requested for a replacement..as it was a faulty phone from the seller! No wonder Moto has good features but it's always a risk to try it!! Would have given 5 stars if I didn't had to go through this.",
            "date": "08 Apr 2015",
            "name": "Mohammed Rezwan",
            "stars": "1 star"
        },
        {
            "comment": "Received in time. worked very fast much faster than my S3. however touch screen was not working properly. Flip-cart had provided me replacement. New phone works fine with batter touch response. But touch sensitivity is not consistence in all screen areas / all time. while scrolling long list some time it senses click. and gives unexpected response. I never have faced this type of touch problem in my S3. otherwise it works great....",
            "date": "08 Apr 2015",
            "name": "vipul vyas",
            "stars": "3 stars"
        },
        {
            "comment": "viewers here am giving explanation only where i face problem battery : poor volume : is ltl bad working excellent with kitkat but wen i installed lolypop am not satisfied some times its hsngs for 10 to 15 seconds unexpectdly. apart from those this is really nice.",
            "date": "08 Apr 2015",
            "name": "krishna",
            "stars": "4 stars"
        },
        {
            "comment": "No problem till now. Good camera, Battery life is good, Sound quality by speakers is nice. No problem at all. a good product by Moto.",
            "date": "08 Apr 2015",
            "name": "anuj saini",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchased a moto g last week...i dont know why...its charger is heating too much while charging the phone... Anybody facing the issue...Flipkart please help me to resolve this",
            "date": "08 Apr 2015",
            "name": "SHIJU KM",
            "stars": "3 stars"
        },
        {
            "comment": "For the price of @13K, the Moto G2 is an excellent smart phone. The only problem is the battery charging time....Takes a lot of time. If Motorola is able to fix this issue, then it'd would have been lot of others in the same range phones including the Chinese fakes...",
            "date": "08 Apr 2015",
            "name": "Sridhar Gopina...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is one of the awful phones to buy from flipkart. Don't go for the cheap price tag, the phone has a serious memory flaw and sends untested Android upgrades. Most of the times the phone can't be used for making calls or sending texts (the absolute necessity of having a phone) Don't recommend even to enemies",
            "date": "08 Apr 2015",
            "name": "Ramjee Panayur",
            "stars": "1 star"
        },
        {
            "comment": "It Should be 4G LTE Mobiles available with LTE connectivity @ the same price Motorola should also stand up now",
            "date": "08 Apr 2015",
            "name": "MOHAMMAD SHARI...",
            "stars": "5 stars"
        },
        {
            "comment": "phone hangs twice every day. you cant do anything since you cant detach battery. you just have to keep it aside. it will take 10 to 15 minutes to get back to normal. UNTILL THEN YOU SHOULD TAKE YOUR CAR OR BIKE OUT AND FIND ONE RUPEE COIN PHONE BOOTH. to call if there is anything important. - What more are you expecting. If you were to take my word DO NOT BUY IT. I was tempted because on youtube they compared it with iphone 6. I thought it has got something. trust me it does not worth your money. older seems good.",
            "date": "08 Apr 2015",
            "name": "yakub",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone, regular updates decent hardware and features.worth every penny but its not a waterproof phone don't walk with it in rain and dip like you will see on youtube,it will die.mine is dead after falling in water and it cost 8000 for repair wich is too expensive.",
            "date": "08 Apr 2015",
            "name": "Adithya Dusty",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchase a Moto G 2nd generation phone on 24.03.15 & I received the same on 30.04.15. When I am start using the product Sim card slot no. 1 has some problem. I requested to Flipkart to replace the product they told some steps to follow after following same, problem was not sorted & I have again requested to Flipkart to replace the product. Again they told to download some apps & pin of same will be shared after 4 hours on call, But at actual since 4 days I am waiting for call from Flipkart. Very poor service",
            "date": "08 Apr 2015",
            "name": "Amit Kavathekar",
            "stars": "1 star"
        },
        {
            "comment": "It's a good phone.i'm not talking about that.First recieve that phone i got little bluish shade on my display.I went to replace it. flipkart also replace my phone. But, now got little problem of upgrading lolipop version. So, I went to service center to service my phone but they aren't not took my phone for free service due to opened battery cover. I didn't opened it.Therfore, Flipkart sent me a used & serviced product. It is ugly to flipkart.flipkart is cheater.",
            "date": "08 Apr 2015",
            "name": "PRADEEP",
            "stars": "3 stars"
        },
        {
            "comment": "Great phone. Using it for almost 3 months. No problem so far. Pros : - Fully featured phone in 11300 (after discount). - No legging so far - Updated to android L - Very similar to stock android. No bloatware. Cons : - I still wish the screen size having 4.5 or 4.7 It would have been perfect phone. Now a days all good phone having larger screen size. It took me long time to decide and finally go with 5\" after compromise. All VFM mobiles are more than 5\" or have to go for flagship's mini variant which are too costly.",
            "date": "08 Apr 2015",
            "name": "Anchal Khare",
            "stars": "5 stars"
        },
        {
            "comment": "Well, so fast responsive touch wiz phone Updated to Lollipop, Easy play high end games on it. Only thing it fekt out of hand and glass broken. it say - GORILLA GLASS but actually its not. It just fell from 4 feet. And now the moto customer care say the price is arround 8000 for display. It would better to buy a new phone with some more bucks.. So for a fault i paid the price. I brought new one. But overall phone is good to go for average use fella.",
            "date": "08 Apr 2015",
            "name": "Sandip Choudhury",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone a week ago,found it a very good phone,very good android experience,but head phone is bogus.Motorola should look into it.",
            "date": "08 Apr 2015",
            "name": "Mridul Pathak",
            "stars": "3 stars"
        },
        {
            "comment": "I got the piece with broken Gorilla glass... The piece i got after replacement, is also very poor product... Voice is breaking and very freaky...",
            "date": "08 Apr 2015",
            "name": "Aju Sojan",
            "stars": "1 star"
        },
        {
            "comment": "good product , but drains battery very fast... remaining features are superb... its ok with this price...",
            "date": "08 Apr 2015",
            "name": "Sra1",
            "stars": "3 stars"
        },
        {
            "comment": "I have used this phone since two months, its battery is perfect for 1 day use if u have moderate usage of games. After loading about about 1.5 gb of apps and games, still the phone runs smoothly nd perfect. but some heavy 3d games, the phone heats up. its charger is really bad one. it takes 4 hours to charge fully, and if u r using simultaneously then it will charge at the same rate that u r using it. that means practically the battery will remain at constant level. Next compared to redmi note 4g, its better in only one way that is its dual-sim, but its the most wanted thing in now-a-days phones. the result of main camera is awsm. the vdo of 15 min will be of 1 gb, u can imagine the clearity. front camera of 2 mp is satisfactory. the main advntg is u can use multiple users and u get 8 gb intrnal memry for usage. sound in headphone is moderate. when its internal memory is below 100 mb, it will become slow which happens in all phones. finally for my usage, moto g 2 is better then redmi note 4g",
            "date": "08 Apr 2015",
            "name": "Parimal Patil",
            "stars": "5 stars"
        },
        {
            "comment": "Not a worth buy. quality issues and slower performance even for normal usuage. it stopped working in 2 months.",
            "date": "08 Apr 2015",
            "name": "Deepak Kudachi",
            "stars": "1 star"
        },
        {
            "comment": "After switched on, multiple blue lines on the phone. asked for the replacement two days back, not yet get the replacement.",
            "date": "08 Apr 2015",
            "name": "Francis Xavier",
            "stars": "1 star"
        },
        {
            "comment": "purchased it for Rs 10K and after using this for last two days I must say that the stock android experience is simply great.Comparing Hardware specs it easily beats the similar priced phones hands down.No lag what so ever even though the benchmark is shifting to higher specs, atleast on paper.The build quality is great and the curved back design is superb.Battery lasts a full day on single charge with data on.The only thing lacking is possibly 4G connectivity which for me is a non issues as still it is quite far into the future atleast in my city ,Jammu.This phone has superb 3G data rates and for most most of our needs 3G is sufficient .All in all it is a robust smartphone capable of delivering most of our expectations.",
            "date": "08 Apr 2015",
            "name": "viivek Parmar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone reallly with lots of expectation about the quality, brand value and service provide by motorola. OS update is good , display is good, no lagging , gud sound etc etc but whats the use of these features with a drained battery. If u switch ur gps on and try to find a location it wil automatically switch off within 1.5 hr even if the battery is 99%. and the main part is i kept my phone in front pocket of tight jeans the glasses left cracks wen i tried to lean on a wall.. i didnt expect this quality den wats the use of giving gorilla glass 3 which cant even handle little pressure on nit.Never thought i will go through this after buying a branded and known companies phone.I dont want to pay 6000 rupees anymore for it. which could cost half of my phone..Otherwise they can keep this pathetic service with themselves.I dont want it anymore.already regretting my decision to buy moto g with which so many expectaions were bound. Good bye to Motorola for providing a low quality cheap plastic phone n Flipkart for putting exclusive offers on moto g and shatter ur customer dreams (y)",
            "date": "08 Apr 2015",
            "name": "prem jayaraj",
            "stars": "1 star"
        },
        {
            "comment": "Received a defective product when a call comes whole display goes blank. Flipkart technical team is not accepting the replacement unless we receive call what a joke by tech team. They dont even understand the issue. Hope this is not a refurbished product sold. I bought this during App Sale.",
            "date": "07 Apr 2015",
            "name": "Nagdeep K",
            "stars": "1 star"
        },
        {
            "comment": "Got Android Lollipop update in a week time, its a great phone, good battery backup. Nice design, overall a great phone.",
            "date": "07 Apr 2015",
            "name": "Gary Singh",
            "stars": "5 stars"
        },
        {
            "comment": "the battery is very bad need to charge twice a day for using wi-fi. the camera is good,lloks good overall good mobile",
            "date": "07 Apr 2015",
            "name": "Veeresh G Andani",
            "stars": "4 stars"
        },
        {
            "comment": "The product was delivered in mint condition and before time. I ordered both phone and cover and both were delivered as per time specified. Good service, thanks.",
            "date": "07 Apr 2015",
            "name": "Girish Dhulekar",
            "stars": "5 stars"
        },
        {
            "comment": "Definitely buy this if you have a budget of around 11k. Using it for almost 8 month never disappointed me. Only problem with this is : cheap plastic body, get crack marks easily with rough usage so please buy a good cover for that.",
            "date": "07 Apr 2015",
            "name": "Lalit Vatsal",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased this mobile around 3 months back but lost it and purchased again when there if offer of rs.2000 via App, but the experience of new mobile is very bad. the mobile gets hang a all the times and also heavy applications do not run or get closed in between. The touch experience is also reduced. seems like motorola has now reduced the quality while selling on App. kindly get my mobile repaired.",
            "date": "07 Apr 2015",
            "name": "Nitish Goyal",
            "stars": "2 stars"
        },
        {
            "comment": "m not satisfied with this. camera falsh light is not working and battery backup is low, tried for return product. but customer care is not responded as expected",
            "date": "07 Apr 2015",
            "name": "chillagatta sr...",
            "stars": "3 stars"
        },
        {
            "comment": "Their agents are not upto date and I tried availing discount using VISA debit card but couldnt get one. The reason behind that I should have used mobile app and their associate have not communicated this to me, that means no 10% discount. The product receievd has some hardware issues as follows, 1) Distorted speakers 2) Upon connecting MOTO G 2 to USB 2.0 or 3.0 on a laptop, the screen flickers and becomes too sensitive to access any application on the cell phone. When registered a replacement request they called me asking to download and install self test app. Informed them that I dont have internet or a WiFi connection on this phone so they denied support and denied replacement of this product. Everytime they call and ask for internet connection and I keep saying flipcart tech team that I dont have one and they keep scheduling a call back for later day. When I checked today the status of replacement found that \"We're sorry. We are unable to process your replacement request. Reason : The issue has been resolved between you and the seller. Hence, there will be no replacement or refund\" ISSUE WAS NOT RESOLVED AND HOW CAN THEY WRITE A COMMENT ON ISSUE RESOLVED BETWEEN SELLER AND ME......I HATE FLIPCART and I have told all my friends not to buy any product from flipcart as the return policy is a biggest lie ever.....Bye bye FLOPCART",
            "date": "07 Apr 2015",
            "name": "Javed Nawaz",
            "stars": "1 star"
        },
        {
            "comment": "I BOUGHT IT 10 DAYS BACK..LOVING IT SINCE..WATS BUGGING ME IS LOLIPOP 5.0.2 BUGS..I HOPE AS IT GETS 5.1 UPDATE THINGS WILL BE GOOD..APART FROM THAT ITS AN AMAZING PHONE.MY BROTHER HAS IT SINCE NOV 2014 AND NOW I ALSO HAVE..LOVE U MOTOROLA!!",
            "date": "07 Apr 2015",
            "name": "AMIT KHAITAN",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good phone for its price, and a seamless pure android experience... again there was no issue in delivery of the product which timely",
            "date": "07 Apr 2015",
            "name": "ng",
            "stars": "5 stars"
        },
        {
            "comment": "i m using moto g2 from last 6 month,.. i found a genuine android software same as in SOny Ericsson. strong battery back up, good speaker quality. Also now android is upgraded to lollipop.. Just awesome experience while using this mobile.",
            "date": "07 Apr 2015",
            "name": "chetan raje",
            "stars": "5 stars"
        },
        {
            "comment": "I bought moto g 2nd gen. delivery service is good i can say because it depends upon the place of order. overall the phone is best at this prize and i got it with latest update of lollypop 5.0. I had some issues with payment related but thanks to the awesome customer care service of flipcart that they resolved it. thanks again.",
            "date": "07 Apr 2015",
            "name": "BAJRANG SHRIVAS",
            "stars": "5 stars"
        },
        {
            "comment": "The best phone in this class, display looks good, battery gives full day support, takes long time to change than other phones. It would be better if the RAM comes with 1.5 GB instead of 1 GB. Camera is not good. Other than these the phone is perfect.",
            "date": "07 Apr 2015",
            "name": "Arijit Guha",
            "stars": "5 stars"
        },
        {
            "comment": "First version of review after few hours of purchase. I gave only 4 stars. The missing star is for the battery. Rest all are perfect. Motorola should have adjusted the battery rating for bigger display. they retained the same battery from Moto G (gen1). Review updated to 2 stars on 10/April/2015 Cons : (1) Touch Stutter : I think I received a faulty device. The touch is stuttering. I noticed this when I was scrolling down on a webpage that has links. The scroll movement is often interpreted as a click by moto G2. I have moto E (1st gen). This never happens on moto E. moto E touch screen always works as per my request. moto G2 does so only half of the time. I wanted to return the phone but someone pointed that the replacement phones are refurbished ones. (2) Shipped with ollipop : The specs mentioned the phone to have kitkat and will be upgradable to lollipop. Mine had lollipop out of the box. I doubt that I got a refurbished one.",
            "date": "07 Apr 2015",
            "name": "Madhav Boddapu",
            "stars": "2 stars"
        },
        {
            "comment": "Motorola-G (2nd Generation) is best phone. i like very much. This instrument design is finest and strongly hard body.",
            "date": "07 Apr 2015",
            "name": "Bhaveshbhai ROKAD",
            "stars": "4 stars"
        },
        {
            "comment": "this phone is very handy to use as it is a 5inch it not a big phone like other brand . touch screen is very smooth and sound quality is great",
            "date": "07 Apr 2015",
            "name": "soumya rout",
            "stars": "5 stars"
        },
        {
            "comment": "i have bought it from 10999/- . At this price it is the best phone...with lollypop....great screen.....good cemara.....but in video camera....no touch focus....lollypop does not allow you to select app drawr background..... so you have to install a home launcher like go launcher, solo launcher, kk launcher...etc...phone is smooth... fast...black phone look great...",
            "date": "07 Apr 2015",
            "name": "Debasis Midya",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Great product in Rs12999/-. 2. Extremely good Battery. 3. Butter smooth Swipe. 4. Music player come with good settings like shake to change song, headphone configuration etc. 5. All games running without any lag. 6. Low light pictures in CAMERA EXTEREMLY GOOD. 7. The front camera is very good for selfie. Cons: 1.… Battery performance is Average (Expand)",
            "date": "07 Apr 2015",
            "name": "Subhajit Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered 2 pieces of Moto G (2nd Gen), both received before a week. Thanks for quick delivery to Flipkart, as always. actually the problems with one piece is it was having yellowish screen & this affecting overall quality of the screen. if we put both piece together it clearly shows the difference in quality of LCD. because of above issue i have to raise replacement request. got replacement but unfortunately having same yellowish screen in replacement piece too. Never expected such scenarios from Flipkart or WS Retail. This time i have not requested for replacement but little bit disappointed as i have given this to my elder brother & he was very excited for the phone.",
            "date": "06 Apr 2015",
            "name": "Jayesh Sarvaliya",
            "stars": "3 stars"
        },
        {
            "comment": "DEVICE HEATING VERY HIGHLY WHEN TAKING VIDEOS..... AND THE CAMERA QUALITY IS GOOD. CAN`T TAKE VIDEO CONTINUOUSLY 3 MINUTES.",
            "date": "06 Apr 2015",
            "name": "AJESH Sp",
            "stars": "1 star"
        },
        {
            "comment": "I will give five star for this phone if the battery stay for atleast 12 hours. Rather it stays only for 6-8hrs for normal use itself like emailing, whatsapp, very few calls and without gaming, browsing.. totally useless for people who travelling lot. whenever i am travelling in the train for just five hours i have to turn off the data, reduce the brightness, but still battery draining faster. now 5 months over my charger not working suddenly and i have to find service centre for replacement..",
            "date": "06 Apr 2015",
            "name": "mathy",
            "stars": "3 stars"
        },
        {
            "comment": "5star to flipkart for the delivery. Now regarding the phone, the specifications are awesome when compared with the price. Great Camer (both front and rear), fast in opening apps and all. Latest Android. Very good sound quality. Could have done better with the battery. Allover very good buy in the range of Rs.13000 Go and have it guys !!! Superb phone :)",
            "date": "06 Apr 2015",
            "name": "Gaurab Majumdar",
            "stars": "4 stars"
        },
        {
            "comment": "Im very much happy with this product i received, right from the package to the functioning of the device. And the exchange price that i received for my old phone is quite good. Thanks flipkart.",
            "date": "06 Apr 2015",
            "name": "Abhinaya Venkatesh",
            "stars": "5 stars"
        },
        {
            "comment": "The phone was delivered before time but problems started from the second day itself. i. There was a lot of cracking in the audio device, and the voice from the other side came with a scratching sound. ii. There was some component which was loose inside the phone, so much that it used to make a very distinct sound everytime i used the keypad. iii. The network would go off every 30 - 40 seconds into a call. I called up flipkart and they have replaced it within a week now. I received the phone today and till now it seems to be working fine except for a little scratching sound every now and then. I ill write another review after having used it for a week.",
            "date": "06 Apr 2015",
            "name": "pallav",
            "stars": "3 stars"
        },
        {
            "comment": "I received a defect product of Moto G from Flipkart and I am following with them for return or replacement since last 7 days. I am following on daily basis with them, giving false promises that will give you call in next 1-2 business days, but still issue is unresolved. I have not expected this from Flipkart. Very much disappointed.",
            "date": "06 Apr 2015",
            "name": "Rajesh Mahapatra",
            "stars": "1 star"
        },
        {
            "comment": "The phone has problem of networking, it does not work in basement or close room.from the fist day the phone does not support the dual SIM.",
            "date": "06 Apr 2015",
            "name": "Harish kumar",
            "stars": "1 star"
        },
        {
            "comment": "Pros Good Built Quality Nice Display Camera Cons For now This phone has too old 400 snapdragon processor Ram only 1gb for this price range Battery Life All The cons are due to price to value",
            "date": "06 Apr 2015",
            "name": "Anish Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "I'm not satisfied with the quality of this phone.On the first day itself the battery got dried up and it took 5 hours to get fully charged.My 2nd problem was with the power off button, when we click to the power off/on button it gets tilted to one side.I think in today's compitative world if Moto is asking 13k phone than it should have atleast 1.5GB RAM and 13 MP primary camera and 5 MP secondary...",
            "date": "06 Apr 2015",
            "name": "Anupam",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone and it was delivered within 2 days. Awesome Shipping Timeline by Flipkart (5 Stars) Coming to the phone: Pros: Phone is awesome and has all the advanced features that usually any High end phones must have. No Lags Awesome 16 GB Memory Phone is very fast. Battery lasts 1 and a half Days on a normal usage (Wifi/Whatsapp/Calls) Screen and Camera Clarity is awesome and also has Video SlowMo feature. I am using my Galaxy S3 in Ear handsfree with this phone for music as the one provided with the phone is not great. A little Equalizer Tweaking and the Original Samsung In ear phones can give awesome clarity. (Use VLC Player from store which is free) Cons: No USB Cable provided (Reduced 1/2 star for this) Earphones are not at all great(Reduced 1/2 star for this) - I used this after using Samsung S3 and the beats and Bass is no way comparable. Overall a very good phone for the price.",
            "date": "06 Apr 2015",
            "name": "Abhinav VIjay",
            "stars": "4 stars"
        },
        {
            "comment": "everything about this product is awesome........i.e. good battery....bigger screen.......loud stereo speakers...........gd gesture..........all in one smartphone.......really loved it!",
            "date": "06 Apr 2015",
            "name": "Rishu Bharadwaj",
            "stars": "4 stars"
        },
        {
            "comment": "Good performance Good camera Excellent value for money..... Battery life so so...... In this price range this one is the best choice.......",
            "date": "05 Apr 2015",
            "name": "Abhijit Kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "Low budget phone. Battery back up is not good. Rest of things are good. Battery back is concerned. This is good phone for who are looking low budget phone.",
            "date": "05 Apr 2015",
            "name": "jitendra barik",
            "stars": "3 stars"
        },
        {
            "comment": "since i have used this set for more than 25 days it was good experience but processor is little bit sluggish also camera takes 5-10 sec to open and 4 secs to adapt to near by environment andriod 5 installation is good on it awesome calling feature is good camera clearty is good but on zooming not so cool thats on original 1.0 x front cam is awesome touch is cool cant install large number of application 3 star",
            "date": "05 Apr 2015",
            "name": "Abi Nandan",
            "stars": "3 stars"
        },
        {
            "comment": "Go for it.... At first I thought it is a value for money buy, but as soon as they started giving updates for the android OS, it made me feel in heaven. Got to use Lollipop before some of my friends who carry costlier phones. Awesome hoice.",
            "date": "05 Apr 2015",
            "name": "Bikash",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola has re-launched after being not in market for few years. They've introduced some new smartphones which are affordable and competitor to other mobile companies in the market. I purchased Moto G(2nd Generation) for Rs.13000/-. It is a great phone with a good price and the touch is really very good. The phone looks stunning with matt finish cover at the back. Camera quality is good ,but focusing takes some time. Processor is also good snapdragon which is also used by samsung. The battery is good, but when using the internet the battery drains out quickly. Normally with data usage on and off the battery remains well. It is upgraded to android's latest version of lollipop. This phone is only available on flipkat. A good phone to buy and experience motorola once again other than other brands which are now-a-days getting bored!",
            "date": "05 Apr 2015",
            "name": "Pranay Shah",
            "stars": "4 stars"
        },
        {
            "comment": "You can't expect more from Brand than this at such price. However I like Samsung phone more. You have to rely on touch screen only as there's not a single physical button except volume up down & lock-power ON/OFF which is not able to wake your screen up incase the phone is hanged. Not much customization as samsung phones.Poor screen brightness. The good thing is you can clean the screen & body easily.",
            "date": "05 Apr 2015",
            "name": "Jay Sondagar",
            "stars": "4 stars"
        },
        {
            "comment": "if i say that this phone is undisputed champion of his league, it will be nothing new abt it because i think it has left his mark in the market already. so i would just like to add another recommendation to the kitty of ''Moto G 2nd gen''. all the newbie's out there if u are looking for a superb phone with great performance and decent looks @ such a great price, don't give it a second thought and just buy it. it is more than value for money...!!!! GO MOTO....!!!",
            "date": "05 Apr 2015",
            "name": "gaurav yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent mobile. camera is too good. sound also great. i a very happy to buy this product. battery charge is average.",
            "date": "05 Apr 2015",
            "name": "very worst",
            "stars": "4 stars"
        },
        {
            "comment": "I can not redeemed the valid offers of airtel 1 GB 3G internet. I feel like I am cheated this time. I sent a mail to flipkart. but they just took a lot of extra time to solve this small issue.",
            "date": "05 Apr 2015",
            "name": "Dhaval Shah",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone since last 4 months.. phone performance is good... Video calling and surfing net is awesome .... in my old phone not able to play some graphics game... but this phone run HD graphics game very smoothly.... Thanks Moto for good phone and Flipkart for delivered the phone on the next day of booking.",
            "date": "05 Apr 2015",
            "name": "Mukund Sandilya",
            "stars": "5 stars"
        },
        {
            "comment": "Had to return the first unit which was delivered as the battery used to drain within less than 1 hr. Got a replacement from FLIPKART, happy with FLIPKART service. Again, feeling let down the battery need to be charged less than 12 hours, if using without any Data usage. If connecting to Internet, you need to carry a battery backup or the phone would be just a paper weight as it drain out in few hours. To add to the woes, network issue had surfaced, network drops and not connecting to WIFI. Already, confirmed that the network issue is not related to the SIM card.. G2 is terrible experience...",
            "date": "05 Apr 2015",
            "name": "Rinu Rajan",
            "stars": "1 star"
        },
        {
            "comment": "I have ordered Moto G2 from Flipkart on 25th March, got delivery by 30th March. Well, I think the motorola quality has definitely been deteriorated. I went ahead to buy this phone despite of recent bad reviews and reviews about the new phones being the refurbished ones. The first this I checked was the manufacturing date which was March 2015 (I was satisfied with that.) Also, it has Android Lollipop as stock ROM installed. However, what follows is the true colors of this device in my first hand experience. Anyway, below are the details of my usage and problems I've been facing with this phone - I am using this phone with dual sim (that's why they have dual sim capability right?) 1. 100 to 0% battery drainage in less than 8-9 hours. (My samsung s advance with a swollen battery gives me at least 3-4 hours of backup) 2. Phone heats a lot whenever an app is running. 3. Charger burns metal hot whenever I am charging my phone. 4. A lot of apps keep crashing. 5. Speaker sound cracks on high volumes (shouldn't really be the case for a brand new phone.) Everything is clear now why flipkart is offering a huge discount of 3100Rs on a \"great in market\" device. Other than the above problems I haven't faced any issue yet. Right after posting this review, I am going to contact flipkart and ask for a replacement. Post that if I am not satisfied with the device, I am definitely asking for a refund. I hope it will help you in making a better buying decision. Based on my current and past experience, I definitely would ask users to buy new models and not go for stale models in the market. This is definitely a bad customer experience flipkart.",
            "date": "05 Apr 2015",
            "name": "Anshul Mendhir...",
            "stars": "1 star"
        },
        {
            "comment": "have it for almost 2 weeks ! really impressed ! will review it after some month !!!! android lollipop 5.0 is working perfect ! waiting for the 5.1 update !!!!!!!!!!!",
            "date": "04 Apr 2015",
            "name": "jatin kumar",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is damaged for two tyms with in 6 months why is it so. execptthis the is nyc it does not stuck",
            "date": "04 Apr 2015",
            "name": "FAWAZ SYED HAMID...",
            "stars": "1 star"
        },
        {
            "comment": "It has become outdated. The price coming down slowly. pro: display is good Con: heating issue while charging. battery is not lasting for a day.",
            "date": "04 Apr 2015",
            "name": "jack",
            "stars": "3 stars"
        },
        {
            "comment": "Ordered it on flipkart and got within a week of ordering. The phone is nice except for the few drawbacks. Pros: Camera is awsome, gives a feel of a phone worthe 25K-30K. Battery back up is fantablous. Look and feel is nice. Cons: Overheating Hangs sometimes after I have upgraded the android version to lollypop.",
            "date": "04 Apr 2015",
            "name": "Deep Shikha",
            "stars": "4 stars"
        },
        {
            "comment": "Strongly recommended. I am using Moto G first gen and Moto G 2nd gen. Product is working very fine. No problem with this phone. Worthwhile.",
            "date": "04 Apr 2015",
            "name": "Parmod Kumar V...",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought Moto G (2nd Gen) after lot of consideration and after reading several reviews. It worked fine for initial 2-3 days. The problem began after I updated it to Android Lollipop. It has turned into a frustrating experience since then. Every activity has become very slow. This phone has such wonderful specs, but I really don't recommend this with Lollipop! Please stick to Kitkat, if you can!",
            "date": "04 Apr 2015",
            "name": "Sam Payne",
            "stars": "3 stars"
        },
        {
            "comment": "I am using this product for last three months.. giving me hazel-free performance. No issue at all. Camera quality is awesome..(both front and rear).. One can compare its performance with high end phones..I am really enjoying.....Thanks to Motorola for such a nice product.",
            "date": "04 Apr 2015",
            "name": "vk srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased Moto G 2nd Gen on 27 feb 2015, it is very good mobile with very good camera & Picture quality. Mobile Ram is very nice. good.....",
            "date": "04 Apr 2015",
            "name": "MSJ",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this fone in November, with in 4 months the performance of this crappy phone gone down drastically. PATHETIC it is!! I would never ever would suggest this to any one, please don't buy it; coz u will definitely regret later on.",
            "date": "04 Apr 2015",
            "name": "harsh sharma",
            "stars": "2 stars"
        },
        {
            "comment": "Guyz.... Awesome will nt b enuff to tag thiz toast... Please order it by clozg ur eyez... U wl surely njoy tiz fone.. Nobody can facilitate tiz kind of specz in tiz budget...",
            "date": "04 Apr 2015",
            "name": "Steni",
            "stars": "4 stars"
        },
        {
            "comment": "mobile system was crashed, may be i have called 50+ times, but every times he said we will contact you in 7day or 12day but still no call back. and from 4 month no any solution from motorola company",
            "date": "04 Apr 2015",
            "name": "yogesh",
            "stars": "1 star"
        },
        {
            "comment": "Battery backup is low, 7 hours backup only in standby mode, I have purchased on Dec-2014, battery backup is very low and mobile heat, 4 time visiting the service centre they take 4 days every time but my problem not solved",
            "date": "04 Apr 2015",
            "name": "Anandaraman",
            "stars": "1 star"
        },
        {
            "comment": "I love this phone ..!",
            "date": "04 Apr 2015",
            "name": "Bappaditya Saha",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Guy i buyed a MOTO G 2Gen with Lollipop on Apr Last week with the FLIP Cover,The mobile was Quite good with Speed and Cover does not match.After i use for a week i came to know that their is a issuse with Battery Problem,its showing 40% ten come down immediately with 9% and finally mobile got Switch Off. I Put a Complaint in FLIP,but no proper response. Now i am suffering with this mobile after making the Full payment. Rest is all fine like Speed and other things. Before buying this product ,please thing yourself.........",
            "date": "04 Apr 2015",
            "name": "K M KADER MASTHAN",
            "stars": "1 star"
        },
        {
            "comment": "Worth of money. Highlights:Gorilla glass and Lollipop Backlogs:Price I am expecting to reduce price of MotoG",
            "date": "04 Apr 2015",
            "name": "subbarao jallepalli",
            "stars": "4 stars"
        },
        {
            "comment": "* Battery draining out too quickly; even after disabling most of the Google App services. Even the Battery Saver mode is not helping. * Sometimes, battery charges shows up completed within 15-20 mins. And while talking, the phone immediately dies out. This creates problem, while I'm travelling. * Mobile overall performance seems to be affecting, as occasional hanging problem or immediate shut-down, causes unwanted shocks. When at work, I tend to lower the sound to Silent & Vibrate. Once off-work, Turn it back up to High volume. Still it doesn't RING, only vibrates for all the future calls. Tried switching it off & back on multiple times. Didn't help. Tried setting in-built Ringtones as well. Same Results.",
            "date": "04 Apr 2015",
            "name": "Nino N",
            "stars": "1 star"
        },
        {
            "comment": "My experience of moto g 2nd is just dandy. You must have read phones specs so I am not going to elaborate . phones performance is lag free . but yes sometimes screen doesn't response on phone calls and it is difficult to attend the phone I don't know if the problem is only in my phone. U won't believe I dropped the phone from 2nd floor and it's still alive in good condition just a micro crack on the corner of the screen . I am satisfied",
            "date": "03 Apr 2015",
            "name": "Ajaz khan",
            "stars": "4 stars"
        },
        {
            "comment": "The set is good software and hardware wise. Some or the other earphone issue still exists. Lollipop makes it just a bit sluggish. Overall good experience.",
            "date": "03 Apr 2015",
            "name": "Kartikeya Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought this product with 2 good offers which saves me 3300 rs from MRP.. Yes I bought this product for 9900 rs... After using this for a week, Here is my review about the mobile.. 1. Good build quality, Feels good and premium in hands, but little slippery. You might need some good back case. 2. Latest Lollipop update and stock android experience. I am lovin it.. In fact, everyone will love this experience. 3. HD screen has more saturation than any other phone in this price segment.. You won't get disappointed , Touchscreen has good response and buttery smooth.. 'THE BEST' 4. Battery backup - OK type... you can expect a full day battery backup with only calls, messaging and some time of whatsapp or other messenger... If you are a core-user, then you definitely need a second time of charging in a day. 5. RAM - 1GB is enough for average user but you will feel some lags then and there while playing high end games and using many apps(more than 6 or 7) at a time due to less clock speed of the processor (1.2 GHz) 6. Speakers - Good, Charging takes time to get full. 7. Overall experience : For average users and users looking for clarity of screen and android experience - \"BEST in this price segment\" For core users like users need a mobile for gaming - Please look for a mobile which has more than 1.5 GB of RAM... eg., Yu Yureka, Xiaomi etc 8. I am satisfied ... Worth for 10K according to my expectation.. Still it needs some improvement..",
            "date": "03 Apr 2015",
            "name": "Thiru Vikraman...",
            "stars": "4 stars"
        },
        {
            "comment": "I received a defective product MOTO G 2nd gen.having HANGING problems . I called flipkart for a replacement but they REFUSED and asked me to visit service center .According to Flifkart 30 days replacement policy my product should have been replaced but they refused to do so, am extremely unhappy with the customer support provided to me by flipkart if they continue to do so i would strongly discourage shopping from flipkart.",
            "date": "03 Apr 2015",
            "name": "Uday Modi",
            "stars": "1 star"
        },
        {
            "comment": "Good Phone, value for money. It meets all your expectations and will never let you down in any area. Worth spending this much.",
            "date": "03 Apr 2015",
            "name": "Rajeev Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Nothing bad to say. An awesome phone. Its really superb. I have got lollipop too. A great phone for a great price. Good work moto",
            "date": "03 Apr 2015",
            "name": "Gijo Varghese",
            "stars": "5 stars"
        },
        {
            "comment": "Product was delivered as commited and on time. Color was same as selected and well packed. Delivery guy was also decent. Overall nice experience.",
            "date": "03 Apr 2015",
            "name": "Kirti Kumar Ag...",
            "stars": "5 stars"
        },
        {
            "comment": "have been using this from 7 months now. for a mid range phone this phone is worth every penny. battery backup of a day if u rent on the net too much . i love the camera . the only negative for me is the panels are way too costly . all in all i will give this product a 8/10.",
            "date": "03 Apr 2015",
            "name": "anoop ramesh",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone since last 3 months, really good experience in android segment. Nice camera, no lag while gaming, receiving speaker is also nice",
            "date": "03 Apr 2015",
            "name": "Vikrant Vare",
            "stars": "5 stars"
        },
        {
            "comment": "You feel the quality when the device in your hand. Amazing touch and screen resolutions. Overall value for money",
            "date": "03 Apr 2015",
            "name": "Mohit Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Really its worth, i received this product in 48hrs service was good, thanks to ekart for early delivery.",
            "date": "03 Apr 2015",
            "name": "lakshmanan balaji",
            "stars": "5 stars"
        },
        {
            "comment": "this product is next to shit.. and flipkart is making fool of people.. once they take it to service center, it will take a month to get it back.",
            "date": "03 Apr 2015",
            "name": "Amit Singh Pal",
            "stars": "1 star"
        },
        {
            "comment": "I have huge respect to this phone for the price tag and features how ever i had some kind of issues in the phone and had to reset to factory settings inorder to bring back to normal, i have asked many of my friends who owns this phone and many have some kind of an issue or the other after 4-5 months, and also its a lottery if you get a good handset you are lucky if not we have to follow up with flipkart itself always.",
            "date": "03 Apr 2015",
            "name": "Vinayak Swamy",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2nd is a decent buy. If you do not find any phone of your dream, go for Moto G, it is very good Value For Money. Downsides: only 1 GB ram and No 4G.",
            "date": "03 Apr 2015",
            "name": "ronn",
            "stars": "4 stars"
        },
        {
            "comment": "I have recently ordered this phone, the delivery time showed me 6 of April, but the courier people handed over the phone before one week thum-sup for flipkart. As for as the product is concerned now i am using it from last 5 days and want to share with you. Pros 1. The feel of the set is nice in hand and appearance is ok 2. The display is bright and vivid. 3. latest operating software 4. Call quality is great and clear 5. picture quality of camera is nice Cons 1. Battery Backup 2. Lagy processor when opening multiple applications 3. Touch not so buttery smooth 4. The PPI could have been better Over all nice package in this price range",
            "date": "03 Apr 2015",
            "name": "J A Bhat",
            "stars": "4 stars"
        },
        {
            "comment": "Fist thanks to Flipkart for quick delivery. I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones.",
            "date": "03 Apr 2015",
            "name": "mahesh ammisetty",
            "stars": "5 stars"
        },
        {
            "comment": "Pros -Descent build quality. Very sturdy with a stylish tinge -Images by F camera are very sharp and pleasant to watch -Can be a good gift for your parents Cons -Minor glitches in calendar app... don't worry -Battery could have been a wee bit better like say just a 500 more of mAh Conclusion -Its more than worth the money",
            "date": "03 Apr 2015",
            "name": "Joe Belunke",
            "stars": "4 stars"
        },
        {
            "comment": "The Mobile is very good of its kind. Will give 10 starts if available. My second Moto G mobile.LOve MOto! and love flipkart far superb service!",
            "date": "03 Apr 2015",
            "name": "Mahesh Pandurangan",
            "stars": "5 stars"
        },
        {
            "comment": "one of d best deals of flipkart i love moto g..... ..................................................................................................................................................................................",
            "date": "03 Apr 2015",
            "name": "Ganez Raja",
            "stars": "5 stars"
        },
        {
            "comment": "Screen 5\" for both phones z comes with a fHD display and for moto its HD .. What I want to say I can't experience a change in pixels ..moto has a gorilla class but z comes with a oleophobic coating Network Both have almost same network configuration but moto works well in low range areas and have a very good network connectivity Speakers Here moto ranks first Camera Z comes with a 13 Mp cam and for moto 8 Mp here also the picture clarity seems to same",
            "date": "03 Apr 2015",
            "name": "Salman Faris Pn",
            "stars": "4 stars"
        },
        {
            "comment": "Phone may have 1.2ghz processor but still phone works smoothly if only increase in ram could have made it best budget phone.and flipkart service was good as usual",
            "date": "03 Apr 2015",
            "name": "Parth basole",
            "stars": "4 stars"
        },
        {
            "comment": "i replace moto g 2nd gen with my old moto g 1at gen mobile. over all the product is very good except one thing. the power button is little uncomfortable. its quite hard when press.",
            "date": "03 Apr 2015",
            "name": "yadav neeraj",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is a good phone widely used for students , it is very good phone heats when it is used heavily it is so common in android . the battery backup is very much impressive it is too good when used in lollipop version the screen is gorilla screen it breaks when falls down but no warranty given for physical damage or liquid damage for phone only software warranty is given",
            "date": "03 Apr 2015",
            "name": "Gvs Harish raj...",
            "stars": "4 stars"
        },
        {
            "comment": "Its just an awesome product by Motorola and excellent value for money. People who think that a phone doesn't need any gimmicky features, can always go for it. Loving the Lollipop but the priority mode is a bit confusing. But, still its way smoother and multitasking enhanced a lot. Thanks to flipkart for delivering it on time and the flip-cover just after one day. Happy with it. I will suggest to people, if you have budget over 10k go for it.",
            "date": "03 Apr 2015",
            "name": "Deepmoy Chatte...",
            "stars": "5 stars"
        },
        {
            "comment": "moto g2 awesome phone under 10k-15k smartphone.using since 1 year, faced no problem yet, and hoping no problems in future too. a must buy phone if u wish to. no doubt in that.",
            "date": "03 Apr 2015",
            "name": "Gaurav Sahu",
            "stars": "5 stars"
        },
        {
            "comment": "look mast hai. camera v mast hai. bas battery backup kam hai internet use karte samay. filpkart ki services ko 5 *****. maine bahut se mobile dekhe aur liya v mujhe ache camera ki talash thi magar mujhe 8 mp me sabse acha camera motog 2nd gen ka laga. thanks....",
            "date": "02 Apr 2015",
            "name": "Paramjeet Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I Have ordered this phone during big app shopping days and after receiving it everything was good except battery backup...suddenly battery drains even if we are not using anything",
            "date": "02 Apr 2015",
            "name": "SAI RITHWIK",
            "stars": "3 stars"
        },
        {
            "comment": "This piece of Art have good looks, great body and mind blowing features!!!! In Short...... CHOTE PACK ME BADA DHAMAKA...............................",
            "date": "02 Apr 2015",
            "name": "Manoj Ghadigao...",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is okay, but some network problem is there and only 1GB ram is there. but you can purchase. the camera is superb. all other features are superb. awesome phone",
            "date": "02 Apr 2015",
            "name": "DILIP KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I would suggest you to buy this fone, it is really impressive and mind blowing fone, I love it. Dont thing twice just go for it.",
            "date": "02 Apr 2015",
            "name": "Very Very Very...",
            "stars": "5 stars"
        },
        {
            "comment": "I am using from last 2 months and very much satisfied. Smooth operation, good speed, good design. Very good camera clarity. Only problem is battery backup and moto g providing very poor quality headphone with mobile. Other then that, mobile reached my exception Rating for Moto G (2nd gen) is 4 out of 5. Rating for flipkart - 5",
            "date": "02 Apr 2015",
            "name": "kiran kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I brought this phone @ 9899 as i get discount on app purchase now they are giving Lollipop update out of the box i am satisfied with this product.",
            "date": "02 Apr 2015",
            "name": "Nikhil Dumbre",
            "stars": "4 stars"
        },
        {
            "comment": "i had ordered this moto 2nd gen on 31st march,and i got this at 2nd april .flipkart service is good.thanks to flipkart & e kart....... this device not come with 4.4.4 kitkat.. but it comes with 5.0.2 lollipop ...... the battery backup is not best... the devise heatsup like anything... otherwise this device is a best device at this range...",
            "date": "02 Apr 2015",
            "name": "subash chandra...",
            "stars": "4 stars"
        },
        {
            "comment": "I brought Moto g before two days. nice mobile, overall good. charging is slow. So comparing to other mobile same class. moto g 2gen is best.",
            "date": "02 Apr 2015",
            "name": "Hamendra Choud...",
            "stars": "4 stars"
        },
        {
            "comment": "I got my cell phone replaced one due to memory card was not detected But with the replaced phone I am still facing the same issue.",
            "date": "02 Apr 2015",
            "name": "Mohit",
            "stars": "1 star"
        },
        {
            "comment": "FlipKart delivery is ok. the product which is looking good but operation wise if we look it out it has hanging problem and the battery also not that good withstanding capability. But phone is ok and its fit with hand.",
            "date": "02 Apr 2015",
            "name": "Saravanan Sath...",
            "stars": "4 stars"
        },
        {
            "comment": "i have ordered moto g2 and i received this phone in just 3 days,excellent service.the phone is so good but the battery backup is not up to the mark.",
            "date": "02 Apr 2015",
            "name": "sarthak goel",
            "stars": "4 stars"
        },
        {
            "comment": "Battery life was bad in moto g.Some time batterys going down very fast from 80% to 1% when i restart after getting that issue then its show 70% of battery.",
            "date": "02 Apr 2015",
            "name": "selva",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G 2nd generation is almost close to perfection with all the shortcomings of Moto G 1st generation addressed.However the few things I dont like about the phone is 1.The Pathetic Battery life .The battery should be at least 2500mAH. 2.Unable to set photos from facebook to contacts list. 3.The drop down menu has got lesser keys. 4.You have to press at least three keys to activate or deactivate the data connection. 5.The bezels could have been minimized a bit. For the rest as I have said close to perfection.I think the price should now come down from the original Rs 12990/",
            "date": "02 Apr 2015",
            "name": "Gouree Sh Das",
            "stars": "5 stars"
        },
        {
            "comment": "very impressive............ fast and quick response............ gud quality camera........... best for gaming.................... and other............... processor is fast............",
            "date": "02 Apr 2015",
            "name": "nitish sharma",
            "stars": "5 stars"
        },
        {
            "comment": "overall good battery backup poor lags sometimes after loolipop update phone became slow games can be played smoothly no lag internal storage of 16 gb is a plus point i would reccomend everyone to buy this its overall a budget phone",
            "date": "02 Apr 2015",
            "name": "sayanipa bardhan",
            "stars": "3 stars"
        },
        {
            "comment": "Amazing Phone I M LOVING IT .. :) the built quality n all stuff are jst awesome .. the best part is the lolipop update",
            "date": "02 Apr 2015",
            "name": "Tejas Mahade",
            "stars": "5 stars"
        },
        {
            "comment": "If You don't want spend more than 15k on mobile purchase and You need smart phone which do jobs with ease & have Good battery life Then Moto-G is right smart phone for you.",
            "date": "02 Apr 2015",
            "name": "Sushant Lad",
            "stars": "4 stars"
        },
        {
            "comment": "The Phone is great. Good buy. However, I found phone response for Kitkat is better than lollipop. Otherwise, the phone is satisfactory in most aspects. The most dissapointing feature is the battery. Drains out too quick and takes ages to get charged.",
            "date": "02 Apr 2015",
            "name": "Archana",
            "stars": "4 stars"
        },
        {
            "comment": "one word : nice!! among all android phones in this budget range, this is best. Comes without usual android and phone manufacture crap (software), just pure android experience. Camera does the job, sometimes hangout crashes, but thats ok..",
            "date": "02 Apr 2015",
            "name": "Vadiraj",
            "stars": "5 stars"
        },
        {
            "comment": "I am very much excited before purchasing this device. After 3-4 usage, i found that the battery does not last even half a day. I have charged 100% in morning and by the evening at 5-6pm , the battery drains out completely. Motorola is a trusted Brand, Everything is perfect in this phone except for the battery. I am very disappointed with the battery life. I give 5 star to the android Lollipop. It is very user friendly and easy to go through. To battery i give 0 star, even Chinese phones have better battery. If you need better battery, simply go for a Micromax nitro or Nokia Lumia 730.",
            "date": "02 Apr 2015",
            "name": "Paramjit Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Well the phone offers 16GB internal storage which is fantastic. The phone lacks in good quality front camera. When I bought this phone, it was powered by Andriod 4.4.4 however after updating to Android 5.0 it sort of sucks. I mean the phone gets hanged quite frequently, the apps don't work smoothly, the pattern lock refuse to recognize your pattern and few other minor bugs occur. The reason I rated it 4 stars is that I don't think that there are any hardware issues. Probably it is an issue with Android 5 only.",
            "date": "02 Apr 2015",
            "name": "Rahul Singh",
            "stars": "4 stars"
        },
        {
            "comment": "i gifted this to my young sister this product is worth buying i like this mobile look n interface is hot no need to change mobile for 10 years i think",
            "date": "02 Apr 2015",
            "name": "arun tumma",
            "stars": "5 stars"
        },
        {
            "comment": "mobile with good battery backup,nice performance,and beautiful colours,have an excellent quality for price value,also the speakers are powerful for great listening experience,a wonderful gaming experience",
            "date": "01 Apr 2015",
            "name": "Sachin Siwach",
            "stars": "5 stars"
        },
        {
            "comment": "the gorilla glass which is there in the phone is of low quality ...it got cracked as a result of overheating which is also a problem in this phone",
            "date": "01 Apr 2015",
            "name": "Sai Krishna",
            "stars": "1 star"
        },
        {
            "comment": "I ordered during the App off..... fast delivery by flipkart. mobile is good and as if now I don't see any negatives....please go for it!!!!!",
            "date": "01 Apr 2015",
            "name": "Nithesh K N",
            "stars": "5 stars"
        },
        {
            "comment": "best of best android phone but some errors after lolipop update hope you understood me...thanks moto.........never mind",
            "date": "01 Apr 2015",
            "name": "Sajid Khaan",
            "stars": "5 stars"
        },
        {
            "comment": "i used moto g2 last 4 months.here im explaining why we buy and dont buy .. y we buy.. camera quality is best at day time.8 mp is gave good quality pics. screen resolution is good.touch is very smooth and sexy.we can play games with out suck in middle level graphic settings.mobile design is unique and good quality. pure android give a different experience processor and graphic processor is very good performance Why dont buy.... dont hav 1080p video recording.taking 3 hours for charging and ,cheap qulity head phones,charger,battery drying very fast every 10 mint 1 percent battery decreasing in standby. Officially it was moto g2.But we can say it as room heater,iron box,water heater,suicide weapon..if we use 10 mints for call , camera , net , games ..etc it become a burned iron.so we should use wireless headset. not suitable for selfies in night.price is also high because of moto brand .. we can get min 5 to 15 percent discount on any smart phones in outside markets. eCommerce seller r selling on MRP prices. great battery capacity 2070.for extend battery life one trick is just select power off by understanding of Motorola suggestions thank to flipkart for fast delivery",
            "date": "01 Apr 2015",
            "name": "raj",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone from last 3 days phone is awesome. Playing good games on it but on heavy graphics it is hanging. But this is a budgeted phone with 1GB Ram it is working really very nicely.",
            "date": "01 Apr 2015",
            "name": "Niranjan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Very good budget phone with latest lollipop version. I am so happy with performance of the phone. Thanks to flipkart.",
            "date": "01 Apr 2015",
            "name": "Sunil Maturi",
            "stars": "5 stars"
        },
        {
            "comment": "Opted for one day delivery and flipkart delivered it as said. Phone was worth for money. For that cost you wont be getting half the features in brands like samsung. Also, it has a very sleek look and nice finish. Option to get data from previous phone is the best feature i saw...",
            "date": "01 Apr 2015",
            "name": "Sama Murthy",
            "stars": "4 stars"
        },
        {
            "comment": "i got defective product. still they don't return it. the display tone & led flash lite are yellowish colored. i also face a problem in sound while i call someone. there is also a setting problem.. when i make new setting, every time i have to switch off the phone for activate the setting.",
            "date": "01 Apr 2015",
            "name": "krutesh mehta",
            "stars": "1 star"
        },
        {
            "comment": "After a month of good run my phone started giving me problems like frequent hang and does not detects my sim card. I have to restart my phone multiple times in order to make my phone detect sim.",
            "date": "01 Apr 2015",
            "name": "Abhimanyu Kale",
            "stars": "1 star"
        },
        {
            "comment": "After upgrading to Lollypop, I am facing many issues. Touch screen is not working. After it got fixed, now loud speaker is not working. The phone is getting heated if you charge it for 15 minutes.This is a waste product...wasting the money for this product...dont go for this product...",
            "date": "01 Apr 2015",
            "name": "Priyabrata Subudhi",
            "stars": "1 star"
        },
        {
            "comment": "MOTO G 2ND GEN IS VALUE FOR MONEY PRODUCT .. BUY FOR: SMART LOOK LIGHT WEIGHT FAST PERFORMANCE NOT FOR: BATTERY LIFE MESSAGING MAIN CONTACTS KO SELECT NAHI KAR SAKTE MULTI CONTACT MSG OR MSG TO GROUP NOT POSSIBLE",
            "date": "01 Apr 2015",
            "name": "Bdpo Siwani",
            "stars": "3 stars"
        },
        {
            "comment": "bought this phone for my wife on her bday . i am impressed with the device at many pointers like Display Size , Clarity , Easy To use system , Call Quality , Camera , Gps etc. the things that i am not liking are Display is a bit yellowish not completely white , Battery runs out to 40 % by evening she is back from office just with normal usage of the phone a window 8.1 or 10 os in the same device would definitely let me buy 1 for self i am not a fan of Android any given day",
            "date": "01 Apr 2015",
            "name": "Abhinav Poonia",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after 1 month of using the device. Am not going to detail the specifications, it is given in the product description on the website. This is a very impressive mid range smartphone and it comes with android version lollipop 5.0.2 on the box.This is one of the few phones with the lollipop on the box. Packaging is very nice and accessories given in the box are also very handy. Performance of the phone is very good with battery life lasting a little more than a whole day (with complete services such as location, wifi, data etc being used ). The interface is so fluid and is a delight to use the phone. Camera quality is very good for daylight photography, however low light and night photos have a lot of noise and doesn't come out very great because of the flash not being bright enough. Also, disappointed with the fact that there is no mode selection in the camera such as portrait, sports etc. Call quality and video playback quality is very good. The battery does take a slightly longer than usual time to be fully charged, but as I said earlier, battery life is very good. USB OTG works very well, however with the support of a third party file manager app. Phone occasionally does hang when trying to retrieve old files etc. and sometimes has a problem to receive 3G/ Edge data signal. Display and sound quality is also amazing with the dual speakers. Packaging was excellent by Flipkart and delivered before time by seller WS Retail. Hats off to you guys!! Only wish there were more colours available, other than just black and white. Moto however does sell back panels and flip covers in various colours. Highly recommend this phone to a mid range user and kudos to Motorola Mobility.",
            "date": "01 Apr 2015",
            "name": "Mohanakrishnan...",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing review after 6 month use, Moto G proven its quality. Battery backup is fantastic. Voice quality is good Download over wi-fi is good easy to use you can play light game No hangs I don't like few pre-installed application (google korean keyboard, etc .. ), moreover i cannot un-install them sometime battery heat up on high usage",
            "date": "01 Apr 2015",
            "name": "Ravi Shankar",
            "stars": "4 stars"
        },
        {
            "comment": "Got the mobile delivered on December. The delivery was prompt and was delivered in 1 day. But the product is NOT good. I am facing issues with the phone within 1.5 months of buying. It was not getting charged and was not switching on. The Moto service center people told me that there is a very minute edge in the charging pin that has been cut and needs to be replaced. But Moto does not replace the charging Pin alone, and the entire Motherboard needs to be replaced. the Cost is Rs.8000. This is not covered in warrenty because this issue is being considered as a physical damage. ( Not sure why this is so). 8000Rs for issue with the charging Pin alone. and the phone itself cost 12999. Totally Unhappy and the Flipkart is also non cooprative as the time has crossed 30 days from purchase. It's been more than 30 days since this issue started and have also called up Moto support , but no one seems to be assiting in resolving this. Totally unhappy with this product and service of Both Moto and flipkart.",
            "date": "01 Apr 2015",
            "name": "Saravanan",
            "stars": "2 stars"
        },
        {
            "comment": "Out of all the phones I saw online, I regret buying this one. I believe it's FAKE. There is NOTHING good about this phone except that fact that it has a wide screen and a swift OS. 1. The charger is a 2 pin charger which HEATS UP EACH TIME I charge it. It gets so hot that you can't even touch it. 2. The phone, within 2 days of buying, STARTED GETTING HOT when on calls. I fail to understand how. 3. NO USB PROVIDED ALONG WITH THE PHONE. How am I supposed to connect my phone to the computer? 4. Untidy packing. Really bad. Please DO NOT buy this phone. I had alot of expectations with this phone but what's real is real. Thanks.",
            "date": "01 Apr 2015",
            "name": "Sheoli Chaturvedi",
            "stars": "1 star"
        },
        {
            "comment": "Works just fine with new android Lollipop.... HD display Quality with decent audio output......Cool style and design.....better than Redmi.....Best phone at Best Price",
            "date": "01 Apr 2015",
            "name": "Joseph John Bi...",
            "stars": "5 stars"
        },
        {
            "comment": "battery discharging with in 12 hour..............................................................................",
            "date": "01 Apr 2015",
            "name": "shine jose",
            "stars": "4 stars"
        },
        {
            "comment": "The battery life i hated yesterday only i bought this phone..very very worst battery backup....bullshiitttt phone in my life....",
            "date": "01 Apr 2015",
            "name": "Mathan Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "I m using this phone since feb. the phone is good with android lolipop update its has good camera quality nd its never hangs. it sound quality is awesome but its average looking manufacturers should change its looking.",
            "date": "01 Apr 2015",
            "name": "Raghav bhavishya",
            "stars": "3 stars"
        },
        {
            "comment": "Hi Team, My charger has stopped working and now it is not charging my mobile phone. Please do replace my charger.",
            "date": "01 Apr 2015",
            "name": "Ravi Bansal",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone since last 7 days. Very good experience, Only one problem is that it takes so much time to charge the battery and the charger is very chip. Battery backup is average.",
            "date": "01 Apr 2015",
            "name": "Hrishikesh Sarma",
            "stars": "4 stars"
        },
        {
            "comment": "It's pretty smooth and faster and Keyboard sensitivity is amazing. Love its high definition image capturing by 8 MP rear end camera with LED Flash. And love the fact that it had got Android 5.0.2 pre installed during the replacement. The vibration mode is damn good even when phone's sound is in silence mode. It even heavily vibrates in my pocket when kept in silent mode. Thanks Flipkart, W.S. Retail & ekart logistics for such a great product and for timely replacing the old Moto G (2nd Gen) with this new one.",
            "date": "31 Mar 2015",
            "name": "PRITHWISH SAHA",
            "stars": "5 stars"
        },
        {
            "comment": "Good Product... Came with andriod lolipop update... faster access and on time delivery. only fed up with the battery which does not give a day access need to charge it twice. Hello Flipkart, My MotoG 2nd gen back cover is been slightly not closing well, it is like opened from bottom. Kindly help me out.",
            "date": "31 Mar 2015",
            "name": "Arun K",
            "stars": "4 stars"
        },
        {
            "comment": "this phone in 1 word: INCREDIBLE!! Cant believe how motorola managed to enroll all the features it has, in this phone at such a low price.. It could have easily been priced around Rs15-17000 but hats off to motorola!! Just 1 complaint that I have is its battery backup could have been better!! But awesome phone overall..",
            "date": "31 Mar 2015",
            "name": "Shubham",
            "stars": "4 stars"
        },
        {
            "comment": "i Buy 2 Moto G 2nd Gen phone, Its totally waste in all features and performance are very bad, Dont buy this product.",
            "date": "31 Mar 2015",
            "name": "sathiya",
            "stars": "1 star"
        },
        {
            "comment": "the product is excellent only two minor issues one micro sim other non removable batter . there two are not a deal breaker in any way",
            "date": "31 Mar 2015",
            "name": "Abhishek Mittal",
            "stars": "5 stars"
        },
        {
            "comment": "I have not bought 2 of these sets, both for my sisters. It's a damn good phone for the price. Absolute value for money. Great experience shopping at Flipkart",
            "date": "31 Mar 2015",
            "name": "Amit Dubey",
            "stars": "5 stars"
        },
        {
            "comment": "This is very good product...... I'm using this since 6 months and in this period this phone did not hang any time.... its camara quality is very good.... and its too good in use....",
            "date": "31 Mar 2015",
            "name": "Santosh",
            "stars": "5 stars"
        },
        {
            "comment": "aswm device for this specs.. but poor packaging!!!! ever no other online services has more secure packaging than this",
            "date": "31 Mar 2015",
            "name": "sreehari",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone when flipkart gave a discount through their app of Rs 2000. The phone was available for Rs 10999, and I bought a 6600 mAh power bank along with it. I have been using the phone for two days. I got this product one day before the expected date but the package through which flipkart sent it was not impressive. There was only sash of bubble wrap inside and that too was running everywhere except being attached to the packet of the phone. Thankfully the phone turned out to be okay so I guess I can deal with it. Body- Its very simple, yet has a premium look. The bezel around the screen is not the thinnest (Specially in the top, mainly to give room to the stereo speakers), yet the phone is surprisingly usable by one hand despite having a 5 inch screen. The back isn't glossy so no need to worry about fingerprints. However, sometimes the phone felt a little slippery and the volume rocker and the power button wobbles a bit. Its not like its going to come out anytime but it does. Motorola should have done better here. Screen- I have no idea how they managed to put such a good display inside a low budget phone like this. Yes, its not full HD (720p, not 1080) but believe me I have seen full HD screened phones giving a worse display performance. Ambient light sensor works like a charm. No matter where you go it adjusts the brightness for you perfectly. It has wide view angles and the screen is very much view-able at bright sunlight so no issues there. The touch responsiveness is good enough to be satisfied. I have no intention for a scratch test of the Gorilla Glass 3 that they provided but the feel was quite good. Unfortunately the day I got it there was a heavy rain while I was outside with the phone, It was in my pocket but the whole trouser got soaked, yet nothing happened with the phone so I would say the water resistant claim is valid too. Software and Performance- The phone comes with a Kitkat but for the very first time you switch it on, it will give you a prompt if you want to upgrade. If you select yes you can use lollipop from the very beginning. The overall operation is quite smooth but the phone does face a little lag while playing the transition animation from the apps menu while returning to the home screen. Though I think this is a problem of the software and can be fixed with an update. Loading of the casual games were really fast. Although while multitasking (maybe keeping 3 or 4 apps open at the same) I did face a little lag here and there for a short moment. I was playing Subway Surfers so it was not expected. Haven't played any heavy games yet, when I do I'll update the review. Camera- Motorola has a reputation that their phone cameras are not good. Well, the camera of moto G (2nd gen) is an exception. Its snapshots are very nice, even the front camera which is only 2MP can surprise you sometimes. It does struggle when the light is low but which camera doesn't, right? I thought it was good enough there too. Connectivity- The wifi and bluetooth had no problem and the performance was seamless. But While connecting through the USB I did face some issues. First of all, THE PACKAGE DOESN'T HAVE A USB CABLE INSIDE (What bad thing would have happened if they provided a charger with a removable data cable I wonder), so be ready to buy one along with the phone. Next, All of the data cables don't work on this phone. While buying choose a 4-wired data cable in stead of a two wired one (Can't write details here, space is limited). Battery- The battery backup is indeed low. It won't last a full day with moderate/heavy usage. Although to compensate that I bought a small 6600 mAh power bank so don't have that problem anymore. To summarize, the pros and Cons: Pros: Value for money Excellent Looks Beautiful Display Decent performance (Unless you load it up with 5-6 apps running simultaneously) Lollipop Upgrade Very good camera Cons: Video call not available (Can be done through third party apps like skype but not possible directly) No USB cable, sometimes data cable might mismatch and although charging, internal storage won't be shown in PC Headphone provided isn't good Speaker volume is not very high, sound quality good enough though Volume rocker and power button wobbles a bit, could have done better Battery Backup not decent (Will increase fairly once upgraded to lollipop) Takes long time to charge (Don't use your phone while charging, that will lessen it) The cons do have a way of compensation so to me, overall a fantastic phone, considering the budget. Going to give it 4 stars and would definitely recommend others to buy this when someone wants a brand with decent performance but has a problem with budget.",
            "date": "31 Mar 2015",
            "name": "Naim Asif",
            "stars": "4 stars"
        },
        {
            "comment": "the worst mobile which i have seen....i need to get service to my moto g2 :(. this mobile has problems in all aspects....",
            "date": "31 Mar 2015",
            "name": "soumya jk",
            "stars": "1 star"
        },
        {
            "comment": "I Everything is OK in this phone but I found two main disadvantage 1st battery back up is not good and 2nd SAR value is higher than others rest of this I like it .....",
            "date": "31 Mar 2015",
            "name": "Jyotikumar Patel",
            "stars": "4 stars"
        },
        {
            "comment": "ive been using it from 3 days and i can say the phone is good for its price there is some heating while using wifi and some intense gaming but not too much games are running good back camera which is 8 megapixel satisfies but i have little disappointment with the front facing camera built quality is great for its price display is too good which i did not expected battery backup is not too good but satisfies a normal user by conclusion i would say the buyer will be satisfied by the overall performance of the phone",
            "date": "31 Mar 2015",
            "name": "VaMsy Hari",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: The phone has very easy and convenient User Interface and is very fast. There are no lags whatsoever. Its just three days old so it may be too early to say. The camera quality is great and display is very good. Cons: Terrible battery life. The phone is hardly three days old but I have to charge it twice a day. Plus the touch pad is of very poor quality. While typing, some of the keys on the touch keyboard doesnt respond.",
            "date": "31 Mar 2015",
            "name": "Anonymous",
            "stars": "3 stars"
        },
        {
            "comment": "This was my 1st purchase from flipkart. Overall a Good phone... Cons: Bulky... Battery Life Is low... gets heated up. Back camera is good. Front rather secondary camera doesnt work properly. Could have a better front camera.",
            "date": "31 Mar 2015",
            "name": "Priyanka",
            "stars": "3 stars"
        },
        {
            "comment": "It is a very good deal available at this price.The delivery time is also very fast.Only thing to improve is that the sound quality could have been better.Overall Excellent :)",
            "date": "31 Mar 2015",
            "name": "Koustav",
            "stars": "4 stars"
        },
        {
            "comment": "Delivered 2 days earlier in good condition. Pretty fast browsing. My findings.. 1) Plug the charging pin to mobile and plug the charger to mains. Once, the mobile hung by showing battery fully charged but when you switch off the charger its only 58%. I need to restart. 2) Battery condition is 82%, while video recording in HDR mode at about 5 mins recording, the mobile went hot and video on capture was jerking for every 2 seconds. 3) With Kit kat, favorite calls dialed instantaneously. After lolli pop update, favorite calls dial-up a bit late. Apart from the above, its quite a good mobile worth for the money.",
            "date": "31 Mar 2015",
            "name": "R. Vijayakumar...",
            "stars": "5 stars"
        },
        {
            "comment": "Dont buy this model, It has low battery backup & oftenly it has restarting & hanging. Pl. avoid your purchase & save your money. It has no customer support.",
            "date": "31 Mar 2015",
            "name": "karthick M",
            "stars": "1 star"
        },
        {
            "comment": "Its been more than 8 months now i am using Moto G (2nd Gen) and so far have not encountered any problem.Battery back is excellent even when you using data services.RAM is just 1 GB but still no lagging while using Apps or playing any game.",
            "date": "31 Mar 2015",
            "name": "susheela tokas",
            "stars": "5 stars"
        },
        {
            "comment": "Initially was happy with this phone. As soon as I updated to Lollypop the phone was as slow as sea turtle on Land. It wont even handle multiple apps properly. I guess its the Lollypop which has a huge memory leak issue. After using it for 2.5 months, I sold it for 9k. If I had realized it earlier, I would give given it back to flipkart and would not have suffered losses. For a smartphone, its not about the processor, the RAM or any specs on paper. Its how fluid the phone feels while using it. 4 years old iPhone 4s feels better. I guess , i will go for a Oneplus One or iPhone 5s",
            "date": "31 Mar 2015",
            "name": "Karthik Rajagopal",
            "stars": "2 stars"
        },
        {
            "comment": "Just go for it. I experienced the service of Motorola. Its very nice. Best product in range. I bought Moto G 1st generation 6-7 months back and now on 31/03/2015 I bought Moto G 2nd Generation. I am always overwhelmed for Motorola Brand. And I am now planning to buy upcoming Moto G 4g version. And I am also waiting for Motorola Tab with 3G or 4G facility if they launch. Never Doubt about the product Moto G as well as Motorola.",
            "date": "31 Mar 2015",
            "name": "PRATIK GAUDANI",
            "stars": "5 stars"
        },
        {
            "comment": "loss of network connectivity, Single lost every time , The latest update to Android 5.04 but there are still facing the problem. Please replace",
            "date": "31 Mar 2015",
            "name": "Harish Singh",
            "stars": "1 star"
        },
        {
            "comment": "Good phone. More multi tasking than Moto E but i miss a feature where I can log off my gmail account on it. Feature missing on both Moto G/E.",
            "date": "31 Mar 2015",
            "name": "Satyanarayan P...",
            "stars": "4 stars"
        },
        {
            "comment": "Please make it sure before buying any product from flipkart that will you able to return them. I bought new Moto G mobile and it has defected battery, When I raised request to flipkart they said that seller rejected the request. So now I have to run through service centers. ....WHY???? I paid 12999 for defected Moto G piece bought from flipkart.",
            "date": "31 Mar 2015",
            "name": "Find me",
            "stars": "1 star"
        },
        {
            "comment": "Actually I Ordered my mobile in Date: Mon, 23rd Mar'15, Flipkart provide expected delivery date Delivery expected by Thu, 26th Mar'15, but i got my order Delivered on Sat, 28th Mar'15. Worst delivery from flipkart their packing also worst not secured.",
            "date": "31 Mar 2015",
            "name": "Girish Sainath",
            "stars": "2 stars"
        },
        {
            "comment": "Sorry to edit this review, as early there was an issue of the RAM but now phones Touch pad and screen stopped working, so facing problem with the service center and leaving with no phone to use now a days, also an availability of the spares is also a problem. I hope this problem is regarding this specific handset only. phone hangs a bit while playing high graphics games like Real racing 3, the suspect may be a RAM with capacity of 1GB, a 1.5GB or 2GB RAM would have done justice to this.",
            "date": "31 Mar 2015",
            "name": "Swapnil",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this product on the App Day. Got a Discount of almost 3000 INR. Awesome Product, the touch sensitivity is just superb. Hats-off to the Innovation of Motorola. Recommending every one to purchase it.",
            "date": "31 Mar 2015",
            "name": "Arnab Saha",
            "stars": "5 stars"
        },
        {
            "comment": "I am very impress with this phone,Lollipop makes things easy to use. 16 GB internal memory help to store app and games and runs with 1 GB RAM beautifully.",
            "date": "31 Mar 2015",
            "name": "Rohit Sontakke",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it by looking at some good reviews in market,but realy telling you don't even think to buy this phone, 1st of all as the phone is available only on flipkart so its a kind of monopoly kind of thing due which you will not get good service, with so much discussions I replaced my phone with flipkart and the 2nd set was also having multiple issues, I think flipkart is just selling low quality products now a days, inbuilt bettery is another bad feature, bettery charges very slowely and dip down suddenly. Voice quality of phone is so bad, even on normal calling ppl around you can clearly listen your call. overall its a very low quality phone, ultimately I had to sell it at very low price.",
            "date": "31 Mar 2015",
            "name": "Mohan Garg",
            "stars": "1 star"
        },
        {
            "comment": "Hey I have used this phone its amazing Screen is superb Call quality is good Stereo speakers best Only con Battery - average (Maybe due to lollipop ,search for lollipop battery drain problem)",
            "date": "31 Mar 2015",
            "name": "Prince prince",
            "stars": "4 stars"
        },
        {
            "comment": "I was in dilemma on whether to go for motorola or stay with my earlier preffered brand. I have been using this for past three months and I am more than happy with the product. The camera resolution is best value for this mobile. The processor never buckles and gives full support with so many parallel running apps.",
            "date": "30 Mar 2015",
            "name": "Amol Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "It takes 3 hrs to charge the Battery from 0 to 100 % Do not update it because lolipop os has some problem about music player.",
            "date": "30 Mar 2015",
            "name": "Subhash Chander",
            "stars": "1 star"
        },
        {
            "comment": "good product in affordable price range.........................works fast......but ram is bit less when comparing with other mobiles at this price range",
            "date": "30 Mar 2015",
            "name": "pavan bathina",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good buy keeping in mind its price and the brand `value of Motorola. However one should buy this mobile only if you're sure that you have a service centre anywhere near your place. You may not have to make regular trips to the service centre, except if you're facing issues with battery and charging in general. 6 months after buying this mobile, it showed problems with charging. It wasnt getting charged. The flipkart people made it their responsibility to get the phone to work properly and deliver it to me again after servicing. Great job flipkart. The causes of my charging issues- not using motorola charger, draining the entire battery before putting in charge, overnight charging. Please avoid these mistakes if you wish any of your mobiles to work normally. This motorola model is great otherwise. Its a device for keeps.",
            "date": "30 Mar 2015",
            "name": "Ritul",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is a total beast! After 24 hrs of usage Touch-Super Sensitive Camera-Average UI- Best (Stock){{Lollipop!}} Games- Awesome :) Battery-Ok The battery is the part which concerns me a lot. This phone can only last for 3-4 hrs when gaming. Bu for an average user(casual gaming, 2-3 hrs of calling, 3G) it can last for more than a day. The phone does not heat while doing any work or gaming. The power saver can be helpful when in emergency. If you are an android lover, go for it! THIS IS THE BEST PHONE AVAILABLE IN THE MARKET FOR THIS PRICE RANGE",
            "date": "30 Mar 2015",
            "name": "Vikrant Bedi",
            "stars": "5 stars"
        },
        {
            "comment": "First of all, I want to thank Flipkart for 2000 flat discount during Feb 23 to 25. It was best deal in 11k. I would have never gone for it paying 13K as I could get more or less similar features under 10K. But I could still not get Lollypop with any other brand. Pros: Camera, Sound, OS, Pure Andriod Cons: Battery is big turn off. Other issue is is the 1GB 3G data offered by Airtel. Nier Flipkart nor Airtel let me connect their customer service and provide the details.This is why I would give 4 starts out of 5.",
            "date": "30 Mar 2015",
            "name": "Atul Tiwari",
            "stars": "4 stars"
        },
        {
            "comment": "Don't rethink, you have made a right choice if you are looking for a budget phone. This is 5th time, I'm buying Moto G & this piece for my father. Flipkart delivered within a day. It looks cool, after all it is original android from Google, no customisation, no lag on performance. So just go for it.",
            "date": "30 Mar 2015",
            "name": "Manoj Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Once i got the mobile i had updated to Lollipop version OS. Once after updating the OS mobile starts to hang.. The apps start to close while working.. It had been for Two days this problem persists and mobile is too slow.. So i request the replacement of mobile.. They had replaced the mobile but the replaced mobile is too bad then the old mobile.. The mobile has power issues.. Once the power is switched off it can't be switched on and the battery back up is too bad.. Then i serviced my mobile from service center and now it is working fine... All Features in this mobile are good.. Battery backup is too pathetic..",
            "date": "30 Mar 2015",
            "name": "MOHAMED THARIQ",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this and it worked perfectly until i took it to school. Then it got confiscated. Only problem I've faced up till now.",
            "date": "30 Mar 2015",
            "name": "karttiikk",
            "stars": "5 stars"
        },
        {
            "comment": "Best product in this price. Moto G2 has advance features than G. But the slim look of Moto G is missing here, it is little more thick. Over all the mobile is good.",
            "date": "30 Mar 2015",
            "name": "Sunil kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered Moto G on the 25th of September. I was pleasantly surprised to receive it on the 26th of September with normal shipping. Full marks for the buying experience. The performance was acceptable and all was well for 4-5 months. Accidently my charging slot happens to get damaged by me. What normal people will think its charging slot not a big issue. Easy replacement? No chance. The Motorola service Centre said that as charging slot is directly connected to the motherboard need to change whole motherboard. I was shocked!!!! And as charging slot damage is considered as Physical damage replacement of motherboard do not get counted in warranty period. The price they said to replace is 7k for 13k mobile (More than half of original). And I think most of the people don’t know that charging slot damage affects that much amount. In Hindi it’s like “Ghode (Horse) ki naal (horse shoe) kharab ho gayi toh pura ghoda hi badal (replace) daalo”. Other customers, I suggest you, to think before purchase. Don’t make a mistake that I made. I have decided to throw the phone and get another one (Not Moto). Why? Coz I know at least other phone charging slots does not charge this much amount. So here's me saying Hi and Goodbye to the only Moto product I will ever own.",
            "date": "30 Mar 2015",
            "name": "Ashish Khot",
            "stars": "1 star"
        },
        {
            "comment": "Best Phone @13k after 6 months of release..flipkart packing is not good..but over all satisfied product",
            "date": "30 Mar 2015",
            "name": "Dinesh Shanmug...",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone, fast enough to smoothly run any app i throw at it. Battery easily lasts a day too, its a bit bigger than my earlier Moto G but unless you are bothered about that, its one of the best phones available in this segment.",
            "date": "30 Mar 2015",
            "name": "Deepak E.V",
            "stars": "5 stars"
        },
        {
            "comment": "TOTALLY A VALUE FOR MONEY PHONE * GOOD DISPLAY, AWESOME SOFTWARE IN TODAY S DATE, *PERFORMANCE, AWESOME, *CAMERA BEST FOR VALUE *SLIGHTLY HEATS UP NORMALLY LIKE ALL MOBILES *GORILLA GLASS AND HANDLING FEEL WERE VERY NICE JUST FOR IT *IF YOU ROUGHLY USE THE MOBILE PHONES IT SUITABLE Y MADE FOR YOU GO FOR IT",
            "date": "30 Mar 2015",
            "name": "Subramanaya",
            "stars": "4 stars"
        },
        {
            "comment": "i have order Moto G 2nd generation on 24-Mar-2015 but 30-Mar-2015 only i got the mobile. its very slow process please avoid delay delivery... Product was gooooooooood...",
            "date": "30 Mar 2015",
            "name": "Velu Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "worst after sale service . no profit of warranty. if a problem starts in your product , it will land you up just taking rounds of the service centre.",
            "date": "30 Mar 2015",
            "name": "Pranav Singrodia",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone for last 6 months,This is a good at 12999/- but do not expect a good battery backup, with 3G/2G on, it sucks, it comes hardly 12Hrs. Except this, Phone is excellent in performance.",
            "date": "30 Mar 2015",
            "name": "Tammiraju Gundra",
            "stars": "3 stars"
        },
        {
            "comment": "when u first get the product its gud and in working condition and dat tym its too early to review ,but now after having used the product for 5 months or so i won't recommend it to any1 specially not from flipkart online portal The handset has got very good features at a resonable price but finally what matters is dat whether the product is genuine or not? -i would say not a genuine product at all from flipkart...",
            "date": "30 Mar 2015",
            "name": "suraj singh",
            "stars": "1 star"
        },
        {
            "comment": "This review is meant for flipkart delivery not for Motorola G features. I had ordered Moto G (G2) on 24 March on flipkart app which had one offer as particular discount that day and I got 27 March as expected date of product arrival . After purchasing phone , status of order moved to \"your product has been confirmed\" .On 25th march I received a call from flipkart customer care asking about confirmation of product (it was a COD!) and he assured me , I will be mostly getting my phone by today and worse at tomorrow. On 26th (27 is expected date promised by flipkart) still status was same so I called its customer care services and escalated. Today (30 March ) finally i received my phone. I wanted to ask the reason behind this poor delivery . If any product is out of stock please dont promise us and that too in case of phone(one week i was without any communication with outer world). If u promise , value your words. Dont force us to search for a substitute for u . Hope flipkart team will understand and improvise on it.",
            "date": "30 Mar 2015",
            "name": "Surbhi Bhardwaj",
            "stars": "1 star"
        },
        {
            "comment": "SUPERB MOBILE AND EVEN THE DELIVERY TIME TOOK FOR IT WAS AMAZING AND IM SO THRILLED IN USING THE MOBILRE !!GOT WITH LATEST ANDROID LOLIPOP!!!",
            "date": "30 Mar 2015",
            "name": "sailesh krishna",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this mobile for several months and now i can say that this is the best phone ever in this budget. The android experience is very rich and seamless. I highly recommend this product",
            "date": "30 Mar 2015",
            "name": "nitesh",
            "stars": "5 stars"
        },
        {
            "comment": "For five months I have been using Moto G2,phone is working fine and no major issue encountered yet. Good value for money.....!!!!",
            "date": "30 Mar 2015",
            "name": "Vaibhav Singh",
            "stars": "4 stars"
        },
        {
            "comment": "but it gets stuck every time. speed reduced not as expected. Its average in all aspect. good screen better display,",
            "date": "30 Mar 2015",
            "name": "sathesh",
            "stars": "4 stars"
        },
        {
            "comment": "BATTERY PERFORMANCE IS NOT GOOD, CAMERA IS AVERAGE. DISPLAY WAS VERY GOOD. FOR THIS DISPLAY NEEDS 3000 MAH BATTERY",
            "date": "30 Mar 2015",
            "name": "LAKSHMAN VANKAM",
            "stars": "3 stars"
        },
        {
            "comment": "Dear All, Please be note i have ordered moto G 2nd Gen on 23-Mar-15 with offer of Rs. 2000/- worth booking through mobile app. i booked and expected delivery on 27th March but not received the same. later i requested track status they were cancelled my mobile without consent of mine. this kindly worst service flipkart giving know days to us. i have supported our Indian company like more than years. they failed to maintain trust with customers . I request to interfere some senior staff and resolve the issue. instead of refund and i want mobile only.",
            "date": "30 Mar 2015",
            "name": "Gururaj M",
            "stars": "1 star"
        },
        {
            "comment": "Even after using 2 months, this phone is working excellent. The most awesome thing about moto g is the dual speaker, which gives very fine tune stereo sound. Go for it!!!!! its amazing.",
            "date": "30 Mar 2015",
            "name": "Ravi Johal",
            "stars": "5 stars"
        },
        {
            "comment": "I am someone who is the user of Motorola-G2 . Recently in month of January 2015 I had ordered moto-g2 online from flipkart. I received the cellphone on 31st of Jan 2015. On the 31st day from date of receipt my cell was facing touch screen issues. The touch screen started getting hanged automatically and i had to wait for around 10 odd minutes for it to work in the normal condition. Sometimes it used to get hanged in such a way that i just could not use my cell phone for couple of hours.Since it was the 31st day hence i approached flipkart and asked for a replacement but they told we cannot replace it since it was the 31st day as per their Policy. Day 1 : . Finally ,as per flipkart , on 3rd March, as my cellphone was in warranty period and as I trusted after sales services of Motorola I thought to give it to authorized service center near to my location. So I approached service center of Motorola in Mumbai (Address : B2X Service Centre , Dadar, Mumbai). I gave my phone to the counter and they said that \" the touch screen and display will be changed and it will take 10 days\". Day 18 : I tried calling the service centre several times but no one picked up the call the emails sent to the service centre went unanswered.Hence finally i called up motorola customer care and i was being told that the cell phone is ready for pick up.Hence i went all the way to the service centre and to my surprise i was being told that the cell phone has not beinf repaired and will take 3 more days. Day 20 : Finally i called up motorola , marked a mail to the customer care id on 23rd March 2015 ,regarding the delay. You can check ur email records in the system.I was being told to wait for one week Today Day 25 : I am really disappointed its just been 2 months i have taken a motorola phone out of which one month its i could not use it and it is with the service centre. I have just wasted one full month due to motorola's bad customer sales service. My question is what is the use of writing in big word \"12 MONTHS WARRANTY\". What if I say, that Motorola cell phones are losing their quality and using cheap equipments and finally Flipkart losing out their brand and their policy. Seems like I am stupid and visited the authorized service center. Does it take 20 days or more just to replace a part ???? I expect Flipkart to keep up their reputation and trust by replacing the defective piece as it comes fully under 100% warranty. Flipkart...plzz wake up ???",
            "date": "30 Mar 2015",
            "name": "Swaps",
            "stars": "1 star"
        },
        {
            "comment": "THIS IS THE BEST PHONE YOU CAN GET UNDER 15000.....IT RUNS BUTTERY SMOOTH BECAUSE OF ITS PURE STOCK ANDROID WITH NO CUSTOM TO CONSUME ITS RAM....IT RUNS HIGH END GAMES PRETTY WELL........IT LOOKS VERY STYLISH.....IF YOU WANT A LTE VARIANT OF THIS....YOU NEED TO WAIT FOR ATLEAST 3 MONTHS...",
            "date": "30 Mar 2015",
            "name": "ARCHIT SRIVASTAVA",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone! All google apps are integrated so seamlessly!! Lot of advantages on apps like Maps and Drive (integrated into stock) as compared to the same downloaded for my prev Samsung S2. Got lollipop too!! Initially had problems with sim card and memory card getting disconnected frequently. Service center guys said sim-memory-card-tray was faulty and replaced within warranty. Works seamlessly since then. Highly recommended phone!! Has some apps that I think are bloatware (coz I dont use them) but I feel the bloatware is less compared to Samsung! Thanks Moto!!",
            "date": "30 Mar 2015",
            "name": "Akash Kamat",
            "stars": "5 stars"
        },
        {
            "comment": "Value for Money undoubtedly. Gets slow when you get ambitious with its hardware capabilities. Nice and Handy. Dropped it several times but takes the beating.",
            "date": "30 Mar 2015",
            "name": "Manish Dev Mah...",
            "stars": "4 stars"
        },
        {
            "comment": "Wonderful than expectations! Excellance thay name is MOTO G 2ndGen Wonderful than expectations! Excellance thay name is MOTO G 2ndGen",
            "date": "30 Mar 2015",
            "name": "Mohan Deshpande",
            "stars": "5 stars"
        },
        {
            "comment": "purchased it a month ago... works jst awesome... flipkart's in a day delivery was jst mindblowing.... don pay heed to rumors dat itz nt good dat iz bad.... since itz not an iphone 6 plus.... if u r a gamer den dis is only for u at dis price...no heating issue after playing asplahlt 8 for 4 continuous hours... its also water resistant... u can play game while walking in rain..:p gorilla glass screen wid smooth touch...thoughi use a screen guard so dat it stays new...camera is awesome in 6mp.. wen u switch to 8mp mode it will give DSLR type output which is awesome...front cam is awesome and selfies will be jst crispy if u use apps lyk retrica or B612... dual speaker sound as loud as hell... JUST GO FOR IT..!!!",
            "date": "29 Mar 2015",
            "name": "Ashoke Nandan",
            "stars": "5 stars"
        },
        {
            "comment": "I guess I have to go long with this, coz am so in love with this device. 1. Excellent package and fast delivery from flipkart. Ordered it on saturday night and got it on monday morning. wonderful work guys. 2. Everyone has been complaining about battery issues, I don't find any issues with mine. It does give around 9-10 hours of usage using wifi. I guess that is enough for me. 3. Smooth, fast and clean UI. No additional tags or apps. Loved it. 4. Good camera quality. I loved the camera quality, especially the back cam which gives outstanding picture quality in ambient light conditions. 5. The dual front speakers are really a gift. I could now play songs and not worry to keep the phone screen facing the table. Cons: 1. Could have had a better headphone with the device as the default one doesnot have much effect. 2. Charging using the default charger is something that I wish I wouldnt have to do, as it takes upto 4hrs to charge from 0% to 100%",
            "date": "29 Mar 2015",
            "name": "Akhil J",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is fine. One star is snatched for its RAM. Otherwise its the best phone out there! Pros: Outstanding Camera Better battery-Lasts for at least a day while using internet. Display-Awesome 5 inch HD Cons: THE RAM! struggles a bit while using- occasionally when i reached 60 apps Gaming- Not the best That's it for now! Best phone for normal day to day use if you are not a gamer!",
            "date": "29 Mar 2015",
            "name": "John Abdiel",
            "stars": "4 stars"
        },
        {
            "comment": "It is very nice and good. the seller and flipkart fullfill my orders. Thank for all and very good service.",
            "date": "29 Mar 2015",
            "name": "gokul Raj",
            "stars": "5 stars"
        },
        {
            "comment": "It's been 2 months I am using this phone, it's been good performance in all features and technical specifications.",
            "date": "29 Mar 2015",
            "name": "Aditya Kalapatapu",
            "stars": "4 stars"
        },
        {
            "comment": "It starts heating after using it for 10 minutes. Did only basic things like used camera, went through gallery. Sound quality is not that good, when compared to my micromax a90s, which i am having from past 2 years.",
            "date": "29 Mar 2015",
            "name": "shiva",
            "stars": "2 stars"
        },
        {
            "comment": "Good phone, amazing and smooth performance. Now the upgrade to lollipop is also available. Delivered as per mentioned timelines",
            "date": "29 Mar 2015",
            "name": "Ashish Mehta",
            "stars": "4 stars"
        },
        {
            "comment": "Dear Flipkart, I have ordered Moto g on flipkart on 24 March 2015. first i have notified that my order will receive on 28th march. but after 2 days they told me there is a delay in order. on 29 march i received sms that your product is out for delivery...and it will be delivered before 7 pm. So i was waiting for it. but it doesn't come. so i tracked it on site this time they are showing delivery unsuccessful. this is totally ridicules. If you are not able to deliver it then why you send sms??? Flipkart has lost all its credibility as fast delivery. They are overbooking on orders without taking care of deliveries.",
            "date": "29 Mar 2015",
            "name": "Anuj Yekhande",
            "stars": "2 stars"
        },
        {
            "comment": "Overall a fantastic phone within 13k BUT... BUT.... Earphone of this phone is same as a phone cost of 1500. so music lovers place an earphone too when u placing your phone order. cheers!!!",
            "date": "29 Mar 2015",
            "name": "akshay",
            "stars": "5 stars"
        },
        {
            "comment": "i just got my handset and it has android 5 out of the box.flipkart shout update that in info. and its running smooth with no issues as of now. but that is only based on one day of usage...",
            "date": "29 Mar 2015",
            "name": "rohan rana",
            "stars": "4 stars"
        },
        {
            "comment": "undoubtedly....go for it...already..so many revies are there..but..for me..its d best..as i dont wana invest in mobiles more than 15k..n up at this price...its the best...recommended from my side!",
            "date": "29 Mar 2015",
            "name": "ANKIT",
            "stars": "5 stars"
        },
        {
            "comment": "horrible battery.max 4 hrs can not record calls. tried for more than 1 month. regular SD mounting card issue",
            "date": "29 Mar 2015",
            "name": "Kiran",
            "stars": "1 star"
        },
        {
            "comment": "Awesome phone in cheapest price. Best part of this phone is Powerful Performance and large screen. If you want a super performance, i suggest you to go for it.",
            "date": "29 Mar 2015",
            "name": "Abhishek Kumbhani",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone. No heating issues. Stock Android has a few issues here and there but manageable. However, one issue is that when the mobile is being used continuously with a single hand, the weight of the mobile grows on you. My hands start paining after 10 or 15 mins. Other than that, no worries. Have purchased the PNY 10400mAH power bank for this mobile. Charges my mobile atleast 4 times and that too very fast! Also, got the sandisk 32GB class 10 microsd card. Have not loaded anything to it yet but seems to be working fine. Satisfied with the flipkart delivery as well. Received in 2 days.",
            "date": "29 Mar 2015",
            "name": "Gurumoorthy Pa...",
            "stars": "4 stars"
        },
        {
            "comment": "A very good phone for the price. The product competes with phones much more expensive and stands its own ground. The camera is also very good",
            "date": "29 Mar 2015",
            "name": "AJOY MUDALIAR",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile is really a piece of junk...from day 1 its facing issue and also have to visit the service center a lot of times. Better buy a different one coz its just a TOTAL waste of money",
            "date": "29 Mar 2015",
            "name": "Rakesh",
            "stars": "1 star"
        },
        {
            "comment": "If u r used to setting own tones then no , no file manager , cant set ur own ringtone alarm tone message tone, Interface wise good and but battery is just okay! Not goood or bad ! Music player worst !",
            "date": "29 Mar 2015",
            "name": "cibi chakarava...",
            "stars": "3 stars"
        },
        {
            "comment": "Highly appreciated the way Flipkart.com has treated my replacement request. I received this Moto G2 with a problem of ear piece. I have requested for replacement and got the replacement in a very efficient way.I recommend Flipkart and hats off to the Support team.",
            "date": "29 Mar 2015",
            "name": "Yajendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Fantastic smartphone 2 hv. A lot better than its competitor zenfone 5. Amazing sound. The best part are the 2 speakers which are positioned at the front. It is really very convenient. Battery life is a little disappointing but the other features makes for it.",
            "date": "29 Mar 2015",
            "name": "Harshit Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "positives 1.looks good 2.battery life ok 3.easy to use 4.ram is ok negetives 1.8 mp camera not so good",
            "date": "29 Mar 2015",
            "name": "Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "i have used these phone for 2 months or so and found the following things Pros 1. Lollipop 2. Camera Cons 1. Plastic finish, feels very bad like a toy in hand....don't go with it for looks 2. Hangs even in playing average games. 3. Worst battery drops down to empty with below average use in 8 hrs. 4. Sound clarity is worse like hell......can't play in front of friends 5. Far better phones available at these price",
            "date": "29 Mar 2015",
            "name": "Rohit Bisht",
            "stars": "2 stars"
        },
        {
            "comment": "The only part not so awesome would be its speed. Sometimes it hanga for a second or two but that may b because of the way i use.",
            "date": "29 Mar 2015",
            "name": "Abhishek Singh",
            "stars": "5 stars"
        },
        {
            "comment": "My sister wanted a phone and this seemed perfect according to her use... well after actually getting it ..i really appreciated Motorola's effort..decent and snappy at the same time nice build,design,and the headphone and speaker outputs are just rocking...",
            "date": "29 Mar 2015",
            "name": "Himanshu Shekhar",
            "stars": "5 stars"
        },
        {
            "comment": "So I've been using this phone for roughly 6 months now and it has been a great phone. I have come from a Nexus 4 and it is and upgrade in some aspects while a slight downgrade in others. So starting my review: PROS -Dual Speakers: Super, lovely heavenly sound(As compared to the Nexus 4) -Camera: On par with the Nexus 5! -Great screen size( It didn't take me long to get used to it, and once I did I'm now a fan) -High build quality: Really, coming from a N4 I'd definitely pick this quality, sturdy, feels great in the hand. -Battery life: Gives me approximately an hour more of screen on time as compared to the nexus 4, overall I'd say a 20% improvement(lasts a day easily with medium to heavy use) -SDCard: HUGE proponent for buying the Moto G2. -After market support: Several ROMs available. -OTG Support: Plug in USBs, mouses, keyboards, gamepads. CONS 1. RAM: Felt that the ram(1GB) was a bit low for a new device, however there is no compromise on the performance.(There is, however memory leak which is to be supposedly fixed in the 5.1 update) 2. Non-removable battery: I'd always like the option to pop a new battery in :P 4 and a half stars! So I guess that's it, the pros to con ratio is in favor of buying the Moto G(2nd gen) :D Hoped this review helped!",
            "date": "28 Mar 2015",
            "name": "Marc Miranda",
            "stars": "4 stars"
        },
        {
            "comment": "First of all hats off to flipkart's delivery service, I placed order and got within couple of days. The smartphone sports a large display which enhances the experience to watch video. Also you get free Lollipop update for moto g2. The only thing I feel is, it should have at least 2 GB RAM. Currently supported RAM is fabulous while using a couple of apps at a time, however, if you wish to use multiple heavy apps, this device under performs. Sometimes due to overload, the apps are forcefully closed automatically, which is annoying.",
            "date": "28 Mar 2015",
            "name": "Anshuman Deshp...",
            "stars": "4 stars"
        },
        {
            "comment": "Was confused between this and Xiaomi Phones. But the build quality, reliability and the bloatware free product made me choose this. The product is very good. Earphone is very cheap and of poor quality. But there are much better phones at lower price than this. like Yu Yureka, Lenovo etc. Do your research before buying.",
            "date": "28 Mar 2015",
            "name": "Shakthidar H B",
            "stars": "5 stars"
        },
        {
            "comment": "all features are god in this phone but battery life is too short and sometimes there is also some speaker problem while calling.",
            "date": "28 Mar 2015",
            "name": "Tushar kanta P...",
            "stars": "3 stars"
        },
        {
            "comment": "according to its price moto g2nd gen is a very good smart phone but its battery backup is not so good .",
            "date": "28 Mar 2015",
            "name": "Haamil Tanvir",
            "stars": "3 stars"
        },
        {
            "comment": "First of all ppl I wd share my experience with you about buying an electronic device from Flipkart. If the seller is WS retail than products are 100% genuine but if you are buying from any other retailers you may need to het in touch with the service center to confirm whether its a registered product with the company or not.As there are too many fraudulent activities happening in the market of smart phones these daya.. I had been using Moto e for last 8 months recently upgraded to Moto G2...I love this phone as it has got almoset everything you need.. 1 thing I would like to mention here what I experienced with this phone is.. When you upgrade it to 5.0 you may feel a leg in opening apps and may feel that device is running slow.. All u need to do is to back up your phone and than do factory data reset... Now when your phone is up you ll notice that the processing speed is just doubled up. And it will work absolutely fine.. Other thing tht moto should upgrade in this phone is to provide battery and charger of higer ratings as the charger takes hell lot of time to finish chargin and 2070 mah battery is insufficient for a smart phone like this. Phone has good audio quality but headphones are pathetic.. It gives a feeling of headphones in 2001-2005.",
            "date": "28 Mar 2015",
            "name": "Vikas Lalwani",
            "stars": "4 stars"
        },
        {
            "comment": "A complete phone in all aspects...super performance...lovely design...great camera...average battery... style statement....",
            "date": "28 Mar 2015",
            "name": "Sibananda Maha...",
            "stars": "5 stars"
        },
        {
            "comment": "exceptional phone nice features don't hang great design and long battery life it is a beast must buy very low priced",
            "date": "28 Mar 2015",
            "name": "vivek yadav",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchase this phone before 8 month....Its excellent phone in this price range. Initially the operating System was Android Now lollipop version is updated",
            "date": "28 Mar 2015",
            "name": "Rajesh",
            "stars": "5 stars"
        },
        {
            "comment": "I have Purchased the Phone on dated 5-02-2015, but unfortunately phone slipped into the water on dated 9-03-2015, Due the inbuilt battery of the phone we are unable to dry it immediately and service center in very far from my place, we are unable to take to SC on same day, on next day I have taken to SC of MOTO, he has take 300 RS to check the phone and told it will not work and waste to invest the money on the phone to repair as I have purchased it for 12999 RS. it is very painful situation for me as phone is not working within the month only. (MY ADVICE IS NOT PURCHASE MOTO PHONES AS ALL ARE INBUILT BATTERY ONLY) and no local service centers cannot help the phone as it is unique design.",
            "date": "28 Mar 2015",
            "name": "SANDEEP ATHILI",
            "stars": "1 star"
        },
        {
            "comment": "When call arrives screen is not waking up.Talking over left side was less audible compare to right side.I was disappointed:(:(",
            "date": "28 Mar 2015",
            "name": "Udhay",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered the product at 2AM and got it delivered at 10 PM next day. Just 32 hours, it took Flipkart to get this superb phone in my hands. Works quite well, Much faster than previous generation and looks are good too.",
            "date": "28 Mar 2015",
            "name": "Rohit Sethi",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from the month of September 2014 and I am really impressed with the performance.",
            "date": "28 Mar 2015",
            "name": "Sreenivasulu G...",
            "stars": "3 stars"
        },
        {
            "comment": "i am writing this review after 3 months of my purchase. the first thing the phone is getting heated sometimes if some applications are running background, and the color is getting faded in the panel front side. afterall it is a nice product.",
            "date": "28 Mar 2015",
            "name": "jidin raj mc",
            "stars": "3 stars"
        },
        {
            "comment": "excellent working.............................................................................................................",
            "date": "28 Mar 2015",
            "name": "Pavan Teja",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product with good battery life. Delivered by vendor on 4th day (Ordered on 10th night and delivered on 13th noon) though it was scheduled to deliver on 18th. Suggestion: Please make delivery date more meaningful.",
            "date": "28 Mar 2015",
            "name": "Awadhesh Singh",
            "stars": "5 stars"
        },
        {
            "comment": "This is my first Android phone, so I m still exploring the device. Coming to the delivery, flip-kart does a very decent job they delivered the phone on the time. Pros **Best stock android phone under Rs 15000. **Camera: Does a decent job in indoor and outdoor. **8MP camera takes amazing pictures. **Screen is bright and vivid. Con's ** There were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. ****The wall charging unit provided by Moto is heating like anything. **And battery performance is average. **Requires too much time for charging.",
            "date": "28 Mar 2015",
            "name": "Jibu Varghese",
            "stars": "4 stars"
        },
        {
            "comment": "I am usin this phone which I bought from Flipkart. Motpo G2 is worth the money phone . It comes Lollipop android version which further enhances the smooth experience.",
            "date": "28 Mar 2015",
            "name": "Neha Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "USING IT SINCE NOVEMBER 2014 AND ORDERED A NEWER ONE FOR MY FATHER. PHONE IS GREAT, WITH GOOD FEATURES ESPECIALLY LATEST ANDROID LOLIPOP 5.0.2 AND GOOD RESPONSIVE SCREEN WITH FULL DAY BATTERY BACKUP (WHEN WIFI IS TURNED ON ALL THE TIME). FULLY SATISFIED. THANK YOU VERY MUCH MOTOROLA FOR MOTO G SECOND GENERATION. I WOULD LIKE TO GIVE MORE THAN 5 STARS. YOU CAN BUY THIS PHONE EYES CLOSED.",
            "date": "28 Mar 2015",
            "name": "GAURAV ROHILLA",
            "stars": "5 stars"
        },
        {
            "comment": "1.) ITS MOTOROLA 2.)ITS LOLLIPOP 3.)ITS 5 inch HD 4.)ITS GORILLA GLASS 5.)ITS FAMOUS 6.)ITS PREMIUM 7.)Do i need to say more NO COns according to me as this is motorola mobility..!!!",
            "date": "28 Mar 2015",
            "name": "Sandip Sarker",
            "stars": "5 stars"
        },
        {
            "comment": "it surely defines it's price....... slight disappointed with cameraaaaaaaaaaaa..................................................................",
            "date": "28 Mar 2015",
            "name": "Jazzy b",
            "stars": "4 stars"
        },
        {
            "comment": "This mobile is awesome..All the mobiles which I used were of motorola only. It is the mobile which is having all features with cost effective.",
            "date": "28 Mar 2015",
            "name": "Jay",
            "stars": "5 stars"
        },
        {
            "comment": "The product is very good came with well packing and on time.I am very much satisfied with flipkart. and the offers are also coollllll........",
            "date": "28 Mar 2015",
            "name": "Kalyan Chakravart...",
            "stars": "5 stars"
        },
        {
            "comment": "fantastic one from motorola one of eye snapping devices in the present market the best thing to say from the device is camera and looking toooooo goooddddd i doesnt observed any drawback from the device overall i can say the build quality is very good device is looking great",
            "date": "27 Mar 2015",
            "name": "vinay kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery as usual is fast from Flipkart. Congratulations Flipkart. Handset was well Packed, with a charger and handset. Getting extremely hot like a hot pan, when receive calls while data pack is activated. Battery drains very fast.",
            "date": "27 Mar 2015",
            "name": "Pratik Dubey",
            "stars": "3 stars"
        },
        {
            "comment": "Beware to purchase Moto G2. Moto G2 Mobile chargers are not good,over heated for 2 mins and very slowly charging. There is no return policy for chargers, instead off issuing new Moto G2 chargers, Digicart chargers are delivering to the customers. Very bad experience with flipkart and WS Retail.",
            "date": "27 Mar 2015",
            "name": "G S N RAJU",
            "stars": "1 star"
        },
        {
            "comment": "i bought it on the very first day when it was launched .i had a battery issue and not a best gaming phone and it always gets hanged when the internal storage reaches 8Gb and main problem is \"CAST SCREEN\". i could not connect my sony bravia with my phone so the SCREEN MIRRORING option is also not working...i updated to lollipop and still there is no change........better not to buy this phone",
            "date": "27 Mar 2015",
            "name": "Sandeep",
            "stars": "3 stars"
        },
        {
            "comment": "Don't purchased MOTO G 2 nd ...Flip cart show that it's a waterproof but it's not true.. Waste of money....don't buy this phone..",
            "date": "27 Mar 2015",
            "name": "Sethi",
            "stars": "1 star"
        },
        {
            "comment": "I am using this handset from 5 months. not satisfied. poor battery performance. hangs unexpectedly. ringtone is set by default and u cannot chnge it. my phone moto g2 runs according to its will.. :-( :( Plz don't buy..!!",
            "date": "27 Mar 2015",
            "name": "Rishi Jain",
            "stars": "1 star"
        },
        {
            "comment": "It is been 5 months I purchase this phone now it is not connecting to Wi-Fi, battery backup is very poor, if we turn on the navigator that squeezes that battery like anything. not so happy with the product and performance. If I play any game phone is getting over heated. I stopped playing games on this phone. I am worried what to do with this Wi-Fi issue where other devices and working fine on same network. please some one help me with this issue.",
            "date": "27 Mar 2015",
            "name": "chandra",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone in december 2014. till now it has not shown any problems and running fine, but the battery life is a tad worrisome if you are using internet continuously and playing average graphics games. Camera is just awesome and the audio quality is also very good. Sometimes it hangs but i think that is bcoz of installation of too many apps. So, in short, go for this and it is a best budget phone under 15k.",
            "date": "27 Mar 2015",
            "name": "Aiswarya Abhis...",
            "stars": "5 stars"
        },
        {
            "comment": "Specs are good in this price band. Battery draining is a major issue, which can be fixed by Motorola, if they want. Charging time is more becaz of adapter issue, and adapter is not USB type, Need to purchase other USB cable to charge it by Laptop,which may be fixed.",
            "date": "27 Mar 2015",
            "name": "Sanjay Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "There are so many defects with this phone..I recommend \"Dont purchase this bull shit phone\" 1.phone is hanging each and every time..(2/10) 2.battery backup is worst.(2/10) 3.low quality camera..some times it shows camera is not working try again after some time(3/10) 4.speakers are average(6/10) 5.charger is worst..it takes nearly 5-6 hours for charging the phone(4/10) 6.cheap gorilla glass.(1/10). 7.finally my bill is not a valid one.i went to service center,They told that your bill also not a valid one :( (feeling helpless) (0/10) Regarding this i gave many complaints to Flipkart..They did not solve my complaints and they blocked me and they are not responding for any complaints.I recommend every one not to purchase from bullshit Flipkart.Worst support from flipkart..I dont want to purchase any thing from flipkart..",
            "date": "27 Mar 2015",
            "name": "Aveenash",
            "stars": "1 star"
        },
        {
            "comment": "It's a very good phone. The only drawback that I see is the battery. Phone works fine with android 5.0.",
            "date": "27 Mar 2015",
            "name": "Mrutyunjaya Kar",
            "stars": "4 stars"
        },
        {
            "comment": "I FEEL I HAVE TAKE A VERY GOOD DECISION TO BUY THIS PHONE.I AM VERY HAPPY AFTER BUYING IT.THE PRICE IS VERY GOOD AND SO IS THE PHONE.",
            "date": "27 Mar 2015",
            "name": "TARUN KUMAR G",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for my mother-in-law via an exchange offer. Saved 2000/- INR off the listed price because of the exchange offer. Never heard any complaints from her end about the phone. However, I did find it a bit strange that they had scratched off the price tag from the main cover. Will recommend the product to anyone who wish to get the maximum value from their hard-earned money!",
            "date": "27 Mar 2015",
            "name": "Praveen Pious",
            "stars": "5 stars"
        },
        {
            "comment": "NOT AS EXPECTED. .MINUS POINT IS 1.WHATEVER YOU SPEAK OTHERS CAN HEAR. . 2. BATTERY DIES IN HALF DAY",
            "date": "27 Mar 2015",
            "name": "JAGJEET SINGH...",
            "stars": "1 star"
        },
        {
            "comment": "MoTo G2 is having all the features which you will seek in mid range product. Its is really a value for Money. Black Color Moto E is more attractive in looks.",
            "date": "27 Mar 2015",
            "name": "Nikhil Deshpande",
            "stars": "5 stars"
        },
        {
            "comment": "i have purchase Moto G (2nd Gen) from Flipkart on 6th March 2015, within 15 Days of purchase I am facing Net Work issue & Speaker Noise issue, There is this new problem that I have observed recently. The speakers crack on high volume. Will be filling a replacement request once again, for this issue now. i am not at all satisfied with this purchase, He will Not Given 30 Days Replacement Guarantee.. I Purchase 15 Days Before He Not given Replacement OR Refund..",
            "date": "27 Mar 2015",
            "name": "Rajesh A",
            "stars": "1 star"
        },
        {
            "comment": "No issue for buying this phone no need to think more just buy. Every thing in this phone is quite good",
            "date": "27 Mar 2015",
            "name": "Ajay Shukla",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I bought moto g 2nd generation on 7th of march and the touch was not working on that piece, i have requested for return on 8th march and they shipped a new piece. After one week later i found hectic handing issue and heating issue with my phone and i called flipkart cc again. They asked me to do few trouble shoot with installing smart chek app and they again did a major factory reset. The next day again my phone started getting hanged without installing any apps.This time i am requesting for refund rather than a new piece. But still flipkart guys are not assuring anything.",
            "date": "27 Mar 2015",
            "name": "Nkp",
            "stars": "1 star"
        },
        {
            "comment": "Actually I had ordered this phone from Delhi and Delivery was put in Pune. I was little doubtful about Flipkart Exchange Operation. Actually this was birthday gift and Flipkart Delivered it right on the time.........! Also Delivery person show good cooperation since my Friend was very new to online purchases. Thanks Flipkart. Moto G is as usual very good phone, good speaker, nice camera.",
            "date": "27 Mar 2015",
            "name": "Mahesh Satpute",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen), Simply Super ,I am sure no other branded mobiles are available at this price range and with this specs. All the specs related to RAM, processor, Gorilla glass and mostly screen resolution are good.",
            "date": "27 Mar 2015",
            "name": "Asheenth E",
            "stars": "5 stars"
        },
        {
            "comment": "if you want good picture quality so moto g2 camera is very good if you want good picture quality so moto g2 camera is very good",
            "date": "27 Mar 2015",
            "name": "pradeep morey",
            "stars": "4 stars"
        },
        {
            "comment": "After the update of Lollipop it has started hanging. It responses very late. Sometimes completly is doesn't response.",
            "date": "27 Mar 2015",
            "name": "Suraj Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "I was totally satisfied with this phone and strongly recommending this to other...best quality phone with best battery backup",
            "date": "27 Mar 2015",
            "name": "Kishore Rallap...",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this for my lil' brother. He's happy using the phone. Shipping and packaging was super fast and of good quality. Phone is good - as per my very limited usage ! Hence, 4 stars !",
            "date": "27 Mar 2015",
            "name": "P Bhatta",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing this review after using this phone for 2 weeks.I am delighted to purchase this phone event though their are many phone with similar specifications at cheaper price section.First of all i want to thanks Flipkart delivery services for its impeccable service. MOTO G2 rocks in every hemisphere. Performance of Snapdragon processor so smooth that you wouldn't feel it has a 1GB RAM. Almost all the games are promisingly good.Build is also quite solid.And the best part is that you can use this phone single handedly. This phone give me a very firm hold on it even though it is a 5\" incher.",
            "date": "27 Mar 2015",
            "name": "Ankan Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "i have not used a moto g before.... i felt that..this is bit slow ... applications taking more time to get started.. and i would say.. .the battery back up is not that great... and getting heated up while using too.. look wise - awesome... sound too.. fair enough.. a good buy for 13000",
            "date": "27 Mar 2015",
            "name": "KELVIN WILSON",
            "stars": "4 stars"
        },
        {
            "comment": "Well I purchased this product for my wife, using it for 5 months now, the only issue I am facing that any 3g network doesnt work well on this phone. I have tried all the networks where as in the other handsets and at the same location 3g works well. Battery is ok, will last 10 to 12 hours.",
            "date": "26 Mar 2015",
            "name": "Jaypreet Thukral",
            "stars": "3 stars"
        },
        {
            "comment": "Rs. 12,999/-. For this high price, Just Cortex based Qualcomm processor. Seems lots of cost cutting had been done to manufacture this. But Motorola is giving us the product for Rs. 12,999/- No Issues with the functioning of Moto G (2nd Gen) so far",
            "date": "26 Mar 2015",
            "name": "Thiruvanan Thirum...",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this for my cousin, and she is really very excited. she literally shows off and flaunts her phone in front of her friends ,,,,, if i didn't have much to buy a sony xperia flagship phone i too would have bought this phone and it's accesories",
            "date": "26 Mar 2015",
            "name": "Soumik Sarker",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought a moto g2 on exchange during the recent offer....I seriously feel the product delivered to me is Defective one after comparing it with it with people having the same phone. 1) the back cover is defective one because it lacks finishing & it blocks my finger from the unlock button. 2)The new phone had Kitkat 4.4.4 installed in it which gave me a lot of force close issues.....specially the contact book din't open many a times.After upgrading the phone to Lollipop the phone was something worth using but still had force close issues. 3)The battery takes so long to charge up....i have handled many top model phones with large battery life,but none took such long hours to charge up the entire phone. Hence,i am going for a quick replacement as soon as possible",
            "date": "26 Mar 2015",
            "name": "Lukose Roy",
            "stars": "1 star"
        },
        {
            "comment": "In the middle of a conversation on this phone, suddenly, neither can i hear nor can i hang up.this problem became persistent and vexing too after a month usage. anyone has remedy plz suggest.",
            "date": "26 Mar 2015",
            "name": "Karthik p",
            "stars": "2 stars"
        },
        {
            "comment": "mobile 1st port is not 3g enable port ....nd Airtel offer is jst an act to cheat the consumer.. yeah mobile is good .. dat is for sure",
            "date": "26 Mar 2015",
            "name": "gaurav",
            "stars": "1 star"
        },
        {
            "comment": "Phone is good and has not had any issues. Good buy in Flipkart at a very affordable price. Has nice features and has not broken down inspite of using for about 6 months now",
            "date": "26 Mar 2015",
            "name": "Kiran Karunakara",
            "stars": "5 stars"
        },
        {
            "comment": "this is a great phone look very good . and service from flipkart is also very good flipkart deliver within a day thanks flipkart.",
            "date": "26 Mar 2015",
            "name": "Naveen Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is a worst one. no value for money. the battery need to charge minimum for 5 hours then also the charge won't last for even 4 hrs. the touch pad hang in between. it has heating problem.",
            "date": "26 Mar 2015",
            "name": "Baiju Jose",
            "stars": "1 star"
        },
        {
            "comment": "Mobile visual screen and processor is good but having very weak battery backup. front panel is very broad and high, the white strips on top and bottom are of no use and increasing height of mobile making it uncomfortable in holding. Needs to review. In terms of cost it's not good and less features comparing similar range mobiles of other manufacturer.",
            "date": "26 Mar 2015",
            "name": "Sanjiv kumar",
            "stars": "2 stars"
        },
        {
            "comment": "Very nice One Smooth Performance Best Camera Quality...!!!! If Your Mobile Was Heating First Time Than Just Update All Your Software...!!! Awesome One That I Have..!! Thanx Flipkart....!!!",
            "date": "26 Mar 2015",
            "name": "Sandeep Saroj",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile several time hanged and speaker produced unwanted noise while income call, before g2 mobiles very god condition but now coming mobiles trebled.",
            "date": "26 Mar 2015",
            "name": "nagaraji",
            "stars": "2 stars"
        },
        {
            "comment": "Hello, I am writing review after usage of 1 week and below is my review. Pros: 1.Nice one with this price. 2.No Hanging issue till now. 3.Smoother & Faster. 4.Nice Rear camera and clarity is simply superb, etc Con's: 1.Call volume is not good and need to adjust always. 2.Front camera clarity is not good, etc..",
            "date": "26 Mar 2015",
            "name": "Kota Srinivas",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: sound ,build quality, hardware quality,good camera. avg battery backup. Cons: it comes with a worst charger takes a lot of time more than 4 hr for full charge.",
            "date": "26 Mar 2015",
            "name": "Nikhil Thakare",
            "stars": "5 stars"
        },
        {
            "comment": "This is my first android phone & i got it with an huge discount of 3100. Thanks for flipkart for this amazing deal & for this superb product. Flipkart delivery is super fast & i received the phone within 48 hrs after placing the order. used this phone only for 1 day n m joust loving it. Cool look in white. Big screen size, good batery backup, amazing camera & display. Best ideal phone for youths. Thanks again flipkart :)",
            "date": "26 Mar 2015",
            "name": "Chetan Bhardwaj",
            "stars": "5 stars"
        },
        {
            "comment": "Great display, good call sound quality, loud ringtone, but he menu is not as slick or user friendly like samsung. The camera quality is poor, forget about indoor photos. Even outside it is very very average, compared to Apple / Samsung. Moto better improve this, else it will soon lose out to the biggies with better cameras. Pricey at 12k, Redmi is definitely a better bet.",
            "date": "26 Mar 2015",
            "name": "Govind P",
            "stars": "3 stars"
        },
        {
            "comment": "i want airtel 3g offer activate but i couldn't get it please help me........ so please give ur sugesstions to me",
            "date": "26 Mar 2015",
            "name": "saikumar puttu",
            "stars": "4 stars"
        },
        {
            "comment": "I wont get into the in depth review of this phone, everyone knows the specs and the technology on it.Moto have managed to keep the OS as close to stock Android as they can which is something is love about the phone. Motorola's build quality is the best as ever , have been using this phone for a long time now and it hasn't troubled me yet. Everything on this phone right from the screen to the camera to the sound quality to the buttery smooth OS to the build quality claims itself the KING of its price segment for me.",
            "date": "26 Mar 2015",
            "name": "Adith Rai",
            "stars": "5 stars"
        },
        {
            "comment": "I purchase this phone on basis of review received, but its no good. It have a good Display but on the other hand Battery is too poor. When doing multitasking, this phone behaves strangely, its lagging and opening anonymous things. Its a brand new phone, purchased on 21st March and i am facing the issue. I am gonna return it and thinking to buy an I-phone if my Budjet allows.",
            "date": "26 Mar 2015",
            "name": "Rohit Singh",
            "stars": "1 star"
        },
        {
            "comment": "Although more powerful devices are available for lesser bucks, nothing beats the stock experience that motorola provides with this gem of a phone, and the bonus of speedy updates is a killer deal. Motorola is aiming for products for long run and surely they will succeed with this strategy. Extremely satisfied with this product.",
            "date": "26 Mar 2015",
            "name": "Nishant Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i accidently felt in to a swimming pool..my phone was there in my pocket..it is not working after that..i took my mobile to authorised motorola service centre. he said my phone's board has gone and he is telling different amount for the mother board at different time.i contacted motorola.they were not ready to say its board price..that made me really in a difficult situation..i buyed moto g2 4 months back from flipkart.com..even though i felt the phone was good in the beginning...battery life of the phone was very poor and sometimes when someone calls its sound stop suddenly..when phone restart the problem will be solved..fro my experience i am saying not to buy this phone..when it get damaged accidently..you have to forget that mobile for ever",
            "date": "25 Mar 2015",
            "name": "prabhu ram",
            "stars": "1 star"
        },
        {
            "comment": "good phone.. was expecting lollipop out of box..but i cant find update in phone mannually also..dont knw wats wrong!",
            "date": "25 Mar 2015",
            "name": "Shree Harsha",
            "stars": "5 stars"
        },
        {
            "comment": "best camera 8mp and also front cam very fine good working no hang problems. some problem after upgrade android 5 so first think and then upgarde any way very nice product",
            "date": "25 Mar 2015",
            "name": "Abhishek Maher",
            "stars": "5 stars"
        },
        {
            "comment": "Received the product on time and value for money..I bought this mobile after a lot of search and comparison. Also compared the proces on different merchants. As usual Flipkart was a best deal for me and hence went for it..",
            "date": "25 Mar 2015",
            "name": "Sujit",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone last December and it left me with great impact. But unfortunately last week my mobile was pick-pocketed in the market. Now I'm back to square again. I started to search online again and thought to try my hands on a similar kind of product but not this again. But every time I compare this phone, to name a few, HTC 620G DS, Samsung Galaxy S3 Neo, even Grand 2 etc.. I was surprised to notice that this phone has got far superior quality in all aspect! It has got Cornila glass 3 (I hate plastic covered screen) Pictures are good, video is outstanding, sound quality is perfect with dual speaker, body cover is unique and not slippery, battery is decent it works through out a day. Most impressive part is it does not get heat when you video call over Skype, I do that for more than an hour and it is as cool as it looks which also surpasses all the expensive featured phones. All games are suitable, no lagging. And lets not forget it has got a latest Android L which gives you a feeling of being a step ahead than the rest. The only problem is that it takes longer time to get charged in original charger but that's negotiable... Guess what?? I've already ordered this phone again and it should be delivered within a few days!!",
            "date": "25 Mar 2015",
            "name": "Dilip Thapa",
            "stars": "5 stars"
        },
        {
            "comment": "HEY FOLKS ,DONT THINK TOO MUCH, JUST GRAB THIS PHONE, PROS 1.SUPERFAST 2.SUPERFAST 3.SUPERFAST CONS NONE ATLEAST FOR ME U GUYS CAN READ PROS AND CONS IN OTHER TONS OF REVIEWS OVER HERE,I CAN JUST TELL U MY EXPERIENCE OVER THIS PHONE WHY THE HELL OTHER GUY COMPARING IT TO OTHER HIGH END PHONES AND FINDING OUT CONS AND ALL THIS PHONE IS THE BEAST IN ITS PRICE RANGE, AND I AM USING IS FOR ABOUT 6 MONTHS AND I HAVE NO COMPLAINTS AT ALL I WOULD SAY NICE JOB MOTO...",
            "date": "25 Mar 2015",
            "name": "ishank suri",
            "stars": "5 stars"
        },
        {
            "comment": "after the updation the lolipop version there has a lot of hanging proble and battry backup was very lo..............",
            "date": "25 Mar 2015",
            "name": "Balram kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Poor battery performance , but Flipkart rejected the request for refund. I got the replacement earlier and experienced the battery issue again. This time they rejected the request to refund /replacement second time, since thier technical executive concluded that phone is working fine as per thier troubleshooting. You will be left disappointed as these days flipkart customer care services have become pathetic. They will play around with you for sometime and have thier customer care call you back with same responses all over. You write all kinds of mails complaining about the product and they write same non sense all over. They are really turning to be unreliable. Please be careful while purchasing products like these if luck is never on your side. I have decided to not pursue any other product on thier website post the blunt responses they have given. Wish you good luck !! =========================================================== Battery issue within 3 days of use ( First review) All other reviews suggest this phone is good. the look and feel is great and so many features look nice. SAR value can be of concern but for me, the Battery has caused problems. Just bought the phone last week and its not been a week since use, the battery begins to drain at faster pace. The battery indication shows 100% on full charge in morning, 70 % post 3 hours with the phone used just for calls . When the phone is kept completely idle with no application running, no 3G-Wi-Fi, GPS ON etc. the battery still drains at the rate of 1% every 1-2 minutes. But for a moment it suddenly drained 5 % in one short. this is really puzzling and on direct communication with Motorola assist team, they say to do cache-wipe and factory reset to see if battery is resolved. thats not advisable since there is data loss. I can anticipate this issue to be there in future and guidance given by Motorola customer care is also funny. I am in attempt to see if there is any service center who can help, yet with past experiences I can say they will come up with same response as what Motorola did. Honestly the phone looks good but battery is really a turn-off. I hope the Flipkart authorities inspect thier inventory correctly to see all products are tried and tested before selling off. I hope a replacement fetches a good piece.",
            "date": "25 Mar 2015",
            "name": "Sandeep Nair",
            "stars": "1 star"
        },
        {
            "comment": "the handset get heated if you use net,it heats like you cant hole on your hand. service center is very worst they dont care what ever you say they just make you wait wait wait and get lost once you get your had set back.",
            "date": "25 Mar 2015",
            "name": "Praveen Jakkali",
            "stars": "1 star"
        },
        {
            "comment": "Pros: Assured Lollipop update over kitkat made phone more smoother. Real feel on hand. Speakers are very good with crystal clear sound. Battery is decent and runs for nearly 12-14 hours with average use. Automatic brightness adjustment indoor and outdoor. Best camera at day light condition. Real protection by corning Gorilla Glass. Happy playing Subway surfers, Temple Run 2 and Hill climb racing. Good customer care service. Cons: Ram is 1 gb which sometimes may give feeling of lag. Earphones provided are too bad as no sound proof. Full charging takes a bit long time. Main camera does not click good pictures at night. Price is bit too high as competitors with same specifications is available in market within 10k. As a customer: I am happy and satisfied with my phone.",
            "date": "25 Mar 2015",
            "name": "Nabarun Roy",
            "stars": "4 stars"
        },
        {
            "comment": "This is a very good product within the budget. Both looks wise and specification it meets the expectation. Once upgraded Lollipop, facing battery issues since it has started giving only a day backup now",
            "date": "25 Mar 2015",
            "name": "gaurav gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Good looking Picture quality is amazing Good phone with best features in best price Best phone from Moto in good price Definitely a good mobile to buy",
            "date": "25 Mar 2015",
            "name": "Munni Srinivas...",
            "stars": "4 stars"
        },
        {
            "comment": "This is a damn good phone for its features and price. The touch is good. Camera is a surprise package. Battery back up though is a slight let down. The phone was delivered on time. But the touch screen failed to work after 3 days. I registered a complaint with flipkart and the phone was replaced without any hassle immediately. Thank you flipkart for your immediate response and service.",
            "date": "25 Mar 2015",
            "name": "Vignesh Jayasa...",
            "stars": "4 stars"
        },
        {
            "comment": "I have orderd on 23rd March 2015,delivered very fast with next day morning 11 AM itself with Safely,They had a good transport staff.. Thanks to Flipkart Team...",
            "date": "25 Mar 2015",
            "name": "Santhosh.BR",
            "stars": "5 stars"
        },
        {
            "comment": "its nice product for this prise..... 7 month using ... its nice.. worth for its price.....irts camera is nice and very speed in its operation. and there is no lagging in its process.",
            "date": "25 Mar 2015",
            "name": "jai sai",
            "stars": "5 stars"
        },
        {
            "comment": "Im Ordered a new MOTO G (2nd Gen) for 12,999/- the Phone is ok But Missing Of EARPHONES and DATA CARD in Box..How will be the Responsible...?",
            "date": "24 Mar 2015",
            "name": "Syam Kavala",
            "stars": "1 star"
        },
        {
            "comment": "Good phone, no complaint of heating, long battery life as promised, light weight, never hang. Android 5 made this product a best phone in its catagory. Beautiful design. Good Customer care support by Motorola",
            "date": "24 Mar 2015",
            "name": "Omkar Pawar",
            "stars": "5 stars"
        },
        {
            "comment": "i brought a moto g 6 months back for 12999 and now under the app offer brought again for my brother for 10999. the phone is great for 10~13k no phone lag great RAM & memory no issue with battery 1.5 day with normal use with 3g network display is clear and big enough for games & movies only disappointed with the camera quality though it is 8MP the clarity in not there. but makes great shot in low light. overall great phone.. do buy",
            "date": "24 Mar 2015",
            "name": "Abhishek Dubey",
            "stars": "4 stars"
        },
        {
            "comment": "good phone, thanks flipkart for the discounts, i got it for less than 10000 and happy for it. also for timely delivery",
            "date": "24 Mar 2015",
            "name": "subramanian R",
            "stars": "4 stars"
        },
        {
            "comment": "feel very high level of radiation while using , it seems it has lot of radiations than stated in mobile hand set, same can be checked by dialing *#07# recommend not to buy motorola with out having a look on radiation level. second problem is spare parts and service. you need to leave your phone to service center @ 15- 20 days.",
            "date": "24 Mar 2015",
            "name": "Nishant",
            "stars": "1 star"
        },
        {
            "comment": "If you want flawless software experience go with this one and can also provide you good gaming and web browsing experience.... BUT if you are a camera lover and want to take good shots with your rear camera i would NOT recommend this smartphone. Leaving its camera everything else is good.",
            "date": "24 Mar 2015",
            "name": "Shivang",
            "stars": "4 stars"
        },
        {
            "comment": "Good at all.. it must be a good one under 13k.. And now it gone to 11k when buy from app. Anyone who need to buy this, it is a right time to take home!",
            "date": "24 Mar 2015",
            "name": "Maris",
            "stars": "5 stars"
        },
        {
            "comment": "really i m very happy with the mobile. under ruppees 15000 it is the best mobile.it funtioning very smoothly , camera clearity is very fine and video recording is awesome .",
            "date": "24 Mar 2015",
            "name": "bs samant",
            "stars": "5 stars"
        },
        {
            "comment": "Yes, Moto G2 is worthy but battery life is even one day some times. It could be very better if the battery capacity is around 3050Mah. I bought it two months back . android update OTA is nice .",
            "date": "24 Mar 2015",
            "name": "Ranga Santhosh",
            "stars": "4 stars"
        },
        {
            "comment": "I bought the piece in Dec-2014, its been hardly 4 months and I find the phone getting hanged frequently. The contacts keep getting closed in error. Added to the above the cell is getting heated up while charging also. The same heating problem is faced while using Internet. The music store is pathetic which plays all other songs except the selected.",
            "date": "24 Mar 2015",
            "name": "Ravi Desaraju",
            "stars": "1 star"
        },
        {
            "comment": "The product does what is suppose to do - the service is as indicated - everything as per plan & transparent. Good Job Flipkart",
            "date": "24 Mar 2015",
            "name": "salim patel",
            "stars": "4 stars"
        },
        {
            "comment": "Overall very good phone. Since it is sold only on Flipkart, it becomes a monopoly and there is not competitor to have price bargain/discount. This is not fare. Phone as such is very good and smooth.",
            "date": "24 Mar 2015",
            "name": "Sulaiman",
            "stars": "4 stars"
        },
        {
            "comment": "please tell me how to use the benefite that talktime of airtel.... that ur giving with the moto g2 ..........please send me the link of that i can get my benefite",
            "date": "24 Mar 2015",
            "name": "Rajat singh",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G (2nd Gen) i have purchase Moto G (2nd Gen) from Flipkart on 12 January, 2015 1:24 PM , I am facing battery issues, after every hour charging is required, the charger is not working. i am not at all satisfied with this purchase, want to change charger to be replace either by company or flipkart. regards Dipak Tandel",
            "date": "24 Mar 2015",
            "name": "Dipak Tandel",
            "stars": "3 stars"
        },
        {
            "comment": "Good smartphone in term of software,performance but battery back up very poor....when your surfing net.",
            "date": "24 Mar 2015",
            "name": "k srinivas",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola has really made awesome phone. Good solid body & easy lollipop update is icing on the cake. Battery & Heating is still issue as any other android phone has but value for money at price point and utility. Both Camera are decent & does the job.",
            "date": "24 Mar 2015",
            "name": "Atul More",
            "stars": "4 stars"
        },
        {
            "comment": "Good Product From Flip kart. awesome fantastic marvelous nice packing fast delivery quick response customer cared",
            "date": "24 Mar 2015",
            "name": "sudhir",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone six month before.. this is working awesome. touch screen very smooth. applications are working smooth do not see any hanging..",
            "date": "24 Mar 2015",
            "name": "Sankar Kandasamy",
            "stars": "5 stars"
        },
        {
            "comment": "This is really an awesome phone at this price. It's pretty fluidic, and feels really good when u run through it. Planning to buy another one for a friend soon. hopefully 4G support Moto g will be launched anytime now.",
            "date": "24 Mar 2015",
            "name": "Himanshu",
            "stars": "5 stars"
        },
        {
            "comment": "Shipping is very fast and good and products / shipping quality also good, but Delivery guys are throwing the products next to driver's place while delivering the products..Please warn them to do not do that..",
            "date": "24 Mar 2015",
            "name": "Anil Chaitanya...",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile hangs a lot. camera stucks many times. flash light starts buy itself. no method to poweroff the phone as battery is inbuilt, if phone hangs, touchscreen doesnt work. go for micromax, much better, memory is also less . become slow. u have to delete data regulary.",
            "date": "23 Mar 2015",
            "name": "Meena Suthar",
            "stars": "1 star"
        },
        {
            "comment": "Its been almost six months since i am using this phone and the interface isn't even a bit laggy. Obviously being a Motorola device i got the privilege of using lollipop on it so that was a n added advantage. The phone can multitask pretty well despite excessive usage and is agreat buy overall for me. LOVE MOTO!!!",
            "date": "23 Mar 2015",
            "name": "Arshdeep Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Decent phone. Good price to performance ratio. The lollipop update made the phone a little slow. The camera is bad (I felt). Overall quite a satisfying experience.",
            "date": "23 Mar 2015",
            "name": "Daniel J",
            "stars": "4 stars"
        },
        {
            "comment": "my friend also has the same problem with moto g 2nd gen...ringing volume is not loud unable to notice incomming calls...",
            "date": "23 Mar 2015",
            "name": "Chaitu Awesum",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased this phone few weeks back and have found this to be a great experience in all terms may be it music, calling, game, android, speed and sound quality etc. So far I have used Nokia, BB, Samsung, Micromax, HTC, Sony phones and now its MotoG 2nd Gen 16 GB... Nothing better than this. It's a worth purchase in 12999 Good luck in your search for a smart phone!!",
            "date": "23 Mar 2015",
            "name": "Yagnesh Shah",
            "stars": "4 stars"
        },
        {
            "comment": "I don't understand why people called it as Smart phone. Unfortunately I brought this in a hurry as my phone was crashing. You need to carry a charger along with you as you see in the ad CHARGING... CHARGING... Battery reduces by 1% per minute on 3G. It takes more than 3hrs to charge 100% using box piece charger, around 6-8hrs to charge using USB. At times it gets extremely hot by itself even in stand by mode. Sometime I feel scared to go near, fearing a burst anytime. You can use it for a hot massage.",
            "date": "23 Mar 2015",
            "name": "Prakash KP",
            "stars": "1 star"
        },
        {
            "comment": "hello flipkart, i am satisfied by the product and its quality, i will be glad to refer to my friends who are looking for online purchase fast and easy. But i saw the specification and studied hard enough and made the decision on buying this product moto g ( second generation ). I bought this mobile by my first salary and as i received the set, i realize it had only 11.48GB left for me to use as i had ordered for 16 GB moto G ( All software installed takes only 1 GB Space ). I am a office person with lots of downloads and had to buy another 8 GB memory card Also, its front camera is OK at day time, at night time pixels of selfie gets scattered ( just as of 0.2 mp camera), so front camera sucks. Rear is good for 8 mp. Lots of updates, so u get to use proper software at real time. So friends best of luck while taking decision for smart phones",
            "date": "23 Mar 2015",
            "name": "James Abraham",
            "stars": "3 stars"
        },
        {
            "comment": "Nice product..I bought this mobile for my wife soon after it's launch.. Thanks to Flipcart.. 10/10 for the service",
            "date": "23 Mar 2015",
            "name": "Nineesh George",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is really good i really liked it. i am very thankfull to flipkart about their delivery they gave me my phone before time i recommend to buy this phone.",
            "date": "23 Mar 2015",
            "name": "saurabh",
            "stars": "4 stars"
        },
        {
            "comment": "best buy for the price fully satisfied with the purchase . works f9 no lag no glitch, thinking of order moto e also .",
            "date": "23 Mar 2015",
            "name": "ravinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Dear reviewers, All Android mobiles having below 3000 mah are having below average battery life. We have to be content with only phoning and messaging. Playing games and surfing net, using blue tooth and hearing/viewing songs/movies swallow most of the battery power and one will have to charge twice per day;For nominal users, this mobile is a boon and for voracious net and game users, I recommend Gionee M3 which has 5000 mah powered battery.",
            "date": "23 Mar 2015",
            "name": "Krishna kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing Product with superb feature... Brand value pays off better than cheap Chinese phone which comes with high end configuration. Used both Sony & Micromax but finally found a phone which can be called SMART... Thanks to Google for researching the Indian market & launching better product for customer & being pocket friendly.",
            "date": "23 Mar 2015",
            "name": "Mrunal Shah",
            "stars": "5 stars"
        },
        {
            "comment": "NAGARJUNA STYLE OF SELECTION.I DO WHAT BEST FOR BUSINESS ...............................................",
            "date": "22 Mar 2015",
            "name": "NAGARJUNA REDDY T",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, Before purchasing this product I reviewed many brand within equal cost range. In initial phase after purchase I was surprised by the quality and performance of the product. It never gets handed while playing games, online videos or any other applications. There are some reviews that Moto G2nd Gen is being hot while playing games or online videos but in my case it is not happened. I recommended same mobile to many of friends. Full Marks to Moto G (2nd Gen).",
            "date": "22 Mar 2015",
            "name": "Surykant",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Mobile at a very low price offers best performance no lag issues sound is also good and upgraded to android l :)",
            "date": "22 Mar 2015",
            "name": "prathamesh hadkar",
            "stars": "4 stars"
        },
        {
            "comment": "Recently updated to lolipop os. Now I feel that the product is getting heated even when idle. This problem is noticed only when data usage is enabled.",
            "date": "22 Mar 2015",
            "name": "Suresh Kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "I have been enjoying this phone since i have got it. The camera clarity is too good. Love the clicks. But it is not made for gaming purpose. I am a big fan of asphalt8 but i have to play with lowest quality settings, still it buffers. but overall this is an awesome phone.",
            "date": "22 Mar 2015",
            "name": "Abhinav Baliarsingh",
            "stars": "4 stars"
        },
        {
            "comment": "getting back grip case is very hard.otherwise it is nice mobile with all the features expected...Worth for money..Lollypop upgrade is really awesome and impressed.",
            "date": "22 Mar 2015",
            "name": "VICKRAM ASOKAN",
            "stars": "4 stars"
        },
        {
            "comment": "came with kitkat had lot of battry issue update to lollipop 5.2 now batt issue gone but lot for fone hang due to lollipop",
            "date": "22 Mar 2015",
            "name": "kunjan barua",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone 4 months back immediately after buying within 2 - 3 days having issues with phone on voice quality and not getting sounds on phone reported the issue to flipkart. They wanted me to do some checks it fixed the issue for time being again after a month i am having continuous issues with phone had issues with display, similar issue with notification and sounds started, Now the device is not getting charged and completely the phone is dead. When i contacted Flipkart they wants me to contact Motorola Service Centre day after delivering me a faulty product they want me to roam around the service centre which is not at all fair From day one after buying this phone i am having hell a lot of issues. Request you not to buy this phone. It is not worth for money and not worth to buy online a faulty product.",
            "date": "22 Mar 2015",
            "name": "Harikrishna",
            "stars": "1 star"
        },
        {
            "comment": "Awesome phone at this price point. No issues at all. Camera quality is awesome, even low light photographs are not too bad. Got a lolipop upgrade as well. However, after the upgrade phone tends to slow down a bit every couple of days. Need to restart to bring it back to speed.",
            "date": "22 Mar 2015",
            "name": "Ankur Jalan",
            "stars": "5 stars"
        },
        {
            "comment": "After lolipop Battery dies. otherwise , it was super phone earlier at this price. you love using it .. Its handy , camera is good , Screen and touch is superb..",
            "date": "22 Mar 2015",
            "name": "Manish Naryal",
            "stars": "4 stars"
        },
        {
            "comment": "just drawback is battery............... otherwise great product...........,,,,,,,,,,,,,,,,,,,,,...................",
            "date": "22 Mar 2015",
            "name": "Pranil Manjrekar",
            "stars": "5 stars"
        },
        {
            "comment": "Endless and horrible delivery by flipkart and it came after 7-8 days, and no tracking at all. Flipkart delivery is worst. And There were no USB charger or Date Movement can't happen. Also Mobile is so so.. after 5 month it become unresponsive. and response is quite slow after 5 months.. pic quality and sound is not so good.. specially sound is not so good.. wifi and internet connectivity also having issues. Overall an average and not as good as advertised",
            "date": "21 Mar 2015",
            "name": "vivek",
            "stars": "2 stars"
        },
        {
            "comment": "No doubt best hardware & software is used in phone to perform well .....but with a poor battery life all is vain..!! Improve it further..!!",
            "date": "21 Mar 2015",
            "name": "NAGENDRA MISHRA",
            "stars": "3 stars"
        },
        {
            "comment": "ordered the set on 23rd Dec under the exchange offer, got it at price of 9999 ;) thanks to the great service of Flipkart, I had the phone in my hand under 48 hours. so its been 3 months, the phone is working fine and I am enjoying the new Android version, which I received after a month of getting my hands on the gadget!!! u can call this phone a poor man's nexus!!!",
            "date": "21 Mar 2015",
            "name": "Sorabh Rastogi",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using this phone for over 6 months now... This is a great phone with all features packed in a slim outfit. Definitely value for money.. Blindly go for it..",
            "date": "21 Mar 2015",
            "name": "Kiran Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "all apps are working fine. upgraded to lollipop. i am little bit disappointed . because i like to see missed call, dialed no. received call separately. but it gives just on column recent calls... anyway performance is good. battery life is good. it has inbuilt battery saver. and many other inbuilt tools which comes with Motorola only. 16 gb is great for using a smartphone. overall i am satisfied. you can also buy samsung galaxy grand 2 i just missed this phone. having great value for money..",
            "date": "21 Mar 2015",
            "name": "kader khan",
            "stars": "5 stars"
        },
        {
            "comment": "On 19th i ordered my new and favorite phone moto g 2nd gen and i thought it will come at 22nd of march but it came yesterday i was very happy and the phone was nice to handle and a amazingly fast service by Flip kart.Thank You Flip Kart For your amazing fast service and it is the best model and nice to operate and it is a nice phone of andriod of latest under 15,000 rs.Once AGAIN THANK YOU FLIP KART.",
            "date": "21 Mar 2015",
            "name": "Nithin Michael",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is worth its price especially with updating to Lollipop (eventhough there was a considerable waiting peroid) whereas other phones are yet to update their versions.This is pretty good value for money at 13k (from Flipkart). It has a decent processor, good display and an average camera. But battery life leaves much to be desired; gets drained a little early than you would expect. Still can stand one day with pretty good use. Anyways Kudos to Moto and Flipkart for making this moto boy budget friendly in India.",
            "date": "21 Mar 2015",
            "name": "Krishnan Unni",
            "stars": "5 stars"
        },
        {
            "comment": "It is the best budget phone.. Touch is smooth. Camera is good. I'm clumsy and and phone has faced heavy accidents yet it is up with no scratch. I'm happy with my phone.",
            "date": "21 Mar 2015",
            "name": "bhagya",
            "stars": "4 stars"
        },
        {
            "comment": "Impressive smartphone The MOTO G improves on what its OLD MOTO G lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -Battery performance is average. -Charger is not usb type u have to buy pc connector to connect with pc. there were no con's in the device whatsoever with this phone. I THINK MOTO MUST GIVE 1.7GHZ INSTEAD OF 1.2 Ghz Qualcomm Quad Core Processor",
            "date": "21 Mar 2015",
            "name": "Manoj Kamat",
            "stars": "4 stars"
        },
        {
            "comment": "a phone as i expected. heard a lot so decided to purchase and really liked it. performance is good, camera dam good also the screen is awesome. but overall i liked it and will recommend to purchase it",
            "date": "21 Mar 2015",
            "name": "BH!M",
            "stars": "5 stars"
        },
        {
            "comment": "I got the product for a price of 11,700/- and after a months's use these are my findings: - Excellent front speakers and display. - Front cam is doing a really great job. - Rear cam is good and the pics look great when seen on phone, but when you transfer it to a PC the pics don't look that good. - Touch response is very good. - The phone seems to be water and \"SNOW\" resistant to a great extent! Much like my good old Moto Defy :-) - 1GB RAM is actually not sufficient while playing high-end games. Otherwise it's doing a great job. No lag whatsoever. - The backcover is pretty cool and the overall product design and feel is very good. The Build quality is great too. So other than the 1gb ram and the not so good rear cam this phone wins hands down. Loving the MOTO G2 ! !",
            "date": "21 Mar 2015",
            "name": "SHELBIN DEVASSY",
            "stars": "4 stars"
        },
        {
            "comment": "Well, MOTO G 1 is way better than this phone, atleast in terms of screen resolution and touch sensor. I bought it for my Mom, she's happy with it since its her first smart phone, but to me its not even close to its predecessor MOTO G 1, which no one expects from a successor phone.",
            "date": "21 Mar 2015",
            "name": "Vikas Soni",
            "stars": "3 stars"
        },
        {
            "comment": "good one with affordable price",
            "date": "20 Mar 2015",
            "name": "Greeshma George",
            "stars": "4 stars"
        },
        {
            "comment": "Everything about the phone is good except its phone audio quality. There is a constant magnetic/ static disturbance that can he heard in every phone call. Did raise it with Support...followed a bunch of instructions....but this disturbance persists.",
            "date": "20 Mar 2015",
            "name": "Kedar Joshi",
            "stars": "2 stars"
        },
        {
            "comment": "Very Good Mobile. Voice quality good. Call recorder not supported except that i like this mobile very much.",
            "date": "20 Mar 2015",
            "name": "rdl",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this product. I find this phone great in every function be it Battery, Performance, Display, or anything. You will not regret buying it for this price. Nothing better in this price range.",
            "date": "20 Mar 2015",
            "name": "ABHAY",
            "stars": "5 stars"
        },
        {
            "comment": "I was lucky to get this product in its launch day itself. I have no complaints till date about this brand and this model. Moto-E generation II is also great as they have added selfie in it. Although a Flash was needed too. There is hardly difference in Moto-E and Moto-G except Camera and size of devices, Both are great on their space. Still one of the best option while u r going ANDROID !!!",
            "date": "20 Mar 2015",
            "name": "PAWAN SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks to FLIPKART, they delivered this product within the specified time. Neatly packed without any damage done to the piece. I was One of the first few customers to receive this handset. Thank you so much Flipkart. I am using this phone for around 4 months.. here is what i found after usage Pros:- >Superb screen size >Camera quality is far good compared to many phones in this budget. >Android 5.0 runs smoothly without any lags. >Speaker is good, no cranky noise even if u increase the volume. >It handles 720p and slow 720p shots extremely well. > Expandable memory and inbuilt memory are a charm. Cons:- >Battery backup is the main issue P.S- get ur self a portable charger if ur a avid music listener, gamer etc. (battery backup is only for 7-8 hts wid heavy usage) >A little heating on the back while running too many applications. > Eats up quite a lot of ram sometimes. Conclusion- A very good, descent phone with good specs. I dont have too much of a problem only if the battery thing would be solved, the phone would be the best. Running 5.0 lollipop smoothly in it without any issues. Memory bug which was present has been taken care of. Apps can be moved to SD card. Supports OTG. Overall Experience with the phone is amazing. To be honest every phone does have some pros as well as flaws, but compared to other phones, this is one o the best i feel. P.S- Dont hurry to update to lollipop as still its developing and has a quite few bugs. Use kitkat 4.4 till a good stable version is released.",
            "date": "20 Mar 2015",
            "name": "beejoy venkkat",
            "stars": "5 stars"
        },
        {
            "comment": "working seamlessly.... cant find any flaws with this phone.. loving the experience... thanks MOTO and flipkart...",
            "date": "20 Mar 2015",
            "name": "MANAS KRISHNAN",
            "stars": "5 stars"
        },
        {
            "comment": "good one nice clarity most economical featured phone. Needs further improvement in weight. One can enjoy it for features at low cost. Nothing goes wrong in one year.",
            "date": "20 Mar 2015",
            "name": "abhi Jangale",
            "stars": "4 stars"
        },
        {
            "comment": "This was my second moto g. But it doesn't perform like the one I got before. The phone hangs even while making a call or opening gmail. I requested for a return but the flipkart performs some online performance test via smartchk app on my moto g. And told me that everything is fine. Now, again I am facing the same issues and when I requested for return again, FLIPKART REJECTED MY RETURN REQUEST by saying that everything is ok and u should go to customer care center. It's not more that 10 days i.e. still 30 days replacement guarantee is there under FLIPKART ADVANTAGE thing. Why to go to service centre within 30 days when flipkart is shouting out lout about their advantage. I hope they will replace it soon.",
            "date": "20 Mar 2015",
            "name": "abhay",
            "stars": "2 stars"
        },
        {
            "comment": "All items came on time, delivery fellow also dispatched on time, phone is damn good enjoying now android world, this is my first android phone that i've bought from flipkart ,ive also bought SD card on discount which flipkart. Specially thanks to Surat HUB dispatch department (Mr.Kadir Shaikh & Abrar).. .. and Dipak Dhrunarayan Tiwari (delievery fellow) who did job on time. With Regards, Sanir Mogera",
            "date": "20 Mar 2015",
            "name": "Sanir Mogera",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent camera Happy with the processor's speed Lollipop awesome value for money Overall, nice and cool product. Flipkart service: No trouble in shipping and delivery. Happy and satisfied.",
            "date": "20 Mar 2015",
            "name": "Ravishankar K",
            "stars": "5 stars"
        },
        {
            "comment": "It is a decent phone loaded with a lot of features. A good choice if its your first smart phone. User interface is really good. Google rocks!",
            "date": "20 Mar 2015",
            "name": "ANKUR C.",
            "stars": "4 stars"
        },
        {
            "comment": "Guys... this review is not based on frustration. From a third man point of view. I am a moto g 2 user and giving a genuine feedback. Do not invest 12999 for three months... this wont last more than that... you can check with anyone after updating to lollypop the mother board is not capable of surviving due to the old in capable chipsets... and the service centers are pathetic in response... within 20 mins i was there in service center almost i could see 80 to 90 moto g 2 users waiting in queue for giving their phone for service... Google treats our nation like third rated users by dumping their products... pls go for windows which i did and next month it would be upgraded from 8.1 to windows 10. the best OS is windows...",
            "date": "20 Mar 2015",
            "name": "Sankar Ananth S",
            "stars": "1 star"
        },
        {
            "comment": "Delivered on time. good condition. Satisfied with this product. fully recommended to purchase Good good good",
            "date": "20 Mar 2015",
            "name": "yasin",
            "stars": "5 stars"
        },
        {
            "comment": "when i install auto call recorder in Motog2. it record my voice only not the opp. voice it need to improve. when i ask to the experts they have no solution for this at present!",
            "date": "20 Mar 2015",
            "name": "Narsimhan",
            "stars": "3 stars"
        },
        {
            "comment": "The phone is realy good at this price. But from past 1-2 months, after I have upgraded it to Lollypop version, it hangs frequently. Thus, annoying.",
            "date": "20 Mar 2015",
            "name": "kamal bhattach...",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone from almost launch date. I was extremely happy with this phone, till I identified some serious shortcomings around a week back. I went to a trip and did not carried a camera as I was satisfied with picture quality of this camera. Before this trip, I have used camera occasionally, that too for not more than couple of pictures at a time. On my trip as I was using phone's camera, just after 3-5 minutes of continuous usage (especially in bright sunlight), it stopped responding and my phone went to hung state (even power button was not responding). I left it as is for couple of minutes, after which it camera did not worked but phone became sluggish. During this time, phone battery started draining at a faster rate. I was able to use it again after about 5-10 minutes, but faced same problem after couple of minutes. After coming home, I did a factory reset and hoped that this problem will be solved. Few days later, I needed to record a live event. Before starting recording, phone's battery was at 60%. After about 15-20 minutes of recording, again the sluggishness and unresponsiveness appeared, soon after which complete battery drained. Other than above, no major issues.",
            "date": "20 Mar 2015",
            "name": "Anju Goyal",
            "stars": "3 stars"
        },
        {
            "comment": "its gorilla glass,8mp camera toouch everything rocks just loved it after the update to loolipop this is one phone anyone can buy so dont hesitate at all itz brilliant. thnz to theflipkart one day delivery i ordered on 19th and i got my phone 20th morning that was really cool!!!!!",
            "date": "20 Mar 2015",
            "name": "shramith",
            "stars": "5 stars"
        },
        {
            "comment": "The product is functioning satisfactorily. But at times it heats up a lot while using internet. over all not bad",
            "date": "19 Mar 2015",
            "name": "Varghese Thekkel",
            "stars": "4 stars"
        },
        {
            "comment": "Used both moto g and moto g2. g2 strucks a lot and if you are a real smart phone user who uses 100's of apps then this phone is not for you.",
            "date": "19 Mar 2015",
            "name": "Santosh Viswan...",
            "stars": "4 stars"
        },
        {
            "comment": "I am using from last 20 day it a good product in this price range but the cover price is like cheating its almost 10% on the mobile price",
            "date": "19 Mar 2015",
            "name": "Orugunta Reddy",
            "stars": "3 stars"
        },
        {
            "comment": "The Motororla has brought a very good model (Moto G-2nd Gen). The Phone is fast, has very high internal memory, a perfect camera. All in all a very good deal.",
            "date": "19 Mar 2015",
            "name": "vibhor bhartiya",
            "stars": "5 stars"
        },
        {
            "comment": "Its been six months since I'm using the Moto G (2nd Gen) and I'm extremely satisfied with the phone. The Positives: 1. Excellent form structure makes it easy to hold and operate. 2. Build quality is pretty impressive and even after six months the device feels like new. 3. Absolutely No Heating Issue, even after extensive usage like playing games/ watching videos etc. 4. Battery Life: With Normal usage the battery easily last a complete day. 5. Lollipop update has simply transformed the user experience. 6. Speaker Quality along with call quality is very good. The Neutrals: 1. Camera quality is pretty decent and captures good pics during daylight, however there are not many functions to play around with the inbuilt camera app. 2. Screen brightness and Colour reproductions are satisfactory but definitely not the best. The Negatives: 1. Evident Cost Cutting thankfully with accessories only: Pathetic Headphones along with pathetic charger (No USB data cable provided). Summary: Overall I'm pretty happy with my Moto G 2nd Gen and even after six months thanks to the Lollipop update the device still can hold its own infront of newer phones from Xiaomi, Lenovo, Micromax and all.",
            "date": "19 Mar 2015",
            "name": "Chaitanya Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "The perfect smart phone for everyone. Awesome battery stand by . Good perfomance supports all high graphic games superb back camera,",
            "date": "19 Mar 2015",
            "name": "Elang kumaran",
            "stars": "5 stars"
        },
        {
            "comment": "Relly very nice phone. everything is good , but battery back up is little bit disappointment. Everything is fine.",
            "date": "19 Mar 2015",
            "name": "ShivaPrasaad SV",
            "stars": "5 stars"
        },
        {
            "comment": "i have purchased moto g 2nd gen in Feb after a week the phone started hanging, I even reached the service center and the said we ll upgrade to lollipop all the issues will be solve d, but even after upgrading I didn't find any change , my phone still hangs , customer care is not responding to my issues , I even sent an escalation mail but Moto company is least bothered, I have suggested all my not to buy moto g , Complete disappointment by Moto G",
            "date": "19 Mar 2015",
            "name": "Av",
            "stars": "1 star"
        },
        {
            "comment": "Do not buy if u r looking for a stylish and light weight handset. Samsung S3 Neo is better. This handset is not for those who love sleek phones...",
            "date": "19 Mar 2015",
            "name": "Kamal Chandel",
            "stars": "2 stars"
        },
        {
            "comment": "I have bought this product on 3rd of march and I receive this product as expected date..That all credit goes to Flipkart Team.Good work!! But When I found some problem with My phone Like heating of screen with charging. It also get heated with 10 to 20 minute call so Called them Flipkart customer care. Ask for service. They did all the process and I was waiting for Call from Moto service centre. Now the problem begin. I asked them to send ur engineer before 11:00am in at me address but all guys from service centre always called me after 12:00 .The gave all false excuses like engineers mobile phone was stolen bla bla.. They talk like bullshit here are some contact number from service centre called me ..011-14041278,",
            "date": "19 Mar 2015",
            "name": "Shakeb Ahmad Khan",
            "stars": "1 star"
        },
        {
            "comment": "Once the problem comes to phone with in the warranty time also(mine just 2 months) flipkart and motorolla service center response is very very bad.. stay away from motog2 and stay away from exchanging phones also..",
            "date": "19 Mar 2015",
            "name": "THRINESH REDDY...",
            "stars": "1 star"
        },
        {
            "comment": "I baught a motoG 2 last week. found that the front cam display is having problem. I reported the issue on 15th march. 17th March I got a call and told me to do a trouble shoot. I tried that and found the issue is still there. I reported it again. I got replay that i will get a call on 18th March. But didnt received yet.",
            "date": "19 Mar 2015",
            "name": "Bibin Job",
            "stars": "1 star"
        },
        {
            "comment": "Its a Very Nice Mobile With Lots of Latest Features and Very Tough which satisfy hassle free usage Pros: Camera Screen Resolution Talk Time Toughness Cons: No 3g Video Calling Non Removable Battery",
            "date": "19 Mar 2015",
            "name": "Rakesh Machhi",
            "stars": "5 stars"
        },
        {
            "comment": "It was excellent delivery service from flipkart. Initally battery was not standard thats since due to Sync of many apps and they were online. Once changed settings it was coming for more than 11/2 days. Front cam is awesome clarity on selfies. Excellent comeback by moto in India with neat product.",
            "date": "19 Mar 2015",
            "name": "Kamal Rajan",
            "stars": "5 stars"
        },
        {
            "comment": "LACK OF SERVICE CENTERS AND PARTS ARE NOT AVAILABLE AT SERVICE CENTERS, MY RECOMMENDATION IS PLEASE DON'T BUY MOTO PRODUCTS.",
            "date": "19 Mar 2015",
            "name": "Amjad%20basha...",
            "stars": "5 stars"
        },
        {
            "comment": "its the waste mobile,and signal don't catching properly always hanging and the dial-pad is very confusing mobile data is also slow",
            "date": "19 Mar 2015",
            "name": "Ram Maddu",
            "stars": "1 star"
        },
        {
            "comment": "1. Excellent Gadget for people on the go 2. Bold Black look 3. Easy to use and type 4. Great display and protection from Corning Gorilla Glass 3 BUT HORRIBLE DELIVERY SERVICES. my product reached vadodara hub, and was not delivered for 3 days, as the delivery hub mentioned they could not deliver to my specified address. I had to provide them a new address, for which the vadodara hub returned my cell, and had to place an order for a new cell. These guys simply could not deliver the cell to the new address. this whole ordeal delayed the delivery by another 5 days. clearly unacceptable by Flipkart Logistics.",
            "date": "19 Mar 2015",
            "name": "Siddhartha Butola",
            "stars": "5 stars"
        },
        {
            "comment": "I am happy with this product, Its camera quality is superb in dim light and processing is good even i used to play 2.50gb game in it and its working fine without any lagging.",
            "date": "19 Mar 2015",
            "name": "Ravi Raghav",
            "stars": "5 stars"
        },
        {
            "comment": "I bought it 4 months back. It was a very good experience with great features for a nominal price. But I lost this phone while travelling by bus. I will buy it again but just a matter of time.",
            "date": "19 Mar 2015",
            "name": "Subramanya",
            "stars": "5 stars"
        },
        {
            "comment": "every aspect of this phone is excellent except the battery which almost dies in five hours on connected to wifi but normal usage is stil fine nine hours, but still this phone is the best.",
            "date": "19 Mar 2015",
            "name": "Tausif khan",
            "stars": "3 stars"
        },
        {
            "comment": "MOTO G 2nd Defect Hanging and Network issue - Already requested for replacement however technical staff always arguing and forcing not to replace. I have already done factory rest and basic checks as requested by them. Why nor replace or refund asap?",
            "date": "19 Mar 2015",
            "name": "Rishi Pande",
            "stars": "2 stars"
        },
        {
            "comment": "I have ordered moto g on 13th march and surprisingly got the product on 16th so service was fantastic and i have been using moto g for last three days and i did'nt see any lag in performance and device comes with 5.0.2 not 4.4.4 as stated by flipkart.",
            "date": "19 Mar 2015",
            "name": "Sudhanshu Puri",
            "stars": "5 stars"
        },
        {
            "comment": "only lag battery capacity thats it..beautiful mobile ..who ever buy it plz buy one power bank.. go for it..best phone in this range",
            "date": "19 Mar 2015",
            "name": "Subrat Biswal",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this product from Flipkart. I appreciate flipkart for very fast delivery. I got this device with android 4.4.4(Kitkat). It was working good till I did not updated it in new android Lollipop(5.0.2). After update I started facing the issue of audio not coming from the call speaker during calls but my voice is going perfectly to other side. When I reboot the phone it started working fine but the same thing was happening again and again. So I request a return from flipkart. They asked me to do some trouble-shooting and reset the phone to factory setting (OS did not reset during this ). But after trouble-shooting I kept facing the same issue and need to reboot the device again and again. I requested a return again. This time flipkart guys installed Smart-Check application to it to find the issue if it is real and I am not making it up. That subdue application was unable find that issue as I have rebooted the device already and this issue of voice not coming was not happening every time. FLIPKART AGAIN REFUSED THE RETURN. As they replied that their application was unable to detect any issue although I keep telling them that this issue does not happened every time and your this application is not able to detect this issue at this point of time. They replied \"We cannot sure about this kind of issue as we are not the manufacturer. but we are sure about the thing that smart check did not show anything but we cannot assure that smart check are perfectly designed to detect the issue. I again requested the return as I was facing the same problem. This time somehow they were persuaded (by fear or courtesy I cannot say) ,they accepted my return and delivered a new Handset with ANDROID 5.0.2 well before the given time frame. Now I am again facing the same issue and again need to request the return. I have done all the troubleshooting which flipkart earlier stated me. Even I have done the troubleshooting which Motorola told me but still facing the same issue and there is no fix for the problem. I am still wondering what to do with this handset. I am not going to buy any motorola product in future. Latest Update: I requested a return on 18th Mar 2015. I got a call the next day 19th Mar at 2:30 pm from a lady from esclation deprtment stating that THEY WILL REPLACE THIS PRODUCT WITH A NEW ONE AND IF THAT PRODUCT WILL HAVE PROBLEM THEY WILL REFUND IT. I CONFIRMED THE SAME FROM HER THRICE But here is the height of the cheating from flipkart, They call me up the same day at 5:23 pm telling me that they cannot replace it. the max they can do that is to arrange a technician. I tried to explain the entire issue to that guy but that guy was not even ready to understand and told me the earlier information that given to you about replacement is WRONG INFORMATION DELIBERATELY PROVIDED TO YOU AND THEY CHANGED THEIR POLICY FOR THIS PHONE TO REPLACE IT ONCE WITH A FAULTY PRODUCT. NOW YOU ARE YOU OWN AND FLIPKART DON'T BEAR ANY RESPONSIBILITY. I requested that guy to let me talk with any other more senior guy and he replied he is the most senior person in flipkart and no other senior are there. They forcefully arranged a Motorola technician and refused to believe me that phone is faulty. On 20th March The technician visited and declared that problem is unsolvable. and this is a true fail case and recommended replacement but FLIPKART DON'T BLINK YET. Now I really can't say what abt my money which I paid flipkart and what abt their commitment for customer satisfaction and 30 days hassle free replacement and What to do with this phone. I am even not able to perform basic function that is calling. Finally on 25th March, Refunded me my money. Thank you Flipkart for your services",
            "date": "18 Mar 2015",
            "name": "Ankur Garg",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this phone on January 26, 2014. It got delivered on time - within 3 days after I had purchased it. The touch was satisfactory and overall it was all fine until ten days back - I realized that I couldn't switch on the phone after trying several times. That was the beginning of my misery with this phone. I called up the flipkart helpline to know about motorola service centers. I was wrongly guided with an address that doesn't exist. A day after I managed to find the correct address. I approached the center - 25 km away from my place of residence. What lay in store for me was a horrifying reality - I had to pay 80 percent of the total cost to get my 'battery jack' fixed. Motorola is an unethical manufacturer apparently. It's flipkart's responsibility too to settle consumer grievances - this is a case of counterfeiting on part of both the manufacturer and retailer!",
            "date": "18 Mar 2015",
            "name": "Divya Chaudhry",
            "stars": "1 star"
        },
        {
            "comment": "I got the phone but no satisfied as i think. In India, if Indian language will not support than it's useless for Indian people and Motorola Support team also confirm that it will not support on this phone and Flipkart can't refund or replace it. They also not describe this thing in their Product Sale / Technical Page... Too Bad...",
            "date": "18 Mar 2015",
            "name": "KAMLESH MISTRY",
            "stars": "1 star"
        },
        {
            "comment": "I was a bit tensed as Motorola phones are not very user friendly. However, this product changed my view towards them. It's slim body is packed with so many novel features. I liked it.",
            "date": "18 Mar 2015",
            "name": "Kajal Bhattach...",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is very nice to use. Music stops if u shake the phone . Screen sensitivity is ok . Sound is fine.. Good phone below 15 k except 4G.",
            "date": "18 Mar 2015",
            "name": "Anshuman Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "In 72 hours of delivery the sim 2 port has stopped working and the authorized service center is asking for more than 10% of the cost of phone for such a minor repair.On not getting proper response within a month I will put the mobile on railway track,let it crushed; make a movie of that and will up load on U tube.Flipkart should not sell products of such irresponsible companies. Dear friends beware of such worst products.",
            "date": "18 Mar 2015",
            "name": "Jasbir Chhabara",
            "stars": "1 star"
        },
        {
            "comment": "Worthfull Product......................................................................................................................................................................................................................................................................................................",
            "date": "18 Mar 2015",
            "name": "Chanti",
            "stars": "5 stars"
        },
        {
            "comment": "My Moto G (2nd Gen with Android 5.01) display goes blank after entering the pass-code sometimes, have to restart the phone to restore the normal working. Its battery drained from 30--40 % to 1-2 % within minutes. Think this phone has issues with its form-ware..",
            "date": "18 Mar 2015",
            "name": "Karam",
            "stars": "2 stars"
        },
        {
            "comment": "HELLO... I M USING MOTO G 2ND GEN. FROM 1 MONTH ... AND MY EXPERIENCE IS VERY VERY AWESOME... I LIKE THIS PRODUCT .. CAMERA .... SO SO GOOD... IN EVERY CONDITION ... PROCESSOR IS VERY FAST FOR MULTI TASKING... TOUCH IS VERY SMOOTH... FULL PRODUCT IS NICE...",
            "date": "18 Mar 2015",
            "name": "VISHAL PANCHAL",
            "stars": "5 stars"
        },
        {
            "comment": "if you are thinking to buy this mobile go for it you will be happy on your decision mobile screen was giving problem such as notification bar not sliding .Down so I went to Motorola service centre and they replaced my screen in 4 days. And now it is working perfectly fine after 6 months .",
            "date": "18 Mar 2015",
            "name": "Sushrut Dhadwe",
            "stars": "5 stars"
        },
        {
            "comment": "1. I thought that corning gorilla glass3 is scratch resistant, but i was wrong because there is a sign of scratch within three month of use. My friend use htc one m7 with corning gorilla glass 2 for one year now and there is not even a single scratch. I think Moto g 2nd generation corning gorilla glass is same as ordinary glass. 2. battery drain too fast it does not last even for a half day when in use and it take too much time to recharge",
            "date": "18 Mar 2015",
            "name": "Glorystar Syie...",
            "stars": "1 star"
        },
        {
            "comment": "After using for couple of months i am not happy with the mobile. Initially i have problem withe the speakers but not sure it got fixed after couple of months. The phone is very slow. when you launch 3 or 4 apps the phone is gone it will become unresponsive. when using apps like skype for more than half an hours the phone heats up. No red eye correction with the camera. when the phone is idle that your wifi also sleeps and you wont receive any messages. once u try to wake up the phone all the messages will try to rush at that time and phone hangs. No positive customer support from motorola. What they will tell when contacted is clear all data :( Flipkart service 5 stars",
            "date": "18 Mar 2015",
            "name": "ranjeeth",
            "stars": "1 star"
        },
        {
            "comment": "Product is very good when considering the performance,camera quality.The only problem is, when we talk more than 15-20 min its getting heated.Rest of the things are fine.",
            "date": "18 Mar 2015",
            "name": "Siddhardha Nomula",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone for more than two weeks now. Phone is perfect is you are not a heavy user. Battery last whole day(again not for heavy users). Camera and call quality are perfect. So far i have no complaints form the phone.",
            "date": "18 Mar 2015",
            "name": "Dhirendra Pratap",
            "stars": "4 stars"
        },
        {
            "comment": "Decent Phone with ALL features required. beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "18 Mar 2015",
            "name": "Junaid Juwale",
            "stars": "5 stars"
        },
        {
            "comment": "As usual it was a great execution kudos to team Flipkart. Now coming to the product it was initially a great product with good battery backup as in my profession has to be present in the Mail 24hrs. gradually I found out that the battery backup which use to be 24hrs at-least but it is now 10hrs i have tried to contact the customer care but no result looking for some comment from flipkart as well as Customer care team of moto g. Moto has launched Moto e 2 at price range of Its cheated the Customers now a better phone with lolly pop update same hardware better battery backup but in lesser . what will happen to the customer who has purchased the Motog2",
            "date": "18 Mar 2015",
            "name": "Pratik Banerjee",
            "stars": "1 star"
        },
        {
            "comment": "fastest delivery i have never seen ...got this product in just 6hours.And this moto g phone is upgraded to lollipop ..................................................................",
            "date": "18 Mar 2015",
            "name": "Shreyank M Bya...",
            "stars": "5 stars"
        },
        {
            "comment": "Good mobile. Using for the past 3 months. Upgraded to Lollipop. Was little slow (some times), but overall performance was good for the price.",
            "date": "18 Mar 2015",
            "name": "Ganesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Better than my expectation, Stylist nd so easy too carry. Wonderful Experience with android 5.0 lolypop.",
            "date": "18 Mar 2015",
            "name": "Khushboo Mamtora",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Long Battery 2. Looks good 3. Awesome service by flipkart 4. Awesome features Cons: Till now did not find any",
            "date": "18 Mar 2015",
            "name": "Narayani",
            "stars": "5 stars"
        },
        {
            "comment": "Only one word Awesome phone Moto G2 given 5 out 5 star. After 1 month of use my personal experience Sound excellent Gaming excellent Android latest version L Fast Movement with out any stuck Value for money go for it....",
            "date": "17 Mar 2015",
            "name": "nilesh kudaskar",
            "stars": "5 stars"
        },
        {
            "comment": "Spec is good as per price Bigger screen & good display Camera is good compared to lumia 920 So far no issues except battery life. I wish the battery life could have been better.?",
            "date": "17 Mar 2015",
            "name": "Prasanta kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "I am not sure flipkart selling fault pieces or MOTO designed this way, I am totally disappointed with this product. lot of heat generating while attempting phone calls more than 5mins. battery backup is bad. the product is OK for using 20-25 apps. with 3G the battery charge is worst. I won't recommend this product to ppl who are more dependent of 3G and who attempt lengthy calls frequently.",
            "date": "17 Mar 2015",
            "name": "dheeraj karnati",
            "stars": "3 stars"
        },
        {
            "comment": "I am very sorry to say that as moto g (1st) the new moto g2 is not at all a good phone now. I bought the phone from flipkart 24 January and m using it. I got a bad experience for this phone. So without going to the merits i will directly come to the demerits:- 1. Phone charge about 3 to 4(maximum) with data ON... 2.Its getting hot but not much. 3.Simple games like temple run Oz, subway surfer, are stuck most of the time. So guys think twice before choosing this phone. there are other brands also out there which u can opt with low price better than this one. DON'T UPGRADE IT TO Lollipop 5.0.2 until they lunch newer versions. Be Happy Always Bye",
            "date": "17 Mar 2015",
            "name": "A H KHAN",
            "stars": "2 stars"
        },
        {
            "comment": "The Mobile is good one and very simple.. the speed is good and does not hang. This mobile does not have Note Pad, and does not share the screen to TV, but those are very rarely used also. You can instal the notepad from play store. and ms office is by default.. this is good mobile and worth money.",
            "date": "17 Mar 2015",
            "name": "sagar",
            "stars": "4 stars"
        },
        {
            "comment": "this is probably the best phone you can buy in this range , and it got more better since i got the lollipop update . dont think much . just go for it !",
            "date": "17 Mar 2015",
            "name": "Shoaib Gani",
            "stars": "5 stars"
        },
        {
            "comment": "Hi I received the product on 7th and it the phone does not work now and it is after the return date. When I have been asked to pay Rs 3000 to fix it. I think i should have gone for a better phone. Highly disappointed!!!",
            "date": "17 Mar 2015",
            "name": "Arutselvan Thangavel",
            "stars": "1 star"
        },
        {
            "comment": "I bought Motorola moto g (2nd gen), 3 months back but the piece i got has many problems such as touch insensitiveness, battery getting discharged , speaker noise, phone getting switched off in between the calls, etc. but the worst problem is after sales service.Motorola has horrible after sales service. They tend to make you wait about more than a month and then also do not resolve your problem completely.As u can see in my case , i reported these issues to the Motorola service center(SAI COMMUNICATIONS , GHAZIABAD) and then i submitted my phone there with these problems that i mentioned before.They took my phone for more than a month and then only replaced the display and leave out the other problems. In addition to this they damaged my phone physically and want to charge me for that as physical damage don't count in warranty. So as a reviewer i will suggest you not to buy Motorola phones as they have horrible after sales service but if this does not matter to you then you can do whatever you want.",
            "date": "17 Mar 2015",
            "name": "Rishabh Jain",
            "stars": "1 star"
        },
        {
            "comment": "From flipkart i purchased 3 (Moto G 2nd) mobiles recently.One is for me and other 2 are to my friends.I was facing the problem in voice reception quality in my first mobile.After they replaced the phone even i am getting the same problem.i don't know where to say this problem.but other 2 mobile having no issue on this.when i compare these 3 mobile i come to know one thing. the phone having this issue only which has \"blue tint screen \" .Red tint Screen having no issue.",
            "date": "17 Mar 2015",
            "name": "Sasi Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Phone is very good. The only con i faced is battery. i still dont understand my brands limit the battery power so much ... so if u love battery capacity, this phone is not for u.. other then that ..the phone is v nice",
            "date": "17 Mar 2015",
            "name": "Amit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Restored my faith in Motorola! Although No multicolored LED only simple plain white LED,also No IR blaster that makes this phone feel like incomplete but compared to the price it is set this is a very great phone so as to with all the best features!! Pros: #OTG support #Pure Lollipop with multiusers!! #At least a white LED. Cons: #No Ir blaster!!! #Not sensors like GALAXY S4 or S5 but acceptable (considering cost)! #No multicolored LED. #Not much RAM (minimum 2Gb is basic now!!",
            "date": "17 Mar 2015",
            "name": "AR",
            "stars": "4 stars"
        },
        {
            "comment": "The sole reason for buying this phone was Lollypop and brand Motorola. No doubt phone is sturdy and have a solid built but the lollypop update has made this phone too laggy. RAM usage goes too high frequently leading too crashing of applications. I own a micromax android one can A1 and I can say it performs much better and faster that this. May be due to Kitkat but it is much better than this. Motorola's claim of 1 day battery is also not true. By the end of evening you have to reach the the switch board to get it charge. Also the retailer WS retail is not good. They have sent me a substandard product. It has got some visible damage marks on the screen! My only recommendations is not to go for this product better buy another one! May be much cheaper than this",
            "date": "17 Mar 2015",
            "name": "Jasmeet Singh",
            "stars": "3 stars"
        },
        {
            "comment": "This model was very poor of this battery its drain ultimate speed its quick drain what ever its done and more heating while playing any type of games am so disturbed",
            "date": "17 Mar 2015",
            "name": "Iyyanar Palaniyappan",
            "stars": "1 star"
        },
        {
            "comment": "Shipped with the latest update of Android. I didnt need to update anything . Service and tracking was well coordinated and shipped 24 hrs prior to estimate date and time.",
            "date": "17 Mar 2015",
            "name": "Shashank b",
            "stars": "5 stars"
        },
        {
            "comment": "I bought Moto G2 in Oct, 2014. Flipkart delivered in time. The phone was good enough for its price. Towards end of January, I started getting popups for andriod OS upgrade to lollipop. I ignored for a while, but bit the bullet on Feb 12th. Upgrade was easy. HOWEVER, the battery wouldn't charge after the upgrade. I tried couple of steps the Motorola Live Center advised, but those didn't work. Then I was advised to take it to the nearest service center. The service diagnosed the device, and told me that the mother board of the phone was fried! The phone is under warranty, but they didn't have parts in stock. Apparently they have to \"indent\" for the part from the company. Fast forward to March 17th, after repeated calls and an email to both Motorola help line and also the service center, I have yet to hear if the phone is repaired. Apparently, Motorola doesn't have any parts in stock in India, and they have to arrive from China. Terrible.",
            "date": "17 Mar 2015",
            "name": "Venkat Kolli",
            "stars": "2 stars"
        },
        {
            "comment": "I can't express my view how delighted I am by using this awesome phone. but having some heat and hang problems. you can do all office work on this, google now is work fabulous in this and can used like guide to you. Thanks Motorola and Google!!",
            "date": "17 Mar 2015",
            "name": "Sachin Farfad...",
            "stars": "5 stars"
        },
        {
            "comment": "thought all specs are good enough on the paper, the screen is too dull it doent give out colors well and it takes a long time for charging. the intreface and performance is smooth for now but have to see if this will continue after using for some time, since in all the android phone this is the major issue, that is after using for some time the phone starts to lag badly even for basic operations.",
            "date": "17 Mar 2015",
            "name": "shravan v",
            "stars": "3 stars"
        },
        {
            "comment": "Amazing and awesome product i ever seen and cant explain because i have no word.I would like to say that you should go for purchase. if you want cheep and best.",
            "date": "17 Mar 2015",
            "name": "Sanjay Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Yes, I bought one for my mother after her Samsung Galaxy DuoS started dying. This was a very refreshing change for her. She's liking it every bit. It's much faster, the screen size and resolution is good. Easy to get used to and transferring all data using the Motorola Assist is an absolutely fantastic option. The camera is reasonable and is a little cumbersome to use. All in all, a good phone for your mother.",
            "date": "17 Mar 2015",
            "name": "Anand Kothekar",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart deliver amazing fast, Nice phone battery is a problem Everything else is superb Camera needed to be improve",
            "date": "17 Mar 2015",
            "name": "Sanu Antony",
            "stars": "4 stars"
        },
        {
            "comment": "The screen is good. I have had the cell placed in very questionable corners of my Activa for an hour ride multiple times in the first week , and no scratches or anything. None the less I have put a scratch guard. The gorilla glass felt better whatsoever. Ram: (1GB) Suffices; Most of the time its 50 % used. What disheartens me is any time it reaches around 70-75% usage, the cell slows down. Don't know if it is to be expected out of a Quadcore Processor. I didn't expect that to happen before 90%. You need to have Clean master to keep the cell smooth. [I do use Clash of Clans and Brain Wars quite frequently but still no app > 100 MB ] Battery is really good so far. Its been only a month's use but 90% battery lasts me for more than a day. [Use involves frequent Clash of Clans and Brain Wars use once every 2 hours for 16 hours of the day] I had a Micromax A116 which I bought 2 years back for 15k and the only advantage I feel is the additional 16 GB internal for 2k lesser value. (I am very performance of Cell oriented person and don't focus much on camera). 1 GB Ram and quadcore snappdragon, have not been as good as I thought them to be before purchase. The back cover \"seems\" a little fragile. I am planning to get a rigid back cover over the existing one. Though I would say it is a quite trustworthy Cell in this price range and at these specs.",
            "date": "17 Mar 2015",
            "name": "Saurabh Kelkar",
            "stars": "4 stars"
        }
    ]
}
