{
    "filpkart": [
        {
            "comment": "I purchased moto g 2 from flipkart, using it since 3weeks. I observed that the android operating system is using about 45% of the battery, reducing the battery life to 5-6hr. While my wife is using moto e ( purchased from flipkart) its android operating system is using only 16%of battery, giving much more battery life.(she is charging once in three days) both are running on android 4.4.4 versions. I don't know why this is happening.If the manufacturers fill this gap in their next update,It would be the one of the best phone for their specifications and cost. If there is any solution many users will be benefited.",
            "date": "23 Nov 2014",
            "name": "Javvaji Prasad",
            "stars": "2 stars"
        },
        {
            "comment": "I wont be bullshiting about configurations and specifications.. those are already on product display. Device is working extremely good till now. I am disappointed with inbox accessories. Charger charges phone really slow, it doesn't have earthing pin (required just to support charger). Earphones are literally 50rp product, utter plastic and it will make your ears red. All can be excused because device is giving back more then what you have spent. 1* is deducted because of inbox accessories.",
            "date": "23 Nov 2014",
            "name": "Madhav Desai",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it for my teacher and it is an very nice and premium looking phone.some pros and cons are 1.battery backup is too good for a 5incher 2.stereo speakers are too good to listen songs 3.Comes with ready kitkat 4.4.4 4.premium design 5.Guaranteed updtes by google cons 1.camera is not that great as compared to canvas nitro or zenfone 5 and camera ui doesnot offer much option 2.It",
            "date": "23 Nov 2014",
            "name": "Divyanshu Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Has anybody faced heating issue.. I am experiencing the heating issue if the camera is used for 5-10 minutes or playing for 15 min... if the seller reads this please let me know if this true or can be replaced...",
            "date": "23 Nov 2014",
            "name": "Chandresh Dedhia",
            "stars": "2 stars"
        },
        {
            "comment": "awesome phone with awesome features .. no lag at all , awesome sound quality .. now jus waiting for anderoid update ...",
            "date": "23 Nov 2014",
            "name": "Nitin Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "Hi friends... I got this mobile form flipkart on nov 6 2014.. I want to tell something abt moto g 2nd gen after using 2 weeks..This is best mobile with this price. i had already used samsung core and samsung s3 and micromax canvas..moto g 2nd very best compare tha n other.. best internal storage and user friendly.. and battery backup very good..camera is too gud ..also the front speakers very attractive..i m so satisfied by this mobile.. i love moto g 2nd.. i had recommended to my friends...best mobile within best price..",
            "date": "23 Nov 2014",
            "name": "V.Murugan Madurai",
            "stars": "5 stars"
        },
        {
            "comment": "Premium quality phone. Satisfies at every aspect- internal memory, call quality, gaming performance, battery life. Very smooth performance.",
            "date": "23 Nov 2014",
            "name": "Sandeep Nikam",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing smartphone delivered from flipkart.There is no lag at all. Superb gaming and awesome battery,Moto simply world class phone of all time. I would like you to buy this phone.Just enjoy it",
            "date": "23 Nov 2014",
            "name": "GURU PRASAD",
            "stars": "5 stars"
        },
        {
            "comment": "its really a very gud device and at 13000 its a must buy.and thanx to flipkart i got this phone in just two days",
            "date": "23 Nov 2014",
            "name": "rohan bhadoriya",
            "stars": "4 stars"
        },
        {
            "comment": "I am having a tough time sending group sms.... really having a tough time.. and one of the worst mobile of all..... i check what all the way but.. waste of time,,,,,,,,,,,,,, really waste.. please i hate..",
            "date": "23 Nov 2014",
            "name": "JOSEPH REBELLO",
            "stars": "1 star"
        },
        {
            "comment": "Issue Number1: Unable to hear the voice on the call, its completely mute, even the loud speaker is not working. After restarting the phone, it worked. Issue Number2: I have just 6 videos on Gallery, if itry to play them it comes up with the message \"Video Problem can't play this video\" on clicking ok, the video starts playing. Issue Number 3: I have 255 whatsapp images, if i tries to view them it comes up with the message \"Thumbnail not found\". Issue Number4: if i am playing games such as Temple Run2 and Subway Surf the phone gets hanged up and i will not be able to do anything, phone gets heated up soon. Issue Number4: This mobile has been already used by some one else, i could notice the numbers before inserting the sim, when i discusssed with my friends came to know with new phone nothing will be there in the phone.",
            "date": "23 Nov 2014",
            "name": "Gowri Shankar J",
            "stars": "1 star"
        },
        {
            "comment": "good product but my moto e looks better than moto g 2nd gen ........................................................................................................................................",
            "date": "23 Nov 2014",
            "name": "pravesh kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "I don't need to describe the specs again as it is already given at Motorola's official page. I have previously used a lot of Android phones like the Xperia ZR, Xperia L, but nobody came close to my tried and true Moto Defy+. I guess that is why I went for the Moto G. Build quality is good and grip with the Flip cover is excellent although I would have liked if the screen was 4.7 inch instead of 5 inch because it was too big for my hands. The UI is fast and responsive with less to none bloatwares, although free RAM was a bit of a concern because only 300MB was usable. It would have been good if they had included 1.5GB of RAM at least. Also, no 1080p recording. That was also a serious bummer considering the Adreno 305 can play 1080p. My Defy+ plus was (is) a beast because it never gave up even when I tortured it again and again with heavy drops, water splashes, and the Gorilla Glass was tough as hell because I never used a screen protector on it. Let's hope these things remain.",
            "date": "23 Nov 2014",
            "name": "Reetam Chatterjee",
            "stars": "4 stars"
        },
        {
            "comment": "I received faulty product from flipkart &i m very disappointed. I can do a call but dont kno why i am not audible to others",
            "date": "23 Nov 2014",
            "name": "Geetanjali",
            "stars": "1 star"
        },
        {
            "comment": "i ordered the phone on 18th Nov and flipkart given me the delivery date of 24th nov but they delivered the phone on 22nd Nov . the phone is excellent in all function say its call quality, no lag in gaming with quad core processor, best camera in range of 13,000 rs, loud dual speakers, best user interface, pretty and latest android experience, lite weight, better screen, etc. in case of battery life all the android phones get heated in multitasking and less battery life but this phone is best i had used canvas nitro, xaiomi redmi 1s, and canvas elanza all three can be used for ironing when they get heated also the ui of redmi 1s is worst no task button found on it whereas canvas elanza and nitro was good but they doesn't have gorilla glass protection. you can also experience the latest android in market with this phone. so if you want a good phone within this price range then go for moto e,g of g2, because it not only gives value for money but can be used for 2 to 3 years if used like a human being not animal. and thank you flipkart for your best service.",
            "date": "23 Nov 2014",
            "name": "Anurag satish...",
            "stars": "5 stars"
        },
        {
            "comment": "I am really happy with MOTO G 2nd gen. Its totally paisa wasul mobile. and great specs and build quality in this price range. Some things that i think can be improved are 1) Battery life, I can still manage 1 whole day on less than avaerage usage. 2) Camera options or more feature in camera software though image quality much improved thanks to 8MP snaper 3) Lags sometime thats because its running the same snapdragon 400 1.2 Ghz quad core, Need some more Gigs 4) Overall very well built phone, speakers not at the par with HTC but preety loud. Definately winner in under 15K price range",
            "date": "23 Nov 2014",
            "name": "Utkarsh Kale",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 is an awesome phon e within its price range...display is very crisp and clear. sound of speakers is good, not vey much loudy but has clarity.. supports nhd videos.. bt it would be one step satisfactory if full hd being supported by this device.. bt its ok Camera 8MP is very nice.. and the front cam also.. i will give 9 upon 10. device is very fast.. asthe proccessor and ram is given such better.. performance is very good .. one thing it has that the head phone is not to good . output is low. and has a non removable battery.. But overall the phone is outstanding...!! Im lovin it :)",
            "date": "23 Nov 2014",
            "name": "Somnath Das",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Product with excellent features in this price range. Thanks to Flipkart for making this mobile available online. And I got the product delivered within 4 days.",
            "date": "23 Nov 2014",
            "name": "JAGADISH KUMAR T",
            "stars": "5 stars"
        },
        {
            "comment": "i got my moto g 7 days ago ... i think i am eligible for writing a review after hardcore usage for nearly a weak .. 1. pretty quick processing .. 2. camera quality is really impressive including front camera 3. display quality is fairly good . 4. front dual speakers serve the job , pretty descent sound quality.. 5. OTG USB Support 6. 16 gb internal memory + microSD card slot 7. good gaming experience ( played heavy games like blood and glory , dear trigger 2 , asphalt 8 without any problem) cons: 1. i dont care much about RAM . though i find 1 gb is enough for me ...multitasking can be tricky on this phone .. 2. fair battery backup ,but have to charge every day ( 6 hours of display time with average use including 1 hour of gaming , 2 to 3 hours of net usage , half hour to one hour calltime etc) 3. if put on a cover , phone tends to get hwarm after heavy gaming or camera usage ) but not too hot , warm . i have tried to give u a unbiased opinion , simply best in this price range . only xiaomi mi3 is a better phone than this in this price range .. so if u are hesitating to buy this phone .please dont .. u will be satisfied at the end of the day ..",
            "date": "23 Nov 2014",
            "name": "keshav gawde",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using moto g 2nd gen for about a month now and it is the best phone with that can be bought under sub 20k range. Everything works as the specs say they should.",
            "date": "22 Nov 2014",
            "name": "Nikhil Saini",
            "stars": "5 stars"
        },
        {
            "comment": "I have recently purchased Moto g2 from flip kart, but I found that RAM is less than it was claimed. in apps manager it is found that fone is using 573 MB and 281 MB is free (Total 854 MB) however in phone specification everywhere it is written 1GB, Please confirm the same. I will rate this product after clarification.....",
            "date": "22 Nov 2014",
            "name": "Satish Chaurasia",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this product on 17th nov next day i noticed that sim card is not getting inserted ,i asked for a replacement they said they ll contact me in 5 days just to confirm my replacement and they took 5 days just to call me i had to call them everyday requesting them to call me finally they agreed to replace my product and next day i get it i checked the product in front of that delivery person and found out that the touch screen is not working what is happening here when called the customer care they said that the delivery is not updated and i have to call them after 7pm why? and finally when i called they again said they ll take 5 day to call me back my confirm my return what? again its thier mistake that they are delivering me defected pieces and they are the one who are mentally torturing us like this worst customer care i lost my trust in flipkart never going to buy any single product from them.",
            "date": "22 Nov 2014",
            "name": "Saher",
            "stars": "1 star"
        },
        {
            "comment": "First one - Sim slot issue - Replaced (Very Soon) Second one(REPLACED PIECE) - A DEAD PIXEL- Returned and refunded money(Return was 15 days LATE) Third one - HOPE to see it working fine - ( RECEIVED almost within a DAY excluding Sunday )ENJOYING the phone THANK YOU Flipkart and WS Retail HAPPY NOW :)",
            "date": "22 Nov 2014",
            "name": "Rohan Maharana",
            "stars": "4 stars"
        },
        {
            "comment": "when i got the phone,.. i installed lots of apps like whats app,fb messenger etc ..but after 2 to 3 days the apps started disappearing automatically and the phone statred to switch off with in every 15 min ...i informed to flipkart and they said they will call me on 24 regarding this...so i am waiting for it...GUYS I WILL GIVE A REVIEW AGAIN AFTER 24TH OF THIS MONTH",
            "date": "22 Nov 2014",
            "name": "BALU MILIND",
            "stars": "1 star"
        },
        {
            "comment": "I demand only 4 hours early shipping for this Item and flipkart does not delivery in time. Rest phone is good.",
            "date": "22 Nov 2014",
            "name": "Kaushik Rabadiya",
            "stars": "3 stars"
        },
        {
            "comment": "This review is for all the prospective buyer of flipkart who is intended to buy any product from so called mega e-commerce retailer. I want to warn each and every one of you to abstained oneself from get cheated and feel betrayed. I want to share my horrible experience that I had recently WITH FLIPKART. Few days back I booked a moto G 2nd gen and paid extra for GUARANTEE one day delivery. I did not receive the product on the schedule date and when contacted with customer care they said it cannot be delivered on that day but it will take 2 more days. I was also promised for compensation by way of cash in my flipkart wallet within 48 hours. But this could not happen even after a week. Moreover to my surprise they said I have asked them to reschedule delivery and that is why this was not delivered to me that day. I cannot understand how mischievous one can be! How fraudulent one of the reputed online store can be! How unprofessional one could be. Alas! Even after this much of persuasion they don't consider it as their responsibility to respond to its customer. Conclusion:- good product but worst service. I am giving rating one because I was not allowed to give zero rating",
            "date": "22 Nov 2014",
            "name": "Subodh",
            "stars": "1 star"
        },
        {
            "comment": "Overall its a good phone by Motorola, but it does have some cons like.. 1. Speakers- speakers sound quality is very bad 2. Call quality- The nokia feature phone has much better call quality as compared with this phone. 3. Charging time- When I received this phone, it had 0% battery, It took 4.5 hours to charge only 80% battery. And now it is taking 3 to 3.5 hours to charge 100% Otherwise this phone works great, as it has stock android so there is no lag. And battery life is also good, for medium usage it can survive the whole day. And now I m expecting Android Lollipop..! So, overall Its a good phone at this price tag!!!",
            "date": "22 Nov 2014",
            "name": "Ajay Narang",
            "stars": "4 stars"
        },
        {
            "comment": "I am facing issue with the earpiece sound quality, there is a continuous hissing sound while in a call. The display registers scroll gesture as touch, which is very annoying while browsing web. Also the buttons are not good and the power button feels like it may break. This is in contrast to another set that I ordered for my friend. Another interesting point is that the default plastic sheet on the screen had no logos on my set while it had some Motorola inscriptions on the one my friend received. Looks like it was a refurbished product sent to me. It is appalling to see such bad quality control on Motorola's part and Flipkart / WS Retail on not pursuing better standards. Have called Flipkart Customer Care and they have promised call back in 48 hours, let's see. Update : Received replacement today. This one has issue with antenna and is not able to connect to network. Tried different SIM cards as well. I am more and more convinced that they are pushing products without quality checks or are selling refurbished products to meet the demands. This is really disappointing. So far Flipkart's service has been good, though not sure if they are taking due care in making sure that the faulty product or batch of products is identified and notified to Motorola, or they are simply recirculating the returned products.",
            "date": "22 Nov 2014",
            "name": "Amanjyot Singh",
            "stars": "1 star"
        },
        {
            "comment": "This product is very bad. I will suggest you all not to buy this product from this site. They are delivering damaged product because of their small mistake, your product will be fully damaged. I bought this product in last 15 days, they deliverd me this product with small crack on display. Today my product was just slightly get hit by wall, so from that damaged side it got fully cracked. I called to their customer care but they are saying that it will not returnable.",
            "date": "22 Nov 2014",
            "name": "Sudhir Patnaik",
            "stars": "1 star"
        },
        {
            "comment": "mobile look is awesome as compared to other. actually now a days samsung is a very common phone i wanted to purchase other and then i saw moto g 2 in good prize moto people has given bery good facilities to us camera is very good ,video quality is very good and also look is awesome .sound is also good in earphone also. so overall its a very good mobile in a managale range.",
            "date": "22 Nov 2014",
            "name": "Rohit Bandil",
            "stars": "4 stars"
        },
        {
            "comment": "When compared to other android phones in market,it's performance is awesome. Camera is too good. Just gets affected a bit during night photography,just a bit. No doubt about screen. Moreover for the gamer kinda people this is a right choice at this budget. Doesn't lag a bit while playing games and special thanks to it's 16 gb internal memory. I play Asphalt 8 Airborne(1.56 gb), Batman Arkham Origins(1.1 GB),Injustice: Gods amongst Us(2 GB) simanltaneously. Also other factors are good especially it's sound. Again thanks to it's front dual speakers...!!!",
            "date": "22 Nov 2014",
            "name": "Gaurav Gilalkar",
            "stars": "4 stars"
        },
        {
            "comment": "The most 3rd class product i have purchased. Product lost its touch in 45 days. called up motorola and flipkart. Both refused a return back on product as it had crossed 30 days timer. VERY SORRY STATE OF MOTOROLA SERVICE CENTRE. COLLEGE GOING KIDS DO THE REPAIR OF PHONES,, Called up flipkart and motorola multiple times for escalation a. ALL HAVE BECOME THICK SKINNED. PHONE IS WITH SERVOCE CENTRE FOR LAST 20DAYS . nOT SURE WILL GET IT BACK ........ Disappointed to the hilt ... Informed all contacts to never try motorola in life . Have lost faith in flipkart.. Shifting to amazon is better",
            "date": "22 Nov 2014",
            "name": "Greg Dmello",
            "stars": "1 star"
        },
        {
            "comment": "Well I was using Lumia 820 (Windows Phone ) Since Jan 2013. I recently switched to Android through Moto G 2nd generation. To be honest my experience has not been bad but it is not great either. Andorid has apps that are missing in windows phone. In terms of Hardware or the OS performance I still feel that Nokia & Windows OS are the Best. Talking about MOTO G 2nd Gen. 1) Camera : 8 MP camera does a decent job. It is ofcourse not the best. But good for the price you pay 2) Processor: Well to be honest the 1.5 Ghz Snapdragon processor in Lumia 820 is far better than the Quadcore processor on this device. 3) RAM : you get just about 831 MB /1024 MB. 4) Phone does experience some lag occasionally. 5) You get a lot of accessories to choose for this phone. For prospective buyers I would suggest you go for this phone if performance ec is not that Important. My suggestion : Go for a good Windows Phone(1GB is more than enough) or a good Android device with atleasst 2GB RAM",
            "date": "22 Nov 2014",
            "name": "PRABHAVA",
            "stars": "4 stars"
        },
        {
            "comment": "The model is faulty. The side buttons for volume and lock are pushed in and it takes extra effort to push these buttons. I spent 13000 for this phone and it turned out to be like this. Not cool!!! please change the model asap.",
            "date": "22 Nov 2014",
            "name": "Puneet Shukla",
            "stars": "1 star"
        },
        {
            "comment": "Has received on 2nd day from when I ordered delivery by flipkart is ok ... every thing is fine from day one as i started using MotoG2 , The only backlog I observed is battery isn't reached my exception level but it is OK what i experienced with my old iPhone 4s",
            "date": "22 Nov 2014",
            "name": "chaitanya",
            "stars": "4 stars"
        },
        {
            "comment": "This is an amazing phone i was confused as i was buying my first android i was not very impressed with the first moto g but as soon as the 2nd gen came out i fell in love with it totally amazing for gaming easy to carry ....amazing camera overall a fantastic android phone for the price its coming just AWESUM ......just one samll drawback if the battery would have been more powerfull.",
            "date": "22 Nov 2014",
            "name": "Sidd Sengupta",
            "stars": "5 stars"
        },
        {
            "comment": "I bought new Moto G 2nd Gen 2-3 weeks ago. Unfortunately I got the defected piece. It was hanging very badly. I contacted initially support team of Moto G, but they were not able to fix the issue and suggest me to replace the product. After that I raised a Replacement Request. They've replaced it ,but given me used product which was in extremely bad condition there were so many scratches on the screen (screen guard) , phones looks so old and the back side was smelling like something burn inside, may be chips (due to heating issue). I've contacted them regarding this issue, they said to replace it again. I hope they'll not provide the used one. @Flipkart : Guys !!! I'm really disappointed wit you. From now, I'll not prefer buying product from FLIPKART.",
            "date": "21 Nov 2014",
            "name": "ADITYA MISHRA",
            "stars": "1 star"
        },
        {
            "comment": "I am using this Phone from last 2 months..the gadget is simply great for Gaming ..Asphalt 8 Airbone experiance is awesome ..very good graphics..some lags after heating..but that can be ignored.. Camera is not so good bad but not so good as well...does focus properly sometimes..but it's flash light is very effective and bright..good photographs in dark as well.. Processor is simply great..very smooth for operating... but i personally facing the issue with its speaker..it's a loud enough but the voice clarity is so poor...even it gets heated for longer time calls ..sometimes you can not even hold phone near to your ears for longer calls.. you may need to use your headphones which are not so good..disappointment from motorola ... But the best part is google updates they are so fast on this gadget.. As a Google supported stock android OS (4.4.4..will soon get the Lollipop update too..) their are some drawbacks like calls recording and FM recording is not available..no restart button available...and the UI is sooooo very boring...but you can use launchers availables in market...motorola should have done some modifications in OS... But overall a very good phone from Motorola.... And most important part about Flipkart..a very good service guys ..purchased two Moto G 2nd generation so far..once replaced ..but now everything is fine... If you are looking for good brand and budget phone go for it...",
            "date": "21 Nov 2014",
            "name": "Pramod Ardak",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it few days back but the battery is draining very fast. I don't know the problem is with my handset or the phone is like this. Phone is very good execpt the battery. I have raised a replacement request let's c.",
            "date": "21 Nov 2014",
            "name": "Ankit Dimri",
            "stars": "2 stars"
        },
        {
            "comment": "worth mobile for under the budget of 13K. thanks to flipkart.com. the good feature about this product is its Camera. really good front camera and the clarity is also good. can afford to buy this product.",
            "date": "21 Nov 2014",
            "name": "Maheshwar Gowl...",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased a Motorola Handsets/U96158 (Order OD301319394562460800 Tax Invoice no blr_wfld20141100856220) and received today 21/11/2014. But this product is faulty (Nobody can hear my voice when I call them, I cannot hear voice either).",
            "date": "21 Nov 2014",
            "name": "Chandan Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "The Charger gets heated up quickly..alos it takes lot of time get charged. Please tell how to replace my charger for moto g 2..",
            "date": "21 Nov 2014",
            "name": "Ajay Gaikwad",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this product on 20th of Oct and delivered on 28th Oct. I am not satisfied with the delivery. Previously I had a very good impression of flipkart. After buying this Phone I am frustrated with Flipkart. About phone MOTO G 2nd Gen.. I got a defected product from Flipkart. Memory card not detecting, Getting Heated, Hanging Problem Too much, Battery backup is not at all good. I have given 10 complaints but customer care executive are raising requests technical team is saying we can not replace on your address. While new purchase you are able to deliver now when need replacement you simply denied replacement and no reverse pickup? for refund also I have to dispatch the phone. I have given this phone as a b'day gift to my fiance. Now I have to ask her to courier this phone to flipkart. this is really a insult for me. I cannot trust flipkart now.",
            "date": "21 Nov 2014",
            "name": "Saurabh",
            "stars": "1 star"
        },
        {
            "comment": "Hi friends, i ordered moto g2 on 21st , got it on 27th . delighted to see such a good phone. tested it SPEAKERS , they were defective, got it replaced in a week. 2nd phone tested again SPEAKERS were defective approved by Motorola service center.'complained to both Motorola & Flipkart. Got an another replacement..... this time got an repaired phone with screwdriver scratches . At last refunded the amount. i think flipkart services are good as they gave me 2 replacements, but motorola pathetic . NOW SOMETHING ABOUT PHONE... screen size is 4.7 as navigation options doesn't goes off when u open any application. speakers horrible experience, but still not clear but loud... or try to change equalizer settings. camera is good.. ram is enough but cant play even games smoothly like deer hunter( 50mb). overall a very good phone at this price point , no competitor as such of now. BUT ONLY IF U CAN A GET BRAND NEW PHONE FROM FLIPKART NOT A REPAIRED ONE.... 3 stars for phone and somewhat service from flipkart.",
            "date": "21 Nov 2014",
            "name": "Vishal Sinha",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is good in all terms i.e display, camera, experience, touch and feel. Only thing is that battery charges very slowly and discharges fast.",
            "date": "21 Nov 2014",
            "name": "Raghav Rastogi",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered as a gift. Delivery same day. Phone is excellent. Dual SIM. Supports everything that a high end phone offers. Battery reasonable. Not much negatives. No heating and auto cut off after full recharge. Good wifi and network reception. Excellent touch. Camera very reasonable. Not much negatives.. Most of the accessories are available only online. May be I didn't like the way, contacts are displayed. That's all. I recommend.....",
            "date": "21 Nov 2014",
            "name": "Jithesh PV",
            "stars": "5 stars"
        },
        {
            "comment": "An optimum choice for the price range range. It stuns you with the looks and has amazing UI. A worthy purchase.",
            "date": "21 Nov 2014",
            "name": "Naveen",
            "stars": "4 stars"
        },
        {
            "comment": "fully satisfied with specifications and performance today i got my phone looking great and flipkart service is good",
            "date": "21 Nov 2014",
            "name": "RAVINDRA REDDY",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone, and Everything i checked in...I found everything fine and working in excellent condition.",
            "date": "21 Nov 2014",
            "name": "Pushpendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Disappointing S/W (Android 4.4.4) : Apps crash left right and center, sluggish OS (been using a 64GB memory card though)! Firmware sucks too (the Mic becomes dysfunctional once in a while) And now, I am noticing that the battery lasts exactly half a day!! (within 2 months of usage) on a single 2G SIM, Absolutely Disappointed by this product !",
            "date": "21 Nov 2014",
            "name": "subhasis",
            "stars": "2 stars"
        },
        {
            "comment": "they are given a used mobile i order a new moto g2 mobile. in my mobile mx player and whatsapp were already intalled. after that i found that is a used mobile. So flipkart is very bad in their service. actually this prioduct is exclusive only in flipkart so only i decide to purchase this mobile from flipkart i very disappointed....",
            "date": "21 Nov 2014",
            "name": "sheikh nadeem...",
            "stars": "1 star"
        },
        {
            "comment": "Its the best option for mobile under 15K and undoubtedly its value for money. Specs are cool and many reviews suggest this as best option!!",
            "date": "21 Nov 2014",
            "name": "Dillibabu Raje...",
            "stars": "5 stars"
        },
        {
            "comment": "Easily get 3+ hours of Screen on time, no lags , but ram should have been 1.5gb . Wont dissapoint you",
            "date": "21 Nov 2014",
            "name": "RISHI",
            "stars": "4 stars"
        },
        {
            "comment": "I got defected product(Sim1 slot issue) of Moto G(Gen2) and I requested to replace the item within an our after receiving the mobile .Flipkart responded and agreed to replace this item next day They processed and made for pick and replacement for the same address on the very next day .The funniest part is it came through eKart logistics . When I tracking it, the status is changing that unsuccessful deliver attempt without even communicating me and also cancelled this product. How can this happen without contacting the customer ??? They change the shipment status without pick up and delivery attempt I wrote two emails to flipkart expressing my concern over this issue and told that I paid for guaranteed one day delivery I need good service This is worst delivery service I faced .Still the problem is not resolved .Waiting for my product",
            "date": "21 Nov 2014",
            "name": "Shankar Pattipaka",
            "stars": "1 star"
        },
        {
            "comment": "Moto g 2nd gen is a good buy actually......Flipkart delivery was good....a couple of days before the promised date....so 4 stars for that. (15-11-2014 order date) (22-11-2014 expected delivery date) (20-11-2014 actual delivery date.) was using sony wt19i previously....so as far as user experience is concerned m having a fun time using it. Its an awesome upgrade for me so far.......as far as the review, i have been using it for not more than a day or so....so this is not a review actually, just my initial impressions. A good budget buy, with premium looks and feel....and a great performer, keeping in mind the price tag. was confused with a couple of other models too.....asus zenfone 5 and huawei honor 6....but was impressed with moto g....and its worth a buy actually....atleast for me ;-) ....in all its a good product under 15k... To all confused minds out there, its a really good phone and doesnt feels a budget one at all. All individuals have different Priorities.....finally its upto you....in all its a great all-rounder.....and yes about the battery its okok, 8-10 hrs with normal usage.....as its been a day or so using this mobile....will list out about battery backup and few other things later.....",
            "date": "21 Nov 2014",
            "name": "Ashish",
            "stars": "4 stars"
        },
        {
            "comment": "moto g has soo good designing,slim,nice touch and all the features are so nice amazing one .must buy who has budget near about 15000",
            "date": "21 Nov 2014",
            "name": "naresh kumar",
            "stars": "5 stars"
        },
        {
            "comment": "After just weeks of usage, the device suddenly behaves wierd. It began with heating up, freezing and now it has just gone off! On contacting flipkart, they said they arent responsible and to take to contact center. I still now have to see the response from the service center. Advice: Avoid buying expensive items from here.",
            "date": "21 Nov 2014",
            "name": "Jinu Vijay",
            "stars": "1 star"
        },
        {
            "comment": "mene ek moto g 2nd generation ka order dia tha bo mujhe call kanke badle item return kardiya, flip cart moto G ko chod dijiye",
            "date": "21 Nov 2014",
            "name": "Alok",
            "stars": "1 star"
        },
        {
            "comment": "I ordered the Phone on September 11, 2014 and got it delivered perfectly before time by September 14, 2014. Surprisingly, this was my first ever purchase from Flipkart. I am writing a review about this Product after using it for more than two months now. Talking about some of it's key features: a. 1 GB RAM: Works great but may lag a little while too multitasking if you have loaded your phone with too many apps. b. Dual Sim (GSM + GSM): I'm using it for two Sim Cards and is working brilliantly for me. c. 1.2 Ghz Qualcomm Quad Core Processor: Well, yes. It is pretty fast. Quad Core Processor helps. d. 5-inch HD Screen: The screen is brilliant. Big and sharp display. e. Expandable Upto 32GB: This is like a treat. You have Internal Memory of 16 GB which you can utilize for all the apps that you want and still have ample free space to fit at least 2 seasons of FRIENDS in it to watch during your commute. And I am using a 32 GB Memory Card along with it, which gives a brilliant memory space for everything that you need in your phone. f. Android v4.4.4 (KitKat) OS: Well, if you are thinking of buying this cell. then do it. Because the exclusive surprises that Moto may give you in the upcoming months won't be even funny. Lollipop Update coming soon before anyone else except Nexus 5. g. 8 MP Primary Camera and 2 MP Secondary Camera: No issues and no complaints at all. Clean, clear and sharp images. Battery: Yes, if your cell shuts down due to low battery, it will take some time to boot again. Because it needs to get charged to a minimum voltage before it can start. That can be pretty irritating during urgency. The cell takes a bit of time to get fully charged but it's all good. Trust me, no other phone in the 15K category beats this phone & the only phones in the market which you will feel inferior to are Moto X (1st Gen), Moto X (2nd Gen) and Nexus 5 and now the obviously upcoming Nexus 6. But before you move on, a look at the prices of these phones: Moto X (1st Gen): 18,000 (Expensive by 5K) Moto X (2nd Gen): 31,000 (around 18,000 may be) Nexus 5: 24,500 (11,500) Nexus 6: 44,000 (not in the same league) So yeah, go ahead and buy it. You won't be disappointed. It will be a great time with it.",
            "date": "21 Nov 2014",
            "name": "Vivek Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Although there are other phones with competitive prices, moto G is reliable and seems to be working just fine without any issues.",
            "date": "21 Nov 2014",
            "name": "Shashank S",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent features. but there is only one with is mobile that is battery drains quickly. They should think of it.",
            "date": "21 Nov 2014",
            "name": "Balakrishna Jannu",
            "stars": "4 stars"
        },
        {
            "comment": "I bought two of these phones. The first phone I bought over a month ago and it is giving me trouble. THE TOUCH SCREEN IS NON RESPONSIVE. I might have to the service center. I absolutely positively hate doing that to a new phone!!!! I hope no more nasty suprises are waiting at the service or with my second phone........",
            "date": "21 Nov 2014",
            "name": "Naveen Sastry",
            "stars": "2 stars"
        },
        {
            "comment": "Was very happy when I got this phone in starting, but as the days went by it started showing its true color, that's the worst shopping experience I've faced so far. Now I noticed a lot of bugs in this phone, doesn't have even average, speaker make a cracked voice while playing the music or a call at high volume. Having problems with 3G network, it keeps losing signals by every 2 mins while its working fine with other Moto 2g phones. Battery drains too fast even after following the steps provided by flipkart techs. Now I am very much disappointed with Flipkart's customer service, I request for replacement twice but they rejected it saying that all things is okay and this phone is naturaly in this way.. Now I need to file a case in consumer court very soon if you guys won't take any proper action.",
            "date": "21 Nov 2014",
            "name": "Anil",
            "stars": "1 star"
        },
        {
            "comment": "totally satisfied...nothing else to say, just buy if looking phones under Rs. 20,000.. Screen size, storage, processor, camera all problems solved.",
            "date": "21 Nov 2014",
            "name": "piyush",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered the Moto G 2 nd edition on Monday 17 Nov 2014 and got on 19 Nov 2014 2 o clock , before delivery time, But after making two of my sim in to micro sim , I charged the cell whole night till 10 o clock morning 20 Nov 2014 , then with full charge i left to office at 10 o clock, In whole day i spoke 11 min once , then 14 min once then 7 min once= total 32 min of talk over the phone, with dual sim ON, 3 whats app message sent, thats it and my internet was on 2g whole day. When i reached home at 10 o clock night the battery was 8% left from 100 % morning. Earlier i used to speak 3 to 3.5 hours over my Nokia 5233 but still battery will be 2 stick left, This Moto G battery is up to the mark as per my wish, But i heard that automatic restart issue in other comments , That situation , and heating issue i have not faced till now.",
            "date": "20 Nov 2014",
            "name": "Pravu Lal Kabi",
            "stars": "5 stars"
        },
        {
            "comment": "very quick delivery 2 days back i ordered this mobile, today i get this mobile with nice packing... awesome mobile with exceptional price",
            "date": "20 Nov 2014",
            "name": "mrs.mahesh",
            "stars": "4 stars"
        },
        {
            "comment": "First of all Thanks to Flipkart... I have no words to say about flipkart services. its just awesome and very fast. Thank you flipkart.... Phone's Advantages 1) Nice Display 2) Sound system is also very good 3) Battery life is 2-3 days without internet and with internet 1 day (with full use) Phone's Disadvantages 1) Some time it will slow 2) Touch is also not so good but its better than other lower device range Otherwise it awesome... Menu icon view and other things are same as Nexus 5 Thanks to Flipkart and Motorola",
            "date": "20 Nov 2014",
            "name": "Hardik Hirpara",
            "stars": "5 stars"
        },
        {
            "comment": "delivery is perfect screen quality is perfect but back cover of phone is open every time..it is not fitted perfectly so you need a synthetic cover ..",
            "date": "20 Nov 2014",
            "name": "Dinesh Xmen",
            "stars": "3 stars"
        },
        {
            "comment": "hlo frnds i was earlier having moto g 1st gen i was happy with that too i am happy with this 2nd gen device also sleek design marvalous looks screen quality very excellent the thing that i did not liked in this phone is that it is having google launcher as default launcher :)",
            "date": "20 Nov 2014",
            "name": "Amit Veer",
            "stars": "4 stars"
        },
        {
            "comment": "except for battery everything is excellent.. drains withing 6 hours if used for gaming and browsing.. atleast 3000maph battery is required to power it display and processing..",
            "date": "20 Nov 2014",
            "name": "killer",
            "stars": "4 stars"
        },
        {
            "comment": "Overall phone is Good just 1 problem Battery Draining so fast. Best service from Flipkart who delivered 2 days before the estimated date.",
            "date": "20 Nov 2014",
            "name": "Shubham Rathod",
            "stars": "4 stars"
        },
        {
            "comment": "Really a nice smart phone for this price.. camera is good music is not fair speed good nice operating system KITKAT Appearance good",
            "date": "20 Nov 2014",
            "name": "Shalin",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Phone. Having good features. The only slight disappointment is on battery performance. Otherwise I am satisfied.",
            "date": "20 Nov 2014",
            "name": "Om Pandey",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is very good in terms of features and design. Battery lasts enough on wi-fi and 3G. Didn't found much battery drain difference in 3G and 2G usage. Good Camera quality. Only one thing moto can upgrade is 2 GB RAM because so many manufacturers are giving 2 GB Ram and i think it will helpful in future software updates. With current software and minimum number of useful apps i found only 250MB free out of 1GB(890MB) thats not good.",
            "date": "20 Nov 2014",
            "name": "Jadeja Chandra...",
            "stars": "5 stars"
        },
        {
            "comment": "THE PRODUCT IS GETTING HEATED OFTEN, IS THIS COMMON IN ALL MOTO G PRODUCTS WHICH IS BOUGHT THROUGH FLIPKART, CAN YOU SUGGEST ME A SOLUTION FOR THIS, CAN I GET REPLACEMENT IF IT IS HAPPENING OFTEN",
            "date": "20 Nov 2014",
            "name": "JERRY",
            "stars": "3 stars"
        },
        {
            "comment": "I live in I placed my order on tuesday evening. Got my product on Thursday morning! What a quick Delivery!! And about moto g... its amazing... for its price range! Just go for it! Thumbs up!! (y)",
            "date": "20 Nov 2014",
            "name": "Devika Nair",
            "stars": "4 stars"
        },
        {
            "comment": "m using this phone for about 1 month and its really gr8 battery lasts for a day, fast interface, superb quality...just go for it :D",
            "date": "20 Nov 2014",
            "name": "Kunal Kandalgaonkar",
            "stars": "5 stars"
        },
        {
            "comment": "Most mobile phones show super accelerated depreciation. My Samsung Note barely lasted 2 years. I'm glad I switched to Moto G2. It's perfect for my use and at third the price.",
            "date": "20 Nov 2014",
            "name": "Prashant",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is totally awesome..! BUT When you order it, please mention that your shipment is NOT through \"Delhivery\" . The courier service is worst. even i have to go 2 km from my door place to receive my product. PLEASE PLEASE PLEASE...!!! Be far away from delhivery courier service.",
            "date": "20 Nov 2014",
            "name": "Daxesh Prajapati",
            "stars": "5 stars"
        },
        {
            "comment": "IT IS ELEGANT with all the required features. Out of 10 of my colleagues 3 have opted this MOTO G and they only recommended. Now I am the forth person in our office to own this set. Murthy",
            "date": "20 Nov 2014",
            "name": "P S N MURTHY",
            "stars": "5 stars"
        },
        {
            "comment": "Got at the best price and at a faster delivery. Reccomend full n to buy this on Flipkart. Strongly reccomend to buy only on Flipkart",
            "date": "20 Nov 2014",
            "name": "Vinayaka HM",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought this phone on 10th Nov 2014. Very strange it does not allow us to delete the saved contacts it says it is read only file and we can hide the contacts, on 17th Nov suddenly I found my half of contacts are missing, call log sheet is empty and majorly all whatapp nos too are missing, then it is not allowing us to call from the contact list it shows only whatsapp icon and we can't call anybody unless we physically punched the nos.Finally Flipkart is taking back this faulty piece and replacing with new one whereas I wanted cash so that I can buy any other phone than this but their policy is to replace it and they can't refund the cash. There is no good after sales support. I had a very bad experiance with this phone.",
            "date": "20 Nov 2014",
            "name": "Ismail S Khand...",
            "stars": "1 star"
        },
        {
            "comment": "The product is very good at this price range. As usual the service from flipkart is awesome. Nothing negative except little heat when we take video,photos continuously. But Airtel 3G offer is bogus as they gave the service for 1 month and disconnected instead of 2 months. Called up customer care and poor response. not holding their promises. I dont know whether flipkart will take action against them or not.",
            "date": "20 Nov 2014",
            "name": "Srinivasan Raja",
            "stars": "5 stars"
        },
        {
            "comment": "Phone applications wise good and for back panel it is delicate, charging backup is poor, for using applications it is good",
            "date": "20 Nov 2014",
            "name": "Gowtham Adabala",
            "stars": "2 stars"
        },
        {
            "comment": "Excellent phone. Being a bit conservative, I was looking for either a Samsung or a Nokia. But the quality and specifications of this Moto G are much better than the specs of Samsung of Nokia phones available in this price bracket. Camera quality is especially awesome.",
            "date": "20 Nov 2014",
            "name": "Shilpa Pal",
            "stars": "5 stars"
        },
        {
            "comment": "Please read full review if u seriously wanna purchase a good and reliable mobile I purchased this phone on 09/11/2014.................and review today after 12 days.....because i never review a product to early.......first explore all its features...pros and cons...................so here is my review....................first of all would like to appreciate Flipkart fast delivery.......just in 3 days i got this mobile in my hand...................Now come to the product........................yeah i can say this after using this mobile u can definitely feel that your money ...........the money u spent for it ...........is worth nothing in front of its features................(pardon for my grammatical mistakes if any).............................first of all camera.........8 MP camera with a unique feature that most of the mobile don't have in this range is.................clear picture quality..........since i m also a electronics engineer so i know what is the reason behind this.................very correct timing of LED flash.........which makes pics simply awesome.....................whether u take pic in day light or in night..........................u get premium quality pics..............................I tried click pics in a dark room....................completely dark room....................after click when i check.......................i m stunned............no one can say this is a pic by camera in ...its look like ......................pic clicked in proper fluorescent light.............no blurriness in pic nothing.........very good pic....................and as pic......same review for video recording......................even in dark room u get perfect video.......................with no blurriness......................i m socked after watching these features....................phone itself have a feature called slow motion video.......................i click one video of ...............running Fan in my room.............what i say is .........fan running very much slow in video.........................but actually it was in full seed..........so it means u can click fast movements videos..like dance videos etc....... with great satisfactions using this feature...........now come to the Games..........i tested many games in it..............not these sub bay surfer temple run etc..............but even i tested big games too.............NFS most wanted..........1.89 GB installation in mobile...................yeah its run smoothly i finished half game yet.................no glitches in game.........during play..............also mobile will not heat by continues 4 hour game play...................come to video and song play.....................yeah ..........1920x1080 Full HD video played smoothly on this phone.......................video will not pause for a single second.....awesome quality...........also awesome sound quality..........very loud and clear sound...........screen is corning gorilla glass...................u can say .............best touch ever enjoyed...........no need for screen guard........................now come to bad feature of mobile................................first thing........battery charging is slow......too slow.it took 5-6 hour for continues charge.....................although..............battery drains in more then 24 hours which is acceptable.............secondly head phone....although very good in sound quality ..awesome clarity .......but not as good in design.................always slipped from ears.......................this is the problem..............third thing is there is no data cable with box u have to purchase it from market....although any data cable is compatible...............",
            "date": "20 Nov 2014",
            "name": "Mukul Bhargava",
            "stars": "5 stars"
        },
        {
            "comment": "i used before several mobile like MOTO g1, Xiaomi redmi 1s, but this one gives feature same like MOTO 1st gen, Good mid range mobile with good built quality.",
            "date": "20 Nov 2014",
            "name": "Mageshwaran",
            "stars": "4 stars"
        },
        {
            "comment": "OK Giving Review after using more than 15 days First of all its the best cell phone in this range. PROS: 1) looks very stylish & lightweight 2) Latest android and 16 Gb internal storage makes it faster! No lag in any kind of applictaion or games! 3) 3G or 2g both runs fast Cons: well not really for me but a bit of battery issue for those who are very gammy or social media buffer! highly recommended thanks for FLIPCART :)!",
            "date": "20 Nov 2014",
            "name": "AJAY KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "You all must be aware of hardware / sodtware specs and fastness, smothness. 1. As for me dual sim matters. Simply best, auto switching between 3g/2g. Not need for manual switching like other phone like I do for micromax. 2. Has 16GB under hood. But 32GB more to add ext memory. Blessings. 3. 5' inch HD screen good enough with gorilla 3. What more you want. 4. Processor, RAM and battery decent enough to perform best with current KitKat 4.4.4 soon Android 5.0 5. Build in battery enough for a day. 6. Good Camera Clarity day as well as night. -tive points 1. No data cable in box. Can use any old one. 2. Earphone old style drum type. No in-ear pods. 3. Ext memory should be atleast 64GB. 4. Battery only 2070 mAH.",
            "date": "20 Nov 2014",
            "name": "Anup Argade",
            "stars": "5 stars"
        },
        {
            "comment": "First of all blazing fast delivery by Flipkart. Ordered on Sunday and delivered by tuesday. The phone works amazingly well and for the price has very decent specifications. The 1 GB Ram and Snapdragon processor pack a punch and with Multiple apps in operation, switching between them is very smooth. The display is also very good and Sunlight legibility is also quite decent. The stock Android 4.4 does away with all the useless stuff and Transferring my DATA from my previous Android using the Moto Migrate App was a breeze. Camera is also quite good and Pictures taken are quite clear and vivid. Call quality is also nice and the Battery lasted more than a day with Dual SIM usage and 3G network use with moderate use. Only Con I found till now was the metallic bars at the top nd bottom of the phone. They are a tad uncomfortable when u happen to take a call in a busy street and stick ur phone into ur ears. But on the whole thats a very minor discomfort and Motorola has lived up to its name. Don't think too much if u r on a budget. Go and order.",
            "date": "20 Nov 2014",
            "name": "Karn Shukla",
            "stars": "4 stars"
        },
        {
            "comment": "Just go for Moto G2 its awesome phone...Looks stunning... picture quality good, camera best in class... what more u looking for ....",
            "date": "20 Nov 2014",
            "name": "Bhaveshchandra...",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile. delivery was so fast. No defect till date. I was confused btwn sony n moto but when i compared the features of both product. i thought that i should go for moto bcz many features n in dis price.",
            "date": "20 Nov 2014",
            "name": "Binita Rathod",
            "stars": "5 stars"
        },
        {
            "comment": "perfect mobile in budjet I needed white colour mobile but will manage with black colur just issue with battery while playing mobile gets little heated",
            "date": "20 Nov 2014",
            "name": "ritesh likhdhari",
            "stars": "5 stars"
        },
        {
            "comment": "On time delivery by flipkart.. AND about Moto g 2nd Gen .. I am using it from past one week and its an amazing Smartphone camera quality Voice quality and the design is awesome.. Will surely recommend to anyone to buy.. its Worth !!",
            "date": "20 Nov 2014",
            "name": "Raje",
            "stars": "4 stars"
        },
        {
            "comment": "pro's-1>good sound quality 2>good primary camera 3> good phone in this price range. con's- 1>front camera lagging 2> not providing data cable",
            "date": "20 Nov 2014",
            "name": "Sanjay Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this product a month ago. Till then I using and I like the product too much. Its performance is very impressive. Though its overall performance is good but it has some cons. Pros: 1) The design is awesome that fits your hand easily. 2) Screen is bright 3) Camera quality is good but not as much good to compare with samsung 5MP camera quality. 4) Sound quality is awesome 5) Performance is awesome, all application run smoothly, even HD movie runs without stopping. Maximum game runs smoothly. 6) Call quality is good with noise cancellation. 7) Touch quality is nice. Cons: 1) Battery backup is not so as I aspect, but all android phone eats more battery , so compared to other battery backup is normal. 2) Time require for charging is more. 3) Less option for camera and music modes. 4) This product comes with no external usb cable , you have to buy separately. But with all the Pros and cons the product is awesome.I think Motorolla and Google makes the product so amazing. Thanks for the Motorolla+Google product and also thanks flipkart for the service. Thanks for reading........",
            "date": "20 Nov 2014",
            "name": "Jyotiranjan Ka...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G Second Gen was my first budget Android phone. For past 4-5 years, I have been primarily using flagship phones only from Samsung or HTC most of the time. I am really fed up with their never changing and ever heavier getting custom UI solutions which get in the way of updates as well. But when I tested one of my colleague's Moto G, Wow! A budget phone with this good feel in hand and extremely fast performance, it was almost unbelievable. This phone proves that the specifications hype is not worthy of all the price we pay for these Octa Core phones. Sure you get Octa Core processor and 2 GB RAM, but most of it is used for supporting manufacturer's own bloatware and custom UIs. Not the case with Moto G. The specs on paper are mid range at best, but due to the optimized KITKAT OS, the performance is on par with any high end phone. 1080p Video playback is flawless and most of the high end 3D games run just fine. The battery is also something that made me skeptical at first, but again, the number game is at play here as well. The 2000 odd mAH battery seems small when compared to any other high end phone, but the battery backup for me with moderate to heavy usage is 5 hours of screen on time and full 24 hours of total runtime on a single charge. On heavy usage, it reduces to about 18 hours total and 3.8-4 hours of screen on time. This is on 3G only, with Wifi only in the evening and morning times before and after office, about 1 hour of calling, 1.5-2 hours of music, half an hour of video, whatsapp and facebook at regular breaks etc. The only Con I can think of is the flimsy back cover, opening it is hard at least on a new phone and it bends as well. Plus, the power on off button is a little too much used and might get wear and tear in long run. Overall, its a great phone for a great price, for those who are looking for a Nexus like experience. I would say go for it! :) As usual, Flipkart's service was great, delivery was on time as promised. One suggestion I would like to give is to enhance the tracking system a little to show updates in a more detailed and frequent manner. After purchasing a product, the eagerness to get the product in our hands sometimes crosses boundaries :D",
            "date": "19 Nov 2014",
            "name": "Sumit Bhardwaj",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g 2nd generation is reasonable price for the specification and everything good. But if any repair happened means the cost of service will be half price of this mobile. Moto g service center ask more price. My moto g 2nd inside display got damaged. i gone to service center in pondicherry. they asking 7000 rs for reparing, i did not repaired tht mobile. i kept tht mobile in my home itself and brought new nokia windows phone within 6000 rs. Moto g service is very bad. they showing partiality based on country. in USA for first time damage they replace the new mobile freely but in india they did not give, so think before u buy.",
            "date": "19 Nov 2014",
            "name": "Nirmal Kumar",
            "stars": "1 star"
        },
        {
            "comment": "i m really happy to buy my 1st andriod phone, moto g 2nd gen is a value for money mobile, the camera , looks ,screen display is awsome, really happy to buy this product.... :-) the features which make it special: -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb.",
            "date": "19 Nov 2014",
            "name": "Mohd Zeya",
            "stars": "5 stars"
        },
        {
            "comment": "Mr Mukesh Jindel Please Diel *#*#4636#*#* then choose WCDMA only From Slide down menu.Then you will be able to set 3G only mode.",
            "date": "19 Nov 2014",
            "name": "Vaibhav",
            "stars": "5 stars"
        },
        {
            "comment": "Easy to use interface. Good battery life after long talk hours. In terms of gaming not the best phone but will do for small time gamers. Good fill in hand. camera is good enough. however flash light is not that good. battery can not be removed from phone. little bit issue while handling multiple phone calls at a time.",
            "date": "19 Nov 2014",
            "name": "Ameya Soman",
            "stars": "4 stars"
        },
        {
            "comment": "i received this moto g 2 two days ago and after operating it giving this revue ,i must say it is a best phone that i ever seen ,camera quality is good,call voice is more and clear ,front speakers voice is very nice with bass and trouble ,in head phone its ok but not good as samsung ,if we charge battary at night go up to 12 hrs on next day ,internet speed also good on card who have better range..............overall i like the phone",
            "date": "19 Nov 2014",
            "name": "shivaji jogdand",
            "stars": "5 stars"
        },
        {
            "comment": "Within the first few days the battery got drained too fast and complaint was made; Flipkart said use it for a while and see over the phone but mailed back to say that \"the issue was settled\". Today the unit just refused to come alive !! Have made a return request !! Will update on Flipkart response !",
            "date": "19 Nov 2014",
            "name": "Ramanathan",
            "stars": "1 star"
        },
        {
            "comment": "mobile takes more than 5 hours for full battery charge, network drops many times, some heat problem. And height Flipkart customer executives suggest to try another mobiles chargers. Rejected return request. First time ever got such service from Flipkart.com I suggest for new buyers don't think about this phone.",
            "date": "19 Nov 2014",
            "name": "suraj korade",
            "stars": "1 star"
        },
        {
            "comment": "hang little .......battery less,,,,,but its good.......................................................................................................................................................................................................................................",
            "date": "19 Nov 2014",
            "name": "Umesh Tompe",
            "stars": "5 stars"
        },
        {
            "comment": "Writing this review after using it for around a month now Pros Simple lag free UI (Will get OTA lolipop soon) way better than ASUS Zenfone Great voice clarity Awesome dual speakers up front Premium build with nice rubberised finish at the back Wonderful camera (front and back) Battery is good enough, depends on your usage, does get me through the day on mixed usage Cons Symmetric design makes it difficult to predict if you are holding it upside down :P Verdict Go for it, I bet you won't regret !",
            "date": "19 Nov 2014",
            "name": "Siddhes Sathe",
            "stars": "5 stars"
        },
        {
            "comment": "I really love this phone. It looks pretty beautiful. Features are very good, speed is good. But you should go for flip cover to protect this phone though flip cover is expensive. But it is mondatory. After I bought this phone my participation in social networks, interaction with frens and family accelerated. Best android phone , budget phone, almost same features as Samsung galaxy grand 2 which comes at 18k.......which 5k more than this beauty. I am using all social networks, playing games, installed many apps...working fine, but after all this it became slightly slow but really we can't notice much. Only disadvantage with this phone dual sim + internet usage your battery will die very fast ......hardly 4hrs. Also battery chargin is slow........I donno about other phones batter backup. So I am using single sim with internet ....batter backup improved. Data also I tried to optimize the usage for better battery backup. Good phone from Motorola after long time to give break to SAMSUNG monopoly.",
            "date": "19 Nov 2014",
            "name": "Praveen Vemula",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered Moto G on 2nd Nov. 2014 and received it on 15th Nov 2014. So clearly thumbs down to the delivery. I could have got it at least 3-4 days earlier. As far as the phone is concerned I am satisfied with its performance. I have made a list of pros and cons after the initial usage. Pros 1. Brilliant Display: Really liked the display. It is easily readable in bright sunlight. 2. Early updates: Curiously waiting for lollipop update. 3. Build Quality: The phone is very sturdy and feels premium to hold. Sound: Sound quality of speakers is very good if not excellent. 4. Camera: I have used Moto G(2013) and I can say that the camera has improved. The images turned out sharp and the colour accuracy was also spot on. Cons: 1. Battery: 2070 mAh battery is just not enough for a hd display, no matter how good battery saver app you've installed or no matter how efficiently the o/s manages it. A little bit of gaming and HD videos decrease a considerable percentage of the battery's charge. So you need have a power bank all the time. 2. RAM: It has 1GB of RAM which is somewhat on a lower side. You won't notice that in normal usage scenario but if you have installed lot of apps, while playing games you'll notice drop in frame rate. But that's only when you play heavy game(meant for snapdragon 400 processor). You won't notice a thing while playing casual games. Earphones: I my opinion if you're spending 13k on a phone you should get something good. Earphones provided are just mediocre. Very low on volume and no bass at all. Charger: The wall charger provided is just 550mA which takes ages to charge the phone. You can buy a 2A charger. Conclusion One can overlook all the cons for its vanilla o/s which results in slick performance. But the only deal breaker is the battery which is a serious cause of concern for a person who is consistently on the go.",
            "date": "19 Nov 2014",
            "name": "Sunny H. Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G 2nd Gen phone in one word is exceptional. It has a stock android UI and will be upgraded to android lollipop. It is the best phone at such a low price. Those who wants to buy please buy it without hesitation.",
            "date": "19 Nov 2014",
            "name": "Anirudh S",
            "stars": "5 stars"
        },
        {
            "comment": "it is the worst ph i have ever seen.....they gave me a defected piece...and now they are making fool to me that the product has come to delhi ..it will be delieverd to u soon...such a foolish customer cares are !!!!! firstly, they delieverd the product in 2 days coz it was matter of rupees!!! and now they are making very late coz replacement !!!! dont buy this moto g(gandu) ph.......",
            "date": "19 Nov 2014",
            "name": "shivam soni",
            "stars": "1 star"
        },
        {
            "comment": "Hi all I just want to share my experience with this phone Flipkart (ws retail) service was as expected delivered within 3 days thanks flipkart about phone: i bought this phone only by considering the reviews n point given by the genuine buyers I am using this phone from 1 week, i installed all heavy games like Frontline Commando 2, Alphalt 8,Minion Rush,candy crush, dragon ball etc.. i played these games for so many times in a day.. and really happy there is no lagging while playing these type of heavy games.. 1.3ghz quad qore thats nice and about touch its like a makhann \"very smooth\" UI (User interface) is also attractive 16gb inbuilt thats makes more room for our storage it gives good camera quality with 8 mp front camera is also decent Moto g second generation also having good sound quality with two stereo speakers. As per my experience overall mobile is working nicely.. people who are looking for the brand ... they can go ahead with this phone.. I am completely satisfied with the phone.",
            "date": "19 Nov 2014",
            "name": "Yogesh Yadwad",
            "stars": "5 stars"
        },
        {
            "comment": "I've used this phone for 3 weeks and now I'm writing the review Pros -1.2 Ghz processor(Snapdragon 400). It is just a 1.2 one but can be compared to a average 1.6 ghz exynos/mediatek/broadcom processor.It's snapdragon folks. -1 GB RAM -Super Fast because of stock android(Samsung's touch-wiz is very slow compared to this) -Great 8MP camera. -4.4.4 kitkat upgradeable to android 5.0 lollipop (update launched in US, coming to India within a week) -5\" HD screen -Dual SIM -Memory card slot[it wasnt there in the 1st gen moto g] -16 GB internal storage -OTG support -Water and dust resistant -no lag in fifa 15, asphalt 8 and many other high end games. -Dual front facing stereo speakers with amazing sound -High capacity battery (approx. 2000mAh) -Great design(looks better in real life than flipkarts images, see other pics on net) -Smooth, mat-finish back cover -gorilla glass 3 -only phone to have both proximity and light sensor Cons -No full HD recording -0.5A charger with device but no problem since I have a 1.3A one. [to keep cost low] -USB cable not included.[to keep cost low] -Official flip-covers are too expensive. -no NFC",
            "date": "19 Nov 2014",
            "name": "Paawan Kohli",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought moto g2 before 15 days. It is good but i bm facing problem regarding 3g network. In moto g2 while choosing network mode its showing preferable mode 2g or 3g instead of 3g only like samsung and other handset. But in odisha as well as other state there is a lot of problem with 3g signal. Hence I can not receive high speed net as in my last samsung mobile becoz moto g2 cant receive 3g signal as the 2g signal strength is more than 3g. If there was \"3G ONLY\" setting available in moto g2 Than i can receive the 3g signal instead of 2g, where there is low 3g signal.",
            "date": "19 Nov 2014",
            "name": "MUKESH JINDAL",
            "stars": "1 star"
        },
        {
            "comment": "Received Moto g 2nd gen on 17th Nov with drained out charge. Got plugged in but it was not charging for 10 min at all. After 20 min, suddenly 2 % flashed out. After full charged I then kept in the box again. After few hoursI saw the charge went back to 73% from 100% without any reason. And the screen was displaying some auto reboot text. So from me, a bad rating for moto g",
            "date": "19 Nov 2014",
            "name": "Priyanka Saha",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone. Smooth running and got the latest OS from Moto. Waiting for Lollipop 5.0 soon in india.",
            "date": "19 Nov 2014",
            "name": "B manoharan",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone from flipkart and I must tell you it is a superb one. Every thing in this phone is almost perfect. Well designed well equipped. Touch, senors, camera (both rear and front ), speakers every thing. Although if it would have been a full HD screen and snapdragon 800(+) processor it would have been an unbeatable one. Still its best under 13k.",
            "date": "19 Nov 2014",
            "name": "Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is very good except for the 1GB RAM which falls short once in a while, causing reloading of apps or browser pages from recents. A true people's phone for a wide majority of people.. especially considering preferences of the Indian market. have bought 3 units on behalf of relatives/friends and all are very much satisfied with this phone (apart from 2x moto g 1st gen and 3x moto e). On a personal note, since the OS is AOSP with minimal modifications, a lot of tweaks are possible once rooted and then it becomes an awesome phone without competition with other sub 20k phones.",
            "date": "19 Nov 2014",
            "name": "Praveen Nair",
            "stars": "4 stars"
        },
        {
            "comment": "Product is very good . Battery performance is good its runs 2.5 days with out internet. with internet 1.5 days.if any one long life battery go for it . Apps works fast and touch is very good.",
            "date": "19 Nov 2014",
            "name": "panduranga Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "> Got this through in-a-day delivery guranttee and I must say I ordered it at around 6:00 pm on 10th Nov and revieved it at around 1:00 pm on 11th Nov. Packing was great. All in all have been happy with Flipkart as ever. Has been a week since I have started using Moto G. Works exactly as I had expected.I like the design of the phone and it is very easy to hold and operate. Look & Feel: > The 2 speaker strips, in my humble opinion, actually give a pretty good look to the phone...at times it did confuse me though about the the orientation of the phone as it looks same from both ends except for the front cam on top...lol ..but thats nothing to worry about. Back cover is very soft and smooth to touch and feels great in the hand. Display: > Screen colours are pretty amazing, crisp and clear. Battery: > Battery is working very well, and after a normal day usage is only coming down to around 45-50% by the evening, when I reach home and charges back up pretty quickly. Camera: > I love the camera on this phone, though takes a bit of to do for getting used to it, after that it takes great pics even whn compared to other 8MP cams such as that of Nexus 5. Zoom clarity is pretty good. > Slo Motion HD video recording is the one I like the most in this for video. > Also the Macro pics taken from this cam have pretty amazing clarity from almost 1-2 inch distance. Auto focus combined with setting your own region to focus works great. Sound & Music: > Moto have outdone themselves with this one. The software coding for sound output is extremely amazing and the Media effects included with the default player have more than 20 diffeent setting for Wired/Headphone speakers or the mobile's dual speakers separately. > Stereo quality of the mobile speakers is great. When I first got it and was listen to some stereo track I had to literaly check that where is the sound coming from because the stereo is soooo great that it felt like the music was playing from behind the mobile. > Mobile's sound output to my 2.1 Surround system is just great and pretty pretty loun, so much so that 50-60% output is more than enough. Processor and Operation/Graphics: >No lags as of now and pretty optimized ram usage. CPU management is also well balanced, keeping unrequired CPU core in sleep/standby mode so as to save batery. >Pretty decent graphics with no lag whatsoever even on graphic intensive games. Transciever and WI-Fi: > Clear sound reception and transmission with a powerful tranciever, recieving signal strength even in places where my last mobile hardly caught any signal. > Wi-Fi Hotspot is the weakest area of the phone. The range of the wifi hotspot is very less and as compared to my last phone it is not even half of it range. The only drawback I have found in this phone is this. Still it works pretty well.",
            "date": "19 Nov 2014",
            "name": "Rubik Barar",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, bought Moto G2 and hardly used for 15 days, when kept the phone in my jeans and after little bike ride i am surprised to see that top left corner of the glass is broken, on internet search i found so many complaints of broken glass. Before this i bought moto e which is very good. So please use moto g2 phone very rarely and place it in a show case and keep admiring about the phone's build quality, its worst than chinese phone. Not suitable for indian use.",
            "date": "19 Nov 2014",
            "name": "Siva Shankar",
            "stars": "1 star"
        },
        {
            "comment": "Wife was a big No-No for samsung brands. and she is quite happy now with this phone with more better features over samsung or panasonic in same budget.",
            "date": "19 Nov 2014",
            "name": "Ilyas Kazi",
            "stars": "4 stars"
        },
        {
            "comment": "Good one to use than others in this range. did not like the bars on top and bottom of phone. screen to body ratio is also more and looks a little bigger in hands.",
            "date": "19 Nov 2014",
            "name": "kishore nalam",
            "stars": "4 stars"
        },
        {
            "comment": "Nice piece with all the necessary configurations . Positives -Display -Front speakers are loud n clear -Good pic quality Negatives -Battery -Front cam not clear",
            "date": "19 Nov 2014",
            "name": "Anandhakrishna",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchase moto g 2nd generation before 45 days and it come up with hardware issue it freezes and hang while using.flipkart and motorola customer service both not co-operating for replacement of the device.i am regularly purchase product through flipkart but because of this service i will never buy any product through flipkart next time.flipkart is only focusing on selling product not on customer satisfication.",
            "date": "19 Nov 2014",
            "name": "rohit targe",
            "stars": "1 star"
        },
        {
            "comment": "Phone was decent. But pissed off with the flipkart delivery. Order the item with a In a day delivery guarantee by paying extra 90 bucks in order to present a gift to my cousin as a surprise gift. But I got in delivered on the 3rd day. So guys think twice before you order in a day or same day delivery. Flipkart may spoil ur time and ur plans.",
            "date": "19 Nov 2014",
            "name": "Suneel",
            "stars": "2 stars"
        },
        {
            "comment": "First of all 4 Stars for Flipkart. They are doing really a good job. I ordered Moto G 2nd Generation yesterday with in a day Guarantee and Flipkart Delivered the Device on the next Day Morning Impressive !!! and now about the Device, After Using the Device for a Day. It is a Bang on Device in this Price Segment. Pros : 1 - 720p HD Display - 5 Stars. 2 - 830 MB of RAM available - 4 Stars. 3 - Gaming Perormance is Really Impressive. - 4 Stars. 4 - Front Dual Speakers - 5 Stars. 5 - Camera Rear - 4 Stars Cons. 1 - Battery 2070 mah - 3 Stars. Overall It is a Must Buy Device. I will write detailed Review after Full Test of The Device.",
            "date": "19 Nov 2014",
            "name": "Ashish Dongre",
            "stars": "4 stars"
        },
        {
            "comment": "First Generation model is very nice in over all performance. but this one having many issues 1. battery life need power generator all the time with you. 2. phone getting heat. cant hold phone not more than 10 Min while browsing or gaming. and 3. too much radiation , cant keep phone near speakers",
            "date": "19 Nov 2014",
            "name": "Ponmadasamy Mu...",
            "stars": "1 star"
        },
        {
            "comment": "i got this mobile from flipkart and i am using since 3 month, its good mobile in this capacity.. till now i dint get any fault in this mobile. thanks flipkart for lunching this product,",
            "date": "19 Nov 2014",
            "name": "Chandan Singh",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone because I was sick of using my Moto E (also purchased on Flipkart). Got delivered in a day. It looks exactly like the Moto E from the back, except that it is larger. The Moto E sports a smaller grille for the front-top speaker, while the grilles are of equal size on the Moto G. The placement of the volume rocker and power/lock button are exactly the same as on the Moto E - which actually doesn't make for great design. While using the phone in the dark, it is easy to inadvertently push the power/lock button instead of the volume /-, which can be very frustrating. The battery life is only so-so. I keep my screen at lowest brightness, mobile data off and use only WiFi, but even then the battery does not last for more than 6-8 hours. However, given a phone of this screen size, I guess that's all right. Getting the back cover off is a pain, but it is somewhat easier if you start by prying the back off from the micro USB port on the phone. The phone performance is good, but still leaves me wishing it had more RAM - especially while using apps like Skype. During voice calls, switching to another app causes Skype to crash or the call to get dropped - I'm not sure if this has got something to do with the Skype app itself or the phone's memory management. Similarly, while switching between apps, I often see that some apps load all over again after a simple app-switch. I am now eagerly waiting for the Android 5.0 update.",
            "date": "19 Nov 2014",
            "name": "Rahul Ramaswamy",
            "stars": "5 stars"
        },
        {
            "comment": "This is once of the best smart phone in this price. Must recommendation for MotoG (2nd Gen) I like their Camera, Processor, screen, betry, Internal memory, Expendable memory",
            "date": "19 Nov 2014",
            "name": "Kuldeep Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart delivery Service is excellent. Packing is too good. Mobile performance is good.",
            "date": "19 Nov 2014",
            "name": "Nagaraju Pattapu",
            "stars": "5 stars"
        },
        {
            "comment": "Brought the best mobile in the flipkart.... That brings me to keep in touch with flipkart....flipkart may also want to give flipkart first free for some regular customers for their satisfaction......Thank u flipkart!!!!!!!",
            "date": "19 Nov 2014",
            "name": "Arun Pandian",
            "stars": "5 stars"
        },
        {
            "comment": "I have used this product and it really worth buying. No issues encountered yet except sensors not working good.",
            "date": "19 Nov 2014",
            "name": "Adhar Bhagat",
            "stars": "4 stars"
        },
        {
            "comment": "Good and fast delivery and so much happy about the service and it is very safe to but in flipkart rather buying in stores",
            "date": "19 Nov 2014",
            "name": "Sankaran Gopalan",
            "stars": "5 stars"
        },
        {
            "comment": "Positive - Almost everything, Great Touch, Good Camera, Good Performance. Negative - Battery is the saddest part.",
            "date": "19 Nov 2014",
            "name": "Arun Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "i am facing problem with this Motorola g mobile. when some body call me, they can hear me but cant hear them.if u rectified this problem please rectified this problem. thanks & regards tanmoy",
            "date": "19 Nov 2014",
            "name": "Tanmoy Chowdhury",
            "stars": "1 star"
        },
        {
            "comment": "Dear Flipkart, I am a satisfied moto g2 customer but would be delighted if you could provide wooden back covers for the moto g2 2014 models as hey were provided with moto g series The back cover options are not as vast as they were with the previous generation If u could do the same with the second generation it would be great",
            "date": "18 Nov 2014",
            "name": "shri",
            "stars": "3 stars"
        },
        {
            "comment": "camera clarity simply superb using for 1 month mob not hanging heavy games ruuning smoothly speaker damn good the oly drawback is battery :( other wise for 13k worth buying :)",
            "date": "18 Nov 2014",
            "name": "T.D.BARATH",
            "stars": "4 stars"
        },
        {
            "comment": "I have taken 2 times replacement for this product. Delivered me 1st time after more than 15 days Got an Display issue..1st time Second time got an issue back cover loose 3rd time got totally different product with proper packaging. If delivery person ask you for next day delivery due his personal problem don't listen to him bcz they made us fool. i am very much frustrated with flipkart service. Pls. check product properly",
            "date": "18 Nov 2014",
            "name": "Ravi Shah",
            "stars": "2 stars"
        },
        {
            "comment": "This is the best smartphone in this price tag...I brought through flipkart ... so quick service within 2 days of order i got this phone ... This product is awesome friends do purchase it, rather than going for other brands... MOTO G next gen great ... smart on its own.. one thing i would like to add, moto g should give inbuilt file manager...",
            "date": "18 Nov 2014",
            "name": "Pramod S Manth...",
            "stars": "5 stars"
        },
        {
            "comment": "I'm enjoying moto g ... it's super .. n cost is also economical wen compared to other mobile ... loving flipkart",
            "date": "18 Nov 2014",
            "name": "Manu Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 i s so stupid with dual sim ,display problems .kindly dnt buy ,customer care is taking long time.",
            "date": "18 Nov 2014",
            "name": "Praveen Nandivelugu",
            "stars": "1 star"
        },
        {
            "comment": "Hi, Good product and awesome service by Flipkart, i am very happy. I always bye products in this kart...",
            "date": "18 Nov 2014",
            "name": "Udyala SreeKan...",
            "stars": "5 stars"
        },
        {
            "comment": "Good specification for this price range.. Best phone comparing with other mobile at this price range :)",
            "date": "18 Nov 2014",
            "name": "Vivek KG",
            "stars": "4 stars"
        },
        {
            "comment": "Worth buying it..Nice camera with good screen size...The battery stand by time is also good....m loving it ..ll suggest every1 to buy this with no worry....",
            "date": "18 Nov 2014",
            "name": "prince",
            "stars": "5 stars"
        },
        {
            "comment": "I bought two Motor G2 mobiles for my friends .. Good phones go for it.. but battery drains very fast.. You can enjoy \"true\" android experience than any other smartphones in the market. One liner : Go for it a non beginner. As I was used sony experia earlie. .. I recommend this.!",
            "date": "18 Nov 2014",
            "name": "Sudhindra Kush...",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered for my brother as a birthday gift.....i thought it will be just lke samsung ...!!!!But hatsoff MOTO G.......too good!!!!!!!!!!!",
            "date": "18 Nov 2014",
            "name": "suvarna kodukula",
            "stars": "5 stars"
        },
        {
            "comment": "stuffs I like: 1.price 2.clear hd display 5\" is attractive 3. front speakers - pretty loud and stereo speakers 4. usb on the go support 5. rubbery back premium feel (black version) 6. camera quality is awesome (and flash is perfect) 7. design - sturdy feel 8. moto os updates (stock android) no bloat wares latest android os. 9. notification light 10. battery stand by 11. snappy no lags stuffs I don't like: 1. battery charging takes a while (0.5mAh output charger) 2. battery lasts a day for moderate usage (drops 10% every night with no wifi or 3g) ***3. experienced a black out totally recently after I powered it off (battery 50% so no battery drain) and did not boot at all even after holding the power button continuously**** resolved by: ( connected it to the power charger and holding power button for 2-3 mins and it booted up) don't know why it happened so I minus 1 star flipkart: ordered for in-a-day delivery and it was promptly delivered and good packaging and tracking facilities.",
            "date": "18 Nov 2014",
            "name": "chaaran sen",
            "stars": "5 stars"
        },
        {
            "comment": "very nice product... nice built quality and very smooth performance...i really loved this phone...never lags in any application or game",
            "date": "18 Nov 2014",
            "name": "Gyanprakash Ni...",
            "stars": "5 stars"
        },
        {
            "comment": "The major function i liked was the speakers.The biggest drawback is that they have not tweaked the android even a bit and that means that the interface is difficult to use, coming from a Galaxy S4 user.",
            "date": "18 Nov 2014",
            "name": "Shaman Bhat",
            "stars": "4 stars"
        },
        {
            "comment": "This is one of the best phone that i have used till now. At 13k you can get different phones with similar or superior specs. The reason why i choose the phone is because it has promised android lollypop update. Secondly it is one the best device which is easier to hold at this size. I like big screen phones. The only thing that i have is the battery. 2600mah battery should have been used. Well with this battery I'm okey.",
            "date": "18 Nov 2014",
            "name": "Akhil PSuresh",
            "stars": "4 stars"
        },
        {
            "comment": "Writing this review after using the phone for 3 weeks. This is my first smart phone and I am happy for choosing Motorola.Initially, I felt phone volume is less w.r.t both music player and call volume. After using it for few days, I felt its adequate. I feel battery could be enhanced with more backup time as it drains fast. Rear camera is good but front camera is not offering 2 mega pixels quality. Advantages: 1.Economic phone with more features 2.Fast browsing 3. Enhanced Memory Disadvantages: 1.Battery back up 2.Rear camera picture quality",
            "date": "18 Nov 2014",
            "name": "Bindu Sagar Nandi...",
            "stars": "4 stars"
        },
        {
            "comment": "Thanks i like your products good job next please share your good offers than i have applied new product. Also your fast service is excellent. thanks once again. :) Suren",
            "date": "18 Nov 2014",
            "name": "Surendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Bought Phone from Flipkart... Awesome... Performance... a way better then I thought... Camera is good... Battery backup is good..",
            "date": "18 Nov 2014",
            "name": "Rahul Revawala",
            "stars": "5 stars"
        },
        {
            "comment": "All the Features of this are good except its battery life. At the time of charging its also take too much time.",
            "date": "18 Nov 2014",
            "name": "Sultan Shaikh",
            "stars": "4 stars"
        },
        {
            "comment": "loking so awsome and the hd camera recoding ,work very fast,and no hang problem and this fone are used at least last 1month son felling are so much in android phone.",
            "date": "18 Nov 2014",
            "name": "vivek paneliya",
            "stars": "4 stars"
        },
        {
            "comment": "nice phone at this range. Battery : it could be better but still in mix usage like turn off sync,3g data, location while u r not using, giving backup more than 1 day i.e 1.6d, on ideal state it drains very less. performance : 4.5/5 look n fill : 4.5/5 network : 3/5 some times call has some problem during talk,and noise is there camera : 4/5 low shutter speed,gives nice shoot on day verdict: For normal usage go for it",
            "date": "18 Nov 2014",
            "name": "Durga Shanker",
            "stars": "4 stars"
        },
        {
            "comment": "Trust of Motorola at this price with good specification... what else is needed??? \"Please make sure your review contains at least 100 characters.\" this line of flipkart made me to write cons as well.. cons: battery backup is not that good...",
            "date": "18 Nov 2014",
            "name": "waquar ahmed khan",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery from flipkart was best. They are good in business. Phone performance is good but phone charger is not that solid looks like if dont handle with care can break any time. Head phone is not good looks like very cheap and ear starting paining if you use it for long.I wish Moto G could provide nicer earphone likes the one provided in samsung phones. Phone camera is very nice. Phone is worth buying.",
            "date": "18 Nov 2014",
            "name": "Sandeep Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "very sad to say ... moto g 2 gen is not a good phone and still moto g first generation is far better then this phone cons : 1 poor battery and first gen was praised for its battery life 2 heating issue when we use the phone for a while 3 poor flipkart service they delivered me the phone only after 13 days and also the product was defective and they replaced with another defective product . ( non stop poor customer service from flipart) 4 non availiability of moto phones with other online shopping sites makes us to no choice to get from flipkart and my personal opinion that all moto products bust be available in all online shopping site so that we can have fair play since flipkart is providing poor serivice we can swtich to some other provide but this is not happening so blame on MOTOROLA 5 1 gb ram slowest amoung other competitors in the same price range, even though phone does it lag that much but once u load more apps u can find considerable amount of lag in the phone. 6 charge ur phone is similar to RAHUL DRAVID getting 100 runs in 375 balls ... i have used so many devices never ever seen a phone that gets nearly 3 hrs to get charged and i dont know wat charges are provided with this phon 7 another in box accesories is hear phone and very poor quality even micromax hear phone that they give for NITRO which is also in the price bracket is good. over all UNHAPPY with the device and very much FEDUP with FLIPKART service ........ motorola please look into the issue and help us ... one man cant satisfy all the needs of india ... lets try to be practicle and encourge fair trade and also there by increase the customer satisfaction. all the above comments are my own and i faced all those difficults mentioned as cons over there sorry to mention only one PRO is NOTHING. regards sekher",
            "date": "18 Nov 2014",
            "name": "sekher m",
            "stars": "1 star"
        },
        {
            "comment": "I am using this mobile from last one month, not explored much(stuff lilke games and concurrent apps stuff). Here is the cons & pros: Cons: 1. Seeing some issue with edge/3G connection, not sure whether this problem with network[service provider]. it always go to EDGE which I don't want. 2.When phone is set to \"WDMA only\" and data connect lost for some time, data connection never comes back. after phone reset works fine. 3. Network unavailability issue, many times seen this mobile will not have network but at the same time my friend who is using same network will have network. 4. Some time I felt mobile is getting heated whenever I play games 5. Battery backup: I felt bad battery backup 6. HIGH SAR value :-( Pros: 1. Screen size, camera and extendable memory. 2. Up gradable to android Lolipop:)",
            "date": "18 Nov 2014",
            "name": "Hemantha",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G2 is a good android phone in this price. Good camera quality, battery is okey, fast loading, software upgradable to L, nice design of body.",
            "date": "18 Nov 2014",
            "name": "Ratheesh",
            "stars": "5 stars"
        },
        {
            "comment": "fully satisfied.... only 1 company that gives you all the facility in a single 5\" box awesome camera quality 1 of the best feature which is its screen resolution thanks Motorola to give this box",
            "date": "18 Nov 2014",
            "name": "Jitendra Gautam",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone anyone could find right now in its price range. Has been using it for weeks now. Works very fine, better earphone could have been coupled with the phone, but apart from that it is good.",
            "date": "18 Nov 2014",
            "name": "Vivek Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "overall build quality is good ,. bit i didnt like the sound quality for songs ,, camera quality is good .. best buy according to price",
            "date": "18 Nov 2014",
            "name": "ranjit singh",
            "stars": "4 stars"
        },
        {
            "comment": "Super product in this price range. However I personally fell the volume rocker and power button is bit hard w.r.t. to Mogo G first edition. Otherwise all cool. Super phone.",
            "date": "18 Nov 2014",
            "name": "Sumit Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The product was delivered on 18 Oct. Robust build and good value for money. However, it is not turning on now, just a month in use. Will have to ship it to a service centre to identify cause and determine next steps. Disappointing!",
            "date": "18 Nov 2014",
            "name": "Anuradha Kurup",
            "stars": "1 star"
        },
        {
            "comment": "Best android smart phone in the given price range. Camera quality is good. But bit uncomfertable while zooming in and out. The speakers are very good. Overall its a very good buy, worth the amount spent.",
            "date": "18 Nov 2014",
            "name": "Vijay Ghanvat",
            "stars": "5 stars"
        },
        {
            "comment": "First time received mobile with speaker problem it was replaced but now in new mobile there are vibration problem, Vibrator is not working.",
            "date": "18 Nov 2014",
            "name": "Atul kumar sh...",
            "stars": "1 star"
        },
        {
            "comment": "Prompt delivery...by Flipcart it has done its best to deliver the product to me. the product has met my expectations. Awsome camera, display , touch sensitivity What i like most is GPS functionality",
            "date": "18 Nov 2014",
            "name": "H.kumar",
            "stars": "4 stars"
        },
        {
            "comment": "When you want to make group call. If you dialing number, if you observer a entered number is wrong then there is no delete button.",
            "date": "18 Nov 2014",
            "name": "SATISH REDDY",
            "stars": "3 stars"
        },
        {
            "comment": "Mobile(Moto G) Battery backup very bad, it will take min 3 hours for full charging, but it is not given 1 hour backup, If when i play any games not given 30 mins backup. We unable to change the battery due to inbuild battery. Plz suggest on same. What to do ?",
            "date": "18 Nov 2014",
            "name": "Rajesh Gadappa",
            "stars": "1 star"
        },
        {
            "comment": "Been using the phone for 3 days now. Battery backup is reasonably good, given the screen size and the battery capacity. Construction is excellent, save for the back cover which is flimsy. Received a White headset and a White charger with my Black phone - not sure if that is the norm. Overall, a very good buy.",
            "date": "18 Nov 2014",
            "name": "Karthik Sampath",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone with best features, design awesome and great performance...........and Flip-kart deliver service very good- place order on Saturday got on Monday morning!!",
            "date": "18 Nov 2014",
            "name": "Amar Tyagi",
            "stars": "5 stars"
        },
        {
            "comment": "fast delivery... flipkart fail to get me confirmation sms to my number... i faced same with my last 3 orders!!! About phone.. no words to express!!",
            "date": "18 Nov 2014",
            "name": "DavdoN",
            "stars": "5 stars"
        },
        {
            "comment": "The delivery was too fast and thanks to flipkart!!! I have purchased this phone (2 handsets each) to my parents which is handy and also good in all the features as well as specification, go for it you will be satisfied with the investment what you have done for.",
            "date": "18 Nov 2014",
            "name": "Rahul Roche",
            "stars": "5 stars"
        },
        {
            "comment": "This is must buy phone under 15k category . This is best ever phone android version i have seen in this budget phones.",
            "date": "18 Nov 2014",
            "name": "Varun Jayachandra",
            "stars": "4 stars"
        },
        {
            "comment": "I bought the phone on the day of its release, but wanted to wait a while before I review it. So here it is: The basics: it's got a dual SIM, quad core processor, Android Kitkat (waiting for Android 5.0 update!!), 8MP camera (primary) and 2MP in front, really good sound quality (thanks to the dual front speakers), very good battery life, expandable storage, screen resolution is good. Look wise good too, sleek and with a little extra money you can spice it up with a colourful back cover versus the default black. What else do you want in a phone? I am very happy with my buy. I'm still trying to find faults and will update if I do. But none so far! Edit: Ok, I remembered one fault. The charger that comes with it is ridiculous, how can you have a non-removable data cable charger? It's a one piece, and apparently it heats up. So I've been using my old Sony Xperia charger, which is so much better.",
            "date": "18 Nov 2014",
            "name": "Nandini Datta",
            "stars": "4 stars"
        },
        {
            "comment": "I've been using this phone for 2 months now. Well, From a guys migrating from iPhone, i'm pretty impressed. Awesome performance for a Rs 13000 phone. Its no iPhone or any other high end android phone, but he can roar. Camera is also good, I'm not satisfied with the low light performance though, video is also the same. Battery is the downside, poor battery performance. During night, it downloads and updates all the app and by the time you wake up, battery goes down from 60% to",
            "date": "18 Nov 2014",
            "name": "BINU SUDARSAN",
            "stars": "4 stars"
        },
        {
            "comment": "lovely phone...no lags,Battery lasts for one day..U wont regret after buying this..!!! and it supports OTG pendrives too",
            "date": "18 Nov 2014",
            "name": "Dipesh varma",
            "stars": "5 stars"
        },
        {
            "comment": "This is 29th day after I received my phone, it is in workshop for getting speaker replaced or fixed. Basic functionality is also not working. Over all look and feel is good, 16 GB memory is good, camera is good. But when basic functionality has not worked what ll we do with rest of them. Disappointed!!",
            "date": "17 Nov 2014",
            "name": "Ujjwal Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Used a Moto razor and this time \"G\" 2nd gen. Pros: It is extremely good value for money. Sturdy phone, good speed, amazing connectivity, descent battery, good camera, sleek and very light in hand and pocket, 5 star voice quality, can use in rains also. Cons: Sometimes takes time to rotate screen, less options with camera settings.",
            "date": "17 Nov 2014",
            "name": "Anuj Seth",
            "stars": "4 stars"
        },
        {
            "comment": "I have used it for more than 3 months ...As less speaking I first had problems regarding GUI but am having used too...Front cam is good and back cam is awesome..",
            "date": "17 Nov 2014",
            "name": "Nabyendu",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone under 15000 till now with getting latest updates... Its better than any other phone.... You must be thinking of buying Android One but it both has Pros and cons Particularly Cons are more as it gets laggy when doing some hard gaming It has a small screen which ruins the gaming experience.... It has MediaTek Processor which is not up to the mark.... If we do a vs b/w MediaTek and Snapdragon.... Snapdragon wins.... Moto G 2nd Gen has a 5inch HD display which is great for gaming Android One has Camera issues as it has only a 5MP Camera Moto G 2nd Gen have a Slo-Mo feature which makes it more creative Android One has 1700mAh battery whereas Moto G 2nd Gen has got a 2070mAh massive Battery Android one has only 2 sensors and Moto G 2nd Gen has 4 sensors Motorola's Built Quality is great Motorola's inbuilt app called 'Motorola Assist' features a helping hand wherever you are....",
            "date": "17 Nov 2014",
            "name": "Gaurav Soni",
            "stars": "5 stars"
        },
        {
            "comment": "best budget phone, better than any other brands at this price, smart assistance, Google apps are wow, solid built in quality, Android is up-gradable, Camera is decent, heating problems, headset is worst",
            "date": "17 Nov 2014",
            "name": "mohan reddy",
            "stars": "4 stars"
        },
        {
            "comment": "Nothng can beat motorola MOTO G. I was looking for a phone for my mom.Was confused between Asus Zenfone 5 & Moto G.Asus has better configuration on paper, but Moto G wins hands down.The speaker was a must for me.You know how elderly people have problem hearing their phone ring.& with near to original Android, its very smooth UI.",
            "date": "17 Nov 2014",
            "name": "Ajit Kamble",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen)is best value for the price. The cam is improved when compared to 1st Gen. Pros:- Camera is much better than the original's Near-stock Android 4.4.4 is a treat Feels snappy despite aging internals Inexpensive Cons :- No LTE",
            "date": "17 Nov 2014",
            "name": "Ramsai Pavan",
            "stars": "4 stars"
        },
        {
            "comment": "moto g 2nd gen is a good product but hangs when we run games like asphalt 8. also hangs when running on 2g. but overall the phone is good and motorola service is good. and flipkart is good.",
            "date": "17 Nov 2014",
            "name": "Aditya Sinha",
            "stars": "5 stars"
        },
        {
            "comment": "I used this product for couple of weeks and facing issues with power button. The button is loose and mobile gets switched off without pressing it. I will get in touch with customer care and will update my experience too.",
            "date": "17 Nov 2014",
            "name": "Sachin Garg",
            "stars": "2 stars"
        },
        {
            "comment": "Hi Guys..... The delivery by flipkart was quick but, i got a defective mobile The front camera lags",
            "date": "17 Nov 2014",
            "name": "Roshan Pednekar",
            "stars": "1 star"
        },
        {
            "comment": "I would not suggest one opting for this mobile coz of issues(cracking sound from speaker, heating** etc..)",
            "date": "17 Nov 2014",
            "name": "Rakesh M",
            "stars": "3 stars"
        },
        {
            "comment": "I already had a Moto G (gen 1), was impressed with the 1st gen hence ordered 2nd gen on Diwali, got a buy back for old Nokia Asha phone, final deal 12K. Good branded phone at this cost.Till date working fine, infact compared to the older generation, this has a better camera, bigger screen, front speakers & expandable memory.One more this phone looks sleeker than the older generation. I have being using this phone for a month now and no issues till date.",
            "date": "17 Nov 2014",
            "name": "Amol Palav",
            "stars": "4 stars"
        },
        {
            "comment": "WiFi Direct option is given but WiFi Direct function does not works . I inquiry to customer care they told me it will be work in next update.",
            "date": "17 Nov 2014",
            "name": "Mandeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Best product your money can buy with in 13k. Satisfied with sound, camera and battery. Waiting for android L update, in india.",
            "date": "17 Nov 2014",
            "name": "Sunil Kumar S...",
            "stars": "5 stars"
        },
        {
            "comment": "Hats of to flipkart. ordered night 11.45 pm and receive the product the next day before 11.30am(normal delivery). keep it up. About product it is nice once. worth to buy.",
            "date": "17 Nov 2014",
            "name": "Senthil S",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on Nov 10th and I got it by 11th Nov, in a day without any extra payment!! this is amazing.. the phone is also too good, the configuration, the display and the performance is mind blowing... this is a great budget phone and I would suggest to go for it.",
            "date": "17 Nov 2014",
            "name": "Lawrance",
            "stars": "5 stars"
        },
        {
            "comment": "Hi guys, Product was attractive and good in condition No complaints about moto G2. Good handling, good camera even during night. Good battery than samsung those i have used yet. Only no offers with product. Over all best for price. Touch and handling also good. Only i have not tested with GPS as i heard from my friend he also has moto G2. He says phone gets little bit heat but SAR retting is High than samsung phones but within limits provided by government of India. check ur phone SAR rating press *#07# and keep ur health better. i would like to say thanks to seller they have provided good product. But can u guys provide some offers with product or those who have already taken another product from same seller like another phone same moder or not same model vice versa. so they should give some offers or discount in cost referring old order no. so the buyer and seller relation of trust will increase and seller can increase their sell. It will much appreciated if seller will contact us and give some offers to there old buyer. waiting feedback or reply from seller. As i have already taken Moto G2 and One samsug grand Prime from same WS seller. I am planning to take another samsung grand prime but within one week WS seller have increased there product price around 800rs already there product price is higher compare to other seller then why again they are increasing price. This will affect there sell. I ordered Moto G2 on 29th OCt at 12999rs. then Samsung Grand Prime at 15056 rs on 6th Nov and received by 9th Nov But now i wanted to Order another Samsung Grand Prime but its price shows 15893 rs. Request u to give some offers or reduce the product price otherwise it will affect ur sell or people will move to other seller. Even also i am thinking same let see waiting for any feedback from seller.",
            "date": "17 Nov 2014",
            "name": "Alpesh Pathari",
            "stars": "4 stars"
        },
        {
            "comment": "Should I write every thing- I think it will become a paragraph. I am falling in love with it. Motorola and flipkart are exceptionally doing well.",
            "date": "17 Nov 2014",
            "name": "Amresh Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought this mobile 15 days ago....primary & second camera, proceesing, looks are good...but i feel touch is not upto mark... at the time of typing of messages and email you will know the exact problem..overall it is okey...but in this pricing you never expect this kind of touch ...so please careful..",
            "date": "17 Nov 2014",
            "name": "CA Vikas Chauhan",
            "stars": "3 stars"
        },
        {
            "comment": "1. Best Value for Money amongst the recent mobiles 2. Most reliable and great Customer Support 24X7 on-line support Chat etc 3. Very Google friendly and that makes it intelligent 4. Features at par with costly mobiles 5. Smooth and very fast 6. I am delighted",
            "date": "17 Nov 2014",
            "name": "KESHAB SEN",
            "stars": "5 stars"
        },
        {
            "comment": "Definitely the best phone under 15,000, as usually such features are only offered by unreliable chinese brands at this price. Only negative is that its a bit thick and bulky.",
            "date": "17 Nov 2014",
            "name": "Akshay",
            "stars": "4 stars"
        },
        {
            "comment": "1000% value for money !! Its an Google phone !!! or can say baby of Nexus EKart by flipkart is working so amazing that i got this delivery with in 6 days that too during Diwali Period !! There is no negative points regarding phone ! Motorola has roll back after long time can say after Moto razor ! and now they gonna capture entire world market of Android !!!",
            "date": "17 Nov 2014",
            "name": "Abhijeet Titkare",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile is best for low budget...... But problem is no USB cable in the box.......... Battery backup is also great camera quality is also great...",
            "date": "17 Nov 2014",
            "name": "harshal Ahire",
            "stars": "5 stars"
        },
        {
            "comment": "I have got this two week ago.Performance wise this phone is very good, no heat problem. The only problem i face Camera, some times m not able to get focus",
            "date": "17 Nov 2014",
            "name": "Rakesh Verma",
            "stars": "4 stars"
        },
        {
            "comment": "Product got delivered less that 12hrs, as warehouse was near my street. Pros: Best phone compared to Moto X and Samsung Grand series. Cons: Moto Company should have provided Charge and Data Cable.",
            "date": "17 Nov 2014",
            "name": "Srinidhi Raghuram",
            "stars": "3 stars"
        },
        {
            "comment": "Good things about - Moto G (2nd Gen) 1. Super dashing look and sleek design with classic finishing. 2. Speakers - it's work better than other. There is only one thing i don't like about moto g 2nd generation - File Manager Go for it...!",
            "date": "17 Nov 2014",
            "name": "Mahesh Sawant",
            "stars": "4 stars"
        },
        {
            "comment": "Perfect mobile no flaws... Fast delivery... except few negligible bads... Perfect mobile no flaws... Fast delivery... except few negligible bads...",
            "date": "17 Nov 2014",
            "name": "PraveenKumar",
            "stars": "5 stars"
        },
        {
            "comment": "Writing this review after using both the phone I am going to list only issue noticed with this phone. very low battery backup moto g 2nd gen",
            "date": "17 Nov 2014",
            "name": "Reegan Rock",
            "stars": "1 star"
        },
        {
            "comment": "There are several reviews of the product online, however this is good buy for basic users. Slightly bigger while on hand. Battery life and camera are great. Just looking forward for the Android L release.",
            "date": "17 Nov 2014",
            "name": "Pushkar V",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product from Motorola and Google. So far it has been going well. good product at worth price from Flipkart. Keep up the gr8 work Flipkart.",
            "date": "17 Nov 2014",
            "name": "Kamlesh Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "I have ordered Moto G 2nd gen last month. Delivered to my home on time. But, I got the used one!!. Yes!!, I am sure about it. My bad, We were so busy and we don't have time to return and reorder the product. I was very much disappointed with Flipkart. Coming to MotoG2, It is a nice phone with good features. Liked it!",
            "date": "17 Nov 2014",
            "name": "Vijay Shouri C...",
            "stars": "4 stars"
        },
        {
            "comment": "i was very fascinate about this phone and purchased it ,the performance is absolutely fine but i have a problem of heating issues with it .....very much annoyed if it gets heated",
            "date": "17 Nov 2014",
            "name": "karthik",
            "stars": "3 stars"
        },
        {
            "comment": "Worst product - Dead within one month Worst service - It's been twenty days I still didn't even receive a call or mail regarding why it is getting late. (KERALA) When it was working for 25 days, it felt so great. But one suddenly it went dead. No damage.",
            "date": "17 Nov 2014",
            "name": "Karthik",
            "stars": "1 star"
        },
        {
            "comment": "Delivered in the right time block. Excellent communication and service from flipkart. The phone is a great buy for that money. Battery seems to be holding up now as that was my major concern.",
            "date": "17 Nov 2014",
            "name": "Anirudh R",
            "stars": "5 stars"
        },
        {
            "comment": "Perfect mob with cheap price..... Nice mobile and great product delivery experience..... But just what i dont like is the Review tab, we need to compulsory type atleast 100 characters even we dont wann to waste that much of time.",
            "date": "17 Nov 2014",
            "name": "Rakesh Rajgopal",
            "stars": "4 stars"
        },
        {
            "comment": "Worth buying, good one. Battery back up is fair enough, good connectivity etc. Flipkart is smart as always in meeting the delivery timelines",
            "date": "17 Nov 2014",
            "name": "Ravikiran Kaya...",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using moto G2 since last 1 month,,here r some pros n cons : Pros: 1)clear display 2)good form factor grips well in hand. 3)nice design 4)camera is OK 5)performs well Cons: 1)serious audio issues ,noisy speakers ,very poor. 2)battery drains fast 3)it hangs while playing low end games like subway surfers 4)takes hell lot of time to charge",
            "date": "17 Nov 2014",
            "name": "Mudasir maqbool",
            "stars": "3 stars"
        },
        {
            "comment": "The product is too good with lots of features.look wise as well as performance wise the product is a big yes to all. The only thing which i didn't like was that there was no USB cable given along with this handset and also the headphone which is in the accessory is very much low in quality. these days everybody want to have a good hands-free which we dont have in Moto G hence please improve this.",
            "date": "17 Nov 2014",
            "name": "Vijay Dhosiwal",
            "stars": "4 stars"
        },
        {
            "comment": "worth for your money. Very good. good camera quality, good video quality. Smoth navigation and touch. Tough gorrila glass.",
            "date": "17 Nov 2014",
            "name": "Vijay",
            "stars": "5 stars"
        },
        {
            "comment": "Nice looks , high resolution camera , latest KitKat 4.4.4 , good processor with good working ... Only data cable is not given , file manager is not installed..",
            "date": "17 Nov 2014",
            "name": "Yash Raj",
            "stars": "4 stars"
        },
        {
            "comment": "It is Just Awesome completely satisfied...........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "17 Nov 2014",
            "name": "Varadharajan R...",
            "stars": "5 stars"
        },
        {
            "comment": "its all beyond my expectations.... very good product, everything easy......Experience for the last one month is extremely satisfying.......",
            "date": "17 Nov 2014",
            "name": "Parameswaran N...",
            "stars": "5 stars"
        },
        {
            "comment": "At first when Asus 5 was launched I was lured toward it as it gave many features. But after the Entry of Motorola moto g I was confused which one to buy. Later I got that having many features does not make phone work good. Asus produces best laptops but they are new in mobile field, they may give many features, but the working differs on many grounds. Now, something about hardware Glass is gorilla corning glass 3 N study frame. Overall strong enough in daily use. Software are something to talk about Google gives best software, but few are resource hungry For instance Google chrome which you can disable in setting but cannot uninstall. All software are good working. To sum it up this is the awesome product. I sure recommend to buy.:)",
            "date": "17 Nov 2014",
            "name": "Satej Nair",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this moto g2 two weeks back from flipkart..and delivery was good..till now I have faced no problem. Good thing it has KitKat 4.4. But in the box you will not receive data cable. other than that all is good. Its battery backup is OK. it will give 1 day backup with Normal usage and again depends on you how you use your mobile. In the end I will only say that don't think twice just get it..its a good budget android phone..",
            "date": "17 Nov 2014",
            "name": "Ravinder Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone good supporting familiar to user, but required more features like camera and hard disc and processor",
            "date": "17 Nov 2014",
            "name": "vivek yadav",
            "stars": "3 stars"
        },
        {
            "comment": "Redmi 1s is not at all a comparison with this...everything is good,but at night the flash performance is little bit bad at time...the picture taken at night,have some whitish spot in it...i'm using this phone right now..i'm happy with this phone..",
            "date": "17 Nov 2014",
            "name": "Smruti Ranjan...",
            "stars": "5 stars"
        },
        {
            "comment": "i m litl a bit disapoint wid this product as i acpect more from dis phone....sm features r missing...n camara reslt is also nt dat great",
            "date": "16 Nov 2014",
            "name": "Sumit Kaklotar",
            "stars": "3 stars"
        },
        {
            "comment": "The Moto G has serious issues in audio. The speakers do not work consistently. I had ordered the MotoG on flipkart and had to replace the phone for audio speaker issues. same issue reoccured in the replaced piece. It feels that the product has been put to market without adequate checking.",
            "date": "16 Nov 2014",
            "name": "Indu Kiran",
            "stars": "1 star"
        },
        {
            "comment": "Purchase moto g 2 product is good but charger is not good.Charger is to much heat but flipkart executive say this is normal.Charger is not quality is poor.Phone is take to much time for charging it take 5 to 6 hours for full charging.",
            "date": "16 Nov 2014",
            "name": "Anmol",
            "stars": "1 star"
        },
        {
            "comment": "M using Moto g jst frm 20 days bt really m satisfied wth this product its really good to buy nd thx to flip cart for giving such a nice product on time..",
            "date": "16 Nov 2014",
            "name": "Brijesh Sedani",
            "stars": "5 stars"
        },
        {
            "comment": "Very good , in all aspects , except battery , should hav been more powerful since display is big . if you are not interested in games then this is the one to buy , not because it cannot play, as a matter of fact it play any game , processor is excellent , but because of poor battery falls short than expected ..",
            "date": "16 Nov 2014",
            "name": "Dr Rama krishna",
            "stars": "4 stars"
        },
        {
            "comment": "Motog2 - awesome phone. At this price this is the best phone you can purchase. The functions are working smoothly. Camera quality is good. Phone performance is awesome. Storage is good. Design is excellent. The product packing is awesome and delivery time is also above expectation. ***** star!!!",
            "date": "16 Nov 2014",
            "name": "Prashant Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "my mob suddenly stopped working n i donno wer 2 approach now...if u people know any info plz do comment...",
            "date": "16 Nov 2014",
            "name": "Karthik Gk",
            "stars": "3 stars"
        },
        {
            "comment": "Bought it as a gift. Was not disappointed. Does what's advertised, better than any other in its range. Stock android..no bloatware...good features...better than expected performance....just buy it.",
            "date": "16 Nov 2014",
            "name": "Anirudh Mathur",
            "stars": "5 stars"
        },
        {
            "comment": "The service is very very poor when it comes to delivering replacement product.Very much disappointed .",
            "date": "16 Nov 2014",
            "name": "Shivaranjani S...",
            "stars": "1 star"
        },
        {
            "comment": "Worst product..worst battery backup...plz exchange this product...battery get drains easily....even this product does not hide apps....yaad h....flipkart must exchange product for better sales...",
            "date": "16 Nov 2014",
            "name": "saloni shah",
            "stars": "3 stars"
        },
        {
            "comment": "first of all the delivery service was good. it was delivered to me within 2 days. lets come to the phone. pros: 1)display is very good 2)no lag 3)camera is extremely good. the only thing which i found as not good was the speaker. when audio is kept in full sound it cracks over all it is a good phone between 10k to 15k",
            "date": "16 Nov 2014",
            "name": "Dhandapani",
            "stars": "5 stars"
        },
        {
            "comment": "Must buy for a guaranteed upgrade and for a phone which can do all the daily use smart tasks . I you thinking for it just go for it ... i orders 3 of them . by recommending:)",
            "date": "16 Nov 2014",
            "name": "Manjeet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2nd product is very good within 15000 range but weight is very large than other sony phone. camera result very good",
            "date": "16 Nov 2014",
            "name": "nikunj patel",
            "stars": "5 stars"
        },
        {
            "comment": "I have used Moto G for over a month now and have found the phone to be amazing and true value for money with nice look and feel as well. I am using the phone without cover and screen guard and after normal handling of phone not even a single scratch / mark has been observed till date. Phone has good specifications to play high resolution games such as Fifa 15 or other heavy car racing games. Battery life if good, music quality is good, camera front and rear is good. Overall I am impressed with the phone at such an attractive price.",
            "date": "16 Nov 2014",
            "name": "Pulkit Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i was confuse with mi3 & this one and made a decision that not to chose china and i am very happy with my moto g 2014 ed No words just feel amaze when i hold my device each and every time :) you must buy this phn and experience the stock android and 5.0 also coming soon and i am very excited that motorola are the first of the few brand who gives update very fast... don't look for any other thing just buy it and you will not regret 4 stars because of multi tasking option which i think software issue but still i love it",
            "date": "16 Nov 2014",
            "name": "Vinay Singh",
            "stars": "4 stars"
        },
        {
            "comment": "I HAVE BEEN USING THIS PHONE FOR A MONTH..IT LOOKS GREAT, GOOD PERFORMANCE.. THE PROS ARE VERY GOOD CAMERA, QUITE FAST,DOESNT LAG AT ALL, GOOD BATTERY LIFE,GOOD SOUND CLARITY.. CONS ARE HEADPHONE IS BAD, NO INBUILT APPS LIKE FILEMANAGER, A BIT PROBLEM IN SIGNAL RECEPTION.INTERNAL MEMORY IS 12GB",
            "date": "16 Nov 2014",
            "name": "SUMAN DATTA",
            "stars": "4 stars"
        },
        {
            "comment": "Smart phone is best...but ear piece problem 6 times found... two times Handset replaced but again problem found",
            "date": "16 Nov 2014",
            "name": "ANOOP M.R",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this for my CEO. IT is an awesome product by moto.. .",
            "date": "16 Nov 2014",
            "name": "Vijay DR",
            "stars": "4 stars"
        },
        {
            "comment": "Main problem of this mob is its battery..it drains very fast.. And the charger which comes with this mobile has less output..which results in slow charging..at least it takes 4hours to get fully charged..which is too much time as compared to charging with any other company's charger which gives double output.. Other features are just okk at this range.",
            "date": "16 Nov 2014",
            "name": "Sanil verma",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using this mobile for last one month. It is very good mobile but it's touch is not good that's why I am giving it to 3 star otherwise I will it 5 star",
            "date": "16 Nov 2014",
            "name": "Rishi Aneja",
            "stars": "3 stars"
        },
        {
            "comment": "Hello guys i am writing a review on THe moto G (2nd Gen) and now here it goes.... The phone runs quite smooth on android 4.4.4 Kit Kat and has a very efficient browser and its camera runs perfect though it is not the best phone in this price but I cannot trust the other brands..... A must buy phone for Android users... Pls ignore the Little flaws in the phone but all-round it is an amazing device......",
            "date": "16 Nov 2014",
            "name": "Sam Bajaj",
            "stars": "5 stars"
        },
        {
            "comment": "Hello there, I ordered the device on 8th September and exactly after 45 days, my device restarted itself and stuck in boot-loop (powered by android white screen) eversince On contacting service center, motherboard has fried and needs replacement Terribly sad for the performance it delivered And as 30 days have passed, i am not eligible for a replacement from flipkart side.. Stay away from this device if you are a power user",
            "date": "16 Nov 2014",
            "name": "vighnesh aravind",
            "stars": "1 star"
        },
        {
            "comment": "Am using moto g2 from more than one month,there r +ve an -ve things r there,.overall its gud experince with this phone. Postive pionts according to me - 1. its Design,Look 2. its perfrmance very fast and reliable. 3. softwares- all apps r runing very fast .pre installed apps r performing very gud. 4. camera -performing very gud in his range of mobiles 5. andriod kitkat 4.4.4 Negitive points r - 1. Battery life - is not very bad. but its VERY VERY bad experince..if u play games or using net browsser the battery goes down very fast within 1 hour 65-70% goes down,am charging 2-3 times a day.its take 2.5 -3 hour to charge fully 2.water resistance -i dip the phone in water for 5-8 seconds .after that touch not working properly. :( 3.ring tones-- not esy to set a sng,,..,,same tones for both the sims, 4.head phnes nt working when u r on viber. 5. accesary comes wd this phone is not gud quality its average. 6.open speaker sound quality is average .... 7.managing both sims not easy task. 8.camera consumes lots of battery power and phones heat up. one thing i most like about this phone is google will updates with andriod L,.i don't know when but its feel gud.",
            "date": "16 Nov 2014",
            "name": "The Rohit :)",
            "stars": "3 stars"
        },
        {
            "comment": "Delivery of this phone was a bit late i believe due to diwali But overall a nice product Flipkart service is also good",
            "date": "16 Nov 2014",
            "name": "Ankit Kakkar",
            "stars": "4 stars"
        },
        {
            "comment": "White one is awesome on hand! my bad luck is that it dropped from my packet and slight scratches came on side.Internal memory ,Screen Clarity,Speed of Processor are excellent.",
            "date": "16 Nov 2014",
            "name": "SaI Are",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good phone - good display -fine camera but only one complaint that my second sim card is not working in phone...",
            "date": "16 Nov 2014",
            "name": "Uday Tandel",
            "stars": "1 star"
        },
        {
            "comment": "you can't expect more than this in this range of 13k yet its battery is too low nd speakers are not upto their best but its camera is too gud high quality pics in low light even without flash and also good for mid level gaming so a thumbs up from me for Moto G 2nd gen",
            "date": "16 Nov 2014",
            "name": "ujjwal dhir",
            "stars": "4 stars"
        },
        {
            "comment": "Pros- 1. Superior Performance with hi fi gaming. 2. Long Lasting Battery with 2070 mAH battery (2 Days Backup) 3. Excellent Camera. 4. Water Resistant 5. Good Gorilla Glass that resist Scratches 6. Slik Design 7. Available in EMI Option through Credit Card. Cons- 1. Phone slips from hand sometimes so be careful in handling 5 inch mobile. Go for Insurance worth Rs 1000 within 15 Days from Invoice Date. 2.Sharp edges between Glass and Body at left upper corner so you feel uncomfortable when talking to somebody. 3. Music is good but not Good as Sony mobiles. 4. Motorola Flip Cover cost is Rs 1100 which is very costly. Motorola should reduce its cost and should provide it in Rs 500-700. 5. It heats when you use it till 30 minutes. Rest OKAY. I would strongly Recommend to Purchase Moto G 2nd Gen. Please donot go for 1st Gen as it is far better than 1st gen. But choice is yours as per your affordability.",
            "date": "16 Nov 2014",
            "name": "RITESH KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "If you are geek who look in to specification and design then this one stands first while you think of a smartphone under 15k. The 5 inch HD screen of good saturation will never let your eyes off from it.It never lags while running app or high end games.Battery is a low power one when compares to the display.But you can run this device on moderate use for full day with single full charge. Performance is good. Gives you an expandable memory and internal memory of 16gb which is a nifty.Adreno 305 gpu stands with high pixel games,videos and apps. Qualcomm snapdragon 400 is a basic processor but quad core gives you better speed and 1gb ram helps to keep up this. What else you can get an amount of 13k.",
            "date": "16 Nov 2014",
            "name": "Jayesh Krishnan",
            "stars": "4 stars"
        },
        {
            "comment": "THE CELL PHONE HAVE LIMITATIONS. THE SEARCH OF A CONTACT NO. IS NOT THERE. A SONG CAN NOT BE SELECTED FOR A RING TONE. OR I MAY NOT DO IT. IF ANY COMPANY PERSON CAN GUIDE ME IN THIS REGARD I WILL BE VERY GLAD.",
            "date": "16 Nov 2014",
            "name": "AJIT GANDHI",
            "stars": "2 stars"
        },
        {
            "comment": "i bought this phn dn at the 1st time it was screen touch problem i found dn i exchange it dn again i got problem regarding sim card ,it wasn't detecting any sim.. so its my suggestion to u dt plz dnt buy ds product else u also have to pay dt mch prblm bcz ds is nt only me my frnds also gtng so mch of problm regardng ds phn evn der is no service centre for ds phn..so decide before gng for ds n save ur money n frustation..thnk u..:)",
            "date": "16 Nov 2014",
            "name": "Shruti Kumari",
            "stars": "1 star"
        },
        {
            "comment": "i loved this phone . there is no problem as written in review list just buy this you will enjoy the . You will love surely .A superb phone at 12,999/- its great to phone like this",
            "date": "16 Nov 2014",
            "name": "Vishnu Athreya",
            "stars": "5 stars"
        },
        {
            "comment": "Decent Phone. Nice Touch. Okay Battery. Good to hold. Fits well in the hand. Aptly sized. But, very bad sound quality. Sad choice of ring tones.",
            "date": "16 Nov 2014",
            "name": "Ajay Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "I got my phone. I really feel great to have it with in the time limit and the product is awesome. I got my phone. I really feel great to have it with in the time limit and the product is awesome. I got my phone. I really feel great to have it with in the time limit and the product is awesome.",
            "date": "16 Nov 2014",
            "name": "Aarun Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is too good...no words to express.. only problem is battery backup. but I still suggest to buy this phone.",
            "date": "16 Nov 2014",
            "name": "vishal mahajan",
            "stars": "5 stars"
        },
        {
            "comment": "The phone work great and battery backup is better that IPhones and Samsung phones. Give a battery backup on 2g - 24 hrs and 3g - 20 hrs, Moto does not have any lag issue and no overheating.. i would recommend every one to go for this as this will not make a hole in your pockets but still look styles.",
            "date": "16 Nov 2014",
            "name": "Benjamin James",
            "stars": "5 stars"
        },
        {
            "comment": "Ordered last night Nov 11 and received at nov 14 PM today! Fantastic delivery. Couldn't keep up with the tracker's speed :) they said that the product will delivery on 17th Monday.........again the product was delivery on 14 nov keep up with the tracker's speed thank you flip-kart I have brought Motorola form filpkart it was very good to have in hands. The product was very good with no damage. Thank you flipkart.",
            "date": "16 Nov 2014",
            "name": "MANOJ KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product with almost all the features that you are looking in a android smartphone within this price range. Its as simple as that !",
            "date": "16 Nov 2014",
            "name": "Anu Das",
            "stars": "4 stars"
        },
        {
            "comment": "Received it in perfect packing. No problem with the setting and other things. I am using nexus 5 and this phone have similar features except the slow processor and higher weight. I would recommend it to anyone with a budget below 15000.",
            "date": "16 Nov 2014",
            "name": "opkedia",
            "stars": "5 stars"
        },
        {
            "comment": "Express delivery by flipkart within 2 days Best product in the price range If you are looking for HD screen, good front and back camera quality, internal storage, dual sim, good looks, android kitkat. Then go for it.",
            "date": "16 Nov 2014",
            "name": "Raj",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Phone in this price. Love to have Moto G. Camera is good Mobil speed in good.",
            "date": "16 Nov 2014",
            "name": "vikas modh",
            "stars": "5 stars"
        },
        {
            "comment": "got this mobile very late due to courier issues,really this mobile is good one for the price limit within 15k, go for it.",
            "date": "16 Nov 2014",
            "name": "Govind Pramod...",
            "stars": "4 stars"
        },
        {
            "comment": "Had opted for express delivery paying additional amount to get the delivery of Moto G in a day. Delivery happened in 4 days. Cust care never had an idea on delivery date and time post delay, they gave courier contact# which puts on hold for infinite. I hope God is saving me now....",
            "date": "16 Nov 2014",
            "name": "Tarun Bhadauriya",
            "stars": "1 star"
        },
        {
            "comment": "First of all there is no issue with Flipkart delivery . I got my product the next day of my order and of course in a good packing. Thank you flipkart. Coming to the Moto G 2nd gen. Those who worry about 1gb ram in Moto G 2nd gen. I tell you just dont worry about it. It is good enough for all apps and multitasking has no lag. Just go for it. Primary camera is good and front camera is decent. Battery is also good but takes sometime to charge. Internal memory of 16 gb is great advantage for the phone.",
            "date": "16 Nov 2014",
            "name": "Sulthan Khan",
            "stars": "5 stars"
        },
        {
            "comment": "I buy this product in diwali offers at sbi debit 10% off (1) best phone best features ever (2) smooth phone and graphics are more better (3) due to price list its so better (4) not looking like china phone (5) best thing is that its a water prof proble is that its have poor battery backup in a dual same but in a single sim no problem some time heating problem when play heavy games best service ever flipkart",
            "date": "15 Nov 2014",
            "name": "Imran karagathra",
            "stars": "4 stars"
        },
        {
            "comment": "Battery back up which is the most essential thing is worst,it hardly gives 4-5 hrs of back up even I don't use internet & make or attend limited no. Of calls after full charge,it's very strange to tell that It looses all charges overnightly.It is a 15 day product & I am using battery saver also.",
            "date": "15 Nov 2014",
            "name": "Debashis pattnaik",
            "stars": "2 stars"
        },
        {
            "comment": "eveything is good about this phone except the phone hangs many times and this problem was not ocurring in moto g 1 gen as i have used that phone also...though everything is same except for camera and size...high end games like asphalt 8 stops midway ..and when i called moto service center they told me to not play that game in future (same with real cricket)..so if u want to play high games its a big NO...",
            "date": "15 Nov 2014",
            "name": "deepanshu verma",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using it from last 2 months. Overall performance is great. But there is pros and cons to it.All pros have been listed by company. Here are some of the problems with the phone 1. With 3G battery drains like usain bolt's 100m race and device heats up a bit but not too much.This problem exist in every device which runs on 3G . 2.In 3G touch doesn't work as smoothly as it works in 2G. Some distinguished feature that stand out are 1. Camera is excellent compared to other company like sony's 8MP quality is really good. Flash works very effectively. 2.All popular android games run flawlessly,I am not talking about big games like FIFA 15. 3. Perfect size to fit in hand and quite light. 4. Display is brilliant compared to micromax phones. ALL other specification mentioned in description is upto the mark. If you are first time android user then it's best phone to choose. Guys who are confused between xiaomi and motorola,don't go for xiaomi especially if you have something important data in your phone for security purpose. Overall considering all factors I would describe this phone in one word as AWESOME.",
            "date": "15 Nov 2014",
            "name": "Mohit Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the moto g 2nd gen. in certain aspects such as its camera, video quality, sound quality, sleek design and many more. but there are certain drawbacks which I encounter while using this phone, sometime camera function hanged the mobile phone, battery backup is also not up to the mark. video call option is not there while making a call via sim. if these drawbacks is rectified then it is the best phone in this price range.",
            "date": "15 Nov 2014",
            "name": "MIRJA GALIB",
            "stars": "3 stars"
        },
        {
            "comment": "Hey dude even I was confused like you a month a ago. But I've gone for moto And my reason is that Asus zenfone is quite an awesome phone in its budget and its UI is also way better than stock android. But the Intel chip under the hood even though its powerful it's battery hungry compared to the snapdragon in moto. I mean ya even this phone has less battery stand by but lemme tell you at least heating issue is not present. Its just warm that phone actually heats a lot when you use it a lot for navigation or gaming or HD video playback. Well, all I wanna say is heating issue is a bad thing for both phones and health. For phones because battery and chip set life decreases and health coz the radiation coming out will be even more stronger as the battery drains fast resulting in faster transmission making it harmful( not literally till you die) but just mentioning. But trust me there is no regret in both the phones. Any of the both just makes you satisfactory for the money you spent.",
            "date": "15 Nov 2014",
            "name": "MURUGESAN KUTT...",
            "stars": "5 stars"
        },
        {
            "comment": "First hats off to flipkart's service. I orderd it on 30th oct. in morning and got it on 1st nov. at around 4in evening. Now about phone..i was in love with this and its previous version from start.I'm writing this review after using it for about 1week. This is my first smart phone.Now about phone... 1) Its charger is not having USB cable while most of other companies provide it. 2) Charger heats up like anything after charging for about an hour. 3) WiFi connectivity is not that good.It took me around 1and half hour to download asphalt 8,while my brother downloaded it on his Asus Zenphone in about half hour on same connection. 4) Battery backup is ok ok. 5) Asphalt 8 runs on it smoothly but after playing 5-6 races device heats up and game shuts down and doesn't start after that till device cools down. 6) It would've been great if RAM was little more. If i've to recommend it to someone then i would also suggest them Zenphone 5. Its screen is brilliant.. I played 4K video on it.It didn't run fluently but atleast i was able to see images. On the other hand Zenphone didn't even played sound. And one more thing its AnTuTu Benchmark score was fluctuating between 17500 to 20k.",
            "date": "15 Nov 2014",
            "name": "Sarang Tarlekar",
            "stars": "4 stars"
        },
        {
            "comment": "Its a good phone worth rs 13k. Everything is good except the background noise in the earpiece during the calls. I replaced my phone but still the problem persists, I think its the problem with the whole batch. I have again requested replacement, will post my review after that.",
            "date": "15 Nov 2014",
            "name": "Anshul Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Great Value for Money- delivered well in time. Would recommend the product to anyone looking for a VFM phone.",
            "date": "15 Nov 2014",
            "name": "Prasad Mopidevi",
            "stars": "5 stars"
        },
        {
            "comment": "Good but also have some backdrops. Battery gets heated up easily and when you use multiple apps also it will get heated up. Phone dialer is not perfect and file manager app should be inbuilt showing internal and external storage. Rest everything is good for at this price. It is almost similar to samsung grand and also better than grand.",
            "date": "15 Nov 2014",
            "name": "Chakravarthi...",
            "stars": "4 stars"
        },
        {
            "comment": "The best Fone ever i purchese.My deciesion was best reply by fone performance.Audio is good video is good, apps are good, perfomrance is sooo good.Best of Google Thankx",
            "date": "15 Nov 2014",
            "name": "Nikhil Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Best phone in this class. Full value for money and extremely light weight but fully loaded.Exceptional sound. Cons: Battery Backup Lot of moto apps. Poor earpiece.",
            "date": "15 Nov 2014",
            "name": "NIKHIL GUPTA",
            "stars": "5 stars"
        },
        {
            "comment": "over gaming leads to heating its normal data cable could have provided charger s good camera , other accessories are good screen, back case s good 1st update to get for moto g thats good",
            "date": "15 Nov 2014",
            "name": "kalyan",
            "stars": "5 stars"
        },
        {
            "comment": "good product very happy that moto g s going to get first android 5 version update data cable could have provided including headset and charger...",
            "date": "15 Nov 2014",
            "name": "kalyan",
            "stars": "5 stars"
        },
        {
            "comment": "Please do not buy this phone at all its the worst phone... i believed the reviews n bought this phone its battery sucks 2 oclock in the afternoon i charged it 100% n by 6 o clock it was empty i was using only wahtsapp n palying candy crush... otherwise also it drains fast.. network reception is 3rd class.. ace duos gets network even at village but on the same place moto does not show any network.. its the worst phone please do not buy it at all please.",
            "date": "15 Nov 2014",
            "name": "Jagruti Nikam",
            "stars": "1 star"
        },
        {
            "comment": "Let me give you a honest review of moto g second generation 1)the display is excellent in this price tag.the colours are quite good on the screen. 2)due to stock android the processing.Hence 1gb ram is sufficient 3)moto g second generation is one of the first phones how to get new android update even faster than my nexus 5 4)coming onto the camera.The clarity is average but focud is really good. 5)battery life is average. 6)build quality is good.no overheating problems. PS-i'm nexus 5 owner and found moto g very good.Hope this review is helpful",
            "date": "15 Nov 2014",
            "name": "Jasmeet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Guys I just wanna share my bad experience about this phone and do not want anyone else to face this kinda experience again. I got a manufacturing defect on the phone and I realized this after 30 days. So obviously I can not contact flipkart (they are hell bent against making any kind of exceptions to the 30 day policy) so I gave my mobile to the service center for part replacement. It has been three weeks so far without a phone. The service center is Sri Sai Communications in Secunderabad and they have three numbers and no number works. I called Motorola they said that the part is not available for replacement. So I asked them timeline when the phone might get back to me and they are not sure about that. I wish there was a zero rating too so I can mark it for this product. I wrote to the zonal manager of Motorola and no reply back from him too. I called flipkart again and they again said waioot for another week and see. Guys 4 weeks without a phone these days can you imagine .... and no one is taking ownership of the issue. I am thinking about going to consumer forum for the issue now. Phone is considered to be a emergency device now and I am without it for 4 weeks( still I do not have the mobile) ... I am completely at the mercy of the service center folks now .... Guys if you wanna risk your money experimenting about the mobile then go for it otherwise I suggest that buy some other phone whivh has good network of service centres in the country.",
            "date": "15 Nov 2014",
            "name": "Rajesh Adluri",
            "stars": "1 star"
        },
        {
            "comment": "I got it on exchange for nokia asha 206 an year old bought from flipkart an year ago. As soon as i got the box i found out: 1. phone looks sleek and amazing. 2. black fone, white charger and handsfree...what a turn off and NO DATA CABLE. 3. It MOTO and start off was amazing. So there is no menu button it ok...its not samsung...and no camera button phone's fast and amazing. Google support is great. No file manager...but thats the first thing that i got from google play. SO HERE IS THE ACTUAL REVIEW AFTER 1 MONTH'S USE Pros: 10k after giving my old non smart fone, for such an amazing phone kudos flipkart. phone is fast, good graphic support 5 inch screen wow. decent audio op good camera and hd video resolution...good video op its light weighted, fits in my pocket looks classy the back cover is rubber coating i think..gives a good grip for sweaty hands while playing games on the run. google gives me all the updates in one page, date time, cricket score, football updates, news, My location, mode of transport available from my current location to my home, my work schedule also tells me when im getting off from work \"Time to go home\" message comes up!!! :) YES ON ONE PAGE!!!! moto assist helps me a lot. Phone goes on silent automatically if i program it to go off daily at a particular time and vice a versa. and many other features... AND so much memory omg...my phone has 197 apps and games i still have 110gb internal memory left with my 16 gb memcard full of movies and cartoons and other stuffs. cons: Battery is a suck up..drains out faster. I multitask on the phone...play temple run while listening to music and 3g connected...hardly stays up for 4 hours straight.but thanks to power bank IM HAPPY There is no timer on camera. I like clicking picks and i sort of find it irritating. sometimes hangs...but its android...its bound to happen. sometimes...rarely...the fone heats up...i can make omlettes on the mobile cheap earphones...so i use zagg. phone hangs sometimes when i connect to wifi. I have a samsung s4, blackberry, iphone 4s and lumia720. I'll say...MOTO G2 is a gamer's delight..",
            "date": "15 Nov 2014",
            "name": "Rahul Gopalakr...",
            "stars": "5 stars"
        },
        {
            "comment": "Despite all the hype around it, the handset is slow and kept begging to restart. Till today when finally it has crashed to become a brick. Doesn't start, can't use. All my data is lost forever.",
            "date": "15 Nov 2014",
            "name": "Prashant Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is classic phone. i am very happy with this product. If you want to take mobile upto 13000 Rs. this is best ever phone.",
            "date": "15 Nov 2014",
            "name": "Mayank Dobariya",
            "stars": "5 stars"
        },
        {
            "comment": "Fast, Handy, Durable Three awsm features of MOTO G2. After using it for a month i can say it's a decent deal to get moto g2. Just hoping for 2GB moto G and little bit slim piece.",
            "date": "15 Nov 2014",
            "name": "Amitkumar Parmar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is nice and all the applications works very well till date. Black colour looks very nice instead of White",
            "date": "15 Nov 2014",
            "name": "Mayank",
            "stars": "4 stars"
        },
        {
            "comment": "nice phone guys but battery backup just ok , all apps running smoothly, battery last for one day only. i have bought this phone on airtel offer, but i didnt avail that offer so plese flipkart help me to avail that offer quickly",
            "date": "15 Nov 2014",
            "name": "charan",
            "stars": "4 stars"
        },
        {
            "comment": "Reasons to Buy !! Excellent camera - more than expected First-come Updates :D Battery Power Surprisingly Fast You will never get disappointed on its purchase!@!",
            "date": "15 Nov 2014",
            "name": "Thiyagarajan...",
            "stars": "5 stars"
        },
        {
            "comment": "i bought moto g2 on 3nov..and it is very smooth.. i have played asphlat 8 and dead trigger 2 and i think this phone is best in 15k as compared to 20k phones... now just waiting for lollipop update in india.",
            "date": "15 Nov 2014",
            "name": "sukh ghumman",
            "stars": "5 stars"
        },
        {
            "comment": "Bought two Moto G 2nd Gen on Big billion day. One phone is okay even though did not meet the expectation However I had the worst experience with Flipkart The phone started loosing network conectivity and raised a complaint against it. It took 1 month to days to resolve the issue. Customer support people told that the phone will be replaced on or before 29th October 2014. I got this information on 18th October 2014. I had to format the defect piece and keep it ready for pickup. DID NOT KNOW WHEN WILL THEY PICK UP. I did not have a phone till then. On 29th 12.44 PM, I got a message saying your product has been dispatched for delivery. 12.45 PM i got another message saying you rejected the product.!@#$ Again started battling with Flipkart. Then finally November 10, 2014 they sent me another phone to replace, a defect piece. I could not here anything but the called at the other end could here me. Same time voice for media was working correctly. Again started interacting with customer support. Finally yesterday that is 14th November 2014 they took the product back and I have to wait for my refund now. Also I need to search for another phone. From the day I choose to buy a phone in Flipkart, I am just like a person without mobile. The issues in the phone was: 1. Network drop. Even on of my relative bought Moto E where he is also having the same issue. 2. Extream heat generated. Especially when you use internet or camera 3. Camera is average 4. Voice disturbance during calls. Completely disappointed with Flipkart. Goodbye Flipkart.",
            "date": "15 Nov 2014",
            "name": "KSB",
            "stars": "1 star"
        },
        {
            "comment": "PLZ DON T BUY DIZ PHONE *POOR DISPLY (LED) *AUTO RORATE NOT WORKING PROPERLY * VERY SLOW MOTO G 2 GEN SIMPLY WASTE",
            "date": "15 Nov 2014",
            "name": "RAJESH",
            "stars": "1 star"
        },
        {
            "comment": "Battery life for Moto G 2 is very poor not sure if its only my phone or all of MOTO G 2.i have charged the battery till 85% and then swtiched off the phone.when i truned it on after 10 hrs found that battery has completly drained out.How can battery get drained out whne i have not used the phone at all.This same happned 4 times now.",
            "date": "15 Nov 2014",
            "name": "Reema Pasanna",
            "stars": "1 star"
        },
        {
            "comment": "I am satisfied with the performance of the Phone except the battery discharging a little bit speedily. Also I would like to mention that the services of the Flipkart are very much timely and customer friendly. My humble advise to the purchaser of the phone is please purchase the pouch ( I also purchased through Flipkart) as it is very much safe & hygiene place to keep the mobile.",
            "date": "15 Nov 2014",
            "name": "Wupadhrasta NS...",
            "stars": "4 stars"
        },
        {
            "comment": "mobile ki battery ka problem hai charging karte samai battery garam hona jaldi se rechanging hota hai 5 to 10 minutes game play karte hu kuch song sunta hu morning 8:50 ko ghar se nikel ta hu 2:30 ko mobile charging karna parta hai kya problem hai bhai pls resolve this problem fast . i was received the product Mon, Nov 03, 2014 and now i was complaning problem now saturday 15 Nov 14",
            "date": "15 Nov 2014",
            "name": "ravi singh",
            "stars": "1 star"
        },
        {
            "comment": "This Web site not stand on offers given on when time time of purchase . And customer service is not good.",
            "date": "15 Nov 2014",
            "name": "Ramesh Kambham",
            "stars": "1 star"
        },
        {
            "comment": "Good Product, Fast Delivery by flipkart. Once again flipkart made it. Sound Quality and Camera is amazing.",
            "date": "15 Nov 2014",
            "name": "Himalaya Garg",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this product on 11th Nov evening and received it on 13th Nov afternoon. Delivery was good, nicely packaged. Now coming to its pros and cons: pros: -Nice price range -Premium looks -Good solid body with gorilla glass 3 which is almost scratchless -5 inch screen -phone is water resistant (it can endure everyday water splashes and we can also easily talk in rain) -Very smooth -Vanilla android experience and will get an update to Android Lollipop -Rear camera is good in low light conditions also -Battery life is good. Lasts me a day with normal to heavy usage. -Stereo speakers are great and loud Cons -Ram is just 1GB so when I'm playing heavy games and I come out of the game and go back to it, the game restarts -sometimes due to ram the launcher also restarts. but it takes only 1/2 a sec to restart so its not a big issue -front camera is not that good In the end I would suggest that you should go and buy this product if you have a range between 10-15k. According to its price range the product is good enough.",
            "date": "15 Nov 2014",
            "name": "Pranshu Batra",
            "stars": "4 stars"
        },
        {
            "comment": "Exactly after 34 days of purchase of the product, suddenly I am getting screen display problems. Even the screen is ON the there is a flicker like dim and dip of the screen which hinders operating the phone. Phone was never dropped or put in water, but still the issue os screen flickering is happening. Hence I can rate this product only 1",
            "date": "14 Nov 2014",
            "name": "Sridhar Gopalachar",
            "stars": "1 star"
        },
        {
            "comment": "First of all I thank Flipkart for the next day delivery without paying any extra bucks. Booked the phone at 1 PM and got next day early morning :) Now about the first look of new Moto G - A stylish, classy phone with so many features included for just 13K ( promised early Android Lollipop update made me choose this phone ahead of Micromax Nitro ). It looks like a high end phone. I'm using the phone for just 2 days. So it is too early to make a comment about the performance of the phone. Will update about the pros & cons soon!",
            "date": "14 Nov 2014",
            "name": "Sanoop P",
            "stars": "5 stars"
        },
        {
            "comment": "Its a best phone having a combination of all features in reasonable rate. It also working great. I appreciate this mobile phone. \\",
            "date": "14 Nov 2014",
            "name": "Snehal Choudhari",
            "stars": "4 stars"
        },
        {
            "comment": "Everything in this product as per specs..but it need to improve with battery performance and sound quality. Display is good. Camera Quality is fine Compact to handle But Only problem with its battery..drains very quick, But whatever it is I LOVE MY MOTO. Because it is MOTO.",
            "date": "14 Nov 2014",
            "name": "SenthilPrasath A",
            "stars": "5 stars"
        },
        {
            "comment": "1) I have recently purchased one black moto g2. But while opening the box I found that all the accessories are white which is quite unusual. Can it be replaced with all the black accessories? 2) I had to wait three days just for the information that accessories will be of white color always and the phone can't be change either. Well thats not a biggie but it is biggie what was waiting for me. I put the phone in charge but it can't be charged. Its always showing 0%, the indicator goes on and immediately goes off. I had to wait three days just for that piece of information, how long will I have to wait now for this thing to short out?",
            "date": "14 Nov 2014",
            "name": "Jagabandhu Paul",
            "stars": "2 stars"
        },
        {
            "comment": "Hi, I don't know why bill copy was not send to me for purchase of this mobile. over all everything is working fine for Moto G 2nd gen",
            "date": "14 Nov 2014",
            "name": "Jagmeet Suman",
            "stars": "3 stars"
        },
        {
            "comment": "THIS PHONE IS ONE OF THE BEST PHONES YOU CAN BUY UNDER 15K. I RECENTLY BOUGHT THIS PHONE AND I'M REALLY HAPPY WITH IT. FOR A CASUAL USER LIKE ME WHO DOES NOT PLAY MUCH GAMES ON MOBILE ITS OVERALL PERFORMANCE IS GREAT. NOWHERE I FELT LIKE IT NEEDED MORE RAM OR BETTER CAMERA, IT RUNS ON STOCK ANDROID THE UI IS VERY SMOOTH. IF YOU ARE PLANNING TO BUY A GOOD SMARTPHONE PLEASE KEEP IN MIND NO PHONE UNDER 15K WILL PROVIDE YOU WITH ALL THE FEATURES. ALL WILL HAVE SOME CONS AND SOME PROS, SO FOR ME THE BEST PHONES UNDER 15K ARE 1. MOTO G 2ND GEN 2. ASUS ZENPHONE 5 16 GB VARIANT",
            "date": "14 Nov 2014",
            "name": "AHMED MUSTAFA...",
            "stars": "4 stars"
        },
        {
            "comment": "Bought it as i have to maintain two numbers now and needed a dual sim phone, and moto g was the right choice. with gen 2 u get it upgraded to 4.4 and extendable memory to. I used a S2 for quite long so G2 feels a little big and heavy. Still all in all a good phone for the price.",
            "date": "14 Nov 2014",
            "name": "Harpreet Singh...",
            "stars": "4 stars"
        },
        {
            "comment": "i purchase motoG2 phone,not working already complaint in flipkart customer.i want replace new phone",
            "date": "14 Nov 2014",
            "name": "krishna kumar",
            "stars": "1 star"
        },
        {
            "comment": "fantastic mobile in android series,specifically in moto .very good design and speed.Thanks to flipkart for their online selling and better delivery",
            "date": "14 Nov 2014",
            "name": "shivamvinoth",
            "stars": "4 stars"
        },
        {
            "comment": "Firstly, software of Moto G was failed. Later once we have asked to replace it, it was found to be phone with old screen gaurd.",
            "date": "14 Nov 2014",
            "name": "Kapil Gautam",
            "stars": "2 stars"
        },
        {
            "comment": "I gor this product with 4 days of my request for moto G-II.Quick efficient service even to a little remote part ! The Mobile,It's a wondrful piece and definitely worth the money you pay",
            "date": "14 Nov 2014",
            "name": "S.P.CHAUKIMATH",
            "stars": "5 stars"
        },
        {
            "comment": "I really enjoying this phone as much as and after four days i really felt that i have a good phone in my hand with good price because the phone has almost good camera not only back but also front and front camera is seems like back camera so that is awesome and the size is of five inch and battery back up is also good but when playing the game it is reducing fast but it is common in all mobile so i am not afraid of that problem and overall performance is very good............ My recommendation is that , If you want to buy this phone so i think you should go for it because the other are not provide this type of gadget in this price. i Really happy with this phone.",
            "date": "14 Nov 2014",
            "name": "Chirag Parmar",
            "stars": "4 stars"
        },
        {
            "comment": "Bad quality touch screen (gorilla glass). this will became your blunder mistake.Non supportive customer care .There are on mission on giving any type of warranty even it is genuine. Repair part are so costly that you can buy new phone in it . \"PLEASE DON'T BUY IT\" .",
            "date": "14 Nov 2014",
            "name": "anirudh parmar",
            "stars": "1 star"
        },
        {
            "comment": "It is a very nice deal for such a price.... the phone is smooth, feels nice, no problems at all, doesnt heat up, battery back up is fine... I got a delivery of the phone a day before.. and that really good.. but the Delhivery courier service was bad as they were not able to provide me the info of where the package.... However the phone works Great....... cheeeeeeeeeers...",
            "date": "14 Nov 2014",
            "name": "K%20Lakshman%2...",
            "stars": "4 stars"
        },
        {
            "comment": "I bought it because the nexus 6 was not announced and want to check it out before buying moto x. But now i cant let go of my Moto G. fantastic value for money. I don't like the Nexus 6. And well the Moto X can wait. I am fan of the Moto G.",
            "date": "14 Nov 2014",
            "name": "advpramodr",
            "stars": "5 stars"
        },
        {
            "comment": "First of all Flipkart tooks 7 days to deliver this product Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -Not catching the Wifi Signals even my Micromax a117 catch the same signal -And battery performance is poor",
            "date": "14 Nov 2014",
            "name": "Rahul Dhawan",
            "stars": "4 stars"
        },
        {
            "comment": "Firstly i received damaged product ,problem in ear piece of phone ,speaker vibrates and cracking noice in full volume. Thankfully Replacement accepted and waiting for it . OK coming to the review.I owned MOTO G 1st gen.It was awsome for its price.Still good deal for the price 9999. Advantages of MOTO G Good display (great display for the price),same for camera(since 5mp details are low but color reproduction is gr8),good sound(even its mono back speaker i find it loud and clear than moto g2) Advantages of MOTO G2 Great display compared to moto g(i found color tone of MOTO G2 is warm and MOTO g is cool) Gr8 camera 8 mp serves its purpose(more details than moto g and far better ) Gr8 design and feel,feels slimmer and lighter than moto g(even though by specs its slighly thicker and heavier) about graphics and all....its mid range snapdragon 400 powered device...but no lags and issues...far better than samsung and all phones upto 25k price range can play almost all games...for heavy gamers go for moto x. Disadvantages of moto G I say its speaker quality poor....very poor(even though more instrument music is audible its still far behind moto g So in simple for guys looking for new phone in price range 10k to 30k 1.usage moderate gaming and lots of social media normal day to day camera usage this is the phone 2.Heavy gamer more techy? wait for MI4. Moto x? still wait...i expect price to be drop soon...right price be 26k ...32k for 10.7gb useable memory ? (why? a phone with 5.2 screen ..u might watch and store lots of hd videos and play heavy games with about 1.5+ gb size,its not sufficient",
            "date": "14 Nov 2014",
            "name": "Muhammed Mubeen",
            "stars": "4 stars"
        },
        {
            "comment": "For the price you pay. It is the best in class. I have friends who have other phones. they are good. But Moto G2 is outstanding. In all the senses. Relatively. Without a reference scale, the Moto G2 has amazing performance. OI would only wish one thing. The processor to be a little more, than it comes with. I recommend this product. -Peace.",
            "date": "14 Nov 2014",
            "name": "Sunny",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is a real game changer for Motorola A nice phone with good specifications ,good battery backup, no hanging, cool design, over all I'm very much impressed with this phone, Thank you Motorola , thank you flipkart",
            "date": "14 Nov 2014",
            "name": "sreeraj s",
            "stars": "5 stars"
        },
        {
            "comment": "When i received the product then phone was working excellent bur phone charger was not working at all, flipkart please change the charger or resolve my problem",
            "date": "14 Nov 2014",
            "name": "pravin sharma",
            "stars": "4 stars"
        },
        {
            "comment": "If u are planning to buy this product don't think order... Best in its class. Great display + Battery 1 Day backup + Decent Camera + Future promised upgrade what else u want.",
            "date": "14 Nov 2014",
            "name": "Joy Patel",
            "stars": "5 stars"
        },
        {
            "comment": "every thing is good only thing is when we are using camera then back side little heat is there.in this range 12999/- this one only the phone available with very good feature.",
            "date": "14 Nov 2014",
            "name": "saket tiwari",
            "stars": "4 stars"
        },
        {
            "comment": "Ph. is of 5 star rating but only draw back is call recording apps not working, I was tried almost all call recording app. for this Ph. but only mic recording is done speaker omited every time.",
            "date": "14 Nov 2014",
            "name": "Niteen Bhatt",
            "stars": "4 stars"
        },
        {
            "comment": "I feel good to use this phone. I have 1 issue once I bought this phone i noticed that flipkart was giving 2 month 3G plan for airtel connection at free of cost I am getting.",
            "date": "14 Nov 2014",
            "name": "Puneet Soin",
            "stars": "3 stars"
        },
        {
            "comment": "NO WORDS FOR THIS PHONE AND THIS IS SIMPLY AMAZING.. I LIKE IT The Moto G (Gen 2) runs Android 4.4.4 KitKat out-of-the-box, and the company has confirmed an Android L update is on the way. The device has a number of Google apps preloaded, including Gmail, Google+, Google Drive, Google Photos, Keep, Hangouts, Search, Google Maps, Play Games, Play Movies, Play Movies, Play Books, and Play Newsstand. The Moto G (Gen 2), much like the older version, uses on-screen navigation keys.",
            "date": "14 Nov 2014",
            "name": "JOY RAUT",
            "stars": "5 stars"
        },
        {
            "comment": "Performance of this mobile is not up to expectation .please look out for CPU over heating during WiFi use and data use,while playing games. it would be good if the battery is more than 2070mAh",
            "date": "14 Nov 2014",
            "name": "Virinchi Nani",
            "stars": "3 stars"
        },
        {
            "comment": "Its amazing phone. Love the fact that now can get Lollipop update. Just got it today. So can't really help with pros and cons at this early stage. But so far so good.",
            "date": "14 Nov 2014",
            "name": "Shagufta Almel",
            "stars": "5 stars"
        },
        {
            "comment": "Very bad service by flipkart. the product was expected to be delivered by 13 Nov and it not delivered to me yet. i have no information where the product is? Flipkart and their logistic partner are playing with the package. I will not recommend flipkart to anyone.",
            "date": "14 Nov 2014",
            "name": "Neeraj Pandey",
            "stars": "1 star"
        },
        {
            "comment": "best phone in the range of 12-15 K upgrade-able to android L (5.0) RAM should be slightly on higher side but 1 GB is also fine.",
            "date": "14 Nov 2014",
            "name": "Rahul Dwivedi",
            "stars": "5 stars"
        },
        {
            "comment": "its a good handy phone.especially the front camera.And nice delivery flipkart in two days ..very good...happy with the buy",
            "date": "14 Nov 2014",
            "name": "Arun",
            "stars": "5 stars"
        },
        {
            "comment": "Good one. I was expecting a default data cable with the product. To my surprise the pack included just the phone and the charger, Flipkart service a good. I placed the order and I got the phone on the next working day.",
            "date": "14 Nov 2014",
            "name": "Dhivya Shunmugam",
            "stars": "4 stars"
        },
        {
            "comment": "At 13k the product is very good for its big screen, display quality and build. Even though Motorola upgraded from 5MP to 8MP, the quality of the photos still not that good. The battery is decent. Now waiting for the Lollipop update.",
            "date": "14 Nov 2014",
            "name": "Sagar Sivan",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome mobile phone(Moto G 2nd Gen). Last month I was purchase this Mobile i.e. Moto g 2nd gen. Performance wise very good. GPS system is also good. If we talk about Camera then have a best quality as well as secondary camera is also good. Picture quality as well as video quality is very good. Talking about Battery backup is good compare to average mobile. But I can’t say that ki Battrey backup is very good. 1 day Battery backup. But all features are tooooo good.",
            "date": "14 Nov 2014",
            "name": "Govind",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone. By great I want to mean that within Rs.13000/- it gives all the feature of premium mobile. One thing I have noticed that the form factor of the phone is a bit different from my Galaxy Grand Duos (1st Gen). In portrait position horizontal screen size is less than Galaxy Grand. This is an added benefit for people with small hand. One-handed operation is very easy due to that form factor. I don't find any of the cones described in 1, 2 & 3 stared rating. Let me address some of them below: 1. SIM tray is not accurate in size : In reality, this is not an issue. If you cut down your standard SIM into MicroSIM then only this issue may arise. Because, MicroSIM is not exactly equal to a sized-down standard SIM. 2. Heating Problem : This is the law of physics not an issue. The actual heating part of the phone is processor not the battery. It happens in every electronic device. 3. Volume Rocker : Does not find any issue till now. It up/down volume 5 steps at a time. For instance, to increment/decrement volume from 0% to 100% one have to press 20 times or hold down the button. This is not an issue. This is the technology which provides more control in volume adjustment. 4. Mobile Internet : Please ask your network provider for better services. I have Aircel internet connection and didn't face a single problem. It automatically switches between 3G and 2G network based on coverage. 5. Memory Card : I am using Samsung MicroSDHC 32 GB Class 10 Evo memory card from the very beginning and yet to face any problem. This memory card is full of songs, movies and other things that can be played. (Did you remember the add. of Phillips DVD Player - \"Player anything round and flat\") There is only one cone I have noticed so far that the charging time is higher than my Galaxy Grand Duos. This is only because of the charger's capacity. A charger with higher output can fix this problem. Bottom Line : If you are expecting the WOW features of a 50000/- mobiles in a 13000/- mobile ... then I must admit that \"You are a dreamer\"",
            "date": "14 Nov 2014",
            "name": "Bedanta Bayan",
            "stars": "5 stars"
        },
        {
            "comment": "I am a Flipkart first customer and still my product is not delivered in 1 day as promised by Flipkart.",
            "date": "14 Nov 2014",
            "name": "Virender Beniwal",
            "stars": "1 star"
        },
        {
            "comment": "I brought this mobile 1 month back in Big Bash sale. I got this for around 9900(Incl Exchange and a0% cash back). Mobile performance is excellent.And some customized features from motorola like \"Assist\",\"Migrate\" and \"Alert\" are very useful. Camera both front and back are Excellent. But i disappointed at battery backup :(. Max is 18hrs. Some times we need to charge twice in a day also :( :'( .",
            "date": "14 Nov 2014",
            "name": "KC Raju Vysyaraju",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this product last month. And, its addictive. It's awesome. It's truly a smart phone. There are a few lags sometimes but I guess that can not be avoided in android OS.",
            "date": "14 Nov 2014",
            "name": "P Sirish Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "After using 3 months, I am writing this review. The MOTO-G 1 is much better than MOTO G 2. Various features in 2nd gen is not upto the mark as 1 st gen. The battery is bad, the display is dull, the magnet which hold flip cover is very weak. Only there is improvement over the camera, nothing more. Expectationally high, Price wise high, Performance less. Wish I could exchange it with Moto G1",
            "date": "14 Nov 2014",
            "name": "maheswar pradhan",
            "stars": "2 stars"
        },
        {
            "comment": "I got Best Service by Flipkart for this item to be returned. Initially i thaught i will not get item to be replaced but i love you flipkart to replace the same. Best Site Best Site Best Site Best Site Best Site Best Site Best Site Best Site v v v ..!!",
            "date": "14 Nov 2014",
            "name": "Lalit Goyal",
            "stars": "5 stars"
        },
        {
            "comment": "flipkart packing was good, On time delivery About Moto G(2nd Gen)- It is good phone in price of 12999Rs, When your looking for both budget phone and a smartphone then its for you. How every it will not give you experience of high smartphones. Interface to settings is not that good but ok. It is same like other android phones. Its comes with Corning Gorilla Glass 3 that is some good of it. Video Recording is Not Full HD that is very huge lack in world of All high definition and front facing camera is 2 MP not that good for selfie. Back panel looks good in terms of design but lacks in quality of strength because it may get broken in opening. Front View of mobile doesn't give you any sense about up or down side, Front view is not nice as compare to back side, it seems as contradiction in designs. mobile has good sound quality when your singly watching videos. If u want to get just smartphone experience its ok...but not high end quality.",
            "date": "14 Nov 2014",
            "name": "Harshad Nishik...",
            "stars": "3 stars"
        },
        {
            "comment": "Fine Product with in-built memory,speed,touch censors. best budget smart phone at present in the market.",
            "date": "14 Nov 2014",
            "name": "Venkatesh V Ve...",
            "stars": "4 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Cons android 4.4.4 version not supporting video calling option need to update android version",
            "date": "14 Nov 2014",
            "name": "RAJASHEKAR",
            "stars": "5 stars"
        },
        {
            "comment": "I bought 2 weeks before. Good package and Prompt Delivery by FK. Good phone under 15K Pros: Speed Gorilla glass Memory Light weight Cons: Camera clarity ok, but not upto Samsung's 5MP clarity Outer casing very cheap look.",
            "date": "14 Nov 2014",
            "name": "Mohamed S M",
            "stars": "4 stars"
        },
        {
            "comment": "I'm not happy with Moto G 2nd Generation and even after replacement. Below are the list of problems that I've encountered. 3G will not auto connect if no WiFi available until restart or rebooting the device. This is a major problem and I think it's a glitch with 2nd Generation. Performance issues with the battery as it drains so fast even if you turn off GPS locations and other apps that chew battery. Reducing volume (by pressing down side button) will lead to delay the volume for 10 secs as it will not happens immediately. Due to the performance issues, device freeze for particular period unless you terminate applications. Even I've checked the RAM which is all clean with much space. Finally, requested to replace but the new device has got similar issues even thought few were resolved. Buyers - I would recommend to go for 1st Generation rather 2nd one. Cheers, Trinadh,",
            "date": "14 Nov 2014",
            "name": "Trinadh Uppalapati",
            "stars": "1 star"
        },
        {
            "comment": "Having got a positive impression from lot of people, i have ordered this mobile. 1st time smartphone buyer, that too with the mobile which is worth the money spent. Delighted. As usual Flipkart service it the best.",
            "date": "14 Nov 2014",
            "name": "Sivarama Kkris...",
            "stars": "4 stars"
        },
        {
            "comment": "Hi All, I have ordered Moto G (2nd Generation) on 11th Nov, it reached me by 13th Nov. Its really fast. They have given expected date on 15th Nov. Delivery is very fast. might be because i am in Bangalore. Any how i am happy on that. I don't know why there is a hole on the pack, somebody in between checking the product. There are the chances for loosing the product. Please take care on that. Rest i am happy with FlipKart.",
            "date": "14 Nov 2014",
            "name": "SUNEEL B",
            "stars": "4 stars"
        },
        {
            "comment": "Package and delivery is good. The only thing missing is there was no information what all items i'm going to get in the box. Data cable is missing.",
            "date": "14 Nov 2014",
            "name": "Omveer",
            "stars": "3 stars"
        },
        {
            "comment": "good stuff for the time being in this range camera good, browsing speed is ok I think the cost is kept a little bit higher due to the marketing system",
            "date": "14 Nov 2014",
            "name": "ivan",
            "stars": "5 stars"
        },
        {
            "comment": "service support is bad and poor after sales didn't expect from flipkart.... Cons Battery Drains Quickly within a Day Ram is not Suffcient Rest everything is better",
            "date": "14 Nov 2014",
            "name": "Hitesh Kanojia",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone from flip kart on 1 September and received it on 4sep. My Experience is - 1. Its fell very good in hand its soft and comfortable in hand dosn,t fell big as other phone 2. battery backup is good but not excellent. I charge over night and it remain till next night without any internet use. 3. It has good and loudspeakers. But i am disappointing what i uses in my previous phone 1. It do not have videocall option which i have in my previews canvas phone . 3. It has some problem with 3g network my other phone (xolo opus q1000) work great in my home but moto g has some problem it runs on 2g 4. Sometimes it cellular network do not work for 30 40 seconds. i have to reboot it. 5. in my previous phone call recording apps work fine but it is impossible in motog 2nd gen 5. there is no option in mobile network setting for switching it to 2gor 3g it work automatically that's why i think problem in moto g reception when it changes. 6. stock camera app is not very good. No stock option for browsing OTG storage and 80% time it do not detect it except san disk storage",
            "date": "14 Nov 2014",
            "name": "vipin",
            "stars": "4 stars"
        },
        {
            "comment": "gives u more than one could ask for. the display, moto assist, beautiful front and back cameras..it has it all! no battery issues and most imp of all, its looks pretty :)",
            "date": "13 Nov 2014",
            "name": "Shivani",
            "stars": "5 stars"
        },
        {
            "comment": "NICE ONE,WORKING FINE,COMING TO MOTO(G) NO PROBLEM UPTO NOW... 1. Screen: Nice, crisp and vivid, but only 720p. With Snapdragon 400, I guess 720p makes more sense than 1080p. It is 5 inches in size but feels compact and usable in single hand. 2. Performance: Android 4.4.4 comes pre-installed. Lag-free so far. Runs Riptide GP pretty well. Should run all games meant for Snapdragon 400. MS Office, Facebook and Google Drive all work fast and fine.",
            "date": "13 Nov 2014",
            "name": "SATYANARAYANA...",
            "stars": "5 stars"
        },
        {
            "comment": "I have to replace the device twice and finally returned my 3rd device.1st one has touch screen problem,2nd unit gave a burning smell while charging and the last one developed some hairline scratches despite of Gorilla Glass 3 protection and suffered frequent network drops and lags.I wanted to get rid of this piece of junk but I regreted that I ordered it on Big Billion's Day.Therefore no refund.But I mailed Flipkart regarding these issues.And after writing dozens of mails they approved my refund. Though Flipkart refunded my money this time my experience wasn't great as after approving my refund they cancelled it without any intimation.So, I have to suffer a lot of pain in writing mails to them regarding final approval of my refund. Only pros that I found... ----------------------------------------------------------------------------------------------------------------- * Latest Android L update *Design *Dual front facing speakers Cons ----------------------------------------------------------------------------------------------------------------- Battery Backup,Camera,Touchscreen freeze,Low quality Gorilla glass,RAM,Network issues...& Many more And yes previously I owned MOTO E I upgraded to this shit as my lovely MOTO E got stolen. And believe me MOTO E was way better than this crap in terms of performance and VFM if you neglect the absence of front cam & flashlight in it. I regret my decision :( Goodbye MOTOROLA... DON'T BUY IT !!!",
            "date": "13 Nov 2014",
            "name": "RAKESH SAHOO",
            "stars": "1 star"
        },
        {
            "comment": "Excellent mobile I want to buy one more mobile to my girl friend !!!!! Superb clarity, Sound effect , voice clearance and Battery Back up . FLIPKART DELIVERY : IT WAS AMAGING WITH IN 1 WORKING DAY I GOT MOBILE ON HAND .. MY REQUEST PLEASE SALE ORIGINAL AND GENUINE PRODUCTS FOREVER.DONT CHEAT ANY ONE . THANKS FLIPKART",
            "date": "13 Nov 2014",
            "name": "SOMASHEAKAR VK",
            "stars": "5 stars"
        },
        {
            "comment": "wrost courier service from flipkart.not delivered in single day delivery even they taken amount from single day delivery",
            "date": "13 Nov 2014",
            "name": "sravan kumar p...",
            "stars": "1 star"
        },
        {
            "comment": "This is a shit, as you can guess from the following issues:: 1. Lagging so badly. 2. Hangs on any app and doesn't respond, if power button is clicked it shut down itself. 3. After changing from Delvik to Art, there is an optimization round on each start up (reboot). 4. On enabling data it sometimes show data is on,and sometimes data is off and same case on disabling the data. 5. Camera lagging is also an important lagging feature. Refresh the phone after tapping the home key from camera app (i.e., don't show anything for some seconds) 6. Same thing on every reboots and after many factory resets. 0 Stars 0 Stars 0 Stars 0 Stars 0 Stars 0 Stars (Its important to give rating to post, that's why there is 1 star) Vineet Kumar",
            "date": "13 Nov 2014",
            "name": "Vineet Kumar",
            "stars": "1 star"
        },
        {
            "comment": "ill JBL headset works in Moto G, if yes i need spec.. and type, any 1 help me???. worth for money. But bad in battery back up. taking too much time for charging. Battery back up less then 5 hrs. even in silent mode...",
            "date": "13 Nov 2014",
            "name": "Madhu",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome product...its value for money..it would be good if it has NFC too...flip cart was really awsomeeeeeeeeeeeeee",
            "date": "13 Nov 2014",
            "name": "Rama Raju D",
            "stars": "4 stars"
        },
        {
            "comment": "this is the reliable, better,and help full ,handy product for this modern generation,I am glad to know that the motorola lanch this smart product for this ,and flipkart reach this product to me at a valuble and chip rate",
            "date": "13 Nov 2014",
            "name": "Raju Guria",
            "stars": "5 stars"
        },
        {
            "comment": "Hi i have bought the new moto g 2nd generation recently and its taking too long to get charged.. Can anyone tell me how much usual time does it take to get charged when battery is almost NIL.. Also, does only original motorola usb cable will work with the phone?",
            "date": "13 Nov 2014",
            "name": "apoorva tiwari",
            "stars": "3 stars"
        },
        {
            "comment": "Overall the Moto G is quiet satisfactory. Only problem which i noticed is about the poor built quality of Charger. With use because of bending of wire the charger wire gets cut from the end where it is joining the adapter. It would have been great if the charger provided was and USB charger. I give 4 points, 1 point cut for the charger. otherwise all well. Go for it.",
            "date": "13 Nov 2014",
            "name": "Arun Singh Parmar",
            "stars": "4 stars"
        },
        {
            "comment": "* Voice output during a call is very low * Signal reception is very weak * Display is good * Gaming performance is ok * Build quality is ok * Headset is ok * Satisfied with product but not satisfied with Flipkart customer care. Flipkart should work on that. * Got faulty headset in the beginning. Flipkart people sent me new headphones(of some other company) which were worse. Asked them to change it . Instead of changing it they gave me Rs 500 in wallet by which I cannot buy a decent pair of headphones plus I will have to pay the delivery charge plus I can buy it from the same seller who unfortunately does'nt have decent pair of headphones . Pathetic. NEVER WILL I BUY ANYTHING FROM YOU",
            "date": "13 Nov 2014",
            "name": "ujjawal",
            "stars": "1 star"
        },
        {
            "comment": "Product is Good But the delivery given by person is not good .shipment quality is very low and you will not get any hard copy for ship ment ..........directly what a very production you r buy .....their is no garenty or shop is paying tax for it",
            "date": "13 Nov 2014",
            "name": "Yogesh",
            "stars": "3 stars"
        },
        {
            "comment": "i am very satisfied with this smartphone.. it has everything which i need. thank you Motorola and thanks for flipkart. still impressing me lot. Impressive smartphone",
            "date": "13 Nov 2014",
            "name": "Sushant Jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "Good at all parameters except sound. speaker's used are low quality, annoying to ears during calls n camera also need to have better. With this price tag, I suppose can get better phones since speakers are low graded...main purpose for cell phone",
            "date": "13 Nov 2014",
            "name": "Apurva Mehta",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product value for money. Compares to the best phones presently available in the market. Good performance processor, camera and display. Would be amongst the first few phones to be upgraded to android 5.0.",
            "date": "13 Nov 2014",
            "name": "Francisco Gons...",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product value for money. Compares to the best phones presently available in the market. Good performance processor, camera and display. Would be amongst the first few phones to be upgraded to android 5.0.",
            "date": "13 Nov 2014",
            "name": "Francisco Gons...",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this from over a month now. First of all, I bought this on the Flipkart Big Billion Day. So I got a good price for this. I will not mention that here. But Thanks Flipkart for the day. About Flipkart: This time not-so-fast delivery. But, as I bought it on the Big Billion Day, I can understand the reason. About the Device: Pros: 1. Sleek build. 2. Feels of a great quality in-hand. Though not in metal. 3. Great quality speaker. 4. Very good display. 5. Fast processor. 6. Good call quality. 7. Great camera. Cons: 1. Ir-replaceable Battery. 2. Need to open back cover to insert Micro-SD or SIM card. 3. I don't know why, but I get only around 750-800 MB of total RAM. out of which 400-500 MBis always in use. This was the condition when it was new and I didn't install any app. If Android is using reserve memory, then I should be getting the remaining memory free, but still it is used up.",
            "date": "13 Nov 2014",
            "name": "Samir Sahu",
            "stars": "4 stars"
        },
        {
            "comment": "................................In good quality........................................................................................................................",
            "date": "13 Nov 2014",
            "name": "Harianbu M",
            "stars": "4 stars"
        },
        {
            "comment": "I like the all the function of mobile and the clearity of the product and the back of battery. Is also k",
            "date": "13 Nov 2014",
            "name": "swapnil s",
            "stars": "4 stars"
        },
        {
            "comment": "Everyone's reviewed this phone. So I'll simply give a personal review than a spec or tech review. It's a great phone. Works damn smoothly. Good camera. Good sound. Good display. Don't take my word for it though, try it out for yourself. Alternate options: Looking for higher spec's go all in for the Moto X (2nd gen).",
            "date": "13 Nov 2014",
            "name": "Darryl Vaz",
            "stars": "4 stars"
        },
        {
            "comment": "In my opinion, I would say the Moto G(2) would be a better device .but plz tel me hw can I keep my battery full day.. I can't keep charge for every 4 hours.. I love dis phone.except battery..its battery backup is too bad.",
            "date": "13 Nov 2014",
            "name": "sudharsan kri...",
            "stars": "3 stars"
        },
        {
            "comment": "Bought the MOTO Gen 2 Dual Sim and must say I am very happy with it. Reliable product , got all the productivity features I want plus a decent camera . I got it exchanged after a horrible experience with Nokia Lumia Windows Phone . Kudos to Android for developing solid smartphones for sensible users and Filpkart for their commitment to customer satisfaction.",
            "date": "13 Nov 2014",
            "name": "JayKay",
            "stars": "5 stars"
        },
        {
            "comment": "30 days replacement guarantee is very good service from wsretail,also flipkart delivery is quite good",
            "date": "13 Nov 2014",
            "name": "sudheer bolla",
            "stars": "4 stars"
        },
        {
            "comment": "it an excellent phone. i works great and faster 1. the ram is good with it's speed 2.camera qualty is good but there is no extra features in camera like threr is no sports mode,face detaction mode and other thereonly panaroma and HDR mode 3.battery backup is ok for gamers it is not good we can play game in full battery backup for 1h only the internal storage is only 12.79gb and for app usage it takes 1.5gb more thann that this is the good phone to buy in low budget with lots of features",
            "date": "13 Nov 2014",
            "name": "vinoth",
            "stars": "5 stars"
        },
        {
            "comment": "it's a awasome phoe...value for money...camera is too good...outstanding look.......battery is fine....",
            "date": "13 Nov 2014",
            "name": "Santanu Baidya",
            "stars": "4 stars"
        },
        {
            "comment": "I m using this phone last 2 months. I got this phone on 11th September. This is a excellent phone in this range, No lags while playing games like real racing whose setups approx 2gb and it runs smoothly without any issues... Completes normal users needs.. Battery backup is good for me, normaly 2 days with total 8 hrs of listening music and playing some games, chatting and 2 hrs of calling... Excellent product....",
            "date": "13 Nov 2014",
            "name": "Sangram Jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "Bought the mobile 2 weeks back . It does not look like a original gorilla glass, i had some scratches visible initially, and yesterday the display is broken, just fell down from 2 feet. (I had HTC mobile which fell down many times and it is still good). When I called Moto service center, they said it would cost 6900/- and it can only be replaced with display and glass. Don't recommend such a bad build quality product. Even if you put some safe covers it looks bulky as it is already bulky. If you see the display in sun light you could see only the vertical lines in the screen nothing other than that, which is irritating. finally throwed my mobile and searching for some other mobile.",
            "date": "13 Nov 2014",
            "name": "Saravanan N",
            "stars": "1 star"
        },
        {
            "comment": "Awesome mobile, i purchased this mobile last month, its super and my friend also purchased the same mobile. it's mind blowing mobile i downloaded many apps but it working super. i strongly recommend this mobile....",
            "date": "13 Nov 2014",
            "name": "Victor Raj",
            "stars": "5 stars"
        },
        {
            "comment": "Had lot of apprehensions before i purchased. After receiving the product, i am very happy .Received mobile in good packing condition and solid build with value for money features...",
            "date": "13 Nov 2014",
            "name": "SAIKRISHNA KOP...",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G 2nd generation on sept 23rd. Exactly on oct 24th displat got flickered, So reached out Flipkart on 24th and they said you are 1 day out of replacement policy. On 25th display went totally off, so went to service center on same day and after ch ecking they informed me its a problem on their side and so they would replace the display. Its been solid 3 weeks and stiff these guys are refusing to get my mobile back. Like same story my colleague bought same mobile a week after me and he 2 faced same problem. Exactly 1 day after 30 days replacement policy his phone display went off. People be aware about motorola product. I'm not just posting this out of frustation, this guys have launched product without having idea on \"value of our money and service\".",
            "date": "13 Nov 2014",
            "name": "Quality and se...",
            "stars": "1 star"
        },
        {
            "comment": "Display is good and it does not lag.battery life is ok.it has all the necessary features that you require in any decent android phone. so far i am happy with this phone.",
            "date": "13 Nov 2014",
            "name": "HIREN DHORDA",
            "stars": "4 stars"
        },
        {
            "comment": "First to mention is the quick delivery within two days and the tracking method from flip kart, which is very comfortable and satisfactory and time to time updates on the shipment. Moto G 2nd gen is very nice and the product satisfies all our basic needs, right from capturing a nice pic to online payments and long calls. The camera is good, the storage is enough, the performance of the phone is fast for the RAM it has. Its not getting heated up after prolong use, the charge lasts long inspite of keeping 3G on for a long time and browsing the internet. The speakers are not up to the mark, same with the ear phones provided. The ear phones are not the one which you can insert in your ears, which lacks the rubber ring, which would have been better if provided. when wearing and lying down, sure that the ear phones will drop, which is one point to be considered. The charger provided is a normal one, not the one suitable for USB charging. The over all rating is that, best buy for this price. Look out for days when discounts are there to save some amount.",
            "date": "13 Nov 2014",
            "name": "Karthikeyan S",
            "stars": "4 stars"
        },
        {
            "comment": "I got Moto G2 a week ago. I had Moto E previously. The reason i did go for Moto phone again is I had an exceptionally great battery back up experience with Moto E. But the same is not the case with this phone. The given 2070 mAh doesnt even get me through half a day . It hardly lasts for 5 hours with just one hour of 3G usage. The worst part is that if I turn on 3G connectivity battery power drops dramatically quick and the worst of all happens when I plug in the mobile for charging battery power keeps dropping and it takes a hell lot of time to get full charge. Additionally the mobile is heating up while charging. I have to use my mobile very frugally if I had to make it last for more than 10 hours. But that is not why we all buy smartphones and that is not how it works. I really didnt imagine Motorola has built a very good specs with 8MP cam, expandable memory, large screen size , good internal memory and everything around a pathetic battery life. All these are not made good use of if the battery performance is so poor . Wake up Moto !! I would rather buy a new Moto E back again from flipkart instead of this one. Though the specs were low battery was more than decent .",
            "date": "13 Nov 2014",
            "name": "tgbalakumar",
            "stars": "1 star"
        },
        {
            "comment": "Product is good and value for money. Pros: Screen size, Anroid KitKat, Speed, Inbuilt memory, Camara Clarity, Fornt Camera, Dual Sim Worth for money. Cons: Battery capacity is very less. Auto call recorind is now working properly.",
            "date": "13 Nov 2014",
            "name": "Vasanthakumar...",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G 2nd Gen is an excellent phone with good processing & internet connectivity. I have been using this phone since 15 days and no lag in using any applications even with heavy games like temple run & candy crush. Phone is worth for every penny. Only limitation is absence of micro USB charger in pack contents.",
            "date": "13 Nov 2014",
            "name": "Gaurav Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I was excited to buy Moto G, Delivery was on time was pretty happy until I tried to make a call to one of my friend and found the volume is not working tried couple of call with the same problem checked the solution which was provided online by MOTO G in system settings. Just placed an order for replacement. Hopefully my product gets replaced on time. i would rate 0/5 for the product which is delivered to me as i cannot on the web giving it 1.",
            "date": "13 Nov 2014",
            "name": "DS Sandeep Singh",
            "stars": "1 star"
        },
        {
            "comment": "the phone is fine but the charger is not good. as it is not able to connect properly in any of the sockets hence the phone is not at all able to get charged. hence very annoying.",
            "date": "13 Nov 2014",
            "name": "aakanksha",
            "stars": "1 star"
        },
        {
            "comment": "Its really a good product if you see the phone alone but if ask for overall product and accessories, i must tell you Motorola used very cheap material for accessories.",
            "date": "13 Nov 2014",
            "name": "Anoop Chauhan",
            "stars": "3 stars"
        },
        {
            "comment": "Had a great experience buying on Flipkart everytime i purchase this mobile will fulfill all the need that everyone want to have in their mobile Good display Good speed Over all a good smart phone if price drops surely i will buy some more",
            "date": "13 Nov 2014",
            "name": "Sakthimurugan. p,...",
            "stars": "5 stars"
        },
        {
            "comment": "It is beautiful phone, with impressive software and hardware features. Its been more than a month and it never hung a single time. works smooth. If you are switching from Samsung, as it has stock android, absence of some small but basic features like hiding unnecessary inbuilt icons, setting separate wallpapers for lock screen and home screens, no file explorer, no inbuilt navigation app etc. may annoy you initially. Use black wallpaper to save battery which may be concern to some buyers. (As per my observation it has significant impact on battery life to be honest). The in-box charger charges phone at quite good speed. If you are a nominal user of internet(3G) your battery may last more than 30 hours. If you are always streaming videos and are on phone for internet, it is not at all for you as you will feel that you are always out of charge. *It is difficult (rather impossible for me) to charge from PC/laptop using USB cable. It just doesn't work for me. So you may be needed to carry plug charger with you all the time. I did not buy it for camera, though taken pics still look great. In-box earphones are a bit disappointment, not par with the quality/features of phone, it just seems to be liability than a complementing feature. All in all I am giving 4 stars for other users who want to buy it.(performance + fair battery life - missing basic features - not so good earphones) However for me it comes to around 4.5 stars as I hardly miss Samsung features in it. I love its speed and display. Also I use 4-6 hours of internet daily, around 1-2 hours in office and 4-5 hours at my home, and the battery lasts for around 30 hours for me, so not much issue with battery life as well. Only issue is that it does not get charged by any USB cable (Motorola has not provided any in-box cable) so I need to carry charger with me all the time and provided earphones are bad quality earphones. (btw JBL earphones work great with this phone.)",
            "date": "13 Nov 2014",
            "name": "Saurabh K",
            "stars": "4 stars"
        },
        {
            "comment": "My uncle bought this product recently...Initially we were so happy with the features and style of this product. But just after 30 days of using, it died!! Since 30 days are over, we could not return it to flipkart... Don't know what happened to the phone.. Handed over to the nearby Motorola service center...",
            "date": "13 Nov 2014",
            "name": "Lakshmi K",
            "stars": "2 stars"
        },
        {
            "comment": "i bought this mobile in sep'14, but that showed speaker error, replaced it in oct but the new phone showed that error again, i was told to format my phone twice to troubleshoot the problem and i lost all data in the phone. now i need to do that again after every 15 days. i would never buy any electronic item from flipkart and especially of motorola.",
            "date": "13 Nov 2014",
            "name": "Vikram kaushal",
            "stars": "1 star"
        },
        {
            "comment": "Took this mobile through EMI but flipkart didn't convert the purchase to EMI. Rather they charged complete money. When i contacted bank they confirmed that flipkart is mentioned 12 EMI as a purchase but they didn't convert to EMI and took full money. Because of BLOODY flipkart's mistake i got statement to pay full money which is very difficult for me pay.People cant afford things by paying complete cash so they opt for EMI. Bloody in that Cheating customer. Its completely FAKE.I don't know if they are doing the same with all other customer.Really Never in my life again i will shop with flipkart. I am also sure flipkart wont even react to this because they want money and they got it.CHEATERS absolutely CHEATERS.",
            "date": "12 Nov 2014",
            "name": "Aadhithya Raju",
            "stars": "1 star"
        },
        {
            "comment": "Features are very good, cam is excellent. disadvantages: no data cable option Micro sim Poor charging 4-5 hrs if you kept full even without net usage",
            "date": "12 Nov 2014",
            "name": "siva",
            "stars": "2 stars"
        },
        {
            "comment": ": touch response and navigation through phone is ok but slower than what i expected after reading reviews build quality is bad it looks like cheap overall performance wise which include internent surfing gaming gmail setup using apps on phone is average it would not annoy you with performence but you would not be happy as well with performence headphones in box should have been black instead of white in black color model camera quality is good sound quality of speaker is also good in short spending 13000 on this phone is not waste of money but there are also other phones in market whom you can look on before buying specially xiomi mi3 which i came across after buying this phone it beats moto g all ends up",
            "date": "12 Nov 2014",
            "name": "lokesh kumar",
            "stars": "3 stars"
        },
        {
            "comment": "a good phone. i am looking for that. but still waiting for that offer of airtel sim with 1 gb 3g net for two months.",
            "date": "12 Nov 2014",
            "name": "ramakant",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery was fast, product was awesome. The mobile has a very attractive display and fast processors with considerable price that puts it on the top of every other mobile at this price... Google's Android and Motorolla (first manufacturer of mobile) - awesome deal! Go fot it. Thank you Flipkart, service was awesome.",
            "date": "12 Nov 2014",
            "name": "Divyansh Upreti",
            "stars": "5 stars"
        },
        {
            "comment": "Value for money phone. But Motorola should at least give a cover for the phone, beside that the features are pretty good.",
            "date": "12 Nov 2014",
            "name": "saurav",
            "stars": "3 stars"
        },
        {
            "comment": "Have been using the phone for 2 weeks .. Its fluid, fast looks and feels top notch.. Have been using flagship phones like the Htc One X and the 5S and realised that smartphones do have a life of just 2 years or maybe a pint more .. Switched to mid-range and been in the hunt for quite a long while .. Like : Design and build quality is simply awesome , pure android and OTA updates , great front cam , stereo speakers, splash proof Dislike : long calls do have crackle in voice quality , rear cam not that great and cam app missing basic effects , ear phones are just plain and un inspiring , miss a sync cable in box .. Notes : Based on snapdragon 400 SOC its pretty fast and the battery lasts for a day .. waiting for android L update that could remove the bottleneck of battery and efficiency thanks to ART on L ... You get what you pay for !! And flipkart delivery was superfast in almost 46 hrs !!",
            "date": "12 Nov 2014",
            "name": "Henick Johnson",
            "stars": "5 stars"
        },
        {
            "comment": "Its my 2nd moto G 1st one is replaced by you, but still I m facing some problems , is it Moto G 2nd issue for all mobile. Its charge very slow and after coming 30-40% range of batrry level the phone starts the problem of heating. The headphone of this set is 3rd class sound is clear but the sound is very low.",
            "date": "12 Nov 2014",
            "name": "Rahul Pandey",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this phone on 11750/- Rs from flipkar one months ago.touch screen working smoothly there are no issue on this phone.All thing is good.",
            "date": "12 Nov 2014",
            "name": "Sunil Kumar Su...",
            "stars": "2 stars"
        },
        {
            "comment": "Booked the phone under standard delivery and was delivered after 12 days which looked like an endless wait..This is the first time delivery sucked as opposed to pleasant experiences in my past quite a few purchases. Phone is cool..Faced problem in connecting to home wifi. Did some research on the web and could connect after choosing Static IP. DHCP has problem getting IP address, it was looping. Once that hindrance was cleared, usage experience is excellent. Very light and excellent to hold for its size.",
            "date": "12 Nov 2014",
            "name": "Kirankumar Tati",
            "stars": "4 stars"
        },
        {
            "comment": "I love each and every aspects of this device though it has a few minor setbacks. The camera performance is not great with the default Motorola camera, but does give an improved performance with third-party apps. The battery backup is decent enough for the price (it lasts about 1.5 days for average usage). The phone tends to heat up on continuous gaming for about 20 minutes or so.. And the worst aspect of this purchase is that Motorola packed an earphone which is just a piece of crap.... BUT THE DEVICE IS AWESOME. BEST BUDGET PHONE UNDER 15K.",
            "date": "12 Nov 2014",
            "name": "Shyam Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "I sold my Moto E.... it had no flash, no front camera and no good main camera.... otherwise a brilliant piece... The xiomi mania compelled me to get a Redmi 1s..... it's battery backup and the MIUI disappointed me.... finally back to this Motorola.... the phone is superb.... a little bit big.... everything is excellent... battery can be improved.... camera is nice but should have been 1080p.... overall I give it 8.5/10.....my next phone will be Moto MAXX.",
            "date": "12 Nov 2014",
            "name": "WASEEM UD-DIN",
            "stars": "5 stars"
        },
        {
            "comment": "Processor makes a browsing and switching between apps smoother and quicker. Display is good and interface is convenient for user. Storage is ample depending on usage. Phone gets little bit heated on playing simulated games. Sound quality on speaker not at all great Images clicked on fone seems ok All in all value for money",
            "date": "12 Nov 2014",
            "name": "Nishith Gandhi",
            "stars": "4 stars"
        },
        {
            "comment": "I have got a defective headphone with moto g2.but Moto G 2nd gen is superbb...want change only d headphone.what to do? plz help...thank you",
            "date": "12 Nov 2014",
            "name": "Tarasankar Sarkar",
            "stars": "3 stars"
        },
        {
            "comment": "Very Nice phone and great sound. Touch is great . This is the best Smartphone at this price. Only thing which I think is missing is detachable usb charger",
            "date": "12 Nov 2014",
            "name": "Pankaj Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "its my 1st android phone & its a very decent product.(experience with this phone is 1 week) pros. Battery Backup is good. does'nt have heating issues. Have all updated features . Design is good. light weight. Easy to handle for a newbie. the phone is made up of good quality materials its 8mp camera is better than Sony. cons Don't expect a good service center at your home town ..as i m facing this problem in allahabad.If some major problem arise in future(Hope so don't happen) i have to send it to main service center of moto which will cost me 15-20 days without my phone. All in all its a good product you can trust it ...",
            "date": "12 Nov 2014",
            "name": "Animesh Bandyopad...",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is very good.Performance also very nice.But it taking long time for charging approximate 2.5 hrs.Otherwise phone is very nice.If high rating charger should be provided then phone is very nice.high games are not lagged.",
            "date": "12 Nov 2014",
            "name": "Rakesh Ranjan...",
            "stars": "5 stars"
        },
        {
            "comment": "AMAZING PRODUCT BY MOTOROLA CAMERA IS AMAZING NO LAGG UNTIL 1 MONTH GOOD BATTERY BACKUP BETTER THAN ANY OTHER MOBILE IN THIS RANGE OF PRICE",
            "date": "12 Nov 2014",
            "name": "balaji chettiar",
            "stars": "5 stars"
        },
        {
            "comment": "The design: Nothing outstanding but the curved back do helps in gripping the phone. Screen: Good sun light legibility at 50% brightness levels Build quality: For a careless person like me this assumes prime importance. The phone has been dropped 2-3 with screen downwards on tarred roads. Nothing has happened to the screen only plastic has chipped from upper edges. Camera: Good camera. For all those complaining about poor camera. Enable touch focus and give camera sufficient time (2-3 seconds) to focus (Let the green colored circle appear before clicking). Cam has acceptable quality indoors. Battery: lasts 12-15 hours with my usage (2G internet, screen on 3-4 hours, 1-2 hours of calling, 1 hour of games like subway surfer, Sudoku etc.) Charging time: Default charger takes eternity to charge, heard slow charging is beneficial for battery life and only time will tell how long the battery lasts Do NOT compare it to phones like MI3 which are targeted at different segments. Mi3 has its own advantages but nothing can provide vanilla android experience at this price point. IMHO, user experience matters more than anything else. Hardcore android loyalists will appreciate Moto G (second gen) while the MiUi rom lovers will prefer Mi3. To each his own. P.S. Posting this review after 2 months of usage. Phone has hanged 2-3 times. If your phone is stuck, just press the power button for 7-10 seconds to bring it back to life",
            "date": "12 Nov 2014",
            "name": "Abhishek Puti",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G review (2014): still the best budget smartphone Last year's Moto G took us all by surprise. Sure, we knew Motorola wanted to reinvent the cheap smartphone experience, but the very first device in the company's cost crusade was even better than we expected. Let's be honest, though: The G's greatest asset was its small, it became awfully easy to forgive the thing for not being the quickest, the prettiest or the smartest. Still, it was one of those gadgets that wound up being more than just \"good enough\"; between the price and performance, the Moto G was one of the best cheap smartphones you could own, period. Here we are less than a year later, and we've got a sequel to play with (one with the same name, no less). If you took a quick peek at what it brings to the table, you'd be forgiven for thinking that Motorola wanted to play it safe the second time around -- the new Moto G2 isn't a game changer, and it doesn't have to be. Does this year's model clear the \"good enough\" bar once again? Moto G (2014) PROS Camera is much better than the original's Near-stock Android 4.4.4 is a treat Feels snappy despite aging internals Inexpensive CONS No LTE Screen isn't as crisp as last year's model SUMMARY Motorola's wallet-friendly formula hasn't changed much since last year's Moto G, but that's OK -- the company changed just enough to make the 2014 version one of the best budget smartphones out there.",
            "date": "12 Nov 2014",
            "name": "Aby Bencent",
            "stars": "5 stars"
        },
        {
            "comment": "camera is nice all are nice so i also think it nice in first day in my village i taken a photo it is very clear zoom is also nice",
            "date": "12 Nov 2014",
            "name": "kavin magesh",
            "stars": "5 stars"
        },
        {
            "comment": "Just a day after I got this Phone, I throw it on road because of some personal reason, it went sliding for 30-40 feet on road. when I pick it I am not even expecting it to start... but guys, it is working fine.. no problem at all.... although scratches are there over phone everywhere ;) . . All functions as promised are working fine... if you are looking for a phone in this budget, then go for Moto G2",
            "date": "12 Nov 2014",
            "name": "Deepak Sahu",
            "stars": "5 stars"
        },
        {
            "comment": "The screen size of moto g 2nd generation is mentioned in product description is 5 inches, but when it comes to reality it is only 4.5 inches only, if we measure all phone it is 5 inches , not the screen size 5 inches, I am disappointed with this",
            "date": "12 Nov 2014",
            "name": "p Ashok",
            "stars": "3 stars"
        },
        {
            "comment": "During the launching they promised to give 2month Airtel data free through mail. But still i am waiting.",
            "date": "12 Nov 2014",
            "name": "HARI PRASAD SINGH",
            "stars": "1 star"
        },
        {
            "comment": "A very good handset with a comfortable feel and a great style statement. Black handset is a class apart than the White one. Battery lasts an entire day with continuous usage. Camera is simply awesome (Rear as well as front)",
            "date": "12 Nov 2014",
            "name": "Pratik Dhuri",
            "stars": "4 stars"
        },
        {
            "comment": "super cheaper wonderfull.... Best phone phone compared with other companies... even service from ws seller is very good... very good responce",
            "date": "12 Nov 2014",
            "name": "Mohith Raghavan",
            "stars": "5 stars"
        },
        {
            "comment": "Extraordinary phone from Motorola. But heat problem and some of GSM SIMs area not working properly. Overall its good.",
            "date": "12 Nov 2014",
            "name": "Srinu Podilapu",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is goods in looks and the black one better then white. Flipkart is selling refurbished phone at the price of new one. I got my phone with scratches on the lower side of bezel. So i ordered for a replacement. Got another one with a huge noticable gap between the bezel and screen glass. So very dissappointed by the build quality of motorola. Had to keep it because can't take a risk what if the other one came with more deffects. Cons :1. Poor Battery.. get drained itself even without using the phone.. upto rate of 3% per hour even on standby. 2.Speakers are not of good quality.. Sound is not very clear. 3.Mic is not also very good.. Sometime you have to repeat again and again to make the other party hear you. 4. Accessories with the phone are of no use.. cheap quality headphones.. even the charger is of very cheap quality. Accessories supplied with the phone likes samsung guru are more better. Phone is average. Had to go for this phone beacuse of not much option available in this price range",
            "date": "12 Nov 2014",
            "name": "Asif Khan",
            "stars": "2 stars"
        },
        {
            "comment": "I am using this product for last 15 days and it is excellent except one draw back of battery not lasting for more time.",
            "date": "12 Nov 2014",
            "name": "Brahma Dutt Sh...",
            "stars": "4 stars"
        },
        {
            "comment": "Plus points : Good battery backup, screen resolution is better.camera quality is good. Negative point : Slow touch response",
            "date": "12 Nov 2014",
            "name": "Esakki Raja U",
            "stars": "5 stars"
        },
        {
            "comment": "Got moto g (2nd gen) 10 days back. The phone is getting heated and battery is draining out. Contacted customer care regarding the same but my problem still persists and Flipkart to date has refused to replace the set.",
            "date": "12 Nov 2014",
            "name": "Alok Hiraji",
            "stars": "1 star"
        },
        {
            "comment": "i have not get ma order which i placed earlier i had to place a new order,.... so please get the order deliverd",
            "date": "12 Nov 2014",
            "name": "Ankit Tulsyan",
            "stars": "1 star"
        },
        {
            "comment": "Wont gloat much abouot the device. The phone is very good considering the price. a 20k mid range smartphone features available at cheaper price. The initial product given by flipkart had a very minor pixel damage. But the replacement policy and the speed was exemplary. Got the product on one-day delivery and issued a replacement request within half an hour of getting the phone. Got the replacement next day morning. Pretty happy with the entire service of flipkart and the phone too. Cheers.",
            "date": "12 Nov 2014",
            "name": "Abhishek Nair",
            "stars": "4 stars"
        },
        {
            "comment": "Great performance at all, First product had some issues. After i replaced with new one. Replacement reach me within 2 days. Really good....",
            "date": "12 Nov 2014",
            "name": "Prithiviraj Ma...",
            "stars": "5 stars"
        },
        {
            "comment": "Upper right corner of the phone is slightly dented, didnt initiate the replacement because i was in desperate need of a phone. Product is good. Have very heavy rediations though. Rating is for flipkart service. Why one would like to use a dented phone.",
            "date": "12 Nov 2014",
            "name": "amar sharma",
            "stars": "2 stars"
        },
        {
            "comment": "This is my 4th purchase of Moto G for my friends. All i need to say is just Awesome . With this range smartphones and sepcs it is best for all the things.",
            "date": "12 Nov 2014",
            "name": "Abhishek Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone for the price, nice feel. But any Call Recorder Not support ..... good network reception b> good speed c> good display d> good wifi connectitvity",
            "date": "12 Nov 2014",
            "name": "Faizul Anis",
            "stars": "5 stars"
        },
        {
            "comment": "hii at this price it is very good phone. its performance is very nice its look is slim and rich but there is a charger heating problem and USB Cable which connects to Computer is not provided in the box so you have to purchase it from the market. overall it is a good product you should go for it. its a good deal",
            "date": "12 Nov 2014",
            "name": "Harsh Patel",
            "stars": "4 stars"
        },
        {
            "comment": "The phone offers best value for money. The phones offering is all the more increased as it has no bloat ware.",
            "date": "12 Nov 2014",
            "name": "Rishi",
            "stars": "5 stars"
        },
        {
            "comment": "after theft of nexus 4 i was in search of some good phone in 15-20k range, one of mine friend advice for MotoG 2nd gen. i am using since last 2 days and it gives me same feeling, infact better then nxs4 as screen is bigger. firmly recommend for purchase Please install Snap dragon battery guru for optimization of battery usage.",
            "date": "12 Nov 2014",
            "name": "Nachiket Bhavsar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is superb mobile i bought this more than month and used its not hanging , working smoothly, rates is good to buy middle level people.",
            "date": "12 Nov 2014",
            "name": "Umarkhan",
            "stars": "5 stars"
        },
        {
            "comment": "NICE WORK DONE BY MOTOROLA FINALLY...............A GOOD CELL PHONE LAUNCHED FINALLY...........................",
            "date": "12 Nov 2014",
            "name": "PRADY SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "Sir, I have bought the Moto G 2 nd Gen on 08/09/2014.(IMEI 353321060401067) Now the touch is not working. I have contacted the service centre of Thirunelveli but they advised to sent it through online only for service/Replacement.Kindly do needful.",
            "date": "12 Nov 2014",
            "name": "LINGA BHASKAR I",
            "stars": "1 star"
        },
        {
            "comment": "THIS PHONE IS VERY GOOD PHONE EASY TO USE MY OLD PHONE IS SAMSUNG GRAND IS VERY HANG PROBLAB BUT MY MOTO PHONE IS VERY GUD PHONE NOT HANG 16 GB INTERNAL MEMMORY IS VERY GUD",
            "date": "12 Nov 2014",
            "name": "BANARSI SAINI",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from last week and i am impressed by this phone. The phone has 1.2 ghz processor 1gb ram adreno 305 and 8mp camera The device is running very smoothly but it gets a little warm when playing games for 20 mins.the battery life is not so very good.It can last about 15 to 20 hours with normal to medium usage.The camera is excellent.It performs good in natural lighting but it struggles a little bit in indoor lighting conditions.It can also run many heavy games like MC4,MC5,GTA,Asphat 8,Dead trigger 2etc.And the main ting about this phone is it will get Android Lollipop once it is officially launched.Multitasking is excellent.the call quality is also very good.Overall i think that this is the best smartphone under RS15000.",
            "date": "12 Nov 2014",
            "name": "Nupoor Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Good service delivery from flipkart .................................................................",
            "date": "12 Nov 2014",
            "name": "Rakesh Gadigi",
            "stars": "5 stars"
        },
        {
            "comment": "Good Quality Product Satisfied with its Premium Look & Awesome Performance Its Way Better Than I Expected If this has a Better Battery Backup & 1080 video Recording This Would be a Monster !!! Overall its Impressive & Value For Money !!",
            "date": "12 Nov 2014",
            "name": "Manu v Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "disappointed with this phone. There is no video call facility in such a high end mobile. Also other features are not user friendly. Battery back up is not good. Gionee M2 is far better than this mobile.",
            "date": "12 Nov 2014",
            "name": "R L Patro",
            "stars": "1 star"
        },
        {
            "comment": "First of all I have to appreciate the service of Flipkart. No 1 Service Provider for Online shopping. I have purchased this product and found a cheap product on this Price range. Very low battery backup Very Poor display, cant even see anything on sunlight. It is not suitable for anyone who gets more than 20 calls per day. Earphone came with the set is worthless, of no use. Weight is more. I sold it off within 20 days of purchase.",
            "date": "12 Nov 2014",
            "name": "Rajkumar Rajan",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2 is simply phone for me, i have used motoE phone earlier, now using moto-g2. its performance,camera,screen resolution is good, batter backup is ok . over all i starting using now..keep posting as day goes on...",
            "date": "12 Nov 2014",
            "name": "Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "Not very good but ok product all the functions are working correctly but the phone is lagging sometimes.., pros latest updates design camera display speakers video quality cos ram video calling non removable battery",
            "date": "12 Nov 2014",
            "name": "Aravind Devaraj",
            "stars": "4 stars"
        },
        {
            "comment": "I am very much unsatisfied with this device. Headphones are not working from the first day. Charging is pin is loose. Touch is not working while charging. After removing the charging the mobile is not working for 7 to 8 mins. Mobile is getting struck for every 1 to 2 hours. Please replace the device or refund the money.",
            "date": "12 Nov 2014",
            "name": "Sushma Bellala",
            "stars": "1 star"
        },
        {
            "comment": "1. Display: 8/10.. Bright display eases reading 2. Battery: 4/10.. Battery drains very fast if you leave the wifi or 3g data on. Lasts only 8-9 hrs after full charge 3. Camera: Front camera:3/10 rear camera: 6/10. Front camera shoots poor images even under good lighting conditions.. Rear camera takes very long to focus and click 4. Speed and performance: 5/10..Phone hangs once in a while especially while playing videos. I am not a gamer. Hence I would not know the gaming 5. Overall Phone: 6/10... primarily due to the poor battery, camera, frequent hangups 6. Flipkart delivery: 3/10...It took more than a week to deliver to Mumbai",
            "date": "12 Nov 2014",
            "name": "SS",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone in a hurry not without any reference or recommendations. I just needed one phone immediately. But I do not regret my buy at all. The OS is fast and crisp without any lag or problem. The built quality is very good. The battery lasts for an entire day with medium usage. At this price...i would say go for it.",
            "date": "12 Nov 2014",
            "name": "Mehboob Rahman",
            "stars": "5 stars"
        },
        {
            "comment": "i have never seen such pathetic service from any website. i mean u can see the number of complaints for the courier company Delhivery on the internet, still u r partnering with them.. the most annoying part the phone number on the courier company's website is never responding. it is constantly busy all the time ( making us fools obviously ). and when we call customer service of flipkart they say the same thing again and again that we have forwaded ur complaint to the concern department. even the flipkart customer service were not able to provide us with the phone number of the courier company. and again i have ordered other product from flikart and i requested not to deliever thru Delhivery but still they choose them. Thank you very much Flipkart. highly appreciate ur customer service..",
            "date": "12 Nov 2014",
            "name": "Dr. Sunny Chat...",
            "stars": "1 star"
        },
        {
            "comment": "Phone is satisfactory. You can go for this phone in the budget of 12-13 thousand. Only disadvantage is its comparatively low Battery backup & it doesn't have call recording feature (there are no apps which work in this phone for call recording) Rest it is a good mobile.",
            "date": "12 Nov 2014",
            "name": "ANKIT AGRAWAL",
            "stars": "4 stars"
        },
        {
            "comment": "It brought this device few days back, & I felt it is good from every prospectus. Drawback : Although There is NO BIG DRAWBACK is in this device , accept Battery . 1. The battery of this device is in-build , & It take almost 3 hours to charge completely, it should not take this much time to charge. 2. Some time Mobile gets warm slightly after charging & Use. But there are the general issue with all android device. so My opinion for this device is good. You can buy this . go for it . it is good for use.",
            "date": "12 Nov 2014",
            "name": "Sandeep Duve",
            "stars": "5 stars"
        },
        {
            "comment": "No one can stand in front of motog(2nd gen) at the price of rs13,000, although,it was my first Android phone,so i was worried about performance and camera,and i had bought for my sister and completely blown away from its features and adroid exeprience,then i didnt think even a sec and ordered second time for my father from the same resource. Thanks moto for this phone.overall,it has been a good experience and those who are thnking abt buying it.go for it and believe,flipkart won't disappoint you,...............",
            "date": "12 Nov 2014",
            "name": "Abhimanyu Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "The product is very amazing and I loved it very much Five factors I like the most in this mobile 1. Biggest and brightest screen with good pixel resolution and can also play 1080p vedios. 2. Battery lasts very long on heavy usage also for 10 hours 3. The built quality of phone is Awesome and its back is given with a Matt finish. 4. Amazing performance I didn't even noticed a lag while playing games even like Asphalt8, Nova, 5. The camera clarity was awesome with 8mp with flash and the front cam 2mp is very Good to make Vedio calls. GPS : GPS issue is solved in this mobile when compared to Moto G the G2 issue is solved and the GPS works well now. I Rate this mobile 5 star for sure.",
            "date": "12 Nov 2014",
            "name": "Ganesh.U",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is best phone of 13k category...go for it...premium looks,camera average...battery life good,ram very good...better than asus...",
            "date": "12 Nov 2014",
            "name": "Jit sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "i ordered it on 11/11/14 in same day delivery mode.order no;WSRO0477512576.for same day delivery they charged addition Rs.140/-.but i didn't get phone in time,and at 10.30pm they msg me that they wil do delivery tomorrow only.Why flipkart is giving promise of Guarantee on the same day delivery.Is that a fake add",
            "date": "12 Nov 2014",
            "name": "noufal nazeer",
            "stars": "1 star"
        },
        {
            "comment": "i received this set today all function are ok but its secondary (front) camera is not working. showing CAMERA ERROR message and ask to restart camera. after restarting again problem is persisting.",
            "date": "12 Nov 2014",
            "name": "AKHILESH KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "I am waiting for new phone and expected delivery date has passed but phone is still not picked up by courier......worst experience",
            "date": "11 Nov 2014",
            "name": "Rishi Prakash B.T...",
            "stars": "1 star"
        },
        {
            "comment": "I felt excited when moto g 2 came to early three days before I booked in Thursday 13th November evening at 9pm and I received on Sunday evening 6:30pm. It is looking awesome and I am checking its performance now , calls voice is good till now I didn’t checked how the net is functioning but I satisfied with the service .i do not have much time to load songs and movies still i have to check.i confidently say that it funtion good",
            "date": "11 Nov 2014",
            "name": "sravan kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I brought this phone on big billion day, exchanged my Samsung Ace for Rs 3000, also got 10 % discount for using Stanchart Card, so it was a good deal. Phone is good so far.",
            "date": "11 Nov 2014",
            "name": "Vinesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Just the right amount of specs and the right amount of quality to get you in smartphone league of 2014-2015. A great gift for someone special. Awesome customer care service. Great build. Big screen. Upgraded camera. A good option overall.",
            "date": "11 Nov 2014",
            "name": "Abhinav Oswal",
            "stars": "4 stars"
        },
        {
            "comment": "I got the defective product ! It has got touch issues. Twice or thrice a day I have to restart the mobile because the touch stops working. Also, sometimes I do not get any voice on picking up the call while the call is on-going and the other person can hear me nicely. For this issue also I need to restart my cell in order to resolve it. I logged a return request for the same as one cannot bear such a huge amount for a CRAP they have delivered ! Flipkart responded with the Service center details which never existed ! WORST SERVICE EVER FROM FLIPKART ! Again I have logged a return request and waiting for the Flipkart's relpy !",
            "date": "11 Nov 2014",
            "name": "Rashi Agrawal",
            "stars": "1 star"
        },
        {
            "comment": "First: the shipment timing is good. plus point for flipkart. Second about product... pros- 1) good display 2) good battery backup 3) stereo speakers for better surround sound, specialy while watching videos 4) no lags in android 4.4.4 OS (till now) or we can say good processor snapdragon 400 1.2GHz quad core. 5) good finishing 6) good camera (both primary and secondary) Now its cons... seriously guys dont buy this phone without reading these cons. 1) poor sound quality output from those stereo speakers at full volume, even at 8 or 9. 2) poor call quality 3) poor signal level. 4) snaps blurred images at low light actually my nokia lumia was far better than these cons. so i'm giving 4 stars bcoz m using this phone. lol :P",
            "date": "11 Nov 2014",
            "name": "Deepesh Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "great fone fluid android no heating issues no speaker issues go for it nd u wont be disappointed ;) its bttr than samsung shit out there for the same or higher price ......",
            "date": "11 Nov 2014",
            "name": "Dhananjay Dogra",
            "stars": "5 stars"
        },
        {
            "comment": "this is best mobile in range of 15000/-,. A short mean of moto g 2nd gen. value of money,.,. good performance. good storage.",
            "date": "11 Nov 2014",
            "name": "KESHAV SHARMA",
            "stars": "4 stars"
        },
        {
            "comment": "had order moto g2 at the launch 11 sep got it on 14 sep good service flipkart but the packing was not so good After using 2 months my review about phone pro 's 1 good sound 2 clear display (hd) 3 good performance (never hangs) 4 average battery backup 24hr 5 nano coating , scratch proof (gorilla glass 3) con 's 1 no usb cable 2 no software available for connecting to pc (had to be download from internet) 3 no otg cable",
            "date": "11 Nov 2014",
            "name": "shaikh zikwan",
            "stars": "5 stars"
        },
        {
            "comment": "firstly at norml use this is the best ......smooth in working.....as 1gb ram,.....battery also last for 36 hours........attractive google services.....good in navigation as compass..... now comes the very heavy use ...................... i tested this device with all tools avail, played games like asphalt 8, drag racing and high end games...........and used so badly that phone heated badly.........full on entertainment as using 64gb card ultra class 10..... using airtel card....internet speed upto 18mb/sec....!!!!!! AND..... it has basic android that is released by google which is much better than touchwiz by samsung and HTCsense by htc........",
            "date": "11 Nov 2014",
            "name": "saurabh ringe",
            "stars": "5 stars"
        },
        {
            "comment": "While it cant match up to the Xiaomi products for price competitiveness, the feel of the phone combined with native android make it a fantastic option, as compared to the heavily skinned Xiaomi, asus etc phones. The base android install makes it feell a lot spiffier and faster, plus its bound to get android Lollipop pretty soon.",
            "date": "11 Nov 2014",
            "name": "Anant Nawalgaria",
            "stars": "4 stars"
        },
        {
            "comment": "fantastic phone in dis price range..bt ear piece nd charger should have been better.. charger getting heated everytime like a molten rock..nd the given ear piece should be a in-ear ear pice.. insted of this the phone rocks..lag free phone..nd it is having a very good display nd sound clarity.. i am giving dis review after using this phone over two months.. so buyers dont hesitate...just go for it..:)",
            "date": "11 Nov 2014",
            "name": "Saumya Tripathy",
            "stars": "5 stars"
        },
        {
            "comment": "Received and used Moto G 2nd Gen....good performance but the problem regarding battery still continues....I didn't find it upto the mark due to battery problem..It's speaker also have problem on full volume...Phone also get heated after short use of internet... charger also get heated while charging...",
            "date": "11 Nov 2014",
            "name": "sujeet kumar",
            "stars": "3 stars"
        },
        {
            "comment": "I am amazed by this phone at this price point. This is an absolutely wonderful phone. Must have... Crisp display, wow sound, superfast. Way to go moto!",
            "date": "11 Nov 2014",
            "name": "Abeer Verma",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone in the range upto 15k. the screen is good and bright, and the gorrila glass protection is nice too. the phone looks very good in hand with the smooth edges and curvy back. sound is the best feature of the set. loud and loud. the only bad thing about the phone is the micro sim slot. should have given a normal sim slot. otherwise, best buy.....",
            "date": "11 Nov 2014",
            "name": "Sandeep Sinha",
            "stars": "4 stars"
        },
        {
            "comment": "It is worth of what we paid nice touch n nice camera I loved it just I couldn't find my music tracks as where they get stored and if I had to delete how could i",
            "date": "11 Nov 2014",
            "name": "Bhanu Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "Good things about Moto G2 are 1.Never i found this phone lagging in applications from my experience 2.Runs on Android 4.4.4 and expecting lollipop. 3.100 % worth features 16Gb internal ,8MP primary camera 2 MP secondary camera 1.2GHz quad core processor. Bad things about it 1.It does not support 4G where airtel is all set to launch 4G services in India we can't take advantage of it with this phone 2.It's touch sensitivity is not good compared to other phones. 3.Battery 2070 mah is not sufficient run 5 inch 1.2gHz moto G 4.Volume quality some times too low in call ,residual screen burn in are the two issues i faced. Thats all",
            "date": "11 Nov 2014",
            "name": "Sidheek Muhammed",
            "stars": "4 stars"
        },
        {
            "comment": "nice phone liked the features and delivery time.. best product so far purchased on flipkart. Would love to place the order on flipkart.",
            "date": "11 Nov 2014",
            "name": "girisha salian",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product..... Good Battery back up and Nice Display... Excellent Camera quality.... Cons: Delivery Time.. . Took more 4 days than promised duration... More follow up is needed after purchasing of product for delivery..",
            "date": "11 Nov 2014",
            "name": "Harshil",
            "stars": "4 stars"
        },
        {
            "comment": "The Moto G 2nd generation is very nice smartphone. Overall, it's look very beautiful. It's performance is awesome. Specially it's stereo speakers are so powerful , it's produce such a great audio quality. Both the cameras (front & rear) work so good. It's one of the best smartphone manufactured by Motorola.",
            "date": "11 Nov 2014",
            "name": "harpreet singh",
            "stars": "5 stars"
        },
        {
            "comment": "With the technology they are imparting I'm amazed to say that the Motorola is the \"new\" Apple...Mark my words",
            "date": "11 Nov 2014",
            "name": "Vineet Kumar S...",
            "stars": "5 stars"
        },
        {
            "comment": "Specifications are good camers is also good but I have using this phone from last 20 the biggest problem is that the bigger games like FIFA 14 and MC4 stop in between I don't know they just stop in between this is becoming more and more irritating..... But other wise phone is good and flipkart service is also very good they dilvery the phone before the due date",
            "date": "11 Nov 2014",
            "name": "Suraj singh",
            "stars": "4 stars"
        },
        {
            "comment": "Its a good, mobile, a bit costly at this config, would be better to buy in some offer .... Its good to have any exchange offer or 10% cash back .....",
            "date": "11 Nov 2014",
            "name": "Ayush Mahajan",
            "stars": "5 stars"
        },
        {
            "comment": "It is my First Android Phone. I Am So Happy.MOTO G 2nd Gen Is very very best Phone compare to others .",
            "date": "11 Nov 2014",
            "name": "aditya pawar",
            "stars": "5 stars"
        },
        {
            "comment": "I've been using this phone for more than one month now, and the only thing that I have to say is that this is the best budget smartphone, ever, no catches. If you have a budget below 15k, this is the only phone that you should get. Don't fall for more cores, bigger RAM or higher GHz advertised by other companies, just go for this. The only thing missing in the phone is NFC, which I doubt anyone in India even uses, and if you have a use case for NFC, you're most likely not the target audience. All in all, awesome build quality, great screen, great camera(Better if you install AOSP camera or Google Camera app), replaceable back covers, Pure Android experience and a guaranteed update to Lollipop.",
            "date": "11 Nov 2014",
            "name": "Gaurav Pareek",
            "stars": "5 stars"
        },
        {
            "comment": "I have used Both the Devices..i.e The old as well as the New One..But truly The Old One Feels Much much better in Hand..and The Display of the Old ones also Better! Because they increased The Screen size But did not change the resolution..which means the new one has a lower PPI(Pixels Per Inch)... It would had been much much Better if they would had increased the RAM...But Yeah The Dead line Looking around..its simply THE Best among its Competitor..Its Just 12999/- And at this Price Its a Superb Buy and to those who has a Budget of 16K and wants to Buy a Mobile! Don't Just think of Buying any other Device Just Buy The Moto G(2nd Gen) Its Just the Best!!",
            "date": "11 Nov 2014",
            "name": "Saptarshi Roy",
            "stars": "4 stars"
        },
        {
            "comment": "Bought the phone for my dad and he loves it! A great experience once again, shopping on Flipkart. It's only Flipkart that can deliver your product in a day itself. Although the phone initially had some battery issues, it all came out alright in the end. All features promised with the phone are there and the whole UI is wonderful. Only downside is it does not come with a USB cable, so you got to go out and buy one. That's why a four star rating! All in all, the phone's worth a buy!",
            "date": "11 Nov 2014",
            "name": "Monisha Vinod",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is simply superb with all latest features at reasonable price. Quality of the picturs taken from this mobile is quite good.",
            "date": "11 Nov 2014",
            "name": "hanuman bvsv",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome Cellphone. Far better than the previous model in terms of Camera Quality. The only con is Battery Backup. Battery is not at all good. Never Hangs or works slow. Its 8 MP main Camera and 2 MP Secondary cameras are awesome. I would like to say \"Don't Think, Just Buy it\".",
            "date": "11 Nov 2014",
            "name": "Shashank Nairy",
            "stars": "5 stars"
        },
        {
            "comment": "I bought one a couple of weeks back with the hope that my shopping experience with Flipkart would be as good as it has always been. But I was in for a rude shock. My decision to purchase Moto G (2nd) was partially driven by an offer ( free 1GB data for 2 months) which was prominently displayed in the add. When i couldn't activate the offer, I got back to the customer care, who came back saying that the offer wasn't there when I placed t.he order This was a blatant and shameless lie. The information was provided to me over mail and not over a call, because they knew they were reneging. Going forward, I have learnt not to trust Flipkart with its offers. Likewise, I would request others to take their promotional offers with a PINCH OF SALT",
            "date": "11 Nov 2014",
            "name": "subash",
            "stars": "5 stars"
        },
        {
            "comment": "Once i started working with it the battery was draining very fast..sometimes it gets hanged eventhough its a quad core processor...not satisfied with this product...",
            "date": "11 Nov 2014",
            "name": "Hariharan",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is very good .. in fact better than Samsung Grand 2 but the battery life is poor .... fully charged battery drains out in few hours.... Four stars are just for looks and other specs ...",
            "date": "11 Nov 2014",
            "name": "SJN",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this mobile a week ago and find these things - 1- Camera is good in low light 2- Audio in earphones is very normal 3- Two speakers have decent quality 4- Built quality is good of the mobile 5- Mobile heats up with in 4-5 mins of game play 6- Battery is normal, will not stay even 30% if u use the mobile often in a day for music or little games. 7-Often multitasking will make the mobile freez . Thanks",
            "date": "11 Nov 2014",
            "name": "Gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "pros: a> good network reception b> good speed c> good display d> good wifi connectitvity cons: a> bad speaker quality b> after closing camera app phone stop responding for few seconds c> overall design is ok but 2 front speaker bars are not so good looking....looks like 2 big stapler pin",
            "date": "11 Nov 2014",
            "name": "kalyan jana",
            "stars": "4 stars"
        },
        {
            "comment": "One of the friendly user for me . Big screen Good quality cam. Both front and back. Battery backup also good.",
            "date": "11 Nov 2014",
            "name": "Gajanan Kudva",
            "stars": "5 stars"
        },
        {
            "comment": "received the phone + charger + headphones.. but did not received the Data cable..Will I get get the data cable also with this phone..kindly reply ASAP",
            "date": "10 Nov 2014",
            "name": "B SIRISHA",
            "stars": "3 stars"
        },
        {
            "comment": "Great phone for the price, nice feel, solid performance. As a 3 generation iphone user, I got tired of jailbreaks and work arounds. I was worried about performance and the camera. I had a short stint with a Nexus One that left me with a bit of a sour taste for Android so this was a big leap. The phone is fast, the only thing that seems to make it hang a bit are large web pages, jumping back to the home screen can take 1-2 seconds, but everything else seems as fast or faster than my iphone 5 with 7.1.2. Battery life is just as good as the iphone. The screen is amazing and the biggest surprise is the camera, the daytime photos are fantastic. Nighttime are slightly worse than the iphone but the day shots are just that much better. Overall a fantastic phone and a pleasure to use. This is one of those devices that is greater than the sum of its parts (or specs).",
            "date": "10 Nov 2014",
            "name": "Roshith m",
            "stars": "5 stars"
        },
        {
            "comment": "First of all Thanks to flipkart delivery, it was awesome as usual . Now THE MOTO G 2nd GEN received it today . the moment when i opened the box, there was a big smile on my face, the looks killed me :D everything is good, the display, the sound quality of front speaker(by default they are set to bass punch so you might get disappointed with its so called \"fatti hui awaz\". you can adjust it) now come to the big question... \"THE BATTERY\" as i received it today.... battery backup i got was not so impressing we can say its just average, but Motorola claims that battery will give its maximum backup after 10-11 charges, as it is being calibrated within this time. LETS SEE. some people complained that phone is getting heated while charging but mine does not, heating can also be a reason of high/low voltage or etc. but yes battery takes time to charge because of its low Amp charger. . . Rest is awesome. thumbs up. just buy it.",
            "date": "10 Nov 2014",
            "name": "Aakash Kathuria",
            "stars": "4 stars"
        },
        {
            "comment": "I got this product on Sep. Initially it was good.. but slowly i started experiencing problems.. Issues: 1. Dialer - Sometimes it will get stuck, finally i have to shutdown and restart. 2. Msg App - It do not support quick template msgs. So I had to look for alternative. 3. Battery- If you are using 3G/Wifi from morning 7 AM , ur phone will get shutdown at 7PM 4. USB Cable- U cannot transfer movies onto your mobile, it will get disconnect and reconnect in between (already tried with various data cables and also tried with diff mobiles with same data cable and sd card) 5. Games Crash- HD games will carsh after using for 1 ~ 1.5month or so.. if you tell this to moto cust care they will reply to uninstall and reinstall. I already address this issues.. They said to get in touch with service center (so soon) I got this phone in installment, now regretting... Good: Display: Excellent Camera: Nice photos Look: Good",
            "date": "10 Nov 2014",
            "name": "Sudipto Sen",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this mobile last month, after using this mobile for a month now. i can't find any flaws, as i am a hardcore gamer and am pretty much impressed with its performance, the OS is flaw less, and the processing is LAG free, as though this is an entry level smartphone it comes with a killer performance. camera performance is great, it takes high quality pics and no memory problem here. As coming to the battery backup by moderate gaming, listening music, and using WiFi or normal data it gives me 6 hours of battery backup. Though this could be eliminated by updating to Android L (lollipop) or using a Power Bank. Ultimately a best SmartPhone for SmartPeople.",
            "date": "10 Nov 2014",
            "name": "Krishna Teja Sidd...",
            "stars": "5 stars"
        },
        {
            "comment": "This is nice product for basic use , camera quality is too good . Flipcart deliverd the product on time as i wanted to gift this product to my dad .",
            "date": "10 Nov 2014",
            "name": "Neil Sukalikar",
            "stars": "4 stars"
        },
        {
            "comment": "I felt very good when I get the product (Moto G - Second gen) 2 days earlier. That was very speed delivery. Because 13th November is our 1st Wedding Anniversary, I have chosen this mobile for my wife as a special gift. I open the package and see the phone it was good to see. But I am very disappointed when I was switch on the phone :(.. Yes touch panel was not working,. I raised request for replacement, they told me call back on another 24 hrs. I don't want to be delay on this..After 7hrs I am not getting any call from Flipkart and status was still processing. I am waiting. I don't want to get this product after 13th November.",
            "date": "10 Nov 2014",
            "name": "Parthiban S",
            "stars": "1 star"
        }
    ]
}
