{
    "filpkart": [
        {
            "comment": "Superb one. Using since 3 days..no problem yet found.. If you are looking fr a phone under 13k, then go for it, Happy Customer!! :D",
            "date": "03 May 2015",
            "name": "Tulasha",
            "stars": "4 stars"
        },
        {
            "comment": "No sudden hangs like samsung pets do.. gud display.. gud speakers.. more ROM.. gud for playing games.. gud camera quality.. the only matter concerns is heating if camera is used continuously..",
            "date": "03 May 2015",
            "name": "Vasanth Gollapalli",
            "stars": "4 stars"
        },
        {
            "comment": "excellent phone ,,good Quality ,very good 8 mp camera..lollipop update is very nice...but it's over priced",
            "date": "03 May 2015",
            "name": "Sumesh Kaimal",
            "stars": "5 stars"
        },
        {
            "comment": "received the item in good condition. prompt delivery by flipkart. satisfied with its service. good product.",
            "date": "03 May 2015",
            "name": "Hemanth Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen is a good phone, with a good experience quality and better exposure to stay on it......",
            "date": "03 May 2015",
            "name": "Rakshak Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this mobile with 10% offer for HDFC debit card at that time the price was 13k. The build quality and camera are good. Really happy with the purchase.",
            "date": "03 May 2015",
            "name": "Sivanandhan Ka...",
            "stars": "4 stars"
        },
        {
            "comment": "Waste of money, charge will drain drastically, no separate service center in Chennai. Less than 1 star option is not available. So I am giving 1 star. Don't ever go with this.",
            "date": "03 May 2015",
            "name": "Siva",
            "stars": "1 star"
        },
        {
            "comment": "Being a flipkart customer for many years , am satisfied with most of the products purchased here. As far as MOTO 2nd G is concerned , its my 2nd purchase :) , with couple of bumper offer..i got the delivery in 12 hours!! I didnt expected tat so quick.. Thanks & Regards Sajan",
            "date": "03 May 2015",
            "name": "HUSSAIN SAJAN",
            "stars": "5 stars"
        },
        {
            "comment": "Sturdy feel ! Good to hold, rubbery back finish, stock android without lags :) Fast response, average battery life ! I missed the ftp for blutooth transfer in it ! camera app is not great ! i get a battery backup of 7-8 hours with net on !",
            "date": "02 May 2015",
            "name": "Tirthankar Kundu",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola did great work on this, sleek design, fast, no lag, nice look all got A . If you want a budget smartphone with alot features this will be the best.",
            "date": "02 May 2015",
            "name": "Sanket Mohanty",
            "stars": "5 stars"
        },
        {
            "comment": "I loved it, looks and performance is rally great!!! Thanks flipkart for faster delivery, got the phone within 2 days of ordering. Coming to specification in this price range. build quality is awesome and battery backup is average. I installed memory hunger games but no lag in performance and faced no heating problem like other phones. I would say, pretty decent phone from moto!!!!",
            "date": "02 May 2015",
            "name": "Surendra Gurjar",
            "stars": "5 stars"
        },
        {
            "comment": "resolve problem in hendset software fault so setting me jaav factory restore karo or do ya teen deen me problem aata hai to vapas call caro aapka solution ho jayega or or call disconnect hone ke baad order information me easi note thej te he {We're sorry. We are unable to process your replacement request. Reason : The issue has been resolved between you and the seller. Hence, there will be no replacement or refund} PROBLEM RESOLVE PERSON Vishalbhai and he said agar aapko fhir se problem aati hai to aapka refund ya replace ho jayega and wo hi rejected ka dhabba thok deta hai... 28/29/30/01/02 ye sab date se daily call kar raha hu 24 hour me aapka problem solve ho jayega na koi mail na koi msg after call and last aapki policy ke 30 day pure ho jaate he waah maan gaye aapki dirty POLICY ko.. Thanks For NOT SOLVE MY PROBLEM. DU BANANE KA NAYA TARIKA ON FLIPKART ONLINE Purchase.....",
            "date": "02 May 2015",
            "name": "RUPAL D PATEL",
            "stars": "2 stars"
        },
        {
            "comment": "A strict NO NO if you go by my opinion and review. The phone's mic stopped working after 5 months of purchase. I gave the phone at authorised service centres thrice but the mic stopped working after few days each time after servicing. In the third attempt, even my motherboard was changed but the problem still persisted. I wrote a mail to Motorola Customer Care on 24 April, 2015 to which they responded by saying that a Repair Status Specialist Team will contact me within 48 hours. It has been 8 days since then and two more emails from my side but there is still no response from the Customer Care. Flipkart may be doing a good job but I would warn everyone not to have any hopes from after sales services of Motorola. Incompetent service centres and worst customer care.",
            "date": "02 May 2015",
            "name": "Tarun",
            "stars": "1 star"
        },
        {
            "comment": "Cons: 1. Almost same hardware as older motog even after releasing 1 year later. 2. Battery life is pathetic. I have to look for charger every time I want to play a game. The battery actually drains even if I play while charging!! Otherwise battery will empty within an hour. It's the single most pain point. Have to use it carefully to last a day. 3. Charging the phone takes too long. Several hours of charging for full battery. 4. Over priced for medium-end phone, too much for the performance it offers. 5. Too much hype for fast OS(Lollipop) updates. It released it nearly the same time as other companies.(Don't tell me in US they released it early) Pros: 1. Camera quality is better than last motog. Its usable now. 2. Big bright screen 3. Design Verdict: I am utterly disappointed in how limiting the battery is. You have to use it like a phone not a smartphone. There are better specced phones from other manufacturers now. I am done with Moto.",
            "date": "02 May 2015",
            "name": "Bipin Nag",
            "stars": "1 star"
        },
        {
            "comment": "Good phone,,, working perfectly... did not find any issues with the product... very sturdy Good phone,,, working perfectly... did not find any issues with the product... very sturdy",
            "date": "02 May 2015",
            "name": "Sailesh",
            "stars": "5 stars"
        },
        {
            "comment": "Writing the review after using this phone for a month. let me put it simple What I use my phone for - -Listening music for 2 hrs, clicking pics all round the day , playing games for at least 3hrs. Pros- -camera quality, day and night both awesome -got lollipop pre-updated -best mid range phone, worth the price -has all google apps preinstalled Cons -ram saturates after 6hrs, need to do a ram clean up -battery drains out a bit faster, depends on how u save it Ofcourse -headphones' quality is good but the shape sucks -things I hate is the built in music player, it won't play a song after 1day, needs restart, may be bug in the app -cannot download song directly",
            "date": "02 May 2015",
            "name": "sNikki",
            "stars": "4 stars"
        },
        {
            "comment": "from the day i got my phone, i m facing the issue regarding battery and speaker, Battery drains very early, and sound quality is very bad while calling someone Secondly, Motorola service is worse(Jaipur service center ) They gave me my phone in 14 days. Within a month its motherboard is replaced, and even after i am having the same issue. To add it more, after service , camera flash is also not working This battery and sound problem is very common and seeing their service i will highly recommend not to buy this phone.",
            "date": "02 May 2015",
            "name": "Ishtpal Singh",
            "stars": "1 star"
        },
        {
            "comment": "First Thanks Flipkart for sale this motog2 product... Awesomeeee Mob in Adroid version. Display-5/5 Features-5/5 Camera-5/5 Battery-4/5 Multimedia-5/5 Internet-5/5 Connectivity-5/5 Storage-5/5 Thanks flipkarts.Very very satisfied with this product comparison with other mob brand,as a same price. Request to flipkart,please sale original moto g2 licorice(black) flip cover,which is out of stock few days.",
            "date": "02 May 2015",
            "name": "Ayan Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this mobile after lot of review and indeed this mobile is one of the best mobile in this range. with the memory space and easy to use, this mobile is also best selling mobile. I bought it for my dad and no issues till now.",
            "date": "02 May 2015",
            "name": "Prashant coffe...",
            "stars": "4 stars"
        },
        {
            "comment": "if looking for good battery life then dont go for it........bakwaas phone in terms of battery.........................................otherwise ok.......flipkart customer care.......bekaar.....just gave excuse only.........................",
            "date": "02 May 2015",
            "name": "Inder Kumar Bh...",
            "stars": "2 stars"
        },
        {
            "comment": "17-ORDER ID : OD302586868415768300 REGISTERED NUMBER : 8898135485 I ORDERED FOR MOTO G 2ND GEN,IT WAS DELIVERED TO ME ON 17TH APRIL 2015,TALIKNG ABOUT D PHONE DER R LOTS OF PROBLEMS WHICH M GOING THROUGH WITH IT,FIRST PROBLEM IS DAT IT TAKES LOT OF TIME TO CHARGE D PHONE..N D CHARGER HEATS UP LIKE A MOLTEN ROCK....AND D CHARGE DOESNT REMAIN FOR MORE DEN 6 HRS...I HAVE TRIED DOING RESET TWICE ..BUT D SAME ISSUE PERSISTS..AND D ANDRIOD SYSTEM CONSUMES D MOBILE DATA ANYHOW..EVEN WEN M DISABLING IT FRM D APP SETTINGS...AND IF I HAVE DISABLED SOME APP AND WEN M ENABLING IT,,M NT ABEL TO ACCESS IT..I''M ABLE TO ACESS IT ONCE M RESTARTING D PHONE...AND EVEN IF M JUST ENABLING D DATA D CHARGE DRAINS FAST..AND DER IS NO FAETURE OF CLEARING D RAM,N WEN M LISTENING TO MUSIC ..N WEN M CLEARING D TASK D MUSIC PLAYER SHUTS DOWN...ONE ISSUE WHICH IS RAISED RYT BEFORE 2 DAYS FRM NOW IS DAT WEN I HAVE CLEARED ALL D TASK AFTER LISTENING D MUSIC,D GOOGLE PAY MUSIC REMAINS ON D SCREEN EVEN WEN M FORCEFULLY STOPING D TASK...D PROBLEMS GOES AWAY WEN M RESTARING D PHONE..N DER IS NO FACILITY TO RESTART ONLY SHUT DOWN IS AVAILABLE...D HEADPHONE R QUITE ORDINARY..N ONE THING IS DAT DER IS HEATING ISSUE WITH D PHONE ..I HAVE DONE EXPENSES ON D MOBILE LYK BACKCOVER N SCREEN GUARD..SO DEFINATELY I WANTD TO KEEP D PRODUCT..BUT M NT SATISFIED WITH D PRODUCT..SO KINDLY DO D NEEDFUL N TAKE BACK D PRODUCT..AS D ISSUE WIL B SAME EVEN AFTER REPLACEMENT..SINCE D PHONE IS HAVING GENUINE PROBLEM..N DNT WANNA GET IN SUCH ISSUE DAT U WIL REPLACE D PRODUCT DEN IF SAME ISSUE IS DER M AGAIN CALLING U..SO KINDLY PROCESS D REFUND REQUEST.. Dis was wat my problem..nd LCt person aditya gave d resolution dat wait fr d update..after lollypop wats d next update..n der manager r a lie teller..he told me dat he wil call me back after 5 min..but he didnt gave a call back..der services r pathethic..i wil do all d necessary post wat i can do..to get a resolution..i knw all d necessary mai ids..wil send d pic of my mobile in d next post fr wat a genuine cx does wen he buys a phone..n d genuine cx is nt getting a proper resolution..dey r all money eater..dry r nt service giver..d LCT person aditya says do watever u want to..lets see wats d post makes dem to do.",
            "date": "02 May 2015",
            "name": "Farhan Fansopkar",
            "stars": "1 star"
        },
        {
            "comment": "Got this phone just two months back. It is giving lots of problem and Flipkart people are not interested in replacing this device at all.",
            "date": "02 May 2015",
            "name": "Deepak Rathor",
            "stars": "1 star"
        },
        {
            "comment": "I was waiting for this phone from long time since it came to market. Finally the day has came to buy it through FlipKart.As i do always if i need to buy through online. Some facts about this product after using for about a month now : 1.Moto G looks classy in style with its design. 2.As mentioned its a water resistance i was stuck in rain few days before in bangalore and was able to use the phone after getting drained out partly in my pocket. 3.if you are listening to music through ear phones and you get a call in between, by the time you unplug the earphones from the jack and their goes you wont be able to hear the voice of the speaker from the other side but he can hear your voice.I guess its a bug that is making to switch off and swith on to bring it back to normal condition eevryday basis. as I love to listen music. 4.Battery back up is not upto my expectation as per their specifications. its getting drained out in 8 to 10hrs if you keep listening to music and by launching some basic apps on phone. 5.speakers are good but by keeping more volume i guess the speakers would get ultimately damanged gardually. 6.it takes longer time to get charged completely through USB cable. atleast 4hrs. 7.graphics quality of the phone is superb as i love to watch moves in HD's... You could easly play moves in .AVI, .MKV,MP4,MPGV,blueray HD files as effeciently as you could watch in VLC or KM player in your PC's. Finally I wont recommend anyone to buy or not to buy this product.. it has its own pro's and cons",
            "date": "02 May 2015",
            "name": "Shrikanth M Hugar",
            "stars": "3 stars"
        },
        {
            "comment": "everything fine...except speaker problem...even at zero volume level...some noisy sound is coming from speaker....",
            "date": "02 May 2015",
            "name": "kenedy tensubam",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: Everything Sexy Looking Phone Mannn.... Cons: Little drains faster.(actually i am using roaming SIM i don't know may be roaming could be reason for fast drain)",
            "date": "02 May 2015",
            "name": "Rupesh Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola's products are great.It's android os is customized by google so given great performance and os's updation first released by google's product.Moto G is good,Reliable product.I will recommend to buy it because it's good mobile in budget.",
            "date": "02 May 2015",
            "name": "Hiren Patel",
            "stars": "5 stars"
        },
        {
            "comment": "We have observed that moto g 2nd generation battery charging is not coming more than 3 hrs which need to improve.",
            "date": "02 May 2015",
            "name": "Venkateswarlu...",
            "stars": "3 stars"
        },
        {
            "comment": "Its good product in this price range. i am using it since Nov 2014. no complain. Flipkart delivery is simply good.",
            "date": "02 May 2015",
            "name": "Chandan",
            "stars": "4 stars"
        },
        {
            "comment": "good phone but not a superb phone. there are many phones in the market that are better than this at the same or lower price. but it(moto) has an advantages of latest update of android OS which will not be available for other phones. camera quality, battery back up are normal like other phones. sound quality is excellent.",
            "date": "02 May 2015",
            "name": "deepak khatana",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone in this price range as compared to other brands. The quality of the plastic is quite good. The camera is also good. overall the motorala online chat service is impressive and the rolling out of the latest Android update takes it a notch up against its competitors. not to forget the amazing battery life it offers.",
            "date": "02 May 2015",
            "name": "Abhay",
            "stars": "4 stars"
        },
        {
            "comment": "Firstly, thanks to the flipkart for delivering this product safly. The product reached me within 7 days. This mobile is really very good. I liked the handset look, good feel and overall aspects. Camera and additional storage are the biggest upgrades overall this product is very good. thanku flipkart.",
            "date": "02 May 2015",
            "name": "M Naresh",
            "stars": "5 stars"
        },
        {
            "comment": "After 3 days of usage Its a descent phone and the requirements have been met, white colour looks cool comparing to black.",
            "date": "01 May 2015",
            "name": "Jeyaraman Bask...",
            "stars": "5 stars"
        },
        {
            "comment": "Has tons of problems with it. Some of the basic ones are: - Hangs very often, especially apps in this phone hangs very often. - Sometimes, there are problems in connecting to net. - Phone calls doesn't get cut until the other side disconnects In today's time, these basic problems are not acceptable... Sorry Moto G, you have disappointed me :(",
            "date": "01 May 2015",
            "name": "Priyanka Surana",
            "stars": "2 stars"
        },
        {
            "comment": "its a great phone for the price, but the delivery from flipkart delivery was delayed, it took 4 days to deliver that also from Bangalore warehouse to Bangalore delivery address under the same pin code.",
            "date": "01 May 2015",
            "name": "SUBITH KRISHNA",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best mobile I have ever used... Awesome Display , Sound & Camera quality.... Thanks to flipkart's delivery service...... GO FOR IT.......",
            "date": "01 May 2015",
            "name": "Pavel Malik",
            "stars": "5 stars"
        },
        {
            "comment": "One of the worst product. Battery drains very quickly. Takes so much time to open an application. I think Samsung is better than this. No zero rating is there, so going for 1 rating. I request people not to go for this product. Waste of money",
            "date": "01 May 2015",
            "name": "Sikindar Shukku",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased MotoG2 in Dec14 and after 5 months , its screen got damaged as mobile slipped from my hand and gorilla glass cracked. When I checked with service center they quoted 7+ K to replace the Gorilla Glass. now the cost of mobile is 11K. So I decided to throw this mobile. Will never go with Motorola again.",
            "date": "01 May 2015",
            "name": "Braj",
            "stars": "1 star"
        },
        {
            "comment": "Dont go on negative reviews..Its too Good..I have been using it since 2 months..Ordered 1 more for my brother. Charge it with samsung charger n yu get no battery issues :)",
            "date": "01 May 2015",
            "name": "hafsa Rafeeq",
            "stars": "5 stars"
        },
        {
            "comment": "Hi. I wanted to buy a product which was suppose to be a real value for money. There were few more options available in the market. However, decided to buy Moto G 2 because Motorola is one of the renowned company and moreover this OS is directly controlled by Google. I liked this product. Black is nice and white is very classy. The configuration of this phone is very good if you are paying 11K. I did not find much issues with battery life however it will be a bit early to comment anything about this. Camera quality is pretty decent. Best part is the internal memory and the built quality. Does not lag at all. Overall - Nice and value for money. Go for it if you are not very very heavy user. Rating this device as 4 Star as I wanted to get the battery at least of 2900 mAh.",
            "date": "01 May 2015",
            "name": "Abhishek Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "I am using two SIM from Airtel, one prepaid and other postpaid. Prepaid I am using for 3G data and Post postpaid for voice call. Problem I am facing while using 3G data and making call or receiving call on the other postpaid SIM. My 3G data connection gets disconnects and connects back when I hang up my phone back form voice call on other SIM.",
            "date": "01 May 2015",
            "name": "Amit Gupta",
            "stars": "2 stars"
        },
        {
            "comment": "Good Mobile At Reasonable Price with exiting Offer from SBI Card. After Long time i'm switching to New mobile from suggestions of Flipkart Reviwers keep going FlipKart",
            "date": "01 May 2015",
            "name": "Rangarajan Vas...",
            "stars": "5 stars"
        },
        {
            "comment": "I have used both Moto G1 and Moto G2 , both Working fine some days before Moto G1 was having network issues but later updates fixed it . I am not getting accessories for moto G1. if flipkart can help for flip cover original from moto.. then will increase one more star.",
            "date": "01 May 2015",
            "name": "Sagar Ikhankar",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone around a month back and am using it since then . Pros : 1) Brilliant looks and feel really nice in palms . Much better than samsung or Micromax Phones. 2) No Lagging - Processor is fast enough . 3) Good Camera . Takes good clicks both from front and rear. 4) Solid Built Quality - Of all the points above , this is the best think I like about this phone. Cons : 1) Very average battery life .2100 mah is too low considering competitors provide better mah in same price. 2) Though I do not play too many games . When playing high graphics game , phone became little heated after playing continuosly for 30 mins. Overall Verdict - Good choice at this Price . If you change your phone every 1.5~2 yrs , this is the one you shud go for rather than going for 25k phones .",
            "date": "01 May 2015",
            "name": "Shuchi Garg",
            "stars": "4 stars"
        },
        {
            "comment": "Used first time the handset made by Motorola,Device worth my money 100% .its the best phone in the market in this Price range my only concern is about is price as i had purchased for 13k and suddenly price drops to 11k .",
            "date": "01 May 2015",
            "name": "Nitish Krishna",
            "stars": "4 stars"
        },
        {
            "comment": "I actually wanted to rate is 0 or infact -5 but unfortunately the option is not available. 2 days back I bought this product for 9899 and its pathetic to find out that Flipkart is giving defective products on sale. I was so happy to order the product seeing the review for product but now I have lost trust in Flipkart. I will have to think twice before ordering any product on sale through flipkart.The phone screen gets heated in 5-10mins and its very difficult to even talk continuously for 5 mins. Really upset with flipkart/motog. Dont know who to be blamed for it.",
            "date": "01 May 2015",
            "name": "Bhaumik",
            "stars": "1 star"
        },
        {
            "comment": "We bought moto g2 last month 14th April, they gave offer discount of Rs.1000 total price is 11,999. Now this week they are giving another Rs.1000 for Rs.10,999. Pl don't cheat the consumers. What is the real cost of the phone? Why this much discount in a months? This is cheating....",
            "date": "01 May 2015",
            "name": "Raja",
            "stars": "1 star"
        },
        {
            "comment": "As i mentioned in my review title, this phone heats alot , has a buzzing earpiece problem while on a call and battery backup is also not good at all. I also experienced headache while using this phone for more than 10 mins, maybe due to high SAR value. I have returned the phone due to the above issues",
            "date": "01 May 2015",
            "name": "Keshav",
            "stars": "2 stars"
        },
        {
            "comment": "good features for the price, never hanged. Front camera quality is less other than that worth buying.",
            "date": "01 May 2015",
            "name": "sreeja m",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone for the past 6 months. Based on its price its a very good mobile....design working are very good.the negetive things i found are 2000 mah battery which does not run a whole day if u r using 3g net or playing games...battery gets heated up quite a bit even if the back cover is not metallic...the camera is ok... But if u want budget phone with all the standard accessories dis is the mobile to buy.....",
            "date": "01 May 2015",
            "name": "Rajarshi Roy",
            "stars": "4 stars"
        },
        {
            "comment": "There are some best phones under 15,000 category but best stock Android experience you are going to get with this device. Intially thought of buying zen5 but after reading comments in flipkart i withdraw from the thought and i ordered MOTO 2ND GEN which i got lollipop updated you have to taste it believe me it is the best experience ur going to get pros: *screen is good *camera quality is decent *build quality is top notch which you are not going to get with chinaphones *last but not least LOLLIPOP you are going to love it *cons only con is Average battery life",
            "date": "01 May 2015",
            "name": "YaswanthReddy Kal...",
            "stars": "4 stars"
        },
        {
            "comment": "My last purchase from flipkart. How many times I have to call you ? And you saying that I have installed apps so battery getting drained , then why I have bought this mobile , just to keep it in box so I can see it everyday ? If mobile cant hold its battery with facebook and whatsapp why I need that mobile ? Total money waste and you taught me a good lesson. Thank you Flipkart for your wonderful lesson.",
            "date": "01 May 2015",
            "name": "Raja",
            "stars": "1 star"
        },
        {
            "comment": "Just got fucked after i bought moto reduced the price to 11k.. such a bullshit I dont want to tell more but as the site recquires , phone is getting hung soon even it has 1 gb RAM and 16 internal",
            "date": "01 May 2015",
            "name": "Fellow",
            "stars": "2 stars"
        },
        {
            "comment": "Its been since 3 months since i am struggling with this. has problem when u use both sim card. if u open data usage over other sim then after a while mobile signal goes off !! it shows Emergency calls only or invalid sim or didn't even acknowledge that there is a sim inside it !! has heating problem while playing online game like clash of clan. after 10-15 min use I feel like this is going to explode or melt. screen and rear part both became hot. I had to switch off mobile at least 2-3 times a day and after that it catches the signal . signal problem is with Moto G, E both i wish I has idea before buying this . for me its complete waste of money 13K !! Camera and screen is much better.",
            "date": "01 May 2015",
            "name": "Brajesh Kumar",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone. its good. there are some software issues in lollipop version. Software update is required.",
            "date": "01 May 2015",
            "name": "Rahul Kumar Bh...",
            "stars": "4 stars"
        },
        {
            "comment": "We have got value for money. Moto G is performing to my utmost satisfaction except its one of the accessory i.e. mobile phone charger. Please get the phone replaced and collect the faulty one.",
            "date": "01 May 2015",
            "name": "Anoop Chaturvedi",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is awesome....Have been using this phone from last 5 months....haven't faced any technical issue till now. Go with the phone without even giving a second thought as you won't get such good features in such a lower price with a good brand in smart phones.",
            "date": "01 May 2015",
            "name": "Shweta",
            "stars": "4 stars"
        },
        {
            "comment": "I find it very good phone under Rs 13K. Buy it without thinking of anything if your budget is less than 15K.",
            "date": "30 Apr 2015",
            "name": "Sudipta S",
            "stars": "5 stars"
        },
        {
            "comment": "Audio quality of the mobile is too bad… and I raised return request on 6th April ….. Still not response Are they selling used products (refurbished?) ? Never buy anything in discount sale.. from Flipkart",
            "date": "30 Apr 2015",
            "name": "Praveen Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "Awesome product package. Disappointed with no USB cable. Ear phones are about average. But the phone itself is wondrous. Motorola put its best in one kit with best price in the market. When I bought it, it was Rs. 13K. But Flipkart gave 10% off on every SBI debit card purchase which made me opening the phone kit merrier. Every now and then, Flipkart manages to keep it's best product delivery system continuous.",
            "date": "30 Apr 2015",
            "name": "Subhash PVRC",
            "stars": "5 stars"
        },
        {
            "comment": "This is the fourth moto g i've ordered from Flipkart , the first two being a moto g 2013 models and the others are moto g second generations. The other 2014 model was for my relative and it is working fine. The phone I got has a strong green tinge in the display.Upon requesting for a replacement , tech from flipkart said that they will be sending link for a smart check app to test the phone and will receive a call back from another tech for follow up in 4hrs. There was no link sent yet despite contacting them twice. I'm loosing my trust over Flpkart as a reliable source for buying Motorolla products.Giving wrong information to customer and giving faulty promises which you can't keep is not good customer service by Flipkart and Motorolla.",
            "date": "30 Apr 2015",
            "name": "Swaroop Joy",
            "stars": "1 star"
        },
        {
            "comment": "Its a good product while there are several in the market but you can rely on this as I am using it since past 8 months & it is running quite good. Compare to Samsung & other settled brand in the market it is cheaper & giving better results. Thanks Moto & Flipkart!!",
            "date": "30 Apr 2015",
            "name": "Tuhin Saxena",
            "stars": "4 stars"
        },
        {
            "comment": "looks great and classy and works just fine. loved it. the performance and the presence of work done at such price is more than satisfactory. loved it. go for it!",
            "date": "30 Apr 2015",
            "name": "kranthi sagar",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this mobile from flipkart and got it delivered the next day ( on additional charges) from the moment i got it , the mobile kept on rebooting after a different time intervals. I applied for return and flipkart with its great solution providing team gave me all support. No solution seem to sort it out. I checked the net on why this was happening. I found out that the lollipop is very unstable and has its own issues. The tech team of flipkart forgot to tell this to me or would have thought that i would not buy it. What ever measure flipkart took was just some factory reset and cache clearance which any tom dick and harry does. Did not expect this from flipkart. Guys kindly understand that you are customers are educated and they need it know this. My sincere advise is that people before you buy any plain vanilla google os devices, remember to check whether the os is stable. because flipkart accepts devices only if there are any hardware defects for replacements. Do not be fooled. !!!",
            "date": "30 Apr 2015",
            "name": "Sri Kumar",
            "stars": "1 star"
        },
        {
            "comment": "before updating to lollipop the performance of the device is pretty good but when i updated the os to lollipop version,the performance of the device is reduced very much. it is strucking,over heating.. what not everything.. performance is woerst",
            "date": "30 Apr 2015",
            "name": "Kimidi Rajesh",
            "stars": "1 star"
        },
        {
            "comment": "It's one of the finest product to purchase,battery life is very good,it never hangs like samsung make mobile.it is the best mobile to purchase",
            "date": "30 Apr 2015",
            "name": "SANTOSH shindhe",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, i am writing this review after using this for one month. it is stright away coming with the lollypop OS. as a moto product it is nicely working. after using of 15 days am getting battery charging issue. i think now a days every one while the starting days of buying this phone may got the charging issue. Because there are so many moto built in apps will run in background. for me it's created lot of issues, it is takes to full charge for 6 hours. but it is getting drained by 5 hours. i have raised for return the product, but the flipkart product expet Says that, we have to charge fully every time in the starting days and asked me to stop all the unnecessary apps which are running in the back ground. now the battery is coming more than 12 hours. over all the product is nice.",
            "date": "30 Apr 2015",
            "name": "Sivannarayana...",
            "stars": "4 stars"
        },
        {
            "comment": "Its the best smartphone with such specifications at such a rate.....Nice touch, good camera quality....da only drawback is the audio is not dat grt.....else.....Awesome Phone!!!",
            "date": "30 Apr 2015",
            "name": "Monica",
            "stars": "4 stars"
        },
        {
            "comment": "I am not at all happy with the type of product delivered by the flipkart on 29/06/2015 , the sim card are not getting detected by the Moto g2 , took to Moto service center they checked and informed . I was delivered a defected peace by flipkart , Not at all happy ,as it created a lot of inconvenience , don't know how will be the return policy . I would suggest others buy it from a store where you can check the product before purchasing .",
            "date": "30 Apr 2015",
            "name": "Sijo Moses",
            "stars": "1 star"
        },
        {
            "comment": "One day Delivery service of Flipkart is very nice. Product safely & on time delivered. one of the best service overall my online shopping experience.",
            "date": "30 Apr 2015",
            "name": "Chetan Jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for my brother and he is really happy with the phone performance, I bought it for 12999 and It is just awesome to have this phone into this price range. I personally love the phone speakers, sound quality is very good. Look wise it is a decent phone and size is also decent. It looks elegant in hands.",
            "date": "30 Apr 2015",
            "name": "Ashish Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Its a very good phone.. Thanks to flipkart to for quick delivery. Display is very good.. even phone is also very fast.",
            "date": "30 Apr 2015",
            "name": "Biswabrata Das",
            "stars": "5 stars"
        },
        {
            "comment": "Product is good. Sound buttons are bit stiff. Over all good product but sound button issue must be resolved in future.",
            "date": "30 Apr 2015",
            "name": "xyz",
            "stars": "4 stars"
        },
        {
            "comment": "I will never purchase anything from #flipkart in future. This site is ban from my online shopping list. The return policy is not good. I have purchased Moto g from here and the Charger was not supporting the phone. Hence I was not satisfied with the product and want to return it. But they have rejected my Return Request saying they can not return but ready to replace. Any how the charger start working after Technical support but now what I am facing that some software application is not working properly in the phone. Highly dissatisfied by the service of #flipkart.",
            "date": "30 Apr 2015",
            "name": "sannu sinha",
            "stars": "1 star"
        },
        {
            "comment": "I order Moto G 2nd gen 2 days back and got it delivered to me with in 48 hrs (Normal delivery). Packing and delivery was spot on by Flipkart About the phone I am using it for the past one day. No lags or heat ups ... Nice display and good camera ... Audio quality is good. Will post a review after few days of usage. Overall happy shopping at flipkart",
            "date": "30 Apr 2015",
            "name": "Ajay N",
            "stars": "4 stars"
        },
        {
            "comment": "Very disappointed with the service or support that Motorola had to offer. I received a faulty piece, which overheats when charged and voice echoes back for the person at the other end. I tried raising a complaint multiple times but their customer care people refused to believe that phone is faulty and conveniently blamed it on the network. When I pushed, they asked me to visit a service centre, which are normally located at Mars and where people don't pick up their phones",
            "date": "30 Apr 2015",
            "name": "puneet soral",
            "stars": "1 star"
        },
        {
            "comment": "I'm using this product for almost 6 months ,i'm very satisfied with this product.Battery is good.Sometimes its hard to operate the phone with a single hand.",
            "date": "30 Apr 2015",
            "name": "Rodriques",
            "stars": "5 stars"
        },
        {
            "comment": "Dear Buyers, please be aware of 30 days replacement warranty. Flipkart will not replace your product. I had an issue with my Moto G (2n Gen) within 10 days of purchase because of battery issue. I was asked to update s/w. Worked for a few days. Updated OS as well. Still there’s problem. Basically, phone has a problem. Flipkart pushed the problem beyond 30 days with temporary fix and now they say as per policy, 30 days time period is over. You will be asked to go to the service center. That's the only support you can expect. On top of it, they accuse you of not handling the phone right with their assumptions. They also question your integrity by asking hypothetical question like, \"what would you do if your phone went wrong in 3 months - will you still ask for replacement?\" what sort of question is that? Isn’t it ridiculous? Flipkart gave me a defected piece and expect me to go to the service center to fix the problem. When you pay Rs. 13000 for a product and if the product has problems within 10 days, isn't it fair to replace the product unless there's an external damage? Why should one struggle to fix the software problems and go to service centers to get the problem fixed? Just accpet the phone has a problem and replace it!",
            "date": "30 Apr 2015",
            "name": "Venkatesh Mallya",
            "stars": "1 star"
        },
        {
            "comment": "First of all being a FLIPKART FIRST member got next day delivery, thanks. Superb phone with all features listed on site. A perfect feet 5\" inch screen. (as 5.5 inch screens are too big for pockets!!.) Lolipop is a lovely operating system.Toady is first day with phone and am enjoying. The major plus is sound - the stereo effect is unbeatable of MOTO-G, superb quality. Keep up the good work- Motorola and Flipkart. I have two observation about product. a) Despite being LOLIPOP - no support for indian Gujarati language.( other local Mfgs give the same) b) Front camera is not up to the mark. The best part was MOTO MIGRATE from MOTO E first generation to MOTO G, the way the data was shifted on wifi within 20 minutes - it was amazing.!!",
            "date": "30 Apr 2015",
            "name": "Baarin Dixit",
            "stars": "5 stars"
        },
        {
            "comment": "enough to satisfy your need...but the problem was changing of 3g network to 2g automatically.bcz it was preferred,may the os problem,otherwise its a nice phone with everthing good,backup,clarity,speed,durability,waterproof.",
            "date": "30 Apr 2015",
            "name": "shubham raj",
            "stars": "5 stars"
        },
        {
            "comment": "Heating issues are there in mobile when we use more than 20 to 30 minutes. Do not go for MOTo G2. With this price we will very good brand mobiles in the market. I have requested for replacement for many time within a 30 days warranty period but they do not respond till my warranty get expired. Technical team also not resolved my issue, simply they said that heating issues are very common in smart phones.FLIPKART is really worst and worst customer care in all online portals because they did respond to me till my Return policy over. Please do not take any products from FLIPKART.We can't be-leave FLIPKART. I'm suggesting to my all don't take any thing in flipkart. Flipkart is not good one at all. My Rating for this MOTO G2 is 0. My Rating for this FLIPKART is 0000000000000.",
            "date": "30 Apr 2015",
            "name": "Ravi Teja",
            "stars": "1 star"
        },
        {
            "comment": "My phone is just one month old...i appreciate flipkart service for their quick delivery, The problem with my phone is I cant see the caller's number and images while my phone is ringing..the display appears black..so i dont know who is calling..then what is the purpose of having this phone....i have to unlock the phone to see who is calling by pressing power button...i contacted moto help but their service is not good... So guys at this price lot of new phones with good configuration is available... my simple advice is dont go for it when it didnt fulfilled the basic function of a phone..",
            "date": "30 Apr 2015",
            "name": "Karthikeyan",
            "stars": "2 stars"
        },
        {
            "comment": "highly satisfied with the phone. i got it in a addition discount at 9899 thereby saving 3100 from actual price. One of the best budget phone. flipkart delivered it before i expected.",
            "date": "30 Apr 2015",
            "name": "Bishwajit Saha",
            "stars": "5 stars"
        },
        {
            "comment": "Got phone n flip the very nxt day. Booked it at a discount price wit airtel offer. Happy wit it ...!!!",
            "date": "30 Apr 2015",
            "name": "Kaushik D N",
            "stars": "5 stars"
        },
        {
            "comment": "The quality, finish, aesthetics, and overall features of this phone is excellent. You cant ask for more. The only issue I had was barely after 15 days, the price was slashed by Rs 2k. But, that is what is happening all the time now a days. You win some and you lose some.",
            "date": "30 Apr 2015",
            "name": "Priyabrata Pat...",
            "stars": "5 stars"
        },
        {
            "comment": "What i liked about the Moto g 2 is it's camera, it's really impressive. Other features are normal as in other phones.It's one of the cons is the price is a bit high.",
            "date": "30 Apr 2015",
            "name": "Ravi Raj",
            "stars": "4 stars"
        },
        {
            "comment": "I always prefer flipkart to buy any product reason they provide good service,Genuine product,delivering product is before date and important indian website, About Moto G 2nd generation it was very mobile within new price 10999 no other product i am finding good with such specification. Screen is very good,nice display.back camera is good,front camera is not upto that mark,good signal strength,3G working faster and battery is 2070Mah which is little disadvantage but for this price it was good if compare other specifications. Over all product is nice and delivery is faster appreciate.",
            "date": "30 Apr 2015",
            "name": "Ganesh Sanap",
            "stars": "4 stars"
        },
        {
            "comment": "battery is very poor when connected to internet it early shutting down this very hard we can't put internet full day when we go out. i am using nearly 2 months i am not feeling well with this phone -RCM",
            "date": "30 Apr 2015",
            "name": "Rama Chandra Murt...",
            "stars": "1 star"
        },
        {
            "comment": "I ordered Moto G in another order and got the faulty piece however Flipkart refunded my entire amount. This time i again bought it with good offer and got the perfect piece. Not facing any issue.",
            "date": "30 Apr 2015",
            "name": "Sandeep Chopra",
            "stars": "5 stars"
        },
        {
            "comment": "wondeful delivery by flipkart and product is awesome wich comes with lollipop 5.0.2 version and camera quality is exceptional and built quality is pure in style and everything is fine but not satisfied with battery with only 2070 mah",
            "date": "29 Apr 2015",
            "name": "sai vaisnav",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the phone 1 week back and from 2 days since I started using the phone,it was giving problems throughout.Touch problem was there and because of that I couldnt even make calls using that and battery was getting drained very soon eventhough i didnt use it and mobile was also getting over heated.I called Flipkart asking for the refund and they told only replacement can be done now.I don't want this Moto G anymore.Those who are going to purchase,please think before u proceed.",
            "date": "29 Apr 2015",
            "name": "Robin",
            "stars": "1 star"
        },
        {
            "comment": "I love this phone this segment....owo nice camera display...Its a nice idea for moto g compani......This speaker ia great ......",
            "date": "29 Apr 2015",
            "name": "Sk Minan Nur",
            "stars": "5 stars"
        },
        {
            "comment": "I had been looking for a right mix of performance, looks, power and accessibility for a long time. I had tried my hands on touch screen phones (a Samsung and a Sony) but never could decide of them to be replacements for my Blackberry. Moto G succeeded in winning my confidence after almost 3 years. This is absolute value for money. Unless you are not being overtly nasty with it it will stay faithful and will not let you down. :-)",
            "date": "29 Apr 2015",
            "name": "Avik Chakraborty",
            "stars": "4 stars"
        },
        {
            "comment": "bought two phones for 9900 each! totally worth it and yes i suggest you..just go for it! nice features!",
            "date": "29 Apr 2015",
            "name": "Monica Rekapalli",
            "stars": "5 stars"
        },
        {
            "comment": "It has been amazing phone in this price range. Comes with the latest android OS Lollipop v5. Battery backup is good. Handy phone. Little bit over weighed but good. Nice display.",
            "date": "29 Apr 2015",
            "name": "Fawaz",
            "stars": "4 stars"
        },
        {
            "comment": "Fist of all Flipkart stands NO1, in fast deliveries {as per my view},Hope it remains the same, As awesome mobile, Worth of the price Superb cameras, front and back Awesome style and good and handle to it, Battery very good Build quality is good HD Screen Its an Good Mob, Really an worth",
            "date": "29 Apr 2015",
            "name": "sai",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is good can be purchased but battery must be little more. price falls down nearly 2000 after my purchase. Little disappointed for that anyways if any one wants to purchase may place the order and avail the discount. Phone is nice and I am satisfy with it.",
            "date": "29 Apr 2015",
            "name": "Dilip Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Best in its kind. Motorola should have more service center's across the country. In Assam there is only one!",
            "date": "29 Apr 2015",
            "name": "Amit Bukhredia",
            "stars": "5 stars"
        },
        {
            "comment": "There are Android phones and there are Stock Android phone, and Moto G2 is the best option in the 10K-15K range. With 1 GB RAM this phone is good for light and moderate users.",
            "date": "29 Apr 2015",
            "name": "Achin Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Hello Team, I got a defective piece where its not even charging after 28 days. When I tried to request for a replacement it was already 30days and now I am unable to replace the piece I got. So my suggestion is do not do not buy this product from flipkart.",
            "date": "29 Apr 2015",
            "name": "sundaram",
            "stars": "1 star"
        },
        {
            "comment": "The MOTO G second generation white colour mobile I have purchased from Flipkart for 12999/- for my spouse and it is a master piece to posses. Though I have later purchased Desire EYE from Dubai, the photos from MOTO G2 is so great and very nice skin tone quality comparable to my DSLR camera. It is a very perfectly priced (cheaper) than for its contents and quality.",
            "date": "29 Apr 2015",
            "name": "Veeramani Srin...",
            "stars": "5 stars"
        },
        {
            "comment": "Never had ever encountered such a buyer unfriendly company. The last time I bought a phone, Samsung GT-S7562, its performance was worst in every deapartment when compared it with same phones but bought from brick and mortar shops. The history has repeated itself again and I am finding this new phone also behaving so erratically. I have found the phone hanging on so many occasions. The sound suddenly dips during the middle of songs and then recovers. The camera is also not very good. The phone has already become slow within a span of just 30 days. Now when I want to return the product , they are denying and making sure that I go through all sorts of harrasment.",
            "date": "29 Apr 2015",
            "name": "Rahul",
            "stars": "1 star"
        },
        {
            "comment": "Battery required 10 hours to charge fully. And, drained fastly in 3-4 hours even with battery saving apps installed and optimized. Requested for replace the product first time. Second phone too got the same problem. So, they refunded it. The phones with offers aren't good like old ones. they aren't even worth for that offer rate. Heard from friends that the old phones doesn't have any of these issues.",
            "date": "29 Apr 2015",
            "name": "Jegan S",
            "stars": "1 star"
        },
        {
            "comment": "This is a awesome device. its camera is the best in 8 mp, no words for front facing camera, hats off to processor best, the screen is the best the gorilla glass also all the features are awesome fabuolus before this i was using galaxy grand it was good but not good as this 1. Its speakers are rocking but when we do voice call its sound is too much like the loud speaker 2. No problem with dual sim( signals call internet sms etc ) 3. But with the two sims 3g net and wifi the battery gets drained in 5 hours only 4. the battery is not so good it only runs for a day with few call,movies , gaming etc. 5. First i was using kitkat now i have upgraded to lollipop it runs with no problem 6. The front facing camera is awesome in light as well as dark /low light or with flash 7. Screen is good with picture quality and video quality. 8. its has been upgraded to 5.0.2 lollipop which is highest than the nexus devices also IN SHORT THIS IS BEST PHONE IN 13K",
            "date": "29 Apr 2015",
            "name": "VATSAL GUPTA",
            "stars": "5 stars"
        },
        {
            "comment": "The phone was delivered just a few minutes back as I am writing. It's an used phone which I've received in a new package. The screws are damaged. Dust all over. Sim slots were dirty including the body after removing the cover. Have called them immediately and have asked for refund (they would give me an another used phone in a new package if I go for exchange). But I've been informed that someone will call me. No calls yet. Will update as soon as I get an update. Flipkart - I lost trust with you.",
            "date": "29 Apr 2015",
            "name": "Nagaraj Chandran",
            "stars": "1 star"
        },
        {
            "comment": "I know the product is good as I have ordered it twice for my friends. I was trying to order the mobile today - 29/04/15 using the 15% OFF + 10% OFF on SBI Visa cards for MOTO phones. I was unhappy to see that the offer was removed prior to its expiry date - 29/04/2015. I have even called the Customer care guy to check out the same but he is simply answering that the offer was updated. He is certainly trained not to answer my question that - Why the offer was removed before its expiry ???",
            "date": "29 Apr 2015",
            "name": "Ram Prakash N...",
            "stars": "2 stars"
        },
        {
            "comment": "Good product for a good price. display good, sound quality good, touch excellent. no lagging even if multiple apps are running.",
            "date": "29 Apr 2015",
            "name": "Swapy",
            "stars": "4 stars"
        },
        {
            "comment": "its an excellent phone for its price...awesome on kitkat.......camera quality just excellent . one problem is that its a bit laggy on lollipop as it has only 1 gb ram.a great phone to buy ...now has reahed the top of the competition with zenfone...and all...it has the best software update and performance is amazingly awesome...waiting for lollipop 5.1 with fixes....best time to buy....best phone",
            "date": "29 Apr 2015",
            "name": "Prasanna V",
            "stars": "5 stars"
        },
        {
            "comment": "Nice service from Flipkart, received product in 2 days and in good condition... 5 stars to flipkart...............",
            "date": "29 Apr 2015",
            "name": "Varun Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought Moto-G2 few weeks ago and its working very well, happy with Flipkart service & handset. Although the offers from Airtel are fake, Airtel is real cheater. I wasted an hour on customer care but their offer data is not credited on my no. and now its showing me invalid account. When I now paid for 3G data, its showing only 2G data credited. Realizing their network speed is quite bad in my area. I'll be dumping its sim soon.",
            "date": "29 Apr 2015",
            "name": "Susheel Nagrani",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent product for the price. Works like a dream! Love the speakers - nice loud and very correct reproduction of music or any other sound! This is what I call value for money - with the 2000/- discount and further 10% off on debit/credit card!!!",
            "date": "29 Apr 2015",
            "name": "PORUS TAVADIA",
            "stars": "5 stars"
        },
        {
            "comment": "With Xiaomi phones not made available for general public with their show off flash sales, I decided to purchase the Moto G(2nd gen). This handset from the time of launch is still readily available on flipkart :) I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones. The only con in this phone is the very average battery life. If one is a regular user of the phone for browsing, whatsapp, etc several times a day I feel the battery will drain out in about 8-10 hours. Overall very much satisfied … i booked phone on 22/04/15 got it on 23/04/15 good service and price is 12000/- after one week i.e. today(28/04/15) the price come down to 10000/- i lost Rs. 2000/- just because of the flipkart customer care people. before booking the phone i took an advice by mailing and by phone. but they said by phone that we don't know. they not even respond my mail.relay, they don't know what offer is going rite now what may come in future. if they know also they will not guide us. really i'am feeling very..... bad. if there is any way to help me kindly do the needful please..................................",
            "date": "29 Apr 2015",
            "name": "Tarakeswara Rao",
            "stars": "5 stars"
        },
        {
            "comment": "every second error is generating , i don't want to use your product , its pathetic ! i want to get rid of ,important call email ,sms , everything is missing",
            "date": "28 Apr 2015",
            "name": "Mohd Imran",
            "stars": "1 star"
        },
        {
            "comment": "moto is rocking the in all segments, good build quality and nice finishing only cons heats up , but far better then samsung , which becomes as sam-hang....",
            "date": "28 Apr 2015",
            "name": "Bablu Mourya",
            "stars": "5 stars"
        },
        {
            "comment": "I am being forced to write this review because of the absolutely pathetic response i am getting from FLIPKART | WS Retail for the issues faced on this device. I will be completing a month today and its troubling me since the day i bought it. Around a week back i raised a request for return of this device, but they disapproved it after some stupid troubleshooting steps. 3 days back i raised request for return again as the device is still behaving badly, but till date no response from flipkart. I have been facing the following issues with this device: - Battery not charged properly, stays on x% for hours(need to restart to increase the %) - Sometimes when u remove charging, it shows the battery is still charging - Hangs and auto restarts on playing videos on fb, youtube - Call disconnects automatically - Very slow touch response",
            "date": "28 Apr 2015",
            "name": "Sunny Kaul",
            "stars": "1 star"
        },
        {
            "comment": "Wow! Amazing smartphone.Complete value for money. Pros: Amazing camera(Both camera having very good even in low light and Indoor lighting conditions). Amazing display, Large memory, Latest Android 5.0 (Lollipop). few Bloatwares. Cons: Average battery life(For power users) High radiation even in single sim :( :( (I can feel skin irritation even when I touch the phone after prolonged usage). High display spare cost. (If u break the display, it would cost about 7,000/-). Charger gets hot while charging. Low quality headset(but this is not a matter when compared to phone. Also in Moto service center people are waiting for hours to claim warranties because of less service center and many problems in the phone. PREGNANT LADIES AND HEART PATIENTS (WITH PACE MAKERS) PLS DON'T PREFER THIS PHONE.",
            "date": "28 Apr 2015",
            "name": "Avinash",
            "stars": "4 stars"
        },
        {
            "comment": "Go for it !!! best budgeted smart phone , testified and proven track record of Motorola , just no issue ,",
            "date": "28 Apr 2015",
            "name": "Abhijeet",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best mobile I have ever used.You will get all features that u need. +points 1)Good display 2)Real video recording & voice in recording is totally original 3)Battery backup is nice. You can see video up to 9 hours 4)Good web browsing 5)Music is clear 6)Wallpaper setting is good 7)Lollipop is running smoothly without any problems",
            "date": "28 Apr 2015",
            "name": "Bhaveshkumar V...",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought this on the first day of launch. I like it so much that I bought 3 of them for my family. I just love the pure android experience. The call clarity is really nice. So is the display.",
            "date": "28 Apr 2015",
            "name": "Anish Antony",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this handset after returning Sony Xperia E3 and Micromax Canvas Knight A350. Both returned in 10 days from the date of purchase. But this Moto G2 is something different than today's smartphone era. Good part is it automatically upgrades to Lolipop, latest Android version. Seeing the look and feel, you wouldn't mind paying lil extra. A good design. Functionality wise phone is above average. Works faster when have only factory software. On adding new apps and running multiple apps simultaneously slows down the phone notably. Camera primary and secondary is absolutely satisfactory. Ear Piece should have been better. It doesn't fit well though. Go for it. Value For Money.",
            "date": "28 Apr 2015",
            "name": "Shrikant Auti",
            "stars": "3 stars"
        },
        {
            "comment": "Backup dropped to 8 hours max within 5months. i bought it in october and used it for 4 months, backup dropped immediately to maximum 8 hours. No option for battery replacement too.",
            "date": "28 Apr 2015",
            "name": "Santosh Baratam",
            "stars": "3 stars"
        },
        {
            "comment": "Friends don't buy this phone. The only reason is there is no Service. Sharing my experience and I am resident of Mumbai. Bought Moto G 2nd gen from flipkart. The delivery was made after 5 days of order. After only two months of use my phones display got blank with no reason. My findings are: 1. There are no authorized service centers. 2. There's only one service center called B2X located far off Suburbs with total staff of 4people. 3. From past 15days I am following up. Only response I am getting is \"We cannot do anything the part is not dispatched from there some location in Chennai\". 4. They donot know when it will get dispatched and when they will be able to give me back. In this age of Service, I would rate this product a total failure. Don't buy because you are not going to get any service. Choice is yours.",
            "date": "28 Apr 2015",
            "name": "Shyam Gandhi",
            "stars": "1 star"
        },
        {
            "comment": "Hi, I have purchased moto g 2 on 19th Feb'15 after some days of using i noticed that while charging it take 3 to 4 hour for 100% battery charging. it disappoint me not happy",
            "date": "28 Apr 2015",
            "name": "Surya prakash",
            "stars": "1 star"
        },
        {
            "comment": "Mobile was good, feature good, handling M2 is like bt battery life is not good enough for M2, and how to set songs into ringtone ?",
            "date": "28 Apr 2015",
            "name": "grv",
            "stars": "3 stars"
        },
        {
            "comment": "Guys this is the best android mobile available in the market. Motorola has done good job in bringing these gem in affordable price. I purchased it at Rs. 11000 and at this price is is steal. I know there are few companies like Xiaomi, Asus, Lenovo who have released mobiles with better specs in better price but Moto G looks very expensive and smooth as compared to Zenphones, MI & Lenovo. Last but not the least in terms of brand Motorola is far far far ahead then these brands.",
            "date": "28 Apr 2015",
            "name": "Ashok Parmar",
            "stars": "5 stars"
        },
        {
            "comment": "so many phone available in market so keep in mind another phone also. battery drain too fast why.......... thanks",
            "date": "28 Apr 2015",
            "name": "om prakash gupta",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased Moto G 2 before 5 month. This is the best product in this range. Camera quality is good. Apart from this, only one service is missing, i.e. security, if you want to password in menu or gallery folder. Here is no any facility like samsung. Otherwise product is best.",
            "date": "28 Apr 2015",
            "name": "Sumit Chhipa",
            "stars": "5 stars"
        },
        {
            "comment": "First time I'm using Motorola Phone,it's a great experience.Screen size,Sound,Camera is so nice.Battery Back up also OK.",
            "date": "28 Apr 2015",
            "name": "Somnath Misra",
            "stars": "4 stars"
        },
        {
            "comment": "too cost ,only 1 gb ram , cam should be better , only 2070 mah battery ,better to go for lumia 640 or 640 xl",
            "date": "28 Apr 2015",
            "name": "raj kumar",
            "stars": "1 star"
        },
        {
            "comment": "though it comes with great spec. speakers are not as good. absence of usb cable is such a dissapointment.",
            "date": "28 Apr 2015",
            "name": "praveenkumar",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone for my father in October 2014. Its been 7 months and he is very satisfied with it. Camera quality is very fine. No lag while multitasking. Battery performance is good. No complaints.",
            "date": "28 Apr 2015",
            "name": "Sidharth Ganguly",
            "stars": "5 stars"
        },
        {
            "comment": "good .......................................................",
            "date": "27 Apr 2015",
            "name": "indian",
            "stars": "5 stars"
        },
        {
            "comment": "Why I was not informed that the price will reduce within 10 days. Customers must be aware of future offer. I am extremely unhappy.",
            "date": "27 Apr 2015",
            "name": "saket kumar",
            "stars": "1 star"
        },
        {
            "comment": "nice phone. touch is too smoth. camera n other features are aweome. lollipop is superb. i personally felt that the front speaker should be in body colour as in black its some what wierd looking.",
            "date": "27 Apr 2015",
            "name": "Ajeet Kumar Anand",
            "stars": "5 stars"
        },
        {
            "comment": "Guys Dont Buy anything from Flipkart ,bad experience with it I had purchased a Moto G 2nd Gen from WS Retail ,which was delievered on 30th March ,In the very 1st week of my usage i found the phone to be defective ,had lots and lots of problems .repeated calls and complains were made to flipkart but still my issue was not solved nor did I get any replacement .On 24th April I received a call from your product specialist ,as I was busy I requested him to call me after 30 minutes .He assured a call the very next day,On 25th April ,I did not recieve any call from your side ,I again called the customer care executive and then again he assured me of a call back the very next day ,as expected a still I did not receive any call on 26th April as well . On 26th April I recieved a message stating my return request was rejected .Again a call was made on 26th ,your customer care executive kept assuring of a call back the very next day ,Surprisingly its 27th today and I still havent Recived any call back from your end . Finally I have requested for an replacement or an refund on 27/5/2015 ,even after hrs I did not recieve any message or email confirming that my requested has been taken up,like it is always given .Again I called customer care service and they were helpless,all they said is they have taken a complain for the same ,which I have been hearing everyday without any outcome of the same All this while I did not recieve any message or email confirming that my complain/request has been taken nor any message stating the time when I shall recieve a call from your product Specialist",
            "date": "27 Apr 2015",
            "name": "Avinash Almal",
            "stars": "1 star"
        },
        {
            "comment": "I am using it for 6 months or so and got following issues till date : 1. Sever issue with battery back up . It drains out fast particularly when using internet 2. Got heated severly most of the time during using 3. Taking much time for full charging and charger itself got heated and 4. No data cable in package",
            "date": "27 Apr 2015",
            "name": "Atanu Sadhu",
            "stars": "3 stars"
        },
        {
            "comment": "I brought the phone a couple of days back and now flip kart has decided to dropped the prices. I called up the call center and they told they cannot do anything about it. I feel short changed on this and I will never order anything from flipkart again. They cannot guarantee for price match (it has not been even been a week since I ordered)",
            "date": "27 Apr 2015",
            "name": "Saket",
            "stars": "1 star"
        },
        {
            "comment": "camera is awesome both front and back, but some times music player got strucked and restart should be required, battery will be expected 1.5 days but for charging it takes more time like 4 hours this is the disaster of the phone. and lollipop is not good where silent mode option is not available in the phone.",
            "date": "27 Apr 2015",
            "name": "sai vardhan sunku",
            "stars": "4 stars"
        },
        {
            "comment": "horrible experience for me. i got product with manufacturing defect in SIM card slot. Battery backup i also not good. moreover i have requested for return but flipkart service is unable to solve my problem. they are not responding to my request",
            "date": "27 Apr 2015",
            "name": "TABASSUM KHAIR...",
            "stars": "1 star"
        },
        {
            "comment": "Nice piece for the price range 12K. No big issue. Performance is good. recently my phone is updated with 5.0.2.",
            "date": "27 Apr 2015",
            "name": "Raghunandan Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent piece,,, wonderful camera, superb OS, has been upgraded to Lollipop 5.0.2. Multitask with ease. I am a proud owner of MOTO G II.",
            "date": "27 Apr 2015",
            "name": "Ashutosh Upadhyay",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone for given money!! Smart phones do have heating problem and moto is not the unique one. It does the heating problem. So dont charge, dont play game, dont use internet download or any internet actions in hte background. Except the above it is really nice phone. till now( Apr 27, 2015). Brought the phone on Mar 20, 2014.",
            "date": "27 Apr 2015",
            "name": "Thangamurugan...",
            "stars": "5 stars"
        },
        {
            "comment": "Touch is not sensitive It is heavy Camera really sucks!! Tried to improve touch sensitivity by factory reset, but all in vain. Won't going to buy motorola phone ever again. I don't know why so many people are talking about this! Better to buy Xiaomi mi4i or note",
            "date": "27 Apr 2015",
            "name": "Ramandeep Singh",
            "stars": "1 star"
        },
        {
            "comment": "Great improvement of MOTO. Its really a good mobile to handle apps and other features. Good internal memory and easy to update",
            "date": "27 Apr 2015",
            "name": "Rama Pitchaikani",
            "stars": "4 stars"
        },
        {
            "comment": "Can do everything with it: pros: amazing display awesome camera amazing front facing speakers lollipop experience good although there are bugs right now comfy to hold, snapdragon 400 does everything smoothly adreno 305 does everything you ask it to multitasking better than any other phone with 1 gb ram, cons: absence of 64 bit capability does everything but heavy apps take around a second to show with lollipop headphones and charger low quality better buy another charger,it charges very slow battery drains very fast get around 3 hrs screen on time and 8 hours of use with 45 mins subway surf type games, standby time very low with wifi on, heating very low , max 43- 45 when playing extreme games.",
            "date": "27 Apr 2015",
            "name": "Saketh Sabbana",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone at this price..! With latest android version, it is coolest phone in this range with good speed n looks n camera quality is superb.",
            "date": "27 Apr 2015",
            "name": "Raghvendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Perfect mobile for all types of users. Screen quality is very good. watching movies in this 5 inch HD screen sure you will love it. battery is okay.",
            "date": "27 Apr 2015",
            "name": "Phani Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased this phone in Feb,,and in 2 months, I faced a lot of issues in this phone. Can't say whether issue is only in my piece or others are also facing this issue. - Unable to attend call many times.. phone got hang, - battery is super slowly charged - Now from today I am unable to hear caller voice . Need to use either speakers and headphones... Not happy with my handset..",
            "date": "27 Apr 2015",
            "name": "Megha gupta",
            "stars": "1 star"
        },
        {
            "comment": "Hello, I am using this phone since last 4 months, earlier I was impressed with features and less cost. But suddenly flash light of my phone stopped working. Service center guys told me to keep 2-3 days for software issue and for hardware issue 15 days which is not at all acceptable. One of my friend's phone suddenly stopped working. phone is dead now. Service center guys are not providing proper solution. 11K is wasted. So go for good reputed brand.",
            "date": "27 Apr 2015",
            "name": "Mandar",
            "stars": "1 star"
        },
        {
            "comment": "This is second time Im getting defective product. First one was with earphone, which easily replaced with another. So I was having good trust in flipkart about the return policy. But this this time Im really frustrated. Got phone which has problem with speaker. Requested return, customer care asked to install an app. They told they will be calling next day and will give PIN no to remotely accessing the phone. Next day, got a call and he told reset the phone it will be okay. Return request rejected. Reset phone, but still having the issue. Very next day battery also started draining fast. Again requested return, same repeated. Installed the App wait for the PIN. Next day customer care called and told to update phone (OS) software. Since I don't have very speed internet I can't update the phone. I told them to give the PIN and they told me after updating the phone only they can check. After many request he accepted but for the PIN I have to another day. Since many of frnds suggested Moto G 2nd Gen is good phone. Some of them using happily. I have checked the seller, WSRetail. Trusted seller. Rating 4+. Ordered the item. Now I came to know that why 2000+ users rated 1 for this item. Still Im not sure I will get Replacement / Refund.",
            "date": "27 Apr 2015",
            "name": "Shafeeq",
            "stars": "1 star"
        },
        {
            "comment": "Whatever icebreaking reviews i got for this phone,unable to believe on those after using it from last one month,Its getting hang so many times within in couple of hours,processing is slow,not worth to buy with present quality measurements.Their are much more better products available int he market.",
            "date": "27 Apr 2015",
            "name": "Megha",
            "stars": "2 stars"
        },
        {
            "comment": "using sinc elast 6 month , awesome feathers and get good service of my money. evn got android 5.0 . satisfied except its look, must be quite straighter .",
            "date": "27 Apr 2015",
            "name": "anil meel",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone on jan31.till march 31 no problem arise after that it was hanged for some time.and the both the sim slots are got damaged .i dont know why it happens",
            "date": "27 Apr 2015",
            "name": "rajashekar",
            "stars": "3 stars"
        },
        {
            "comment": "I was hesitant to buy a MOTO phone initially after using Nokia and Samsung top line instruments for many years, (I was replacing a Galaxy NOTE 1), but I do not regret this selection at all. Good Battery Life, Very Little bloatware. Good Performance on all counts for the price range.",
            "date": "27 Apr 2015",
            "name": "G",
            "stars": "5 stars"
        },
        {
            "comment": "got it for Rs 9899/- in Flipkart. All offers to gether ..... .................................................................................................",
            "date": "27 Apr 2015",
            "name": "Sathish Kumar D",
            "stars": "5 stars"
        },
        {
            "comment": "Battery life superb and even camera clarity.Speed of mobile is good while comparing with my first samsung duos mobile.",
            "date": "27 Apr 2015",
            "name": "Rama Krishna",
            "stars": "4 stars"
        },
        {
            "comment": "moto g perfect for multi user in android lolipop perfect camera as compare to other 8 mp camera front facing camera also good moto provide update upto 18 month from launching of date asphalt 8 and dead trigger 2 game also run smoothly",
            "date": "26 Apr 2015",
            "name": "SUNIL RATHAUR",
            "stars": "5 stars"
        },
        {
            "comment": "Recently i bought this product. This is a good smart phone for better price. All the features are good except the battery backup.",
            "date": "26 Apr 2015",
            "name": "Janapati Siva",
            "stars": "4 stars"
        },
        {
            "comment": "You are getting an awesome phone at a low price range . It has an excellent body finish pretty good while holding did not feel cheap interms of looking primary camera takes pretty good shots specially in the outdoor conditions heavy games can be played smoothly bt with multiple games at the same time it can hang for a moment or so cause of its 1GB ram . cons are its heating issue the temperature can raise upto 46 C which can be felt easily after 10 or 15 min of heavy usage . and the battery life is also not that good with a onscreen time of about 5 to 6 hours which is pretty enough for a whole day . After all its a good phone in this price range bt surely there are much better options but if u want a premium phone at this price than just go for it .",
            "date": "26 Apr 2015",
            "name": "Atul Tomar Avit",
            "stars": "4 stars"
        },
        {
            "comment": "It's been over 6 months and I haven't regretted buying this phone for even a single moment. Complete value for money.",
            "date": "26 Apr 2015",
            "name": "Kartik Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "I bought 2 mobile both mobile are facing so many issues,i raised requests n number of times. flipkart people not responding properly. Thay told every time we need troubleshoot the divices.I never seen this kind of service in my life. worst service providing the flipkart. Dont buy any mobile in flipkart.",
            "date": "26 Apr 2015",
            "name": "BHANUPRASAD LAVU",
            "stars": "1 star"
        },
        {
            "comment": "Value for Money. I installed more than 100 applications, Still running smoothly USB cable is not included with phone. Only charger and head phone included. if using 3G battery is draining fast Only Problem I found is voice call recording is not supported.",
            "date": "26 Apr 2015",
            "name": "Renish Ramacha...",
            "stars": "5 stars"
        },
        {
            "comment": "This used to be the best phone money could buy. It is served well by its vanilla android but its display and RAM undo all the good work done with the Moto G 1",
            "date": "26 Apr 2015",
            "name": "Kapil Amonkar",
            "stars": "3 stars"
        },
        {
            "comment": "Moto g2 is really below par... and in addition to that Flipkart's Service is Worse than that..Stop buying moto g2 and stop wasting your money or else you will definitely regret your decision..It is not that worth compared to its predecessor.",
            "date": "26 Apr 2015",
            "name": "chaitanya .",
            "stars": "1 star"
        },
        {
            "comment": "Mobile was good and but charger is wasted in a month and also charge capacity is very less compared to other moblies. very less service center in chennai please look into them",
            "date": "26 Apr 2015",
            "name": "Meena",
            "stars": "4 stars"
        },
        {
            "comment": "This is the second one I bought. Working great! except it was only one day when it stopped charging and I got scared but somehow got corrected of its own....Thank god otherwise had to follow up with customer care/ service centers.... I will buy one more but if I get discount....Don't I deserve when 'I bought already 2?",
            "date": "26 Apr 2015",
            "name": "Mohit Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I liked it too much as best performance in its class rather even better....I will buy one more certainly",
            "date": "26 Apr 2015",
            "name": "Mohit Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I got the phone on time and used it for ten days. The phone got stuck at loading screen and was not able to boot. Contacted flipkart, they replaced it with other piece. After using it for a month, the speaker got damaged. I need to rush to the service center, they took fifteen days to replace the part as it is not readily available. After a week or so, the phone started again hanging and gets heated up very often. Fed up of rushing to the service center every time, I bought huwaei honor holly which is pretty much fast and I am still using it with out any problems. The phone motherboard is changed (as informed by the service center). Now out of 10 calls you make, every 4th call, the other person cannot here your voice. So, you have to close the call and initiate again. I don't know how much time it will take again. Even the service center people are not fast in solving the problem. So, my sincere advise is better not to buy this one. And after all you are prepared to buy it, also be prepared to buy one more phone as you have to rush to the service enter every time. Even the upgraded android lollipop is not upto the mark. It needs plenty of updates. Features like call block list etc.. are missing compared to competitors. I have seen a lot of users of moto coming to the service centers with same kind of issues. So dare to buy this and feel free to loose your hard earned money.",
            "date": "26 Apr 2015",
            "name": "Naveen",
            "stars": "1 star"
        },
        {
            "comment": "excellent phone in 13k, camera is better then samsung 8mp. front camera is better than samsung 5 mp. video recording of this mobile (720p) is better then samsung 1080p. battery backup is excellent from samsung grand prime. i am using moto G2 from 5 months & still using.",
            "date": "26 Apr 2015",
            "name": "kumar chandan",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Superb look,feel premium in hand Battery Backup good ,goes all day if not playing any games No heating problem, also charger on first use heats and then became normal Superb rear 8MP Camera Supports otg Plays high end games, only tried asphalt 8 airborne No lagging White colour phone looks cool Speakers at front are loud and clear Internal memeory is 11.48Gb and is Enough to store Brand Tag of moto Cons: Front camera not good No USB cable given in box Blue colour flipcover on white phone looks superb but on usage gets dirty,but no problem you can clean it with alcohol and cotton Not found any more till now But should buy it from Flipkart only",
            "date": "26 Apr 2015",
            "name": "Prashant Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Ever since I purchased moto g2, it showed lot of defects in the phone. The phone heats too much whenever. It also got poor music player. one month passed I was using the product but suddenly its display shattered as the mobile got pressed inside my jeans pocket. It is really not worth buying a phone with a poor hardware after spending so many bucks.",
            "date": "26 Apr 2015",
            "name": "sulaksha galyekar",
            "stars": "1 star"
        },
        {
            "comment": "I was planning to buy my first smartphone, did a lot of analysis and browsed through so many reviews and finally finalized Moto G 2nd Gen which is in my price range, really good looking phone with latest android updates available. Phone is really have a competitive price compared to other brand phones with the same configuration, navigation of the phone is really smooth.",
            "date": "26 Apr 2015",
            "name": "input output",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this for the past few months , The Only good thing when compared to other low end mobiles is voice clarity response to Touch is horrible and this went to worse when upgraded . Many restarts to come back to normal Need to wait after touch to call anyone It is just as normal smart phone.",
            "date": "26 Apr 2015",
            "name": "Viswaraj",
            "stars": "2 stars"
        },
        {
            "comment": "Within 10 days phone is useless . audio and video didnt sync battery heart Worst customer care service Please research more before jumping to this . I gave 5 stars m after my 5th day im giving 2 stars",
            "date": "26 Apr 2015",
            "name": "Kaushik.S",
            "stars": "2 stars"
        },
        {
            "comment": "I really like it.Worthy of money..But not providing data cable..............................................................................................................................................................................",
            "date": "26 Apr 2015",
            "name": "shiva kumar",
            "stars": "5 stars"
        },
        {
            "comment": "After 4 month use, I'm not satisfied. 1.battery is below average. 2.screen is normal. 3.while browsing in 3G, phone is heating up. 4.No default file manager. I think this is the only smart phone that have no file manager. 5.when using GPS navigation, phone getting low battery in 3 hours.",
            "date": "25 Apr 2015",
            "name": "Saravanan",
            "stars": "2 stars"
        },
        {
            "comment": "I have purchased two moto g (2nd Gen) mobiles flip kart. Processor of mobile is good. Picture quality is very nice. Screen size, speaker, features are very good. Speed of delivery is very fast. Next day I received mobile after placing order. One drawback, I want to notice radiation of waves is very high.When we use to talk long time or use multipal opeartions more heat is generating. Battary Life is very less, if you are using 3G network, you need to charge twice in a day.",
            "date": "25 Apr 2015",
            "name": "Babasaheb",
            "stars": "4 stars"
        },
        {
            "comment": "Gud camera clarity and the lollipop version is awesome and the internet also very speed in the handset...",
            "date": "25 Apr 2015",
            "name": "Ch Bhanu Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "I got the phone just one week ago...within these 7days i faced no issues regarding the device or any malfunctions. The phone has some inbuilt features provided by Motorola..like Moto Assist and Moto Alert which makes the phone unique. Its camera quality is excellent(both rear and front), smooth touch, awesome display and resolution, light weight. But the headset sound needs to be improved. It's not so good. Probably i'll buy another headset of other brand like JBL. Apart from this particular issue the phone is really excellent. I am satisfied.",
            "date": "25 Apr 2015",
            "name": "Soumik Karmakar",
            "stars": "5 stars"
        },
        {
            "comment": "i like the mobile very much it is best in all ideal for normal users and also give a high end specs at only 11k is lot more for me. I will surely recommend this for persons with under 12k budget. the only problem i faced uptill now is its android 5 lollipop, actually sometimes it is not responding properly.",
            "date": "25 Apr 2015",
            "name": "shubham sonawane",
            "stars": "5 stars"
        },
        {
            "comment": "Its my first smart phone. It was working with kitkat android but as it upgrade with lollypop its performance degrade a little.Its rear camera is too good capture damn good quality picture and shoot video also. It look also good. But its accessories are not as good as mobile you have to place order for the another earphone if you like music. Over all we can not get any other brand smart phone in this price.... Go for it.",
            "date": "25 Apr 2015",
            "name": "Himanshu Mittal",
            "stars": "5 stars"
        },
        {
            "comment": "About Flipkart: Its always a pleasure to do shopping on FlipKart and specially when you get exclusive deals which is not available anywhere. About the Phone: Good phone at this price. I am using it not since more than 3 months and its working perfectly fine.",
            "date": "25 Apr 2015",
            "name": "Hozefa Tijoriwala",
            "stars": "4 stars"
        },
        {
            "comment": "i bought a moto g 2 almost 6 months back for my mother... it was defective.. In the begenning we didnt realise it.. but later when we realised we gave it to our nearset motorola service centre.. they said they would return it in 6-7 days instead they returned us back after one month.. Also the number which they gave us was wrong.. Another number nobody would pick... and now when we got back our phone it is more defective... earlier the call would cut itself while talking in between... n now we are unable to receive calls of anybody... also if we call to somebody it cuts itself in between the conversation...THESE GUYS HAVE VERY PATHETIC SERVICE... I WILL NEVER SUGGEST ANYBODY TO BUY MOTOROLA PRODUCTS.. THE SERVICE CENTRES PROVIDE REALLY POOR SERVICES.. THIS IS NOT TOLERABLE..",
            "date": "25 Apr 2015",
            "name": "visitor",
            "stars": "1 star"
        },
        {
            "comment": "pls dont ever buy this mobile.touch is not working, without plugin we cannot use this mobile. dont waste your money",
            "date": "25 Apr 2015",
            "name": "kiran",
            "stars": "1 star"
        },
        {
            "comment": "Pathetic first flipkart purchase experience, I've received a phone which having manufacturing defect and audio often doest works during calls raised complaint with flipkat regarding this almost before a month but I have not received my replacement just like xiomi motorola must pull out flipkart and search for any other platform to sell their phone this one star is to flipkart not for moto g phone is good.",
            "date": "25 Apr 2015",
            "name": "atul pathak",
            "stars": "1 star"
        },
        {
            "comment": "Bought this mobile 3 months back from FLIPKART, thanks to it's fabulous service got my handset within 3 days. Have been using this since then & i am totally satisfied with dis handset. Though I am a new user of Moto so was hesitant initially but cell is more than what i was expecting. Comparatively good battery backup ( 1+ day with normal use of gaming, calling,net surfing & using whatsapp) ; camera quality s good. All in all it s best cell in this price segment.",
            "date": "25 Apr 2015",
            "name": "Himanshu Chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "Wonderful product from #Moto. Worth the cost. Sound clarity in outside speakers is awesome. Display is clear and better than my Old Samsung S4.",
            "date": "25 Apr 2015",
            "name": "Bharanidaran K...",
            "stars": "5 stars"
        },
        {
            "comment": "There is no need a review for moto g2. Because it is already a king among the middle range phones. Super super.i brought this as gift for my wife.she is really enjoying.",
            "date": "25 Apr 2015",
            "name": "dr khaleelu ra...",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone in November 2014 & reviewing now after 5 months... First of all pointing out the advantages of the phone... 1) Considering the pricing of d phone at 13k with brand name Motorola attached,... i would say its a bang for buck at this price...Yes there are great competitors like Asus zenfone 2 a most budget flagship device.. but you can never ignore a brand name & its quality & durability... 2) Coming to the interface provided by Google..(Google now launcher) with android latest lollipop 5.0.2 its a great combination providing butter smooth interface .. great features..plus its capable of getting 5.1 update which has all bug fixes to lollipop... 3) With 1 GB of ram it is capable of playing all high end games like Asphalt 8, Dead trriger 1/2, Modern combat 5, brother in arms 3 etc.. No issues with that bt still if you are a hardcore gamer go with phone packed up with 2GB Ram for smooth high end play.. 4) Lollipop greatest benefit is the ram management it provides.. i can surely notice the smoothness it delivers than kitkat n experienced smooth playback on games also.. 4) Phone is capable of playing Full HD videos with the help of vlc player easily.. no lags as such.. 5) Coming to the camera the back camera packed up with 8 mp shooter is just amazing.. provides good color combination images... n rear front facing camera 2 mp is also good..(not a great camera user) still you can check other reviews you.ll find good reviews about camera... 6) A much needed thing fr any phone for me is rooting it... provides tone of customization's with custom roms + recently cm12.1 ( 5.1 update ) type custom Rom has been released which is great thing... with xposed framework for lollipop.. So there.s no doubt you,ll get bored about it... Coming to some noticeable disadvantages.. 1) The battery is not removable which makes it a problem to have a visit to service center if some problem occurs.. 2) The battery backup of d phone on standby is great Np in that.. but then if u use it for hardcore gaming with WiFi/mobile data continuous usage u wont b happy then.. 3) I,m a average user - MY USAGE STATS ARE MOSTLY - WiFi on whole time for whats app, Instagram, Facebook & decent gaming - This usage provides me around 10-11 hours of battery backup with screen on-time usage of around 4 hrs 30min or 5 hours.. which is no doubt great thing when u use net don't expect battery to b great... So guys a last thing to say if u looking out for budget smartphone provided by google with regular updates + brand-name+ casual gaming + quality and durability this for you... ITS SAID ALWAYS PHONE WITH SPECS THAT COMES ON PAPER N PRACTICAL USAGE TRUE IS A GOOD ONE... YOU'll FIND GOOD BUDGET PHONES MARKED WITH GREAT SPECS NOWADAYS.. BUT BE SURE TO SEE ITS GOOD ON PRACTICAL USE ALSO.. DON'T JUST GO FOR SPECS BUT SEE QUALITY + DURABILITY = LONG LIFE SAVINGS ON PHONE..",
            "date": "25 Apr 2015",
            "name": "YASH DEDHIA",
            "stars": "4 stars"
        },
        {
            "comment": "I took delivery of the Moto G 2nd Gen on Oct'14 with great excitement ! But from the very begining, it started giving problem with \"connectivity\", both \"net\" on & \"net\" off. I am a regular customer of this company, But they didn't bother either to replace or repair the set, at all. I am totally frustrated & thought, It would have been better to throw Rs. 13000 to river Ganges, instead of investing in this product. This is very unfortunate that Flipkart never care for the after sales services to their customers.",
            "date": "25 Apr 2015",
            "name": "Raagini Roy Ch...",
            "stars": "1 star"
        },
        {
            "comment": "Using since 2 months device sometime lags while unlocking, may b because of 1GB RAM, this device need 2GB RAM, price is little high comparing with other competitors, otherwise everything is fine. Device is little vibrating while increasing volume level, only minor problems.",
            "date": "24 Apr 2015",
            "name": "Shafeek Muhammed",
            "stars": "5 stars"
        },
        {
            "comment": "camera awesome,games with heavy graphics runs nicely, internal storage is 16 GB,awesome . battery is some what decent, display is good",
            "date": "24 Apr 2015",
            "name": "ROHIT KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I am satisfied with product as well flip cart, only thing i am expecting some special gifts or offers for me as i am regular customer, purchased over 50 products worth 2 lakhs",
            "date": "24 Apr 2015",
            "name": "katuri Srikant...",
            "stars": "5 stars"
        },
        {
            "comment": "Do not go for this product, I am having lots of problem like hanging, heating and poor battery backup with this device;, Even flipkart customer support is not useful any more, The do not rely what problems i am facing. They just cheque my phone status with some app online and responed device is working properly. Maximum heating temp is 45 and my device is around 42 or 43, but they are ohk with that. I can't place phone close to my ear due to heating problem but flipkart is ok with that because app does not show them phone is heating. Hanging is another issue with this device, When you try to call any no u cant dial in one shot, or receive most of the time call. Screen goes blank every time. I will prefer to buy micromax max mobile from any other site,because if you buy from flipkart and any problem occure with that then they will not help you,,, Wastage of money. don't make mistake like me...",
            "date": "24 Apr 2015",
            "name": "ASHISH BHATT",
            "stars": "1 star"
        },
        {
            "comment": "Battery issue needs to charge atleast 2hr to get full 100% charge else best in this range................................",
            "date": "24 Apr 2015",
            "name": "Avinash",
            "stars": "3 stars"
        },
        {
            "comment": "My request dated 21.04.15 for replacement or return of my order delivered on 30.03.15 on account of heating and hanging problem has still not been approved till 24.04.15 . The website apparently fights shy of accepting return of high value defective itemsalthough it is within guaranteed return policy . .",
            "date": "24 Apr 2015",
            "name": "Bhramar Saxena",
            "stars": "1 star"
        },
        {
            "comment": "Received this unit within 40 hrs of placing order! But disappointed with its poor media volume output...touch screen hungs sometimes...have to reset by pressing power button. Other features are very nice.",
            "date": "24 Apr 2015",
            "name": "Padmanabhan An...",
            "stars": "4 stars"
        },
        {
            "comment": "The product is good and the flipkart delivery is very very BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD...BAD. Don't waste time with them..better order from other providers....",
            "date": "24 Apr 2015",
            "name": "CHiVi",
            "stars": "5 stars"
        },
        {
            "comment": "It is really very good handset from my previous micromax phone. 16GB inbuilt with lot advance technology",
            "date": "24 Apr 2015",
            "name": "Ramesh",
            "stars": "5 stars"
        },
        {
            "comment": "I order this phone on 11th april got it on 17th april a little bit late. Come to the phone. The phone is Simply Awesome. Screen is Fabulous,Very Decent ,Great Resolution, you can easily see it in sunlight. Camera is also great but i feel some problem in low light but its awesome in light its focus is brilliant,flash is also not so bright as compared to other like samsung, sony,etc. Front camera is awesome very clear pictures even in low light. Lollipop is also good but the google now launcher i hate its white background at app drawer. Sound is very pretty. Performance is very good,very smooth, graphics are also good. The Biggest problem of this phone is its Battery. Battery takes a 4 hour to full charge and only runs 6-8 hrs ,and if u are using the 3g networks then it runs only 5-6 hrs.But if you don't use your phone continuously then battery is not a major problem to you.. there's one another problem is its HEAT, Sometimes you even cannot touch it to your ear. But Overall its Best phone under 15k.",
            "date": "24 Apr 2015",
            "name": "Abhishek Bamuriya",
            "stars": "4 stars"
        },
        {
            "comment": "there is some problem with my motoGen2 speaker. i feel there is some sort of radio like static i hear when calling..its craking sound you hear when you call... rest all are good but the basic functionality calling is poor",
            "date": "24 Apr 2015",
            "name": "Hamid",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone from 1 month. it is good phone, but charger is not good. no usb cable and it is getting heated am using LG mobile charger for this moto g phone. it is awesome while using LG charger.",
            "date": "24 Apr 2015",
            "name": "chandra",
            "stars": "4 stars"
        },
        {
            "comment": "good product and working properly. It is as per my expectation. Delivered on time and nice phone in this range.",
            "date": "24 Apr 2015",
            "name": "nilesh mantri",
            "stars": "4 stars"
        },
        {
            "comment": "Some small issues only with something like themens and all. but other than that phone is awesome.Relly very nice mobile with good color",
            "date": "24 Apr 2015",
            "name": "sandy challa",
            "stars": "4 stars"
        },
        {
            "comment": "Good at this cost -Bought two months back but disappointed that there is no all sharecast/screen mirroring though they claim with icon for all sharecast but that is for google chromocast dongle.",
            "date": "24 Apr 2015",
            "name": "Rakesh Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "USING PHONE SINCE LAST 1 week ITS NOT JUST PROS AND CONS , ITS PRO'S, OK'S AND CON'S PROS: 1. GOOD AND FAST PROCESSOR - NO LAG 2. CALL QUALITY TOP NOTCH WITH NOISE CANCELLING 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY. OK'S 1.SCREEN PPI AND COLOR VIVIDNESS COULD HAVE BEEN BETTER. 2. CAMERA NOT THAT TOP NOTCH BUT NOT COMPLAINABLE.-GOOD FOR THIS PRICE RANGE 3. FRONT SPEAKERS- MANY PEOPLE PRAISE ABOUT THE FRONT SPEAKERS , BUT IT REALLY IS NOT THAT LOUD, THIS IS MY 5 TH PHONE IN 3 YEARS AND SO I CAN EASILY FIND THE DIFFERENCE. 4. MUSIC AND SOUND OUTPUT QUALITY NOT GREAT BUT OK, EVEN WITH HEADPHONES. 5. FINGER PRINT MAGNET BACK COVER. 6. BACK PANEL LITTLE SLIPPERY. 7. FOR SOME HIGH END GAMES PROCESSOR HAS SOME LAG. 8. COULD HAVE DONE WITH A BETTER CUSTOMIZED UI , STOCK ANDROID (EVEN THOUGH THE LATEST KITKAT) FEELS VERY CHEAP AND NOTHING SPECIAL. BUT THIS CAN BE OVERCOME BY PURCHASING EVERYTHING ME LAUNCHER OR THEMER APP WHICH IS THE GREATEST IN UI CUSTOMIZATION HOME REPLACEMENT AVAILABLE TODAY IN ANDROID STORE. CON'S 1. THE SCREEN BRIGHTNESS IN IN DEFAULT WITHOUT BRIGHTENING IS TOO TOO LOW , EVEN FOR INDOORS IN A HALF LIT ROOM. JUST INCREASE THE BRIGHTNESS BY ONE POINT AND EVERY THING IS FINE. 2. NO DLNA AND NFC. 3. NOT A VERY GOOD AUDIO CODEC. 4. LAST BUT NOT LEAST , BULL SHIT EAR PHONES, COULD HAVE DONE BETTER WITH JBL IN EARS. SUGGESTIONS: 1. COULD HAVE DONE WITH AN MORE GRIPPIER BACK PANEL. 2. A BETTER HEADPHONES. 3. COMPLETELY CLOSED FRONT DUAL SPEAKER VALLEYS. IF YOU KEEP THE PHONE DIRECTLY UNDER A LIGHT AND LOOK AT THE EDGE OF THE SPEAKERS YOU CAN ACTUALLY FIND THE BOTTOM FROM WHERE THE SPEAKER EMERGES, NOW THIS SMALL GAP CAN BE PRONE TO DUST AND SWEAT WHICH CAN GO INSIDE. 4. USB PLUG-GABLE CHARGING PLUG. 5.3000 MAH BATTERY. THATS IT, FINALLY IT IS A GOOD PHONE, EVERY THING HAS ITS PROS AND CONS, WELL YOU CANT EXPECT GALAXY S5 ALPHA FEATURES AND SELL FOR 13 K, BUT WORLDS FIRST MOBILE PHONE MANUFACTURER AND POWERFULL ANDROID MAKES DEADLY COMBINATION, THERE ARE PHONES LIKE KARBONN, ALCATEL, XIAOMI M1 WHICH MAY HAVE DOUBLE SPECS AND SELL AT THE SAME RATE OR SLIGHTLY HIGHER. BUT CANNOT BE COUNTED FOR ENDURANCE. BECAUSE MY 4 YEAR OLD MOTOROLA ATRIX 4G STILL SMOKES SOME OF TODAY'S NEW AND GOOD PHONES FROM TOP MAJOR INTERNATIONAL MANUFACTURERS IN ALMOST EVERY RESPECT. HENCE MY OPINION \"\"\"\"\" GOOD DEAL \"\"\".",
            "date": "24 Apr 2015",
            "name": "shrishail chavanda",
            "stars": "5 stars"
        },
        {
            "comment": "Battery life of phone is very average that was a big disappointment .Sometime slows up . But Overall a good phone",
            "date": "24 Apr 2015",
            "name": "rm",
            "stars": "3 stars"
        },
        {
            "comment": "I have received a defective product and my replacement request is rejected. Within 2 days of the delivery of the Moto G2, it has started hanging. I kept on following up with cust care only to hear that my return request is rejected. The phone still hangs intermittently, especially when i try to receive the calls and make calls. It is very frustrating for me as I had given it as a gift. I am giving one star for flipkart's poor cust service and 30 days return policy which did not work in my case. Finally I have given up with Flipkart and decided to go directly to the Moto cust care.",
            "date": "24 Apr 2015",
            "name": "Bhushan Mutagekar",
            "stars": "1 star"
        },
        {
            "comment": "Super. Thanks Flipkart for prompt delivery and alos Motorola Ranks super in terms of voice communications Thanks",
            "date": "24 Apr 2015",
            "name": "R Rayhana Parv...",
            "stars": "5 stars"
        },
        {
            "comment": "I was excited for this phone and expected a lot out of it. However the processor performance takes a toll if you are trying to do some heavy stuff like downloading something and then playing a low consumption game at the same time. It's just ok phone dont be super excited about it. Paying 13K , its worth maybe little bit less.",
            "date": "24 Apr 2015",
            "name": "Vidharva Nanda",
            "stars": "3 stars"
        },
        {
            "comment": "At this phone, I don't think you can't get better deal than this. Even it specifies android 4, it came with android 5 and experience is super awesome. I was able to play Asphalt 8 and other high-end graphics games. Very fast and stylist. Go with this one, trust me.",
            "date": "24 Apr 2015",
            "name": "Uday Hiwarale",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola along with its service center is running Fraud Service to Snatch Customer. Instead to replace defective micro-usb port for a running mobile they forces to replace motherboard that also with doctored motherboard but with higher cost. And calling customer to come another day to have original IMEI No. restored so that they can repair the original motherboard and refix it but with higher cost. Detail of my experience: IMPORTANT: I have restored the original motherboard with non-branded Technician (road-side). FRAUD DETAIL: 1. On 22Feb2015 my MOTO G2’s micro usb port was damaged, though set was working. Set IMEI No. (1) 353321065372446, and (2) 353321065372453. 2. On 23Feb2015 morning I approached said service center. They received the defective set and advised me to come at evening. They also told that I needed to pay Rs. 900/- to change. But they had issued no receipt on the pretext of their printer became out of order. 3. As I approached them on evening of 23Feb2015, they told that I have to change the motherboard for Rs.5000/-. As I countered that the set was working and micro usb port is easily replaceable that I knew from other brand’s experience, they told that they had no such expertise. 4. Being a busy person it is difficult for me to live without a smart phone. Here it may be mentioned that I am using Motorola smart phones starting from Q9h, MilestoneA853 and now moto-G2, moto-E and also ASUS Zenfone 5. 5. I gave consent to change the mother board. 6. They changed the motherboard but refused to return old mother board. They also advised that I had to return with my Moto-G2 on 28Feb2015 to have IMEI no. restored. They had not issued a detail legal VAT paid bill. Instead they gave a money receipt for Rs.5000/-. The receipt has header in the name other than name registered in online service center search But With Same Address. 7. I was exhausted at a horrible day end without mobile. I had failed to check the mobile in detail. But on countering a lot I took back the old motherboard as my property. 8. On returning home I took the help of Internet and realized the fraud in detail. The new motherboard is of outdated Samsung phone identified with IMEI no. (1) 353325060920083, and (2) 353325060920091. This explains that the said service center to give me relief a little changed the mother board and tried to keep the original motherboard. They would change the defective micro-usb port and refixed it if I had approached them on 28Feb2015 on the pretext of restoring IMEI no. They also kept my Defective charger on the pretext of replacing it on 28Feb2015. They mentioned this on the reverse of the money receipt. 9. Also so called new motherboard has defective micro-usb. So I cannot charge it. It is now brick. 11. Their plan was to repair my original motherboard and to re-fix it on the pretext of restoring IMEI no. on 28 FEB. 10. Instead, I lodged complains in online Motorola service help. Ref Complain no. #150224-092121 and #150224-029100. But I have not got any fruitful answer from these. Motorola Online Help is speaking in favor of their service center. 11. IMPORTANT: I restored the original motherboard after replacing micro-usb port through a non-branded road side technician. For this He charged Rs.300/- for usb port replacement and Rs. 1100/- for motherboard re-fabrication.",
            "date": "24 Apr 2015",
            "name": "Aloke Sarkar",
            "stars": "1 star"
        },
        {
            "comment": "I loved it. Size, weight, screen quality, camera both main and front and battery backup, everything is perfect. I would recommend it.",
            "date": "24 Apr 2015",
            "name": "Santosh Lakhani",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone since months. I can say it is an awesome phone with all features. I'm satisfied completely. Best phone from motorola. Thanks Flipkart and Motorola.",
            "date": "24 Apr 2015",
            "name": "Victor Goel",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this from 1 months ago and found there have so many problem regarding battery. Which drain very past during net use it does only work 2-3 hours if we are using 3G connection.Accessories section they did not provide data cable so this is major draw back of this section and also for headset quality is not good. Camera is ok but not match photo quality with redmi.So I will be advise please don't purchase this.Totally money waste of this kind of mobile.If Flipkart will back my 70% money I would be happy. If this will not support 4G then it will be totally cheat us by FlipKart because so many current phone are working on this way. Thanks",
            "date": "24 Apr 2015",
            "name": "Bijendra Prata...",
            "stars": "1 star"
        },
        {
            "comment": "This phone comes with a moto \"Itne mai Itna hi milega\" But as all Indian we want more. Those who are New andriod user this phone is perfect 5 rating. All those who have previous experiences will probably rate this 2. Cons: 1.)Very bad battery back up(screen is bigger than moto g 1st gen ... Bhai Battery tho badaoo) 2.)Ram 1 GB is very less for people love to download and work on multiple apps. 3) thick and heavy. 4) Stereo speaker ( loud but bad quality audio) 5) Bad cutomer care service( @ flipkart i hv repoerted a sim slot problem.. 2 weeks no joy) Pros: 1) good camera 2) good build quality 3) Snapdragon quadcore( fast processor) 4)dual sim 5) latest OS (lollipop) Note: Very bad battery back up.Keep a power backup ready",
            "date": "24 Apr 2015",
            "name": "Rakesh",
            "stars": "2 stars"
        },
        {
            "comment": "Price is fine.. camera is good.. overall i find it good. I bought it from Flipkart app. It gave me 2000 rs off. Delivery was on time.",
            "date": "24 Apr 2015",
            "name": "Shubhra Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "Good for cost ... Delivery ok.... Flipkart service not bad ...... Motorola come back in Anroid very strong ....",
            "date": "24 Apr 2015",
            "name": "Aruljothi Arum...",
            "stars": "4 stars"
        },
        {
            "comment": "i purchased this mobile 6 months back. over all phone is good but battery is very poor, some times it is hanging that i have restart my phone, and sometimes getting network problems and data services not coming...........",
            "date": "24 Apr 2015",
            "name": "s@mp@th",
            "stars": "4 stars"
        },
        {
            "comment": "Needless to say, the phone is very good except its SAR value being more. It is working flawless. Worth buying.",
            "date": "24 Apr 2015",
            "name": "Venkatachalapa...",
            "stars": "5 stars"
        },
        {
            "comment": "camera lens aacha nhi h scratches aa jaete h uske upper baki ka phone bohot aacha h 10/10 battery backup agr poore din 3g chlaoge toh bhi chl jaega it takes 3 hours to full charge",
            "date": "24 Apr 2015",
            "name": "Sachin",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product on big app day for 11k, with lollipop Version OS it works great, Pictures taken in HD mode are Excellent. Earphones are of good quality. This is the best phone to buy in 10k-15k range.",
            "date": "23 Apr 2015",
            "name": "BHARGAV T R",
            "stars": "5 stars"
        },
        {
            "comment": "Last week we bought Moto G 2 from FlipKart via WS Retail. It cost around Rs.12,000/. After we started to use the new mobile, we were faced 2 Major issues with that phone. Moto G 2 mobile phone screen display is not working(Only Black screen) and have battery issue(daily 2 times we need to charge it for less usage). Now we requested the retail to give another Brand mobile or Cash back instead of this mobile. But they are not accepting and sending the same mobile model from the same retail. How we can make sure the 2nd mobile also will not have any issues. Also they are saying any reason for mobile screen display failure.. Please advice.",
            "date": "23 Apr 2015",
            "name": "RajaShanmugam",
            "stars": "1 star"
        },
        {
            "comment": "yaar bahut hang ho rha,,, takreban 20 baar shut down kr chuka hu isse me, kabhi dialer kaam krna band krdeta hai to kbhi mp3 player, to kbhi pura phone hang ho jata hai bahut time k liye, jb tk shut down na kro resolve hi nhi krta apne aap ko",
            "date": "23 Apr 2015",
            "name": "pawan",
            "stars": "2 stars"
        },
        {
            "comment": "Really it is great mobile by Motorola.And thanks for FlipKart service for fast delivery as compared to other Online services",
            "date": "23 Apr 2015",
            "name": "Nitin Jagtap",
            "stars": "5 stars"
        },
        {
            "comment": "Except for battery everything is fine. Battery is not as expected. Camera clarity, resolution of screen are good as expected.",
            "date": "23 Apr 2015",
            "name": "shwe",
            "stars": "4 stars"
        },
        {
            "comment": "It's really good phone, but charging full takes more than 3 hrs and Head set is poor. apart from that everything is good.",
            "date": "23 Apr 2015",
            "name": "Ramesh Gopi",
            "stars": "4 stars"
        },
        {
            "comment": "two problems are there 1. It's not charging if phone is on 2. It is having Buzzzzzing sound,which effects both caller and receiver",
            "date": "23 Apr 2015",
            "name": "Namrata Khare",
            "stars": "1 star"
        },
        {
            "comment": "i have purchased moto g2 from ws retail// product is faulty and ws retail is also denying for return// worst service and product of flipkart",
            "date": "23 Apr 2015",
            "name": "ravindra kumar",
            "stars": "1 star"
        },
        {
            "comment": "Excellent Product from Moto G Thanks to Flipkart....:-) I am using this product from Past 6 Months.Battery Life is very very good and product is Extreme Superb. Thanks to Flipkart Once Again... Cheers - Vijay Garikipati",
            "date": "23 Apr 2015",
            "name": "Vijay Garikapati",
            "stars": "5 stars"
        },
        {
            "comment": "Used it for 3 months. Has been worth its price. Super fast performance. No lags. Lollipop Update runs pretty smooth. Decent Camera-HDR mode preferred. Decent Speakers. Only concern is battery life, which wont last whole day for heavy usage. Buy it if you are Android fan.",
            "date": "23 Apr 2015",
            "name": "Nikhil Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "The best ever phone I have use till now within this price range, The camera and image quality is excellent, except Ringtone can not change, rest all are good.",
            "date": "23 Apr 2015",
            "name": "Yashesh Shah",
            "stars": "4 stars"
        },
        {
            "comment": "brilliant phone, this is a second Moto G (2nd generation) i have bought (both were gifts). people are very happy and impressed. good response Intuitive amazing camera (better than high end Samsung phone cameras any day) Loong battery life. would recommend a buy",
            "date": "23 Apr 2015",
            "name": "AKP",
            "stars": "5 stars"
        },
        {
            "comment": "I have replaced this mobile phone twice and even getting it for the 3rd time I am facing problems, the touch pad is not working even the IR sensor beneath the speaker is not working and the phone Lags as well at times. Frankly speaking DO NOT go for this phone. That will be much better.",
            "date": "23 Apr 2015",
            "name": "Vivek Ayush",
            "stars": "1 star"
        },
        {
            "comment": "This is an excellent smartphone for decent price. I am really happy with the performance of the phone. Most important thing is it has Lollipop with AOSP based Android. No lags, no random reboots. Even after installing many apps, almost 350 MB RAM is always free. Now, I am waiting for Android 5.1 update. Lets hope that Motorola will give it soon.",
            "date": "23 Apr 2015",
            "name": "Nikhil Bhalwankar",
            "stars": "5 stars"
        },
        {
            "comment": "I received the product as stated in the description with earpiece and charger. Phone is working fine and OS is android L 5.0.2. Better performance than my previous Xperia Ion. Android L makes using 3G easy on battery. Economical buy with good performace.",
            "date": "23 Apr 2015",
            "name": "Indra Dutt",
            "stars": "4 stars"
        },
        {
            "comment": "I Bought this mobile just for Rs: 9900/- I searched all other models and finally purchased this when Flipkart give offer on mobile app flat Rs: 2000/- off and 10% discount with AXIS bank Credit card. I am enjoying allot with this. ves : Gaming is too good. Chatting with friends easy because of big display. Phone performance is too fast for my usage. Display is more than enough for me. Feeling so luxurious. Some -ves i found. Battery is not standing for long time. Camera clarity is little bit dull when compare with Samsung S3 neo. Thanking you, Best Regards: -------------------------- Ranjeeth Kumar Pathi",
            "date": "23 Apr 2015",
            "name": "Ranjeeth Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "This is my first smartphone and my experience with Moto G2 is very well. Draining of battery is just a problem otherwise this phone is very good",
            "date": "23 Apr 2015",
            "name": "Rohit Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "I feel to review a product you have to use it well. I bought Moto G in month of Oct'14 so its with me for around 6 months. Prior to Moto G, i had used Samsung Galaxy S2 for 3 years. For 3 years, I never faced any issue with the S2 phone except battery drainage or slowness (which used to get resolved on resetting the phone again). I had to replace the S2 battery 2 times during this period. For MotoG, I have faced the following issues within 6 months: 1. Touch screen started giving issues, sometimes touch doesn't work for certain areas. 2. The charger has stopped working. I am using another charger now. 3. Many times, people calling me get message that the phone is out of coverage or unreachable, when it is showing the full signals to me. Conclusion - Phone is cheaper than competitors, but it is not a durable phone. Not recommended",
            "date": "23 Apr 2015",
            "name": "Raju Arora",
            "stars": "1 star"
        },
        {
            "comment": "look wise good phone but not good for gaming and other heavy usage,battry lasts 1 day in normal usage, while browsing and gaming time it gives only 1 to 1 and half hours, for gaming and heavy users please dont go for this, flipkart is giving really good service .",
            "date": "23 Apr 2015",
            "name": "sudharshan",
            "stars": "2 stars"
        },
        {
            "comment": "awesome phone with good specification.delivery is also very quick.i got it in the next day after i ordered.completly satisfied with the product",
            "date": "23 Apr 2015",
            "name": "Julia Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "A good product but it also comes with some issues that i have faced like Battery back up and also what is irritating is sometimes the Internet does not turn on at all (could be Lolipop issue) I have to restart the phone to get the internet working...",
            "date": "23 Apr 2015",
            "name": "Jaggy",
            "stars": "4 stars"
        },
        {
            "comment": "please change it as in my moto g2 set problem am facing, when mobile data is disabled no call coming , and same moto g2 with my ohter friends having no problem to using it, please replace my moto g2 asap.",
            "date": "23 Apr 2015",
            "name": "Susheel Gupta",
            "stars": "1 star"
        },
        {
            "comment": "i purchased Moto G second Gen mobile .that mobile is not properly working every two hours once hanging the mobile . i got the mobile march 29th 2015. but i complaint April 5th 2015.I called Flipkart organization executive every day two times but there is no response. one guy told me you went to nellore Motorola service center .Flipkart organization executive asked me please produce DOA certificate. Motorola service center person did not provide DOA certificate .i.e Terms and conditions of Motorola. finally i suffered lot there is no replacement or refund .Motorola and Flipkart organization playing (cheating ) the customers.There is no 30 days replacement. oder ID : oD002403832395972300 .please at least you are get some awareness from Flip Kart.",
            "date": "23 Apr 2015",
            "name": "swarna bharathi",
            "stars": "1 star"
        },
        {
            "comment": "Pros: -This product is worth for money than any flagship phones. -Does not hang for any apps or games as of now (including asphalt). -Battery does not get heat too much as others say. -I see little slanginess with tooooo many apps running and internet in turned on....but this is not at all an issueeee in this phone. -Good look and design. Cons: -Battery is not good since only 2070 MAH....but lasts for a day almot with 3g enabled. Say if u put live wallpaper it lasts for 4 hrs.:( -I missed offer from flipakrt, where it was sold for 11000 through mobile app,,,It is realyyyy worth phone for 11k.",
            "date": "23 Apr 2015",
            "name": "Veeresh G N",
            "stars": "4 stars"
        },
        {
            "comment": "After using the product for 7 days I can say the performance of the phone is impressive. Compared to other phones with 'flat' designs, Motorola has given Moto G2 a curved one, which results in a firm grip, along with a 'semi-rubber' back. And due to the gorilla glass, the Moto G2 is much more durable than other phones. And the features... this includes all the main features like expandable storage, 1GB RAM, dual front facing speakers, etc- all this in a 5 inch phone with a 1.2 GHz quad-core processor phone. Camera quality is also good. Frankly, in my opinion, Motorola is one of the company which gives you an assured quality. That is why it is good to spend some extra 2k to get a phone with almost the same specifications, but better ratings. That is what a smart buyer will always do",
            "date": "23 Apr 2015",
            "name": "Jyotirmaya Biswal",
            "stars": "5 stars"
        },
        {
            "comment": "Though the phone claims to have gorilla glass 3 , my moto g screen is broken after 6 months. If you want to replace screen you need to pay 7K, May be Moto is selling substandard quality phone to Indian customers. I am going to buy a new phone , but not from Moto any more",
            "date": "23 Apr 2015",
            "name": "Rajendra K",
            "stars": "1 star"
        },
        {
            "comment": "good phone, good feel and great speed. the only con is that the charger is sub-standard. the charger gets heated will charging. ear phones are just bakwassssss. the phone is good. if you are a little good with your usage battery is also fine enough. the back covers can be replaced. but currently they are out of stock... Flipkart when will they be available??? the ones that are from motorola itself... not the cheap duplicate ones..??",
            "date": "23 Apr 2015",
            "name": "ankit jaurihar",
            "stars": "5 stars"
        },
        {
            "comment": "The best phone ever at a very affordable price ... verdict please buy if want a big screen good camera and a fast processor for multitasking .... :) And one more thing Flipkart is the best. Cheers !!!!!!",
            "date": "23 Apr 2015",
            "name": "Quentin Menezes",
            "stars": "4 stars"
        },
        {
            "comment": "giving review with pros and cons ; pros : splash proof water resistant , easily we can get one day battery back up , decent camera , front stereo speakers ,non removable battery ,smooth design finish and pure android updates by google this is most important for android lovers !! cons : no indication symbols L\" R\" on ear phones , no data cable in box very disappointed, taking 2 to 3 hours to charge 100 % ,1 gb ram is not enough , at least 2 gb ram should be provided ,already system using 500 mb ram approximately ,the display is hard to see when using outside ,so we should increase brightness to full for clear viewing when using outside , near speakers there is some gap so dust can easily get in , i hope next version Moto G3 will upgrade design of speakers and improve in hardware aspects !!! final verdict ,go for it or wait for moto G3 !!!",
            "date": "23 Apr 2015",
            "name": "vivek mylavarapu",
            "stars": "4 stars"
        },
        {
            "comment": "Really an exceptional phone, it is the vanilla version of Android Lolipop so fast on application unlike any samsung phone that I have used",
            "date": "22 Apr 2015",
            "name": "Nagraj Naidu",
            "stars": "4 stars"
        },
        {
            "comment": "Best Budget Phone Ever. Superb Performance. Battery can be bigger. Youtube and camera Does not Support 1080p.",
            "date": "22 Apr 2015",
            "name": "Venkatesh Chitturi",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Mobile But My mobile Problem Is Network Problem & Display Dot Ye Flipkart wale Muje mobile Replace Nahi Kar rahe Jo mera Mobile 10 Din se Problem Aa rahi He custmer care Valo Ko fon Karta Hu to wo log mujhe Bewkoof Bana Rahe He Aaj Fon aayega technician kal aaye 24 hour me Aayega esa Bol ke Custmer ko ye Log Chu***ya Banate He ye Log mene MOTO G2 Use Sirf 19 days huve he par ye flipkart wale replce Nahi Karke dete he Ab Mere Paas ek hi Option He Consumer court jane ka bas Ab Me Paresan Ho Gaya flipkart valo se i hate it service & 30 day Replacement guarantee",
            "date": "22 Apr 2015",
            "name": "Poojan Zaveri",
            "stars": "2 stars"
        },
        {
            "comment": "Hey! It's been a week that I am using Moto G 2, and so far I had a fair experience. The weight of the phone is not much. You can grip it easily because the back cover has a matte finish. The display is good and touch is amazing. This phone comes with an updated version of android, Lollipop. I am not a hard core gamer. I have lots of apps installed and the phone works pretty well. But recently I've started facing a little lag, and its probably because of the Lollipop version. The cameras are pretty decent. I am a selfie addict and the front cam works well for me! A special feature is the \"Slomo\" allows you to record videos in slow motion. The speakers are in the front which increases the sound clarity. So now even if you place the phone back side down, your music wont get disturbed. So its all about pros. The only thing I dislike about this phone is that it has inbuilt battery. So if you are satisfied with these pros and con you can opt for it. I am satisfied with the purchase. :)",
            "date": "22 Apr 2015",
            "name": "subharthi sett",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after using the phone for 3 months. Its my first smartphone and it turned out to be a nice one. the display is brilliant, phone shows no sign of lag on moderate use. there is some heating issues especially when i surf net while charging but the phone cools down really fast. The lollipop upgrade is fantastic it has really boosted the battery life which last a day on moderate use...if you are looking for your 1st smartphone then go for it. you will be happy with your decision...",
            "date": "22 Apr 2015",
            "name": "Subhajit Sen",
            "stars": "4 stars"
        },
        {
            "comment": "Got this mobile with very good packing ... now i am using from last 3 months and having no complain ... WS Retail and Motorola ... Impressive combination of Flipkart ..",
            "date": "22 Apr 2015",
            "name": "Jimit Desai",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is indeed one of the best phones available in the market in this price range. I am using it from last one month and the only issue faced is the amount of battery it consumes. It drains out very fast (last generally for a day only).",
            "date": "22 Apr 2015",
            "name": "Savita Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I got Moto G2(white) with offer. This mobile having hanging issue while unlocking and messaging time.. I raise the complaint for replacement but flipkart people done online service. Still hanging issue not solved. 3 Times flipkart people done online service in my mobile with a help of smart check they erased my all application in 3 times. I don't understand why they are offering 30 days replacement warranty. I really disappoint by flipkart.",
            "date": "22 Apr 2015",
            "name": "suresh",
            "stars": "1 star"
        },
        {
            "comment": "it was awesome, photo clarity is nice both front and back .....battery is also nice .....till now no prob",
            "date": "22 Apr 2015",
            "name": "karthi",
            "stars": "4 stars"
        },
        {
            "comment": "Best mobile that I ever purchased!!! Very smooth in the hands. Good Looking Easy to use... Audio is good",
            "date": "22 Apr 2015",
            "name": "Albert Charles",
            "stars": "5 stars"
        },
        {
            "comment": "Very nice featured phone in this budget,i like screen clarity,Photo quality from phone and it's super fast phone. since i am using this phone from 1 months no issue, no problem. good going . i recommend moto G2 , if you looking range around 10k,",
            "date": "22 Apr 2015",
            "name": "Vinodkumar Nou...",
            "stars": "4 stars"
        },
        {
            "comment": "I m using this phone since last 8 months and no problem overall. Android 5.0 is awesome. but feels slow in gallery pics after update.",
            "date": "22 Apr 2015",
            "name": "Rajeev Dhiman",
            "stars": "4 stars"
        },
        {
            "comment": "The battery backup is worst and drains within half day. and mobile getting heat when connect to charger. waste mobile for this price range. dont go for it.",
            "date": "22 Apr 2015",
            "name": "Surya",
            "stars": "2 stars"
        },
        {
            "comment": "Using phone from more than 3 months and not facing any problem... Peoples complaining very fast battery drainage, but I am not facing the problem. It gives a battery backup of around 18hrs using 3g data too.... At a price of 13K it is a good deal",
            "date": "22 Apr 2015",
            "name": "Pankaj Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Highly satisfied with the performance of the device. It is a true value for money. Moto G (2nd Gen) is exceptional on all features.",
            "date": "22 Apr 2015",
            "name": "Niladri Sengupta",
            "stars": "5 stars"
        },
        {
            "comment": "My sim got stuck in phone . I gone to the service center but they are not ready help me. I am still using it as it is . Sometime battery suddenly drops to 0% and phone gets discharged completely. I want to give my rating below one. But I cannot give so its one.",
            "date": "22 Apr 2015",
            "name": "Abhishek",
            "stars": "1 star"
        },
        {
            "comment": "Bought a phone for my Sister on 10th Mar. After 2 days of using it, its microphone stopped working so the receiver was not able to hear my voice. We gave it authorized repairing center and two days after they return it, now the loudspeaker is not working though microphone is now working. We can't return the phone now, but now we have to again take it to repairing center, God knows how many time. Buy it if you can spare time for regular repair center.",
            "date": "22 Apr 2015",
            "name": "Bhuvan Dev",
            "stars": "1 star"
        },
        {
            "comment": "An excellent mobile for that price bracket. Its very light for the size. Lightning fast and gives an ok battery life. Would have been nice if it charged faster like Nokia Lumia.",
            "date": "22 Apr 2015",
            "name": "Pravish Kuttickat",
            "stars": "4 stars"
        },
        {
            "comment": "using it...but not satisfied ................... Battery drain withing 5 to 6 hrs...and it takes too much time to charge... to make it 100% it takes almost 2.5 hrs",
            "date": "22 Apr 2015",
            "name": "Vikas Verma",
            "stars": "2 stars"
        },
        {
            "comment": "I am satisfied with this product , camera quality awesome. Its been 6 months after purchasing , working flawless. Little battery related problem , gets drains soon.",
            "date": "22 Apr 2015",
            "name": "Shrikant Nikam",
            "stars": "4 stars"
        },
        {
            "comment": "Generally happy with the phone but the battery sucks... Lasts for less than half a day and I need to carry a power bank all the time",
            "date": "22 Apr 2015",
            "name": "Sandeep Goswamy",
            "stars": "3 stars"
        },
        {
            "comment": "I am very happy to buy this phone. I have referred this phone to many of my relatives and friends. I would request Flipkart and Motorola to keep introducing this type of phone which are realy value to our money.",
            "date": "22 Apr 2015",
            "name": "Murli Ashiya",
            "stars": "5 stars"
        },
        {
            "comment": "got this phone in an exchange offer, nice phone and specs in this price range and camera quality is good. gaming experience is also good ,i play asphalt 8 , and other graphic intensive games still till date no lags experienced.",
            "date": "22 Apr 2015",
            "name": "amit v",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile heating lika a iron box.. while charging mobile producing heat surffing internet with in 5min produes heat when im in call after 2 min mobile heating like a ironbox even charger also heating ..",
            "date": "22 Apr 2015",
            "name": "Sravan",
            "stars": "3 stars"
        },
        {
            "comment": "I Ordered this phone on 30th November and got it within 2 days. but the phone i received had a problem with camera and ear phones, so i asked for a replacement and got it soon, thanx to flipkart for that making it soon and fast. Now the replaced phone was working fine for 2 months and after that problem started 1) Phone got switched off automatically and i took it to an authorized service centre the told its a mother board problem we have to replace it, i told ok and the time given was 7 to 10 days and they nearly took 30 days to giv it back, this was one of the problem. 2) After i took it from there may be a week it was fine and primary camera was not fine dis time, and again i took it to service centre they told we have to replace camera within 3 to 4 days we will give it back but after a week they told we have to replace mother board and camera again and they took nearly 10 days again. 3) Now after days i asked them without giving my mobile back they told touchpad is not working sir we have to replace it again. Finally what i got to know was better go with any other products than motorola, because at least thy provide good service and give good response to the customer. Really a waste product and a fake company MOTOROLA.",
            "date": "22 Apr 2015",
            "name": "Bharath Kumar Jutur",
            "stars": "1 star"
        },
        {
            "comment": "This phone takes really long time to charge to full, which is around 6-7 hours. After 1 month of use the phone is not charging with the charger which came along with the phone but chargers with other similar chargers but charging is really very slow. I contacted motorola customer care and visited them. Their response was surprising. They said the problem is because of the some app and I need to identify that app and remove it. If that would have been the case then it should't charge with any charger. Money wasted.",
            "date": "21 Apr 2015",
            "name": "Shivang Tripathi",
            "stars": "1 star"
        },
        {
            "comment": "At this price range Moto G ( 2nd Gen) is a great buy. Lucky to got it 2000 Rs. cheaper on App only day sale. a smart mid range phone which work well great performance and great battery life.",
            "date": "21 Apr 2015",
            "name": "Dhillon",
            "stars": "5 stars"
        },
        {
            "comment": "After update to 5.0 many applications started to restart, battery some days used to drain out fully in half day. I faced a lot of issue with my calendar. Also i happened to remove many apps to speed up the phone. otherwise also battery never stays above a day with minimum use also. Pros: only nice thing is sound quality is good. mobile signal quality is average.",
            "date": "21 Apr 2015",
            "name": "Suresh GM",
            "stars": "3 stars"
        },
        {
            "comment": "Recently I purchased a Moto G 2nd Gen mobile and i had quality issue with a product and later i raised a replacement for the same and the replaced product also a defective piece. Please be-aware what ever you purchase Online.",
            "date": "21 Apr 2015",
            "name": "Sagar H",
            "stars": "1 star"
        },
        {
            "comment": "Even though specs are decent, its the LOLLIPOP that gives the eco-system a slight lag be it animation or opening and closing of applications. The best feature of this phone is the front facing dual-speakers -- ideal for any type of user including the music lovers",
            "date": "21 Apr 2015",
            "name": "Ankit G.",
            "stars": "4 stars"
        },
        {
            "comment": "Its a realy nice product Full marks for-1) brand 2)primary cam 3)sreen resolution 4)performance 5)toughness 6)sound Backlocks- 1)got heated while heavy use or charging after upgrading to lolipop 2)battery",
            "date": "21 Apr 2015",
            "name": "jay Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "good mobile for all the age groups.good camera.internetspeed ok.handy.calling,messaging easy.it people prefer this,partcularly ladies .",
            "date": "21 Apr 2015",
            "name": "nilakantapilla...",
            "stars": "5 stars"
        },
        {
            "comment": "support is super.good mobile for executives.automatically upgraded to lolypop.good camera.internet speed ok",
            "date": "21 Apr 2015",
            "name": "nilakantapilla...",
            "stars": "5 stars"
        },
        {
            "comment": "since i got a defective charger .rest of the product is good.Value for money and good product, but flipkart can check the quality of the accessories before dispatching.",
            "date": "21 Apr 2015",
            "name": "Stephen Sundar",
            "stars": "3 stars"
        },
        {
            "comment": "I recently purchased one through flipcart. It is charging slow taking typically a day and discharges fast. Struggling with the service centre.",
            "date": "21 Apr 2015",
            "name": "ramesh",
            "stars": "5 stars"
        },
        {
            "comment": "Best Android phone yet in mid-budget segment. The latest android frequent updates other than any phone in the market. Good enough processing speed and gets the user satisfaction.",
            "date": "21 Apr 2015",
            "name": "Harsh",
            "stars": "5 stars"
        },
        {
            "comment": "Great purchase all I can say about my Moto G2. Great service by Flipkart. U guys Rock!!!! All in all a great experience till now. I researched for a good phone for 1 months. Finally my search came to an end with this device.",
            "date": "21 Apr 2015",
            "name": "Arijit Neogi",
            "stars": "4 stars"
        },
        {
            "comment": "Sim card slot 1 is not working from the day one, flipkart customer service at its worst...All they are doing is sending me the msg that they will call me at this particular time and then ends up msging that we are sorry for not contacting and will contact you by tmrw....it's mental harassment to keep waiting for the call everyday. I just hope something good comes up my way to change my mind towards flipkart or else this would be my last expensive purchase from flipkart...",
            "date": "21 Apr 2015",
            "name": "VIVEK TIWARI",
            "stars": "1 star"
        },
        {
            "comment": "The phone is really an awesome phone. The cameras are decent. The music quality is good though it could have been better. The only problem is it is laggy when updated to the latest lollipop OS.",
            "date": "21 Apr 2015",
            "name": "Piyush Jena",
            "stars": "4 stars"
        },
        {
            "comment": "good mobile, this mobile is good and branded also. i like this mobile.without checking anything you can buy this mobile.",
            "date": "21 Apr 2015",
            "name": "Ravi Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Motorolla is nowadays selling good phones but the rear and especially the front camera should be made better considering people are crazy about clicking pictures.Front camera has only 2 MP which is really less considering today's standards. Rest the OS and user interface everything is great. Moto should start giving better camera's or it will have an issue in the long run.",
            "date": "21 Apr 2015",
            "name": "Karan Jain",
            "stars": "4 stars"
        },
        {
            "comment": "I was very confused when i wanted to buy this phone.This confusion was a result of negative comments placed on flipkart but the device proved these comments wrong.I have been using this device for 5 days with no issues. everything in it is awesome.Call quality,camera,audio quality etc. just awesome.The best part is its gaming experience, it plays all games well including aspahalt 8, modern combat 5 etc .So een if you are confused go for it, it is totally value for money. It had lollipop pre-installed as in my case.Thanks Motorola for such a great phone.Flipkart delivery and service deserves a salute.!!!!",
            "date": "21 Apr 2015",
            "name": "Aashay Kulkarn...",
            "stars": "5 stars"
        },
        {
            "comment": "buy it a best phone with auto matic upgrade but price should be around Rs 10000 now in comparision to yu yuraka",
            "date": "21 Apr 2015",
            "name": "Harsh Kasundra",
            "stars": "5 stars"
        },
        {
            "comment": "I stay in the ground floor and using Airtel sim Card.My roommate has Samsung and he is also using the airtel sim card. The big difference is his phone is able to catch the signal properly compare to Moto G2. I don’t know do I only have this problem in my phone or this is a common problem in Moto G2.",
            "date": "21 Apr 2015",
            "name": "Mukesh",
            "stars": "3 stars"
        },
        {
            "comment": "One of the best mobiles i've used in the past 10 years. Truly a value for money. I play high end games like Asphalt 8 and Real Racing 3 and have never experienced any lag with the phone. Sound and camera quality is awesome, so is the battery back up.",
            "date": "21 Apr 2015",
            "name": "Rakesh",
            "stars": "4 stars"
        },
        {
            "comment": "I Brought MOTO G 2nd Gen Mobile From flipkart dated on 24-Mar-2015 & Order ID - OD202403361972012000. I got defected product has speaker issues, after that I filed complaints against it And get replacement product , But the replaced product also has defects such as white color is displayed in red shades, hanging issues, no sim selection option getting on contact selected, phone gets heat up when attached to charger, also some time it screen colors changes automatically(But it was not periodically). It Was the worst experience with flipkart.",
            "date": "21 Apr 2015",
            "name": "Devendra Chaud...",
            "stars": "1 star"
        },
        {
            "comment": "this only one draw back when phone ringing mode is activating and one time vibrating.i can't feel him in msg or phone ringing",
            "date": "21 Apr 2015",
            "name": "siva prakash",
            "stars": "5 stars"
        },
        {
            "comment": "Go for It Without Second Thought... Best In Its Category. Best In Features. Upgraded through FOTA Value For Money.",
            "date": "21 Apr 2015",
            "name": "NILESH KACHHWAHA",
            "stars": "5 stars"
        },
        {
            "comment": "moto service is not good moto should provide a good charger charging is very slow cell is best at its price range",
            "date": "20 Apr 2015",
            "name": "Amar",
            "stars": "4 stars"
        },
        {
            "comment": "Overall the phone is good and being android and Google backed phone (Motorola) it is a good all round phone. Only problem is that of late the phone has been hanging and acting funny and I dont know how to get it fixed since need to connect with Motorola directly.",
            "date": "20 Apr 2015",
            "name": "Shrawan Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "Negetive points: 1. Battery back up is worst when internet is on. Like the ridiculous advertisement, I have to carry my charger all the time. 2. 1st It was running smoothly, but started hanging frequently after 2nd or 3rd software update. Now, each time when I try to operate is quickly, it got hanged. 3. secondary camera is not up to the mark. 4. Sound quality is so so. Positive points: 1. It comes with 16GB internal memory which is generally enough to store. 2. Many usefull features like Moto Assists , Alerts etc. 3. Primary camera is 8 Mpxl which is quite good.",
            "date": "20 Apr 2015",
            "name": "Saheli De Sarkar",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart just cheated with a defective product and denied to return with a bullshit way says Smartcheck.I am still facing heating problem and battery drainage problem simply while talking to someone for 10-15 mins. If you will get any issues like this then quickly return the product and don't beleive on their Smartcheck process. Go for another mobile yaar ,this gen2 is not succesfully running.",
            "date": "20 Apr 2015",
            "name": "Saurav",
            "stars": "2 stars"
        },
        {
            "comment": "Best product at this price. No hanging up like samsung or other smartphones. I have been using it from about a month, I dont have any issues with the product. Above all, Flipkart's service was excellent.It was delivered within the promised time.",
            "date": "20 Apr 2015",
            "name": "Harpinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I am not a fan of large handsets and the ones that best fit the hand are generally 4.3 - 4.5 inch. Since Moto G2 has a 5 inch display, it's not easy to fit into pocket and that especially for ladies. Bought this phone for my wife and we are overall very happy with the product. The quality is perfect from all perspectives. This is just similar to Samsung Galaxy S2 in terms of configuration i.e. 1 GB RAM, 8 MP rear camera, 2 MP front camera and 16 GB of internal memory. Motorola has priced it perfectly and you don't feel cheated at all like in other companies where the MRP of you phone itself has gone down 30-40% in a year. You will obviously feel cheated and won't the products again especially from companies like Samsung. Previous to this, we have also used couple of Lava handsets as well in order to get high spec phone at low cost and have sweared never to go back to brands like Lava, Micromax and others. If you are running on budget, close your eyes and buy this phone and you will never be disappointed except for large screen. The specs maybe lower than MMX, Lava and all but the performance and longevity is what you get instead of those fake specs where cheap hardware is used.",
            "date": "20 Apr 2015",
            "name": "Rahul Bangia",
            "stars": "5 stars"
        },
        {
            "comment": "Good things in MOto g second generation . 1. look is just awesome, feels so premium. 2. 16 gb internal memory is one add on 3. sound quality is amazing. 4. expandable slot upto 32 gb which is gud Bad things : 1. battery sucks, if you use internet continuously it will drain in 5 hours . its should have been 2500 mah or 3000 mah. battery is big drawback in this phone . The person who is looking for good battery back up this phone is not for them . 2. battery takes 3.5 hours to get charge fully , it sounds like i am charging phone more than i am using it . 3. and no customization's so same boring android . 4. For someone who doesn't care about looks XiOMI redmi note 4g is good .",
            "date": "20 Apr 2015",
            "name": "sandip pawar",
            "stars": "4 stars"
        },
        {
            "comment": "Gifted to Father. He's using from last one month. No complain from his side. Hence phone passed. Nice Battery Nice Call quality Sound is good Camera is good Overall 5 out of 5. :)",
            "date": "20 Apr 2015",
            "name": "Devesh",
            "stars": "5 stars"
        },
        {
            "comment": "I BOUGHT TWO AND ALSO SUGGESTED TO SEVERAL FRIENDS PICTURE CLARITY IS BEST AND VOICE CLARITY IS ALSO VERY GOOD BETTER THAN SONY. ONLY PINCH IS BATTERY LIFE. OTHERWISE EVERYTHING IS GOOD.",
            "date": "20 Apr 2015",
            "name": "PAWAN KUMAR GR...",
            "stars": "4 stars"
        },
        {
            "comment": "it's really good. worth of having this mobile.. i got it for mob app with 10% of cash back from axis bank...",
            "date": "20 Apr 2015",
            "name": "Druvakumar G.",
            "stars": "5 stars"
        },
        {
            "comment": "very good phone overall for ram,andriod ver,for heavy gamers. good graphics nice camera clarity, slow motion mode etc. -1 for battery back is not so good. it should increase its battery to 3000mah in future overall good to use.",
            "date": "20 Apr 2015",
            "name": "Syed Khaja Num...",
            "stars": "4 stars"
        },
        {
            "comment": "Good Mobile with good performance but Battery is not enough for a phone with 5 inch screen.A day charge is really mandatory for this mobile, other than this its awesome.",
            "date": "20 Apr 2015",
            "name": "Santhosh",
            "stars": "3 stars"
        },
        {
            "comment": "I think this is one of the best product in its range, no comparison moto launch the best one in this range.",
            "date": "20 Apr 2015",
            "name": "RAChit Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "I brought this mobile for my friend it is working fine and it delivered within two days ...............",
            "date": "20 Apr 2015",
            "name": "Eswar Prasad K",
            "stars": "4 stars"
        },
        {
            "comment": "It's an awesome phone for regular day to day use but not recommended for high end game. Best value for the price. Brest part is you get the latest android version and speedy updates.",
            "date": "20 Apr 2015",
            "name": "Jonathan Jerome",
            "stars": "4 stars"
        },
        {
            "comment": "it is a good phone .. i recently upgraded it to lollipop ....and what i love the most is the FLAPPY BIRD like game in lolipop .. cons.: Now the lower speaker is not working i don't know why but it isn't working i am afraid the top speaker will also stop working...",
            "date": "20 Apr 2015",
            "name": "Vinayak Biju",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G is one of the smart phone which is in low price and good specifications. I buy this phone with a lower than the MRP at 9899.00 /rs which is possible by online shopping. Thank you flipkart.",
            "date": "20 Apr 2015",
            "name": "sumanth",
            "stars": "5 stars"
        },
        {
            "comment": "hi guys i bought two moto g mobiles at first i even suggested my friends also for this phone but believe me now i changed my mind completely because this mobile has a serious issues with its display and camera,we can easily compromise with it's camera focus at this price but display very much prone to damage even if it fell down from low heights i changed my disply for 2000 rs so.guys be careful while handling your moto g mobiles.i better suggest you to lenovo and mi s",
            "date": "20 Apr 2015",
            "name": "murali krishna",
            "stars": "3 stars"
        },
        {
            "comment": "Guys, PLS.. pls dont waste your money on this device just because you want to buy a medium range \"good\" phone. It is good from nowhere. My brand new handset which I purchased from flipkart 2 days ago, starts heating up from the time I am using it. battery is nowhere close to how a new battery should perform. Lasts Barely 5 hours. I dnt understand how am I gonna cope up with this handset in future. Starts heating up on charging, while talking etc etc I deparately want to return it but flipkat customer care says that i can only replace the handset and NOT return it. Thanks WS retail. FK should have ensured quality check before getting the device under its brand name. I feel all my money has been wasted.",
            "date": "20 Apr 2015",
            "name": "Akanksha Sharma",
            "stars": "2 stars"
        },
        {
            "comment": "I am extremely dissatisfied with the quality of this product. I have seen that the screen gets heated if I play games and battery doesn't get charged most of the time, I plug the charger. I had complained customer care for return and without my permission they have rejected the return. I somehow feel Flipkart is only making money out of people here.",
            "date": "20 Apr 2015",
            "name": "Gururaj",
            "stars": "1 star"
        },
        {
            "comment": "Hi, I have experienced two major problems in last 2 days. 1. Battery was showing 10% remaining and after connecting to AC charger it came up to 100% in 30 min. After disconnecting and making 2 calls its again came back to 10%.This has happened couple of times. 2. I did not get any calls on mobile and data was also not working. Tried to reconnect mobile data few times but problem remained same.. Then i had restarted the phone..Its very wired situtaion since you might loose some important calls. This mobile is only 1 month old .Please help here",
            "date": "20 Apr 2015",
            "name": "Deepak Sharma",
            "stars": "1 star"
        },
        {
            "comment": "I had bought this mobile to gift my sister and she's happy using this mobile. Flipkart delivery was also with 1 week and the product was in good state. My sis has been using this mobile for 5 months now and she hasn't had any complains about it. All she says is \"Let me get a Selfie\" as the camera is good :)",
            "date": "20 Apr 2015",
            "name": "Lakshmi",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: Excellent Camera. Stills and videos both are captured well. Although self timer is not available. Looks are good. If you use it as wifi hotspot then u get decent speed. Boot on / off is fast. Cons: at times the battery heats up. It is not removable. When u start a call the net connection is gone. I guess thts the case with many phones in this range. But overall a nice package.",
            "date": "20 Apr 2015",
            "name": "Rahul N",
            "stars": "4 stars"
        },
        {
            "comment": "personally i was expecting more... i dumped my panasonic p81 to buy this... wasnt a wise decision compared to panasonic p81, i'd say... 1. half the battery life 2. mushy buttons 3. no removable battery 4. display is kinda dim, dull & sad 5. device isnt half as fast 6. android experience isnt that smooth 7. pressing bottom-central portion of display with 2 fingers shifts color like old LCDs... looks like theres somthing pressing @that spot from back overall, bad decision... its not for power users",
            "date": "20 Apr 2015",
            "name": "Debabrata Mandal",
            "stars": "2 stars"
        },
        {
            "comment": "SUPER MOBILE i like this very much but charger is too much heat while charge it up it is andriod 5.0.2 loolipop its very nice",
            "date": "20 Apr 2015",
            "name": "PARDHASARADHI...",
            "stars": "3 stars"
        },
        {
            "comment": "phone is good but please dont fall into airtel data trap. Generally, they give 1GB 3G data for Rs.192 and under this offer they give 600MB data for Rs.195. So, please avoid activating this crooked offer.",
            "date": "20 Apr 2015",
            "name": "TUSHANT GARG",
            "stars": "1 star"
        },
        {
            "comment": "I would recommend this to all, as its worth buying. Good rear camera,good resolution with the latest android lollipop. The only negative point is the inbuilt battery.Other than that, its one of the best budget phones available.",
            "date": "19 Apr 2015",
            "name": "Rituja Mukherjre",
            "stars": "5 stars"
        },
        {
            "comment": "this is a very Good phone in this price range but a little bulky. batterry life is also average. display, sound and camera are also good but not great.",
            "date": "19 Apr 2015",
            "name": "Tirtha Mukherjee",
            "stars": "4 stars"
        },
        {
            "comment": "this phone is perfect for anyone who is not a hardcore gamer. its got everything which should be in a high range smartphone. the cameras are very nice, the back looks nice and it gets the latest updates in time..",
            "date": "19 Apr 2015",
            "name": "dewam jain",
            "stars": "5 stars"
        },
        {
            "comment": "after one month of purchase... I am facing only problem... I bought this in November and hardly used it for 2 months... and it feels like this phone is made to be in service centre .. 5 to 6 times screen replacement and 2 times motherboard replacement... still the phone is not fine.. it's not service center ... it is motorola who make defective parts i visited service centre in delhi and agra ... so i suggest don't buy this crap...",
            "date": "19 Apr 2015",
            "name": "Shubham Jain",
            "stars": "1 star"
        },
        {
            "comment": "Value for Money Means... It has a bigger 5-inch screen, improved cameras and front-mounted stereo speakers.The basic formula remains the same, but the changes are clear to see. The original Moto G was Motorola's best-selling phone ever, and remains the only phone we've given 8/10. That's a tough act to follow. The Moto G 2 aims to improve on that success. Pros: Excellent value for money, Strong battery life, Much-improved camera, Solid, well-built design Cons: No 4G LTE support, So low-light photos, Average front-facing speakers",
            "date": "19 Apr 2015",
            "name": "Phani Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Good1. I had already used MOTO G 1st gen. Much better than that. Nice that memory is expandable. but there is Heating problem delivery was quick.",
            "date": "19 Apr 2015",
            "name": "ABHINAV` PUSHPAM",
            "stars": "4 stars"
        },
        {
            "comment": "Overall nice phone Pros: 16GB memory Qualcomm Snapdragon Processor Gorilla Glass HD Display Good Looking Latest Android Average RAM Cons: Poor Battery backup (lasts hardly 1 day) Not good call clarity Finger Print Magnet Screen OS a little laggy Costly (You can get a phone with same specification in almost 3K less)",
            "date": "19 Apr 2015",
            "name": "Ashirwad Mehta",
            "stars": "3 stars"
        },
        {
            "comment": "In Just 13000 its really good deal. very good photo quality, easy to handle. It's very good package & delivered in just 2 days that is also unexpected. thanks Flipkart for such a awesome product.",
            "date": "19 Apr 2015",
            "name": "Product handli...",
            "stars": "5 stars"
        },
        {
            "comment": "Hang problem is best feature of this phone. u will see this all the time in it. battery prob is also main feature of this premium phone.",
            "date": "19 Apr 2015",
            "name": "Rahul Shivhare",
            "stars": "1 star"
        },
        {
            "comment": "it's an awesome phone but the only problem is the speed of it. Sometimes whn the phone gets heat up its restarts automatically n starts hanging. Motorola must resolve the issue of this heating",
            "date": "19 Apr 2015",
            "name": "Aviral Singh",
            "stars": "3 stars"
        },
        {
            "comment": "I Have Bought This Mobile 4 Times And All Four Mobile Are Working Very Good i Strongly Recommend To People Its Paisa Vasool Guys And I Like The Policy Of 30 Days Replacement I Got My Charger Replacment Compensation. Thank To FlipKart And The Seller.",
            "date": "19 Apr 2015",
            "name": "Arpit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "very good product, fast shipping and price also lowest under mobile app scheme. i will be deal again soon",
            "date": "19 Apr 2015",
            "name": "mohinder singh",
            "stars": "5 stars"
        },
        {
            "comment": "i have seen and used various company's smartphones but dis seems to good and reliable. as per normal usage, battery backup is good and processor is fine. as we know brand matters for resale ur mobile so dis is also a positive points . i m giving points out 10. overall look 9 (white is better), processor 8, graphics 8, Ram 7, battery 8, company updation 9, ear phone quality 6, mobile speaker and out put to headphones 9, value for money 9 these review based on personal usage since 10 months",
            "date": "18 Apr 2015",
            "name": "vivek gupta",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is simply awesome without any doubt. Touch experience, sound quality, display, you name it...it is better than other phone . only problem is battery backup. It doesn't last the whole day.",
            "date": "18 Apr 2015",
            "name": "Prasant Shaw",
            "stars": "5 stars"
        },
        {
            "comment": "After 3 months of usage visited moto G service centre multiple times on phone heating problem. On every delivery of the mobile, the service centre folks mention mobile display was replaced, had a talk with few customers, almost everyone had same mobile heating problem. You are lucky, if it works without any heating problem. Definitely not a recommended one.",
            "date": "18 Apr 2015",
            "name": "Vinoth Babu",
            "stars": "2 stars"
        },
        {
            "comment": "I have got Moto G 2nd Gen through Flipkart and on the same Day its started to give problem like its heated up like molten rock ,taking 16-17 hours to full battery charge, its Picture quality and LED flash is so poor in compare to other lower cost mobiles, Pictures are with reddish shade. when i contacted Flipkart customer care on 17th April they routed me through their technical team and now they are making if and but to refund my money and asking for trouble shooting etc etc but will not return my money. it clearly stated in Flipkart return policy that if product is not upto mark than they will return whole money including delivery and packing charges but now they are saying its not applicable for electronics item and they will not refund. than why they mentioned there return policy on their web, simply can stated that they will not refund any money for Electronics item. As per them i have to read some other warranty terms which are hide in a very tiny ?(question mark) in last of product detail. i got very funny expert comments from Flipkart technical team that heating of phone is a common phenomena and they cant do anything. I have used 6 to 7 types of mobiles in past years but have not faced this common phenomena in any phone and even my friends and relatives also didn't face the same. Their second expert opinion was that I have to close the background applications 3-4 times a day to keep the phone cool. I salute to their expertise. I don’t know anyone who is wasting his time to do the same everyday, so his phone can work properly while it’s a new phone and don’t have any new applications except pre installed apps. Flipkart is making fools to every customer. so friends be aware before making any transactions with Flipkart.",
            "date": "18 Apr 2015",
            "name": "Puneet Swami",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought it with lolipop which was having some lolipop and issue then i got it replaced and replacement came with kitkat...which was working very good....but after few days when i upgraded my mob to lolipop again started facing some issues....like little bit slow ,hang and performance ofcourse. Mobile gets restarted automatic after hanging...all these occured after upgrading to lolipop only. DO not upgrade to lolipop",
            "date": "18 Apr 2015",
            "name": "kapil sharma",
            "stars": "4 stars"
        },
        {
            "comment": "really nice to hold in one hand.... * batry lfe:for heavy usage like internet,gaming,downloading gives upto 6 hrs only.... * only one 1gb ram for 13k is less *camera clarity is outstanding clarity both front and back *gorilla glass is superb.....",
            "date": "18 Apr 2015",
            "name": "Karthi V",
            "stars": "4 stars"
        },
        {
            "comment": "Using Moto G2 from last 3 and half months. Got at a price of 11k after exchanging my old phone. Motorola should fix the battery draining issue. Apart from that everything is gr8. My overall experience is 4.9 out of 5.",
            "date": "18 Apr 2015",
            "name": "SatishBabu",
            "stars": "5 stars"
        },
        {
            "comment": "There was problems in the piece when I received it, it hangs too much and restart automatically very often. When I requested a replacement..Flipkart refused to do so and said the product is fine and they can't replace. I am very dissppointed with the service of Flipkart. Seems like, now they have monopoly and they are playing games like other e-commerce retailers, I will write in Blogs and Forums as well. I never expected such Worst service from Flipkart. R.I.P. Flipkart",
            "date": "18 Apr 2015",
            "name": "Ankit Pandey",
            "stars": "1 star"
        },
        {
            "comment": "Its the best product at this affordable price....Features are great,,,truely next genaration phone,,Flipkart is superb in case of deleivery,,",
            "date": "18 Apr 2015",
            "name": "Sagar",
            "stars": "4 stars"
        },
        {
            "comment": "Dear Friends, This is Water Resistant Phone. I have test it in the rain and its working fine but it is not water resistant in Salt Water ( Sea Water). Mind It.....",
            "date": "18 Apr 2015",
            "name": "Rony Christian",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is very good with its lollipop features.I have been using this phone and there is no issues with it.the only flaw is battery is draining quickly when we play games . 2070mah battery is not enough for at 5 inch screen. otherwise the phone is good to use.",
            "date": "18 Apr 2015",
            "name": "jayasankar",
            "stars": "5 stars"
        },
        {
            "comment": "After 18 days using review from my side. Phone is just awesome an processing also good.. You can download many app, games in it. and one think i like that all apps or game directly install in internal memory, there is no more load on RAM.. Camera is little good... than others.. so i suggest you go through this product..",
            "date": "18 Apr 2015",
            "name": "Ganesh Onkare",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G looks are very good and performance was excellent. The outer edges are slippery and wife dropped it today and broke the gorilla glass which has cracked -- replacement is expensive at rs 5500. hence overall not all that satisfied.",
            "date": "18 Apr 2015",
            "name": "Gobi Bhuvanesh",
            "stars": "3 stars"
        },
        {
            "comment": "Very nice service from flipkart, but the phone has very poor battery. The battery drains too too fast. I had done replacement and still the new phone too had the same issue. The phone at times goes directly from 80-85% to direct 15-20% and once you re-start and put on charging , it will come back to its original 80-85%. Apart from battery good product. But with such battery can't survive. Suggestion : Don't buy this phone.",
            "date": "18 Apr 2015",
            "name": "Umesh Mishra",
            "stars": "1 star"
        },
        {
            "comment": "Good performance Good camera Great battery life Excellent value for money Solid, well-built design Updated Operating system always",
            "date": "18 Apr 2015",
            "name": "Suresh Badhavath",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this MotoG(2nd Gen) since 5 months.I am very much satisfied and please find my exp with MotoG Pros&Cos Good look and stylish Camera Rear and Front picture quality is excellent in day time and little bit dull in night though we use flash. Good thing is while Video recording we can capture Images also i can give 5 stars for this feature. Battery is avg could have given better but rest features good and awesome device. Voice and Dual speakers good quality If you want to buy branded mobile go for this with this affordable cost.",
            "date": "18 Apr 2015",
            "name": "ANILKUMAR GANJI",
            "stars": "5 stars"
        },
        {
            "comment": "Yes, this is Value for money product. I am fully satisfied with this. I am very happy with Flipkart quick delivery and packing.",
            "date": "18 Apr 2015",
            "name": "Neemesh Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Talked to motorola online but all in vein. upgraded the phone to lollypop. performance has become worst but no patch has come to rectify this yet even after several communication",
            "date": "18 Apr 2015",
            "name": "KK Pathak",
            "stars": "1 star"
        },
        {
            "comment": "if you need phone with good built quality go for it. display quality is also good, if you are not brand conscious you can also think of buying Lenovo a7000 , hawaei x..i purchased this this phone coz i got it for Rs 9999",
            "date": "18 Apr 2015",
            "name": "Vijay Pathak",
            "stars": "4 stars"
        },
        {
            "comment": "Worth For Money........................................................................................................................... :-)",
            "date": "18 Apr 2015",
            "name": "Sankar",
            "stars": "5 stars"
        },
        {
            "comment": "u cannot expect high graphics games on this other wise this phone is good one cam is good sound is awesome cas its stereo speakers did a very nice impresive quality battery is average normal use of 2g with average use would stand it alive for 12 hours which is quite good most important and plus point of this phone is its software ui lollipop expreience",
            "date": "18 Apr 2015",
            "name": "kabir mohammed...",
            "stars": "3 stars"
        },
        {
            "comment": "Pros: 1.Pure android experience..vanilla OS..no customization..no bloatware 2.Huge internal memory of 16gb 3.Excellent Rear and Front camera 4.Awesome music & video playback through front firing stereo speakers 5.no lag at all 6.available free RAM more than 400mb 7.Butter smooth touch with Android Lollipop 8.Smooth gaming experience..no lag no heating while playing Asphalt 8,Dead Trigger 2 Cons: 1.Battery drains fast while using internet..but it is normal with all android devices You will get atleat a day backup one moderate usage.",
            "date": "17 Apr 2015",
            "name": "RAJAT KUMAR MO...",
            "stars": "5 stars"
        },
        {
            "comment": "very good phone in budget with good features but battery is one and only problem after that no doubt at all to be purchases......",
            "date": "17 Apr 2015",
            "name": "A.SAIRAM",
            "stars": "5 stars"
        },
        {
            "comment": "This is a really awesome phone in only 13000. very good features,awesome camera quality in day and night.easy to play heavy games size games.You can move apps from phone to sim card. Good use of money. Thanks flipkart for selling goog and orignal products.",
            "date": "17 Apr 2015",
            "name": "KomalSingh",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery was in time but there are some issues. 1. Headset doesn’t work. 2. Charger overheating. 3. Speaker sound cracks. 4. Battery logo doesn't always show charging when I put it on charging. Several days past since I placed return request but nothing so far from Flipkart. Not satisfied with Phone and Flipkat.",
            "date": "17 Apr 2015",
            "name": "Sajid Memon",
            "stars": "1 star"
        },
        {
            "comment": "Excellent Phone @ this price .... Unbeatable...thumbs up to Motorola. And so is the flipkart delivery system. I got this product shipped to my address in just one day.!!!!",
            "date": "17 Apr 2015",
            "name": "Deepak Raj",
            "stars": "5 stars"
        },
        {
            "comment": "Am using this product from last 5 months..! Except Battery and cam performance in night time everything going to be fine.",
            "date": "17 Apr 2015",
            "name": "N Praveen",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent Phone. Camera front & rear is very good. Service of Flipkart is fast. Sound quality, display quality, Built quality, camera quality, is excellent. Starting hurdle was with lollipop feel. No hang up issue. Use 3G internet network for fast browsing.",
            "date": "17 Apr 2015",
            "name": "Raja",
            "stars": "5 stars"
        },
        {
            "comment": "nice samrtphone as well as nic quality phn .....loved the service of flipkart...100 percentage trust worthy......",
            "date": "17 Apr 2015",
            "name": "Nibin Joz",
            "stars": "5 stars"
        },
        {
            "comment": "Very amazing experience I was thinking for HTC but it is the best came with Lollypop and amazingly superb product at this price. Don't go for samsung and another Chinese mobiles just buy it and Happy experience you will get.",
            "date": "17 Apr 2015",
            "name": "Badrish Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "I got the Balck one a year back for my Father and am so happy with the product that i got a White one recently for my Mother. Build quality : is superb. It feels premium but its heavy. User Experience :one of the reasons i got this is coz of stock android and regular updates. Camera:average There are much better options available. I wanted it for my parents who arent heavy users and wouldn't even use 30% of phones capacity. For them build quality and looks mattered more and in that department, its hard to beat. Android lollipop update has rendered it slow. Hope this helps.",
            "date": "17 Apr 2015",
            "name": "Wakeupproject",
            "stars": "5 stars"
        },
        {
            "comment": "the moble was delivered to me on 3rd Jan 15, in last week of Mar15 i found that glass of my phone is cracked. Due to unavoidbale circumstances i couldnot talk to Motorola. on 167th APRIL I could talk to them am anf came to know that breaking of glass is physical damage so is not covered in warrantee. then waht is Gorila Glass specility.",
            "date": "17 Apr 2015",
            "name": "Waqar Shaikh",
            "stars": "5 stars"
        },
        {
            "comment": "nice product it is with gorill glass so no need to screen protecter.but only minus point it is the battery last for one day only. so main point is to improve is the battery.",
            "date": "17 Apr 2015",
            "name": "chirag patel",
            "stars": "5 stars"
        },
        {
            "comment": "llolipop os is very bad .iam calling number is open another app .some times contacts not open .previous os kitkat is very nice .but i hate lloipop os >NO RATING THIS OS .BUT PHONE AWESOME",
            "date": "17 Apr 2015",
            "name": "vijay",
            "stars": "1 star"
        },
        {
            "comment": "its good, delivered at specified time worth considering. its good, delivered at specified time worth considering.",
            "date": "17 Apr 2015",
            "name": "Siva kumar",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is smthng which shld be nicknamed as awsm...it is cost effective.. its is full of features..m very happy with it...there shld be a 10star option for this 1/",
            "date": "17 Apr 2015",
            "name": "Vishesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Exceptional Phone. Exceptional Price. The Moto G 2nd Generation is the successor to the highly successful Moto G. With a 5-inch HD screen and an incredibly fast Quad-Core processor, you can expect a smooth smartphone experience wherever you go.",
            "date": "17 Apr 2015",
            "name": "manoj",
            "stars": "5 stars"
        },
        {
            "comment": "I bought my first MotoG last year (sep, 14), when it was just launched. I was so satisfied with the features and performance that i ordered two more for my family members. I must appreciate Flipkart for this as the third phone was defective and on my request it was changed in a day.",
            "date": "17 Apr 2015",
            "name": "RAJEEV RANJAN",
            "stars": "5 stars"
        },
        {
            "comment": "dont waste your money in buying this phone. .not working in a week. .continously restarting automatically low quality mobile and charger is not good.",
            "date": "17 Apr 2015",
            "name": "prakash r",
            "stars": "1 star"
        },
        {
            "comment": "A nice smart phone in the range of 15,000/- Good Picture quiality, voice and internet surfing. More over it dosent hang like few other brand.",
            "date": "17 Apr 2015",
            "name": "Amit",
            "stars": "4 stars"
        },
        {
            "comment": "I had purchased this phone in December 2014 and in les than four months the phone has stopped working. I am not sure If its the dealers fault or MOTO G company. But I am very unsatisfied with the product.",
            "date": "17 Apr 2015",
            "name": "Kiran Menon",
            "stars": "1 star"
        },
        {
            "comment": "Superb, Perfect Product.. Sound is cool. Battery is Moderate for Normal Use... If you play more games, than battery comes for 3 to 4 hours.. else 8 hours no problem.. Android L made Phone even more fast and attractive.. Using since 5 months with many Apps, No Hanging, ..! Good Phone",
            "date": "17 Apr 2015",
            "name": "Suprith",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is very good. Best thing is the Pure Android Platform which keeps you updated with the Latest Android version. Only thing is the cost as today market is providing the same kind of cell phones in lower price of some good smart phone manufacturers. So, it will be great if Motorola can cut down the Price.",
            "date": "17 Apr 2015",
            "name": "Dhruval Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this product for the past 6-months THE PHONE IS WELL BUILT, BUDGET PHONE IN THE MARKET PROS: really the pros are very well highlighted in the Flipkart very decently nd in a well-prescribed manner... so don't get confused it here CONS: I DIDN'T COME ACROSS ANY TECHNICAL PROB WITH THE PHONE - still some of the cons I felt are - the phone is bulky is not sleek. which makes it unhandy to use -only once hanged on rough usage if u want a budget phone with all features built go for it if u want some mobile phones which look cool and trendy and ready to spend a bit more money u can very well go for HTC series MOTO-G (GEN-2):WORTH,VALUE FOR MONEY,BUILT IN QUALITY",
            "date": "17 Apr 2015",
            "name": "yogesh c",
            "stars": "4 stars"
        },
        {
            "comment": "This the best phone that I have used before.I think this is the first phone getting updated to android 5.02 lollipop.easy to handle.very cute",
            "date": "17 Apr 2015",
            "name": "pradeep",
            "stars": "5 stars"
        },
        {
            "comment": "CAMERA QUALITY IS POOR.ALSO FIXED BATTERY WHICH MAY CREATE PROBLEM IF MOBILE GETS WET IN WATER OR OTHER LIQUID.",
            "date": "17 Apr 2015",
            "name": "MUNEEM PARVEZ",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G 2nd gen at the time of \"Flipkart Mobile app sale\" at Rs. 9899. As it was in discounted price the owner provide the refurbished and defective product. I already replaced the product one time and the replacement product is also defective one. There is a charging and networking issue in the cell. Also there is a dent on the upper speaker side. Cell gets drain in 2-4 hrs. Quite disappointment by flipkart and its service. Peers service(Amazon) is quite well in this manner. Kindly refund my money and take your disastrous product and service.",
            "date": "17 Apr 2015",
            "name": "Shyam Jajoo",
            "stars": "1 star"
        },
        {
            "comment": "Received Best Product Ever.. Speed is Good Camera quality Ok Battery Back up ok Touch experience awesome. display appearance perfect",
            "date": "17 Apr 2015",
            "name": "Nijanthan S",
            "stars": "5 stars"
        },
        {
            "comment": "The best ever phone...I bought moto for the st time & it was like WOW... & flipkart as always with a stunning service...",
            "date": "16 Apr 2015",
            "name": "Tamojit Bhatta...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought a Moto G 2nd Generation mobile on 27th March during apps day, I recieved a mobile as per the commitment, however when I started using , I have realized that battery backup is worst, even though I did not made any calls. I have complained to flip kart, with a great difficulty flipkart expert asked me to install the smart check software, they says there is no issue. I have raised a concern again I consulted Motorola service center, on top of battery issue, signal strength is very weak, when I am at home, absolutely zero signal, until unless I go outside my house, I don't get the signal, I used the same sim earlier in blackberry it works perfectly, no signal issues at all. I went to service center, there also I had the signal issue, I practically showed to service executive. I have asked flipkart guys to replacemy handset, they says they will look into the issue, revert by 30th April. In fact service executive spoken flipkart guy, 30 days replacement policy is absolutely cheating people, I met few more guys who are facing similar issues with moto g. I went B2X is Motorola service center which is located at kumar pally,Hyderabad. I sincerely advice people not to buy products from flipkart at all. We have to pay money and struggle ourselves. He has installed OS, still the problem persist, then he says that he will service my mobile, why should we buy from flipkart and run after service centers? I am really getting a doubt is flipkart selling the new ones? I have lost faith in flipkart after having this incident, careful with these guys.",
            "date": "16 Apr 2015",
            "name": "Naveen Kumar G...",
            "stars": "1 star"
        },
        {
            "comment": "Firstly, I am bit confused either buy it or not but after purchased and used few months, I love this mobile features. It is handy to use. The sound quality is very good. It uses less RAM while running multiple applications.",
            "date": "16 Apr 2015",
            "name": "amit karn",
            "stars": "4 stars"
        },
        {
            "comment": "I got Moto G2 delivered on 30th March 2015. The product is causing so many problems which I already informed the Flipkart team time to time but till date there is no resolution. Troubleshooting is not working out, I raised request for replacement of phone but still waiting to hear from the flipkart team. I am having very bad experince this time :-(",
            "date": "16 Apr 2015",
            "name": "Ashish Meena",
            "stars": "1 star"
        },
        {
            "comment": "I love this phone.. if anybody is looking for a phone around 10K . You should close your eyes and buy Moto G 2nd Gen. pros : awesome sound quality love the HD resolution very good camera no connectivity issues great look comfortable in hand cons : have not yet discovered any cons",
            "date": "16 Apr 2015",
            "name": "Abhinav Singla",
            "stars": "5 stars"
        },
        {
            "comment": "BEST phone frnds no problems The phone is superb . the sound quality was excellent and the camera was Nice and in my opinion the best phone under 15000. GO UP MOTOROLA",
            "date": "16 Apr 2015",
            "name": "Yash",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered this phone a month back. After 3-4 days the phone started hanging every 5-6 hour and had to be restarted. I complained to flipkart they said to reset the phone. I did the process multiple times and Everytime had to backup my data which is again a pain. Later they said that the issue has been resolved and there will be no replacement. Very poor service from flipkart. I prefer not to use flipkart again because of there poor service.",
            "date": "16 Apr 2015",
            "name": "Ananta Chhajer",
            "stars": "1 star"
        },
        {
            "comment": "I have ordered the Moto G on Saturday and received it on Sunday.Delivery was fine. There are 2 Major Issues in the Mobile. 1. After 4 Days normal Usage Yesterday i have Charged the Phone for 6 hours and within afternoon 3 Clock full Charge has drained. Now i have put Charge for 2 hours still the Charge is 1% i am not saying the phone is totally bad some of the Phone has problem. I have called the Customer Care 2 Times ,within the Scheduled time only they will is the response Worst from Flip-kart Technical Support Team. 2. The Ringtone is the Second Issue already i had the Problem with ringtone but i reset the Phone the Problem was solved now again the same Problem No sound is Coming",
            "date": "16 Apr 2015",
            "name": "Ram Sathya",
            "stars": "1 star"
        },
        {
            "comment": "Motorola has also proved it's also one of unbranded companies. It's has a poor quality camera. A good camera is the one which can click clear pictures in low light that this phone cannot do that at all. What is the benefit to spend 11,000 for a smart phone if it does not have a good camera, instead one can buy a phone for around 5,000 with all most the same features. It's only Samsung that never disappoints its customer from the point of a good camera. I use Galaxy Note 2 that's a great camera and I will never think of any other brand but Samsung.",
            "date": "16 Apr 2015",
            "name": "Shuaib Saifi",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone, good battery, but doesn't work for long on 3G network. Also, does not have variety in colors like in Moto X. Get some colors to the phone's back panel, like for Moto X, black and white are very basic.",
            "date": "16 Apr 2015",
            "name": "Akanksha Pandya",
            "stars": "4 stars"
        },
        {
            "comment": "Hi every one.. I request to you so please don't purchase any company mobile from Flip kart. Last two week before i have purchase moto g2 . with in @ week iam facing problem like stuck heating. when i request for replacement with 30 days emplacement.. they told our product specialist will call. after two days i got call. seriously iam very unhappy with the product specialist.. they come check online with some soft wear like smart check. after choking he saying my cell is good no fault. if there is Fault i have to go to service center.. why should go to service center.. when i have purchase from flipkart. please dont buy any mobile...",
            "date": "16 Apr 2015",
            "name": "yaseen ahmed",
            "stars": "3 stars"
        },
        {
            "comment": "Battery backup is very bad and especially when we turn on data(internet). You will have to charge all the time in a day. Better to go for another mobiles which come with less price and good features.",
            "date": "16 Apr 2015",
            "name": "SUDHEER REDDY...",
            "stars": "1 star"
        },
        {
            "comment": "at first it will work properly for 10 to 15 days and there comes the problems such as dailer will not respond and music player strucks and we should restart the mobile. poooor quality device definetely i will not suggest you this phone . best in price poeer in performance...",
            "date": "16 Apr 2015",
            "name": "Dinesh Reddy",
            "stars": "1 star"
        },
        {
            "comment": "Hey!. i hd placed my order on April-11th n just 3dayz later, i got this cell. Moto g 2nd gen is brilliant. Working good. Only issue i faced was Google Play Music. The songs used to play 1st time when i start the app, but they werent playing 2nd time. So,",
            "date": "16 Apr 2015",
            "name": "Dhaval Shiralkar",
            "stars": "5 stars"
        },
        {
            "comment": "After spending months of time in reading phones specifications, watching unboxing youtube videos, finally I realized Moto G2 is still best in budget phone, and ordered it from FLipkart. Flipkart delivered phone in 2 days only. Thanks! It's a nice phone, good built quality, No heating problem( after reading some reviews I was worried about it), very sensible touch screen. I played few big graphics game no problems so far. And best thing was I got Lolipop O.S by default in my Phone. Sometime very rarely it hangs i think this problem is with every android device. I am much satisfied with my choice, it gives you an experience like you're working on Nexus -5 device.",
            "date": "16 Apr 2015",
            "name": "Manu Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered the phone on 12th and it got delivered on 14th of march. I have been using iphone all along and this was my first android phone. The phone is brilliant with great build quality. Feels solid. The screen resolution gives a feel of a premium phone. Battery life is great. Lasts one full day on 3G with browsing, social networking apps and calls. The only negative aspect is that the phone gets very slow while using various apps. So not a great phone for multi tasking. It hangs at times and I'm sure the updates to come in the Android Lollipop will rectify this negative aspect. Considering the price point, it is by far the best phone in the market and its a blind eyes yes for me if you were to compare other phones in the same price range.",
            "date": "16 Apr 2015",
            "name": "ARVIND SREVATSA",
            "stars": "4 stars"
        },
        {
            "comment": "Well purchased the product 2 weeks back. Phone and its features are basic, but I'm disappointed with Battery. Please make sure you calibrate the battery first for good performance.",
            "date": "16 Apr 2015",
            "name": "Rahul Deep Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "I bought moto g2 n flipkart they delivered in quick time. IF u want to buy a gud mobile at cheap rat go for tis mobile",
            "date": "16 Apr 2015",
            "name": "Jawahar purush...",
            "stars": "5 stars"
        },
        {
            "comment": "Because already i am using Moto g 1st generation and its to good due to that i have purchased second generation and in this both speaker are in front so sound quality is 75 % good.,.,.,.,.,.,.",
            "date": "16 Apr 2015",
            "name": "sridharan kris...",
            "stars": "4 stars"
        },
        {
            "comment": "a best phone that u could buy in this range.it is the best phone with awesome camera quality n a gud processing speed.",
            "date": "16 Apr 2015",
            "name": "kuldeep chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "Superb performance in this same range other mobile................................ I ordered total 6 mobile for me and my family members...",
            "date": "16 Apr 2015",
            "name": "Anurag Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "a decent brand with a decent product. reviews were awesome for this product. every body was saying that it worth for its cost. ended up buying this. prons: 1.wow display brightness was so good and clear. 2.lollipop updated. 3.curvey back case for handy. 4.memory for apps wow i downloaded near to 50 apps and it can be transferred to memory card as-well. 5.charger when you touch the end of charger for connecting the phone you will find in a curved surface indicating the bigger and smller end(no need for inspecting the end before application if you use to it) cons: 1.battery is not as expected as i was using lot of apps. 2.camera is not focusing small letters (tryto take a photo of words in a book and you will know what i'm saying) 3.headphone-yuk crappy . 4.data cable- no data cable and a slow charger(my micromax charger is better than this) 5.hanging issue 1.2 Ghz Qualcomm Quad Core Processor & 1 GB RAM(you will get irritated for sure because of this) 6.i had war with flipkart for getting refund for this product. conclusion: if convinced and ready to buy even after reading this review then follow the warning note below WARNING:be sure of not returning the product coz i almost had a war with flipkart & the customer care person is amazingly replying me saying pls go for court& do want you can do and asking me questions like \"if you dint read the review its not my mistake\". (i'm not blaming flipkart I faced such response ONLY for MOTO 2GEN previous mobiles like mi note i dont have this problem.) take your call for this product you might be lucky :-p",
            "date": "15 Apr 2015",
            "name": "swaminathan s",
            "stars": "2 stars"
        },
        {
            "comment": "I got defected product. There is a dot and horizontal line on the screen which is clearly visible if i tilt the phone a bit. National top most online seller has left me with such a worst experience in resolving my problem which is still pending as of the date i am writing review. Customer executive always says with in 24 hrs our technical team will get back to you but these guys watches will turn to that 24 hrs and they won't get back to you again if you call the same words will be repeated. Still waiting for their response its almost 20 days passed that the product has been delivered to me only 10 days left towards their so called return policy. I am sure if you got such defected pproduct its like hell to you guys in getting resolved by flipkart.",
            "date": "15 Apr 2015",
            "name": "Hari krishna k...",
            "stars": "3 stars"
        },
        {
            "comment": "Worst product I've never used and a worst response from flipkart. Got 2 defective lenovo A600 and one defective MotoG. Again and again getting only defective products.. Till now solutions from flipkart.. I've raised a complaint from the day I got the mobile.. Til now no solution and everyone are so lethargic.. Worst Worst Worst Worst",
            "date": "15 Apr 2015",
            "name": "Zainul Mohammed",
            "stars": "1 star"
        },
        {
            "comment": "Phone was good until android 5.0 update. After the update phone's performance degraded to worst. Not happy.",
            "date": "15 Apr 2015",
            "name": "DHEERAJ SINGH",
            "stars": "1 star"
        },
        {
            "comment": "all is good in moto g (second gen.) there is issue with battery. it can not used for more then 6 hrs with 2g. if Motorola gives option to replace it's battery in future with paid option then i will marks full rates :)",
            "date": "15 Apr 2015",
            "name": "Dhiraj Ahir",
            "stars": "2 stars"
        },
        {
            "comment": "Amazing phone - Quick Delivery Works smooth. I have both the versions of this phone. Both are just perfect in this price range for smart phones.",
            "date": "15 Apr 2015",
            "name": "Rahul Bhatt",
            "stars": "5 stars"
        },
        {
            "comment": "I received moto g 2014 in 26th of april, Bottom speaker is completely not working,some signal drops also there,so made the return request at 8th of april,they called at 15th of april and said they will call by tomorrow 12pm to resolve my problem .. I said how can I trust your service because because you said you will call me 8th of april,but actually called at 15th of april,so if you said you will call 16 th april you will call me after the 30 day period of returns,so I am unable to return after 30 days, I know Flipkart are making fool of us by reducing 2000 rs by advertising big app sale by giving refurbished phones,I read in some of the forums ,they say flipkart are providing refurbished mobiles. So my 10999rs are gone in a second, So I said the customer representative to cancel the return request(because its no use anymore,they wont call after 30 days),he said to wait a minute to decline the request,but actually he didn't decline the request.So its clear that they are making us wait for 30 days,after that they are saying its not there responsibility. Be aware guys as my experience and also viewed other reviews too ,am not the only one experiencing these kind of issues,there are lot of them. So finally my 5 digit money is not worthy for this mobile. This is the last product I would buy in flipkart,and I wont recommed to buy anything from flipkart to my friends,and they wont buy because they already know what I am suffering now. There is minimum of one star recommended for this review,so only I am giving it, My opinion is its not worthy guys,",
            "date": "15 Apr 2015",
            "name": "Shibu Abraham",
            "stars": "1 star"
        },
        {
            "comment": "Hi, Purchased Moto G 2nd gen 16gb white phone during app flash sale offer, from day1 I noticed some jarring/hissing noise and irking sounds in ear piece while on voice calls. it was very annoying to be on calls with that disturbing noise. Also calls not reachable, call blanks for few seconds during conversation .Raised a return request, got phone checked online by a flipkart technician and declared defective got approval for replacement. My replacement phone reached me within 2 days of approval and it was hand to hand replacement (thanks to flipkart :)). Unfortunately this phone is also of same issue along with speaker making much more noise while put for charging. Tried with different telecom provider sim; same issue, Changed SIM slot from 1 to 2 and verified : same issue. Being a electronics product development engineer with 12 years experience I can assess this is a design defect, not going to solve with getting handsets replaced. *******Hope Motorola notice this and look into the issue in next phases.********** Apart from this issue Moto-g 2nd gen is a awesome phone with good feel on touchscreen, built etc... Regards Vishwanath",
            "date": "15 Apr 2015",
            "name": "Anubhavi Kongadi",
            "stars": "2 stars"
        },
        {
            "comment": "Purchased this phone 6 months ago.No issues....good quality.One of the best from Moto. Had a great experience buying on Flipkart.",
            "date": "15 Apr 2015",
            "name": "sharath K.R",
            "stars": "4 stars"
        },
        {
            "comment": "Its performance is Superb but Battery backup is Very Poor, I give rating as 4 because of poor battery .",
            "date": "15 Apr 2015",
            "name": "praveen",
            "stars": "4 stars"
        },
        {
            "comment": "Good features for the price, good performance as well. the display is a bit dull as expected. camera quality is good enough.",
            "date": "15 Apr 2015",
            "name": "shreyas surve",
            "stars": "4 stars"
        },
        {
            "comment": "Battery is very poor, but if you manage to carry a power bank, this is one of the best phones in the price.",
            "date": "15 Apr 2015",
            "name": "ashok gopalakr...",
            "stars": "3 stars"
        },
        {
            "comment": "Likes 1. Every thing is well in place, be it speakers or sim card slots 2. The crispiness of the screen is breathtaking 3. The dual speakers are just awesome 4. Camera works perfectly 5. Form factor of the phone is awesome 6. I can keep on chanting the goodness for all day! Dislike 1. Upgrade to Lollipop resulted in freezing of the phone now and then! 2. The battery is not removable ....... that is a pain when the phone hangs",
            "date": "15 Apr 2015",
            "name": "PRANAV VIVEK",
            "stars": "5 stars"
        },
        {
            "comment": "Good product with good specifications.Camera is good also pure android stack so no hanging of phone.But if you r a long time battery user than it may disappoint you because its battery last only for a day. and if u make heavy use of mobile then it may be power off within a day",
            "date": "15 Apr 2015",
            "name": "Shubham mahes...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this product from Flipkart 2 weeks back, rite from day-1 of usage, phone is getting heated even if you make a call and talk for 10 minutes. I raised return request to replace the phone through website as well as customer care .But the response from them is very poor. They will call you just to tell that your voice is not audible and we will schedule a call tomorrow like that .Going forward dont buy any electrical goods from flipkart However my friend purchased in store and it is working fine without problems",
            "date": "15 Apr 2015",
            "name": "N@veen",
            "stars": "1 star"
        },
        {
            "comment": "i am using this phone more than one month and i am facing some issues 1.its not connecting to my laptop with USB cable 2.battery performance is not good 3.bottom speaker sound is also not good and the major problem is 1 GB of RAM",
            "date": "15 Apr 2015",
            "name": "Pravin",
            "stars": "2 stars"
        },
        {
            "comment": "I got my device in 2 days. Delivery was really awesome. Device is good on the part of performance but battery drains out very quickly.The reality of motorola is that they have very bad service centres(specially if you are in bhubaneswar). I have got a very small memory card slot issue with my device. I gave my product on 27-March-2015 and its been almost 3 weeks and i haven't got my device back.Smart services (authorised service centre of motorola) in bhubaneswar is a place where you must not visit with your device. Do not buy i motorola device. It is highly recommended not to buy this device.",
            "date": "15 Apr 2015",
            "name": "NALINIKANT MISHRA",
            "stars": "1 star"
        },
        {
            "comment": "I JUST LOVE IT.............................................BEST PRODUCT BY GOOGLE................................",
            "date": "15 Apr 2015",
            "name": "Anup Dambal",
            "stars": "5 stars"
        },
        {
            "comment": "No issues with the performance except for the battery. Drains out very fast and gets charged very slow .Over all a decent product.",
            "date": "15 Apr 2015",
            "name": "Aditya",
            "stars": "4 stars"
        },
        {
            "comment": "IF your budget is 10k to 15k this is the best buy i have used so many mobile phones but this is at the peak . everything is good do not think just get one!",
            "date": "15 Apr 2015",
            "name": "prashanth pothana",
            "stars": "5 stars"
        },
        {
            "comment": "Loved the phone. I have gifted it to my sister and she was very happy. service of flipkart was also good, they delivered it in just 3 days",
            "date": "15 Apr 2015",
            "name": "Pooja",
            "stars": "5 stars"
        },
        {
            "comment": "Issues - 1) Battery Drains Fast 2) There is a Lag for 1 or 2 Seconds. Apart from these issues everything is fine.",
            "date": "15 Apr 2015",
            "name": "harish reddy j...",
            "stars": "2 stars"
        },
        {
            "comment": "Best mobile in this price range. Descent look. Good battery back up. Ver good performance. nice camera quality",
            "date": "15 Apr 2015",
            "name": "Saket Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "this product is a really genuine featured phone the only problem is its battery life. I did had camera issues on the first delivery and it showed an error \"camera busy\" and i would like to advise u to boot it in safe mode and see if it works or else immediately get it replaced. the replacement model was too good but for a use from about a week or so i am realizing that with only light gaming and streaming the battery drains down to 15%!!!! this gets me into a lot of trouble only advisable for normal usage and not for professional use or gaming.",
            "date": "15 Apr 2015",
            "name": "Varzan Bodhanwala",
            "stars": "4 stars"
        },
        {
            "comment": "I had a windows phone with no apps or crappy apps. Replaced it with this phone..awesome exp and great UI. Windows UI was confusing and huge fonts sucks.",
            "date": "15 Apr 2015",
            "name": "Anil Jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery was quick.. :) Product is superb with lollipop updated OS android version .... i would recommend my friend to buy this product from flipkart",
            "date": "14 Apr 2015",
            "name": "shiva pinkpanther",
            "stars": "5 stars"
        },
        {
            "comment": "I will tell only one thing. No any other brand can give you all these features at this price. 720p display, 1 gb ram 8 mp camera. Motorola was a trusted name from years.",
            "date": "14 Apr 2015",
            "name": "Pankaj Singh R...",
            "stars": "5 stars"
        },
        {
            "comment": "It fulfill all your smart phone requirement in low price, branded & reliable. After upgrade to Android Lollipop it is now little slow but manageable.",
            "date": "14 Apr 2015",
            "name": "Umakanta Saman...",
            "stars": "4 stars"
        },
        {
            "comment": "Got it within 20 hours of ordering. The delivery person was so nice and cordial and cooperative. Flipkart excels in delivery with superb delivery persons. Just started using the phone,good display,good sound,motorola migrate is so responsive.Overall its a very good gadget...looking forward to more thrills with the phone.",
            "date": "14 Apr 2015",
            "name": "DEBASHISH GANGULY",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing this review after using Moto G2 for two months .G2 is good product for those who are looking at mid level android phone @ decent price . Although there were some problem in speaker , voice was not coming clear & it got echo as well . I had given cell to service center & they repaired it on the spot from then I am using it hassle free . I recommend it to everyone who are looking for value for money.",
            "date": "14 Apr 2015",
            "name": "Ravi Srivastava",
            "stars": "4 stars"
        },
        {
            "comment": "For this prize range phone is excellent. Even though if we are getting a better specification in other brands than this prize, brand is brand. No phone lagging, pic clarity is good. performance is awesome.",
            "date": "14 Apr 2015",
            "name": "Sirajuddin Ahmed",
            "stars": "5 stars"
        },
        {
            "comment": "was delivered bang on time. Great phone. And the good part is even after the heavy lollipop update it does not hang If you are looking out mid range android phone, this is the best one.",
            "date": "14 Apr 2015",
            "name": "Drashti",
            "stars": "5 stars"
        },
        {
            "comment": "Main problem battery,touch issue ,more no of times app closing not responding due to touch and cache clear issue.",
            "date": "14 Apr 2015",
            "name": "Kannan S",
            "stars": "1 star"
        },
        {
            "comment": "Very simple but responsive UI, excellent performance, good battery life. Quality of pictures and videos is great.",
            "date": "14 Apr 2015",
            "name": "Vadiraja Bhat",
            "stars": "5 stars"
        },
        {
            "comment": "Commenting after using this 7 monthes. Everything is great, Stock android - Lollipop Experiene, Display - too beautiful, Gaming - I can Play every heavy games, like Modern Combat 4, Modern Combat 3, Asphalt 8, Need for Speed - Most Wanted, GTA Vice City, The Amazing Spider Man 2 & more. and that's why I bought the phone, but getting hot after few Hours gameplay, But that's OK. Dual Streo speaker is damn good man. Yes I recommend this to others....",
            "date": "14 Apr 2015",
            "name": "Imran Ali",
            "stars": "4 stars"
        },
        {
            "comment": "If you're looking phone at a range of Rs 130000/-. It's a best phone. Don't think for any other model and don't compare it. Awesome phone love it!!!",
            "date": "14 Apr 2015",
            "name": "Ranish Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "The phone works fine. It hangs some times. Sometimes, when I try to call, the phone just doesn't call. It won't hang, but won't call either. No matter how many times I try.It might get fixed with update of 5.1 Apart from this, the phone works perfectly fine. I'm using both the sim slots of the phone, and the battery backup is also good. It lasts me almost a day with complete day usage if 3G and WiFi. The display quality is also good and it's easily visible in sunlight as well.",
            "date": "14 Apr 2015",
            "name": "ANUJ KHANDELWAL",
            "stars": "4 stars"
        },
        {
            "comment": "Guys go for it, -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Overall-value for money",
            "date": "14 Apr 2015",
            "name": "Amit Vernekar",
            "stars": "5 stars"
        },
        {
            "comment": "This one was pleasant deal though looking at some other devices of this range from Honor and other, this becomes just OK Deal, I would suggest you to go for Honor X4 or even Holly, it gives better deal in every aspect, only plus point you get in this is latest OS. But a decent phone.",
            "date": "14 Apr 2015",
            "name": "Jitesh Raghuwa...",
            "stars": "4 stars"
        },
        {
            "comment": "brand new android, fast processing. nice look, screen and loud volume. touch screen is also very smooth. overall unbeatable budget android phone. motorola rocks",
            "date": "14 Apr 2015",
            "name": "veeru",
            "stars": "5 stars"
        },
        {
            "comment": "Ultimate phone, very good speed and work very good, only biggest issue is Battery , it drains very fast, 5% in every 10 minutes",
            "date": "14 Apr 2015",
            "name": "Rakesh Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "its just 2 to 3 months old and my mobile's battery is not even giving the back up of 6. if i'm using my phone for just couple of calls and whatsapp's msgs it dies within 6 to 7 hours. it is little slow as well compare to how fast it was new and it becomes very hot when i'm using it or charging it. sometimes i feel it can burn my skin.. i was very happy happy buying this phone but i had to change my thinking just after a month. i should have paid less and got different phone. this way i'm thinking how long will be using this phone.. i will be forced to change my phone within 6 months i guess..",
            "date": "14 Apr 2015",
            "name": "Amit Kumar",
            "stars": "1 star"
        },
        {
            "comment": "just i told you plz Don't buy this phone. you batter to go for HTC or any other phone, aghar khud kamaya paisa ha to mat khrido aghar bap kamaya paisa ha to kharid sakte hoo.",
            "date": "13 Apr 2015",
            "name": "Toweb ser",
            "stars": "1 star"
        },
        {
            "comment": "After upgrading to lollipop, im charging my mobile for 6-8 hours to reach 100% full battery. its coming down from 100% to 10% with in few hours.Not at all satisfied with the battery consumption and the time it is taking to get the full charge.Im planning to sell this mobile.Any one interested can reach me.Thanks",
            "date": "13 Apr 2015",
            "name": "RK",
            "stars": "1 star"
        },
        {
            "comment": "phone is getting heat and charging will be getting down very faster , so i don't recommend this mobile to buy , even the customer executives are instead of replacing they are convincing me to use this mobile...",
            "date": "13 Apr 2015",
            "name": "Kiran",
            "stars": "1 star"
        },
        {
            "comment": "I ordered it on behalf of my landlord, and he was really happy about it being delivered within 6 hours of ordering.",
            "date": "13 Apr 2015",
            "name": "Bindu Shree",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered through Flipkart Mobile application deal. Got the mobile within 24hrs. Thanks Flipkart for the fastest delivery. Mobile is very nice. Games are running with no lag or heat. Supports all Android software. Decent battery back up. Nice deal",
            "date": "13 Apr 2015",
            "name": "Marimaheswaran",
            "stars": "5 stars"
        },
        {
            "comment": "For future customers of Motorola phones: An input for people desirous of buying Motorola...certainly a nice phone...worries are in after sales support: Either Motorola is over whelmed with large number of failure in their product or they care a damn once sale has been made and they have made their money. So unless you are willing to undergo hardship of a period of two weeks and more just identify defect and another few weeks before (sounds forever to get your phone up and running), go ahead and burn the hole. Would like to add specifically...delivery, etc handled by Flipkart was perrrrfect...only post sales customer care by Motorola is a big hole",
            "date": "13 Apr 2015",
            "name": "Anil Malani",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone and worthy to the money. Battery back up is good, Camera is awesome. No lags in gaming. This is my 3rd Moto G phone from Flipkart. Thank you Moto.",
            "date": "13 Apr 2015",
            "name": "Madhava Lakshm...",
            "stars": "5 stars"
        },
        {
            "comment": "ATthis price aphone like this is a miracle .........the best budget phone till released Its lolipop out of the box.......",
            "date": "13 Apr 2015",
            "name": "Johann Pariyath",
            "stars": "5 stars"
        },
        {
            "comment": "Past 2 months i am using , Good in look, quality, sound but very very slow in 3G connection. taking much time to load a pic. in whatsapp.. Previously i was used Sony(xperia M dual ) with same network which very fast response but in Moto G2 is not that much response. before buying chk with ur close circle and buy.",
            "date": "13 Apr 2015",
            "name": "Senthil",
            "stars": "2 stars"
        },
        {
            "comment": "Worth buying the phone since its value for money. The phone is having Android Lollipop. Good Features",
            "date": "13 Apr 2015",
            "name": "Neha Sethi",
            "stars": "4 stars"
        },
        {
            "comment": "Specs are good but very bad battery backup .I thought it might get returned but NO. So the only things i can do is to get it replaced.I recommend everyone to buy galaxy s3 neo much better than this with better specs",
            "date": "13 Apr 2015",
            "name": "Abhigyan Singh",
            "stars": "2 stars"
        },
        {
            "comment": "I am base customer of Moto been using its products since i was kid. This is agin a brilliant product from Moto. Best is Sound, Camera and Mind blowing durable body. Go for it no second thought. Moto does care for its customers.",
            "date": "13 Apr 2015",
            "name": "Rakshit Raj Thapa",
            "stars": "5 stars"
        },
        {
            "comment": "Its been 2 months since I am using this phone and I am quite impressed with it. Pros: Nice robust built, good responsive touch, good sound and call quality, large vibrant display, non glossy back cover which does not attract finger prints, works good without any hanging or lag. Cons: Camera could have been better, picture quality not that great in low light. Battery also could have been better. All in all good phone at this price point.",
            "date": "13 Apr 2015",
            "name": "Ankit Saxena",
            "stars": "4 stars"
        },
        {
            "comment": "this was pretty good phone at this price range. but i thought processor need some improvement. After the update phone getting too much heat and also lag very frequently. even though the performance of the phone is pretty fine.",
            "date": "13 Apr 2015",
            "name": "Dhanasekar M",
            "stars": "3 stars"
        },
        {
            "comment": "Pros: 1. Camera, 2. Display. 3. Latest android. 4. decent battery. con: 1. 1 GB Ram. Slow if more apps 2. Not for high end games. Frame loss and stuck some times. 3. Not removable battery.",
            "date": "13 Apr 2015",
            "name": "Sandeep Yedire",
            "stars": "4 stars"
        },
        {
            "comment": "This is my Second Moto G2 and I gifted it to my Brother. All have been said before about this phone. Most of the thing said about this phone is true and worth a buy. But if you are looking for good battery life, better choose not this.",
            "date": "13 Apr 2015",
            "name": "Garush666",
            "stars": "4 stars"
        },
        {
            "comment": "1. Frequent Network issues. Only with this phone. 2. Call drops. Had high expectations but disappointed, I must say. Don't have the patience to go to service center. Will wait if any exchange scheme comes...will replace it then. I am using this mobile from 4-5 months now.",
            "date": "13 Apr 2015",
            "name": "Jitendra Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "Good Product. in terms of battery, screen size, display quality and speed. Runs smooth on Android Lolipop... Fast shipping by WS retail. Value for Money",
            "date": "13 Apr 2015",
            "name": "Sameer Handge",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart people are selling defective cell phones they are not properly responding, even though telling the problems of cell phone. I bought Moto g 2gen. phone, which is often getting switched off while talking. which is very bad and irritative. After complaining also, they are not interested to solve the problems by sending the person. Just , they are saying suggestions and leaving complaints as it is. THINK, BEFORE BUYING PRODUCTS IN FLIPKART.",
            "date": "13 Apr 2015",
            "name": "Vijay",
            "stars": "1 star"
        },
        {
            "comment": "Very nice and solid product. I faced some hardware problems but thanks to Flipkart and WS Retail for the replacement. Now it is fine.",
            "date": "13 Apr 2015",
            "name": "Anirban Datta",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this mobile almost 4months back....Its really awesome.,I was stuck between Redmi,HTC,SOny...After tons of reviews and searches I Chose this mob & its really up to xpectation, -The oly disappointment for me was the Headset a (NOrmal one,no IN the ear headphones), -The charger is not Detachable -And the mobile takes solid 4hrs for full charge from 1-100%(not a big con-MANAGEABLE) I also LIke to share one of my experience,..Once I had oly 1% of charge in the MOTO g 2,I charged it for 20mins Approx,as there was no time for further charging as i had to leav office, I switched off the mobile putting it in BATTERY SAVER mode and turned it on after 3hrs it had Amazingly 60% of battery life I have no IDEA wat happened and how my phone came up with a charge of 60%...!!! I strongly Recomend this MOB,..and last but not Least Flipkart.delivery amazing..!!",
            "date": "13 Apr 2015",
            "name": "Srinath",
            "stars": "5 stars"
        },
        {
            "comment": "Good Looking Phone and better performing one as well when compared to Moto G. Looks great in white. Though Android Sucks... iPhone performs much better.",
            "date": "13 Apr 2015",
            "name": "Hemant Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "best smartphone in the market at this price...............go for it without any hesitation...the camera of this phone is awesome.",
            "date": "13 Apr 2015",
            "name": "mitesh shah",
            "stars": "5 stars"
        },
        {
            "comment": "Totally disappointed with the performance of moto g2 got this 2 weeks back and i am shell shocked with its performance I cant even play simple games like subway surfers the mobile is lagging a lot I've appealed for replacement and they've rejected my request I you go for this mobile definitely your money is at risk",
            "date": "13 Apr 2015",
            "name": "Adsam",
            "stars": "1 star"
        },
        {
            "comment": "only one think i want to know that how to take screen shot of screen in this mobile .. plz any one can rlpy",
            "date": "13 Apr 2015",
            "name": "amit.bhilwade",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto G2 doesn't lag even with 10-12 applications in background , wondering why there is a new for 2 GB RAM if one is an average user..Even big games such as Asphalt 8 and FIFA15 run smoothly without a single lag. Love the Gorilla Glass display..it feels like sliding your fingers through Butter. Recent attraction being the revolutionary Lollipop update . Now, the downsides of the phone such as The Sim Card Detection which many of my friends too faced the issue, Occasional Call Drops, while making it becomes total mute..I can't hear the opposite persons voice nor can he ..This has happened to me while in urgent situations..so its of great concern..Being visited the service centre twice and waiting for nearly 15 days to get it back is really frustrating and annoying..also there are hardly 3-4 service centres. If it doesn't face frequent issues ,then that's good and worth. This is only my personal experience after usage and not generalising it as a bad phone saying these issues faced by all.",
            "date": "13 Apr 2015",
            "name": "Kevin Shah",
            "stars": "3 stars"
        },
        {
            "comment": "Got it for Rs 9900! Upgraded to Lollipop, Quality product & performance, worth the price! Battery charges slowly and drains quickly.",
            "date": "12 Apr 2015",
            "name": "Akansha Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "need to be develop with 2gb ram, timely service,hanging problem becouse of 1gb ram.some time game hanging.so it is a hanging phone with less money for system dev needed hanging people.",
            "date": "12 Apr 2015",
            "name": "sanjib kumar c...",
            "stars": "3 stars"
        },
        {
            "comment": "I am using this phone from last 15 days, Good phone at price range of Rs 12000/-. excellent camera quality.",
            "date": "12 Apr 2015",
            "name": "Ranjeet",
            "stars": "4 stars"
        },
        {
            "comment": "this is the waste phone i have ever bought i just want to through this out of my home first of it started from camera it lags frames while shooting videos then it started heating up after lollipop update entire phone became junk now its touch stopped working",
            "date": "12 Apr 2015",
            "name": "Isaac maniratnam",
            "stars": "1 star"
        },
        {
            "comment": "Moto G is good but peoples to think about flipkart only. Every one should know that filipkart will not take back mobiles. Their 30 days replacement is fake",
            "date": "12 Apr 2015",
            "name": "srinivas",
            "stars": "3 stars"
        },
        {
            "comment": "Audio is not clear when try to hear from left hand side. And not sure it will support latest Androd version",
            "date": "12 Apr 2015",
            "name": "ASHOKAN PERUMAL",
            "stars": "3 stars"
        },
        {
            "comment": "I warn all those who wanna buy phones on-line, don't go for it. You only get defective products on-line. I purchased this phone and from the very first day I am facing problems of automatic heating, display brightness issues and faulty display. It has been replaced once but the issues persist. I repeat dont purchase expensive electronic gadgets online. You may easily get ripped.",
            "date": "12 Apr 2015",
            "name": "ABHISHEK CHAKR...",
            "stars": "1 star"
        },
        {
            "comment": "My moto g got hanged first day after buying from flipkart. When i went to customer centre , they said its old used moto g 2nd gen. Flipkart is selling used electronic devices.",
            "date": "12 Apr 2015",
            "name": "Iranjeet Singh",
            "stars": "1 star"
        },
        {
            "comment": "go for it........ VFM........... design looks good. good display clarity $ aslo sound clarity is good",
            "date": "12 Apr 2015",
            "name": "Abhijeet Sawant",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile phone with this price. Totally worth it. well if you guys want to check out more about it than visit it's website.",
            "date": "12 Apr 2015",
            "name": "Ruchir Prajapati",
            "stars": "5 stars"
        },
        {
            "comment": "Product is totally awesome BUT DISAPPOINTED WITH SERVICE OF FLIPKART. Really cheap services and poor response from customer care. Tooo much delay in product delivery. And this is not 1st tym..before dis i ordered many products dey delayed all products..for moto g i give 5 star but for flipkart only 1 Star.",
            "date": "12 Apr 2015",
            "name": "vishal karia",
            "stars": "1 star"
        },
        {
            "comment": "Well bought for my little sis, in exchange of Krabon A51, she felt happy for this phone but she was disappointed that there was no Data cable with in the box and overall the phone is good and responsive and good interface and above that she loves it and mostly the Andriod Lollipop is also fast than ever before and it is really user friendly and the coclusion she LOVES it",
            "date": "12 Apr 2015",
            "name": "Yugandhar Nath",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing phone @ 13k Performance and features are very good. On 3G battery drains very fast else a perfect phone with given specs.",
            "date": "12 Apr 2015",
            "name": "Pavan Dasari",
            "stars": "5 stars"
        },
        {
            "comment": "Complaining phone would be the worst thing anyone could come up with. But charger provided? OMG! shit man. 3 hours to level from 10% to 98% This is frustrating. Would it not be GOOD to pack a good current rating charger in the package instead of this CRAP! Please WS RETAIL, if not in the package, atleast make other replacement that charges fast available to the accessories section of motorola products so that people like me can purchase one, but not this one. We don't crave for handsfree you are providing in the package. So, better eliminate it and place a fast chager. Please make this happen, as other chargers available in the market could damage the phone. And we don't want our 13,000 to go like flush",
            "date": "12 Apr 2015",
            "name": "PIYUSH VYAS",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone few months back . I am not satisfied with the performance as it getting heat . weak battery and it takes too much to charge .System speed is very slow . Overall not satisfied with the product .",
            "date": "12 Apr 2015",
            "name": "Chokkalingam",
            "stars": "1 star"
        },
        {
            "comment": "BATTERY PROBLEM 3 HR ONLY .................................................................................................",
            "date": "11 Apr 2015",
            "name": "ANAND BHUYAR",
            "stars": "1 star"
        },
        {
            "comment": "I had bought a Moto G2 2nd Gen by flipkart on 21st March 2015. I had received the item very quickly i.e. on 23rd itself. from the day i started using the mobile lots of echo in the mobile and even who are speaking with me feeling the same. Further, it is becoming like a hot plate for speaking after 2 minutes. I had requested flipkart for return of the mobile. flipkart people passed 6 days time and then suddnely this morning they asked me to enter a code in some application smartchek and they have certified everything is perfect. But the thing is mobile getting too hot. they advised me to moto g service .even after visiting moto g service at hyd nothing has changed. still even merely speaking after 2 minutes mobile is getting to hot. I earlier bought two lenovo mobiles from flipkart. But since they are perfect i did not complain. But when I have a complaint flip kart not interested to bother about it since their business has increased. Please do not buy any thing from flipkart",
            "date": "11 Apr 2015",
            "name": "Reddy D S",
            "stars": "1 star"
        },
        {
            "comment": "Purchased this phone from Flipkart. I am using this mobile for one month. It is hanging very frequently. Quality is not as expected.",
            "date": "11 Apr 2015",
            "name": "Vijay",
            "stars": "1 star"
        },
        {
            "comment": "I have minimal use so for me it is fine but then also I feel that internet signal strength is not as good as it was on my Samsung Grand. Camera works very good most of the time but some times not as good. Still using will keep updating as per my usage.",
            "date": "11 Apr 2015",
            "name": "Sanjay Walia",
            "stars": "4 stars"
        },
        {
            "comment": "If looking for some phone with feature then i will definitely recommend Moto G2 .Best in Everything. Dont forget to buy\"Moto Flip Cover for Moto G(2nd Gen) because that is something which will make it best in look.",
            "date": "11 Apr 2015",
            "name": "Ravindra Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "Phone and delivery of the product is good as expected. i really liked the service and also the product.",
            "date": "11 Apr 2015",
            "name": "Chithra M",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Well everyone knows about it.its MOTOROLA and the performance,display,camera,build quality,call quality all is very good.Handles heavy games and apps fine It was kitkat but later updated to lollipop 5.0.2. Cons: The only real con i felt is its battery.It should have been a better one.After lollipop the battery seems to perform better.on minimal use the phone last 24hrs.but with lots of browsing,gaming,phone call it wont go for more than 12hr.Once i played real racing 3(on kitkat) for 5:30hr straight before phone battery goes from 98%-5%).but i'm sure no one wants to play like that. After lollipop the performance considerably reduced.more app loading time,unexpected app closure etc.but that's the known problem with lollipop.it will be solved when lollipop 5.1 launches (probably by end of april or may beginning) I highly recommend this phone.Its worth the price.Dont just compare the specifications to find the better phone that will misguide you.",
            "date": "11 Apr 2015",
            "name": "Sujith James",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone designed well. Quite handy. Works pretty good. Not tried with any heavy app or games so far, but has been excellent performance wise with regular mails, whatsapp, web browsing etc.",
            "date": "11 Apr 2015",
            "name": "Maneesh Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "I WAS THINKING IT TO BE A SUPERB MOBILE. BUT IT JUST MEETS EXPECTATIONS. NEED ANY OTHER MOBILE. PLEASE SUGGEST SOME MOBILE . AND I WANT EXTRA DISCOUNT. SO PLEASE BE QUICK AS I REQUIRE ONE MORE MOBILE. A CLASSY AND GOOD BRAND",
            "date": "11 Apr 2015",
            "name": "AKSHAY GUPTA",
            "stars": "3 stars"
        },
        {
            "comment": "I am using this mobile last 8 months.. Nice display, Fast ram and processor, Quick update android, Amazing stereo speakers, Best camera, Nice design Good battery and without any problems.. Go for it...",
            "date": "11 Apr 2015",
            "name": "R@hul",
            "stars": "5 stars"
        },
        {
            "comment": "Next moto g2 4g version will be available very soon here..!!! Dont buy this now. It has many issues till date I have faced.",
            "date": "11 Apr 2015",
            "name": "Amol Yesade",
            "stars": "5 stars"
        },
        {
            "comment": "9899/- is definitely a killer price and everybody should go for this instead of flooded chinese phones in the market. UPDATE: Noticed battery problem that is very intermittent. Even battery is around 80%, suddenly it goes to 1%. Though after restarting, it again shows 80%. And this behavior is very rare. 2-3 times in a month. I complained to Flipkart. First they give their shit application to install and asked me to wait for the call. I didn't get any call for 2-3 days. Then finally after so many followups, I got call and these idiots tried to check battery with their shit app. Do you think that their app is so smart to catch this intermittent feature? So the app passed the battery. After fighting with that idiot, he told me to reset the phone and wait for the call on next day. I don't know how RESET can affect battery but still I wasted 2-3 hours in back-up my data. And still I am getting call. Moral: FK guyz has become very smart now. Even they provide replacement warranty of 30 days but they don't have intentions for that. So won't recommended FK anymore.",
            "date": "11 Apr 2015",
            "name": "sHAILU BB",
            "stars": "1 star"
        },
        {
            "comment": "I & my friend purchased this mobile 2 weeks back.Two mobile are fully hanging when i contact return policy the told me some steps that also didn't work.Please think and bye.",
            "date": "11 Apr 2015",
            "name": "venkatesh",
            "stars": "1 star"
        },
        {
            "comment": "I am purchased it for my brother-in-law, this is very nice phone, i am taking 3rd one, because, i am & my friend already using Moto G (2nd Gen) phone. Thanks for flipkart.",
            "date": "11 Apr 2015",
            "name": "Mohan Raju",
            "stars": "5 stars"
        }
    ]
}
