{
    "filpkart": [
        {
            "comment": "Nice phone. Fast enough. Camera clarity is very good. But battery performance is just above average. Worth buy...",
            "date": "10 Nov 2014",
            "name": "Prabhu Sankar...",
            "stars": "4 stars"
        },
        {
            "comment": "This phone has a serial network issue but if anyone can ignore this then it is a splendid phone as compare to any other phone.. Display - 5/5 Camera - 4.5/5 Battery - 4/5 Looks - 4/5 Network - 2/5 Update - 2.5/5 Overall - 6/10",
            "date": "10 Nov 2014",
            "name": "mohit gupta",
            "stars": "1 star"
        },
        {
            "comment": "it was a lovely phone with lovely feature with best discount i have received with sbi card offer. I was very happy with the delivery schudule because this phone was a gift from my side to my sister on the occasion of diwali. She was very happy to get this phone which has lovely picture quality. But the sad part is that I want one more phone in the same price as i Have booked for my sister I am really waiting for the offer to come again.",
            "date": "10 Nov 2014",
            "name": "HITESH LUNIA",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on 21st october 2014. didn't receive till 7th nov 2014. So i escalated the complaint. they said, it will be resolved on or before 11th of nov. They acted smartly by cancelling the order and refunding the product. What a fantastic customer service !!!!!#$#%$TR%$%^$%#$ This system force me to give a rating. so i gave 1. but actually it is 0 for flipkart",
            "date": "10 Nov 2014",
            "name": "Mohankumar Dur...",
            "stars": "1 star"
        },
        {
            "comment": "I bought the Moto G (2nd Gen) around Diwali and its just been 2 weeks (while i write this review) that I have been using this phone. It fantastic. The experience of an android from windows is fantastic. Not that windows was bad, android is better. The phone is sleek, very light, fast and user friendly. The battery lasts a full 24 hours even after i use the phone apps to the fullest. I would recommend the phone to all. Also Flipkart service is great as always.",
            "date": "10 Nov 2014",
            "name": "Manish Nadkarni",
            "stars": "5 stars"
        },
        {
            "comment": "Well I have received Moto G very next day of my order. Just to inform you that the device having some voice problem however hats off to flipkart who has provide the new sealed pack phone as a replacement after 2 weeks. Now I can appreciate the services offered by Moto g & Flipkart. Feeling great while purchasing through Flipkart.",
            "date": "10 Nov 2014",
            "name": "Surendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I just want to rate - 5 stars. (Flipkart, you need to enable simple rating, without having to write a 100 characters of maningless text)",
            "date": "10 Nov 2014",
            "name": "Vikrant Rai",
            "stars": "5 stars"
        },
        {
            "comment": "Pathetic phone, 1/5 rating.. Volume button rocks and is not fitted properly.... While on call if there is a notification the speaker makes a very painful loud noise.... And after using the phone for 5-6 days all of a sudden the phone stops working and is not switching off even after repeated charging.... Flipkart service (1/5 - All they had to do was deliver)..!! Flipkart 1 day guranteed delivery is a joke..!! After waiting for the entire day, when I called the courier delivery person, I was told that \"You need to come and collect the packet from our office\".. Even after telling them multiple times that I had opted for \"express delivery\", still I had to go and collect the packet from their office.. Paying for \"1 day delivery\" Total waste of money..Dont fall into the trap..!! For the return and replacement of the defected phone I have placed a request twice already but no response yet.. Greatly disappointed by the product and the service....!!",
            "date": "10 Nov 2014",
            "name": "Aniruddh Keswani",
            "stars": "1 star"
        },
        {
            "comment": "After buying Moto G I scrapped the Micromax MBlaze... don't even wish to sell on OXL, kisi aur ki jindagi kyun kharab karaen.",
            "date": "10 Nov 2014",
            "name": "GD Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone in flipkart two weeks before. . its nice good screen clarity . speakers are also good. camera is ok but good for that price. touch sensitivity could be much better but ok. proximity sensor is slow. battery life is good. ring tone comes after some rising . ringtone rising issue is der.bad headphones and charger could develop that quality.. overall good for beginners in android and mid range users under 15 k",
            "date": "10 Nov 2014",
            "name": "dinesh kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Here I come with an in detail review. Initially I was afraid the phone was getting charged slowly. The mistake I made was that I was that I didn't charged phone completely on the first date. Now everything is working fine once I charged completely whole day. It is worth for the money you pay. However, I flipkart replaced my phone, but there is a new problem I am facing now. I can see lot of pixels in the camera, it was no there in the original item. I am afraid that flipkart is sending me only defective problem. I have bought two moto g2 phone on flipkart, one is for me and one is for my dad. My dad's phone just works fine but my phone is all defective product don't know if flipkart is getting only faulty products. Also., now I am waiting for the flipkart technical team to call me. The issue is escalated to concerned department. Once I hear from them, I will update my review here. ***Updated for a month*** This phone is working fine with great camera clarity with Camera 360 application. I like it. Even the battery is perfect, now I am getting a decent battery back up. Pros: Nice display Good clarity of both the cameras For less price you'll get branded mobile Moto and Nexus are the phone which gets pure stock android and android updates. Cons: Less battery backup (2040 mAH) you'll get hardly one day backup if you're not a frequently user. Phone is just works fine and it is totally worth for money unless it is defective product.",
            "date": "10 Nov 2014",
            "name": "Goutham K S",
            "stars": "3 stars"
        },
        {
            "comment": "moto g (2nd generation) is superbbbbbbbbbbbb, i really like like it because when i thinking about getting a new mobile that time i just confused with galaxy grand 2 and moto g (2nd gen.) but when i compared both mobile then it is good configuration and also ordered. after received it is superbbb with compare to galaxy grand 2 realllyy. so thanx to moto and also flipkart.",
            "date": "10 Nov 2014",
            "name": "dinesh dhadve",
            "stars": "5 stars"
        },
        {
            "comment": "Really good one for this price, worth every penny! Pros - Almost everything Cons - Battery backup (not bad, but could have been better)",
            "date": "10 Nov 2014",
            "name": "Rizwan Ahmed",
            "stars": "4 stars"
        },
        {
            "comment": "soooper mama........................................................................................................................................................................................................",
            "date": "10 Nov 2014",
            "name": "Anoop Bhat",
            "stars": "5 stars"
        },
        {
            "comment": "Brilliant build quality This phone stands after Nexus 5 interms of software best deal on flipkart, I bought this phone when the offer was there",
            "date": "10 Nov 2014",
            "name": "Anuroop Rao",
            "stars": "5 stars"
        },
        {
            "comment": "Worst delivery process : Flipkart is good for Metro cities, where product might be delivered by day-end. But, it becomes hell for small cities or, towns. Lots of communication issues, long expected delivery gap, product tracking issues, etc. can make any buyer frustrated. Costly Damage-Repair charges : For Moto G 1st Generation, if your screen gets damaged, it may coast around INR 5100 and for Moto G 2nd Generation around INR 7000. Not a comfortable deal. :( Camera Hang issue : During capturing images, it becomes frustrating, when screen gets hanged. Then I have to restart the camera to use it. So, if you prepare to buy it, make yourself ready for all those issues. Apart from it, I am experiencing a bad Moto Care service facility too. It need improvement.",
            "date": "10 Nov 2014",
            "name": "Navin Barnwal",
            "stars": "2 stars"
        },
        {
            "comment": "hi, This product is awesome and the Quality, packing is good. I recommend this mobile who are looking for a budget phone",
            "date": "10 Nov 2014",
            "name": "Kalyan Chakrav...",
            "stars": "5 stars"
        },
        {
            "comment": "Its an awesome phone, the interface is great and fast enough. No apparent lagging, although the camera and the display are a bit of a let down. But a nice deal for the price. Certainly better than its predecessor which hangs a lot and shows random behaviour. True value for money.",
            "date": "10 Nov 2014",
            "name": "Hemendra Meena",
            "stars": "4 stars"
        },
        {
            "comment": "Heats up rigorously and hangs many times. disappointed with this but they have replaced me the item. Service was really ausm by flipkart.",
            "date": "10 Nov 2014",
            "name": "Pratik Bhingardeve",
            "stars": "2 stars"
        },
        {
            "comment": "About Product: Mobile is good. But the charger gone in just few days. About Flipkart: It's quality has drastically reduced.Be careful about the discounts they offer. This product I had to order for 2nd time. 1st time when I ordered, after 15 days suddenly the order got cancelled. I was told that courier company was not able to deliver the product. Same address I got many products from FlipKart previously. Again I booked and got the product delivered in 2 days time! So when you book a product keep in mind that you might not get the product at the same price.It might get cancelled and you need to book again.",
            "date": "10 Nov 2014",
            "name": "Suman Tripathy",
            "stars": "4 stars"
        },
        {
            "comment": "I have received the mobile well before the date promised by Flipkart.. I appreciate that.. Regarding the mobile, it is having a worst battery back up.. after charging the mobile for 3 hours long, it gives a great backup of 3 hours... Flipkart is having a 30-day exchange policy, but of no use since if we place a request they will extend and extend the process and at the end they will tell you that \"this is not inside the 30-day exchange period..\" i don't know why these people want to make fool the customers.. If you are not guarantee about the product please do not put any offers like these and give wrong ideas to the customers..",
            "date": "10 Nov 2014",
            "name": "Raghav",
            "stars": "1 star"
        },
        {
            "comment": "Cam is not much impressive, have to charge fully once in 1and half day. I suggest that this would be a better choice, who needs a brand mobile,,, thanks flipkart!!!!!!!!!!!!! you said that on 11th Oct was delivery date but you delivered one day before.",
            "date": "10 Nov 2014",
            "name": "Rajesh Nellipudi",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone on 6th Oct, \"THE BIG BILLION DAY\". I was eagerly waiting for my new phone, however it was delivered 1 day late (i was bit disappointed). Moto G 2nd Gen look is great.. performance is good, but when I play game (Real Racing) for 1-2 hours, battery goes down in 6-7 hours including normal use in rest of hours (i.e. internet). The main problem is with its ear phones (the one comes with the phone). I cant hear voice clearly even with max volume. I have to join calls at any time working on laptop and So, I prefer ear phones so I can work easily. I have to press it in my ear that helps me understanding what the person is saying. it hurts...",
            "date": "10 Nov 2014",
            "name": "Chintan",
            "stars": "4 stars"
        },
        {
            "comment": "The Product looks good but needs more life for the battery. Also when purchased from flip kart, was not provided with the transfer cord.",
            "date": "10 Nov 2014",
            "name": "Ramachandran Sriram",
            "stars": "3 stars"
        },
        {
            "comment": "Product quality received was good and very decently packed and handled at all times. More importantly the information regarding the delivery process and the lead time is really appreciable...Need to mention thanks for that!!",
            "date": "10 Nov 2014",
            "name": "Prasanna Chandras...",
            "stars": "5 stars"
        },
        {
            "comment": "I baught with review feed back on Moto G 1st Gen. But 2nd gen is not at all upto the mark. When i get my first peice the battery drained up like anything. they after serious fight they replaced the peicce. then second one after few days touch stopped working. even after restart also did not work. flipkart refunded money by taking the peice back.",
            "date": "10 Nov 2014",
            "name": "Sree Veerendra...",
            "stars": "1 star"
        },
        {
            "comment": "Phone restarts automatically while working. Though gud job by flipkart delivered in one day. Need to replace.",
            "date": "10 Nov 2014",
            "name": "Anant Gudi",
            "stars": "4 stars"
        },
        {
            "comment": "Firstly - Flipkart-awesome customer satisfaction, as always was bang on time delivery! Secondly - Amazing Phone with the best price in market for the features it delivers. The touch sense is great, battery backup is decent (as per the usage), camera quality amazing, music sound great, memory capacity is very very nice. Very light weight easy to handle. And the best thing is, this phone does not have any irrelevant feature, which most of the time we don't use. All the feature that are inbuilt are apt and direct. Over all, a good deal, at a best price. Thank You Flipkart!!",
            "date": "10 Nov 2014",
            "name": "Amreen Fatema",
            "stars": "5 stars"
        },
        {
            "comment": "It's amazing that I have ordered this product on friday and Flipkart delivered the product on Sunday in just two days ...",
            "date": "10 Nov 2014",
            "name": "Navin Varu",
            "stars": "4 stars"
        },
        {
            "comment": "Guys, I would like to inform you that I think Moto G so called Gorilla GLASS 3 is much more delicate that it can even with stand the pressure/force for normal day to day use. I had bought Moto G(2nd Gen).Black on 19-09-2014 and on last Friday (07-11-2014) it developed some hairline crack at the bottom just above the bottom speaker. And on Saturday (08-11-2014) it developed one more crack perpendicular to this crack running from first crack to till top speaker. I have not yet contacted service center and am not sure whether this will be repaired or not free of charge within warranty time as this not physical damage as it not subjected to any forces from outside like dropping or throwing etc.., Hope this will be resolved free of charge. Guys, Be careful, Moto G2 so much delicate that it is not up to the mark of (not even close to) Gorilla GLASS 3 tag. Compared my previous Nokia Lumia 800 Gorilla glass which was so much strong that I used to give demo of Gorilla glass like the way in Youtube and it never broke until recently when it broke in some major road accident which made me to change cell phone. I thought of trying Android cell i found Moto G2 of little worth for Rs13000. When I got the Moto G2 some how i felt its not that good as to be called as Gorilla Glass. So i was using very much carefully. But to my bad luck it had developed some crack(not visible from top) and when I visited service centre they told me that it is beyond warranty(all physical damages even though it is not done by me by any means) and said it will cost me Rs7000. This is too much. I have contacted Motorola customer care. Hope it will be repaired at no extra cost to me. If not I’ll be going to consumer court. What I say is if you people assuming that it is having Gorilla Glass as feature and buying means its total waste of money. I feel Moto G2 Gorilla glass is so much brittle that you can use it for day to day not usage. It has to be just put in some museum after buying so that it should not break. I will be posting more details about repair status or Service centre response regarding the same.",
            "date": "10 Nov 2014",
            "name": "Mallikarjun Reddy",
            "stars": "3 stars"
        },
        {
            "comment": "this is really cool phone at this price.....yet thr r som cons 1) Gets heated when 3G is used 2) 3G drains battery quickly(it wont drain to zero but it will reduce faster) 3) 1GB RAM is not enough for android.....2GB will b cool",
            "date": "10 Nov 2014",
            "name": "Sandeep Balaji",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered Moto G2 on 07-Nov-14 and got the set on next day i.e 08-Nov-14 for extra Rs 90/- through ekart. Well I'm from Kolkata and tracked my order continuously through the flipkart, which is up-to-date tracker, it is impressive when it launched in Kolkata and within time they delivered me. Now its time to review the Handset. *First of all Moto G2 impressive and it is my 2nd android device going to use. I used it continuously for the day and happy with it. *Its battery is not bad. *Till now the phone is not hanged. *Night Camera not so impressive but in day its fabulous what i felt. *very fast response as i felt. *User available memory is 12.79 GB and u can use full memory to install apps. *No heating issue i felt. If you have any query then you can ask me over facebook/abhimitra6/ In the box: ---------------- handset charger headphone without In-Ear *No data cable :( Overall I'm Happy and satisfy with this phone. :) If anybody thinking to buy it, do not hesitate go and get it... They deserve 5 * so i'm giving it. some days ago I heard about insurance on mobile, so if u have any knowledge regarding this please help me to do insurance of my phone. Thanks.. :)",
            "date": "10 Nov 2014",
            "name": "Abhi Mitra",
            "stars": "5 stars"
        },
        {
            "comment": "Pros- -Excellent build quality. It fell down from a flight of stairs (5-6 ft) and nothing happened! Just a minor scratch on the body and that's it! -Nice and decent camera for its price. -Android kitkat with guaranteed updates to android lollipop. -Stereo speakers and that too on the front side with is very helpful. The speaker quality is just fine. Could be better. -Display is very nice. Although its only 720p hd but there is no sign of pixelation. -Motorola trust. Cons- - Suffers a little lag sometimes when multitasking. Result of its 1.2 gHz processor. -5\" display may seem a little large at first but you soon get used to it and then it feels like a boon.",
            "date": "09 Nov 2014",
            "name": "Shrey Jain",
            "stars": "4 stars"
        },
        {
            "comment": "first of all i want to thank flipkart team as it was delivered to me before time.it been one month got no complain. It look over price but it not...fells classy on my hand. i got the black one, earlier i used to get confused which one is the top and bottom, as the hearing and talking point are the same. the only think to disappoint was, there was nothing free product with the phone- neither the flip cover, nor the memory card and not even the screen guard. every thing u have to buy..",
            "date": "09 Nov 2014",
            "name": "Robin Mankee",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered one online, paid extra and got delivery same day. Excellent product as per many reviews with many pros and few cons 1. battery backup needs improvement 2. even with a black color phone, still shipping white headphones and white charger 3. UI does not have quick wi-fi, auto rotate on/off etc, so needed to download apps 4. in calls, everyone on the listening side complained of low voice even though i was speaking in the mic. finally did some research and increased the gain on the audio to fix this issue as well as low volume in recordings",
            "date": "09 Nov 2014",
            "name": "manish",
            "stars": "4 stars"
        },
        {
            "comment": "After a week of use Cons : Battery ... (Not good backup) On Screen Time is about 4 hours (Expected more) Charger (Cheap) Earphones (pathetic) Heating ( Camera use of 10 min.... gaming 10 to 15 min.... chrome use 10 to 15 min.... back side gets heated. so handle with care ) Pros : well we all know that so no point of mentioning it again Overall its nice experience NO PHONE IS PERFECT",
            "date": "09 Nov 2014",
            "name": "Rohit Sarkar",
            "stars": "4 stars"
        },
        {
            "comment": "This is the best phone that i've ever used till now. An best mid price range phone with almost all the features that makes the phone smartest",
            "date": "09 Nov 2014",
            "name": "Nithin Bhat",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile's perfomance is xcellent,n specially look i jus luv it ! Craziest mobile ever... but the service frm flipkart has to improve.My rating is oly for the mobile but not for fk service.",
            "date": "09 Nov 2014",
            "name": "Avinash.k",
            "stars": "5 stars"
        },
        {
            "comment": "a very nice design i like it the battery backup is also awesome the display is the key feature the sound is very awesome and crisp and clear and very sharp camera is also awesome signal and wifi catching is superb",
            "date": "09 Nov 2014",
            "name": "shubham jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "I RECEIVED A DEFECTIVE PRODUCT IN WHICH 2ND SIM SLOT DOES NOT WORKING. AFTER THAT , ON THE SAME DAY OF DELIVERY I FILE A REPLACEMENT REQUEST TO THE FILPKART WHICH THE FLIPKART DISAPPROVED THE REQUEST. NOW IT SEEMS THAT I HAVE WASTED MY MONEY RS 12999 BY BUYING ON FLIPKART. FLIPKART IS JUST FOOLING THE CUSTOMERS BY PROVIDING DEFECTIVE PRODUCTS AGAIN AND AGAIN. IT IS REQUEST FROM ME TO ALL BUYERS PLEASE DO NOT PURCHASE ANY ELECTRONIC PRODUCT FROM FLIPKART. IT IS A FROD COMPANY. I DONT WANT TO RATE THE DEALING BUT IT DOES NOT ACCEPT, SO GIVING SINGLE RATING. IT GIVES VERY BAD IMPRESSION ON CUSTUMERS.",
            "date": "09 Nov 2014",
            "name": "sameer kumar",
            "stars": "1 star"
        },
        {
            "comment": "Eye catcher,close your eyes ...go for it,best in kitkat series from google. Comfortable handling physically with gorgeous display.",
            "date": "09 Nov 2014",
            "name": "Prabu Krishnam...",
            "stars": "1 star"
        },
        {
            "comment": "Camera 4.5star (both front and back) Battery 4 star User interface 4.5 star Screen 4 star U will get more in rs:-12999",
            "date": "09 Nov 2014",
            "name": "vikram yadav",
            "stars": "5 stars"
        },
        {
            "comment": "For those who are your average users i.e. just internet based usage like facebook / whatsapp , surfing and emails.. look no further. I don't do any heavy gaming .. just your subway surfer or candy crush types. I have been using this phone for 2 weeks now and am extremely happy about it. Music sounds better if you get some proper headphones than the ones shipped with this phone. I was an iPhone user and was concerned about shelling out another high amount on a phone. Took a chance on this budget and am really impressed. One concern is the sleek body sometimes feels as though you're about to drop it....so would recommend getting a back cover with a proper grip. The display is really good. Heating issues.. yeah too much of 3G warms the phone up a bit.. but I have seen the same on almost every other model i have had a chance to lay my hands on.",
            "date": "09 Nov 2014",
            "name": "N.J.",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone 2 months back...I'm feeling happy about this phone...Camera quality is awesome and coming to the RAM it is good in this range...and also display is very nice...Finally, my opinion is to go with this phone if you want a phone at 13k range....",
            "date": "09 Nov 2014",
            "name": "Sai Krishna Re...",
            "stars": "4 stars"
        },
        {
            "comment": "When it comes to the Moto G, every review talks about how great this phone is at this PRICE POINT. To me, this is a great phone..PERIOD. I have not LOVED a phone this much since my Samsung Galaxy S2. I have used Sammies for a long time now and I was curious to see what 11k (got 2K off on this on the Big Billion offer on exchange of my wife's old Sony Ericsson Xperia mini pro) would get me. Boy was I pleasantly surprised! The Moto G (2) looks as decent and the build quality is as good as any other phone out there. Only the power and volume rocker keys feel a bit flimsy but do their job perfectly well.I love the curved rubberized back and the phone feels just right in the hand. It feels so compact in the hand for a 5 incher, especially when compared to the Samsung Grand duos. How great is that splash screen on boot up!! The screen is clear and sharp and while the colors don't POP they are natural, quite like the HTC palette. Everything on this phone just WORKS and works QUICK! There is no lag whatsoever after a month of use. I was frankly concerned about the 1 gig of RAM but there seems to be no need whatsoever for more. I don't use the phone for gaming so I cannot comment on that. I cannot understand why most reviews talk about potential battery life issues just because of the bigger screen. I am getting more than 24 hours with wifi, 3 g, location services and bluetooth on permanently. I charge the phone for a couple of hours in the evening and by next evening i still have 25-50% charge left! Stock Android Kit Kat flies through every (multi) task.There is no bloatware and the few preinstalled Motorola apps are actually useful. I do miss some of the shortcuts (swipe to call and text etc) and other extras (File browser, flip to silence) that came with Touchwiz but its certainly something I can live with given the sheer speed with which everything gets done. Connectivity is fantastic..leave everything on and it seamlessly switches between Wifi and 3G, and bluetooth goes into a low power standby state when not connected to a paired device. The camera is decent and very quick to start up. I actually like the Motorola camera app because it lets you access and change the settings very quickly and access to the gallery from within the camera app is just one swipe away. In phone editing options are good as well. The front facing stereo speakers, while short on bass, are loud and clear. The bundled headphones went straight into the bin, but lets face it, even an iPhone's stock buds are no good. One final point, and this is something that no one seems to care about these days...this, after all, is A PHONE, and when used as a phone, the call clarity is EXCELLENT, enough to put those costing 3 times as much to shame. Motorola, in Google's hands, has really done an impressive job with this one. What the future holds under Lenovo only time will tell. If they can keep this up, I, for one, will never blow my hard earned money on a \"flagship\" phone again!!",
            "date": "09 Nov 2014",
            "name": "Afzal Mohamed",
            "stars": "5 stars"
        },
        {
            "comment": "1. Bulk \"Import ALL from external .vcf File does not work. Import is possible for around 15-20 files at a time> \"ALL FILES\" puts it into a loop 2. USB Data connect does not work. Device has to be brought into \"USB Debugging Mode\", and USB Debugging enabled for the data connection to work.",
            "date": "09 Nov 2014",
            "name": "vee srinivas",
            "stars": "3 stars"
        },
        {
            "comment": "Good one with great spec. Got this for my wife and on receiving the product i thought of exchanging this with my moto x first gen",
            "date": "09 Nov 2014",
            "name": "Ajay Maliyackal",
            "stars": "5 stars"
        },
        {
            "comment": "Have used this product for more than a month.... Regarding the specifications everybody,am not going to in detail about them It's camera quality is good.It'll take decent pics. Regarding gaming,I am not a gamer at all..but tried asphalt 8 and need for speed most wanted and fifa 14,All are pretty decent,works smoothly.... And the battery,one of the biggest problem in android,But the Moto G can give up to around 15 hours on Normal usage.So it's decent battery I didn't liked the volume and power buttons though,they are perfectly fitted.But it's not a major concern. In short,it's an awesome phone for you if you don't have lot's f bucks in your pocket",
            "date": "09 Nov 2014",
            "name": "Prashanth Mushkem",
            "stars": "4 stars"
        },
        {
            "comment": "At this price range i preffered this phone to evryone after hardly using i m writing this review there is only one cons in the phone that is Battery Life but if u use it proprly then battery is also good.. and other functionality ,look and flipcart service is Great as always no lag in the phone additional features give you great experiences dont this more just buy it ;)",
            "date": "09 Nov 2014",
            "name": "Ganesh Andhale",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought this phone last month on 6th October 2014, it was running very smoothly for past month, but today morning when I woke up to find that the phone has bricked. My phone is getting rebooted at the boot screen itself, it would vibrate and then restart after only a few seconds, only to repeat the process continually. i couldn't even get it to stay off.",
            "date": "09 Nov 2014",
            "name": "Nilesh Chakrab...",
            "stars": "1 star"
        },
        {
            "comment": "Product is good, go for it.................................................................................................................................................................................................................",
            "date": "09 Nov 2014",
            "name": "NZM",
            "stars": "5 stars"
        },
        {
            "comment": "I got my phone today evening..Just amazed what a phone it is..very much smooth,,without any lag any app can run also the games....too much fast...but battery should be more powerfull.....although overall this is really smart.... now the time to see what will come next..I hope the phone will go smoothly without any problem.",
            "date": "09 Nov 2014",
            "name": "Soumyajit Koley",
            "stars": "4 stars"
        },
        {
            "comment": "Its Unbeatable......But only thing is BATTERY :-( :-(....It get drain when we use internet and moreover we must put charge twice a day....Camera quality is Excellent....!!!!",
            "date": "09 Nov 2014",
            "name": "Guruprasadh G",
            "stars": "4 stars"
        },
        {
            "comment": "Thank you flipkart for delivering within 12 hours.. Phone is light weight, intelligent OS, and smooth touch.. Crashed in candy crush but thats ok as of now.. thumbs up",
            "date": "09 Nov 2014",
            "name": "Kunal Natta",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchased one moto g 2nd gen on 23 rd october 2014 from flipkart and sorry to inform that the screen of the mobile broke on just a simple fall of mobile from my hand while i was sitting in the office.since the product is marketed by flipkart the company has no service centre of its own and authorised centres are asking for time and charges which are really mind boggling.they are saying minimum 25 days to 30 days will be required and charge of Rs 6727/- for replacement.more then half the cost of the phone.i had used many other phone and using lumia 1320 right now.they are not so vulnerable .if this is the strengh of the body and quality of service i doubt people will buy moto for second time.anyway i have no complain about performance of the mobile.it is very good.",
            "date": "08 Nov 2014",
            "name": "Brij Mundhra",
            "stars": "3 stars"
        },
        {
            "comment": "after using two weeks Over all performance is good Camera: ok Display: Nice, crisp and vivid, but only 720p, gorilla glass good Performance:ok Battery:poor Heating Problem : slightly while using internet ront speakers are loud n clear no network or call drops",
            "date": "08 Nov 2014",
            "name": "balakumar Nata...",
            "stars": "4 stars"
        },
        {
            "comment": "superb phone. value for money (y) (y). audio experience is great .. the screen is also good. camera could have been better.. all in all .. its a complete package under this price segment. go for it .",
            "date": "08 Nov 2014",
            "name": "s g",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I got the phone from flipkart. Before time delivery. The phone is good not great. Screen looks nice but the battery takes forever to charge. Even with moderate 3G usage the battery barely lasts a day. Can hardly hear the radio (tried various headphones). Camera is good even in low light.",
            "date": "08 Nov 2014",
            "name": "Shaunak Samvatsar",
            "stars": "3 stars"
        },
        {
            "comment": "great this is gifted to my father in this dipawali. thank you for flipkart .....................................................................................................................................................................................................................................................................................",
            "date": "08 Nov 2014",
            "name": "CA Shivkant Ti...",
            "stars": "5 stars"
        },
        {
            "comment": "I am using moto G2 since last one month.... First of all thnx flipkart for fast delivery... I got my smartphone within 3 day... Now come to mobile, camera quality excellent..I loved to use this smartphone.. Just one thing that I want to mention is battery life is not that much good as I expected... Otherwise excellent phone..",
            "date": "08 Nov 2014",
            "name": "Prajapati Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "got d phone b4 d xpected date just with in 5 days after placing d order dis review is after using a month performance:great n after using for a long tym it just waits for a sec n pick ups battery:it good battery life for 5 to 6 hours on browsing, net connectivity:good ,not so bad camera:awsome,i had a greate experinence ,we can capture around 100 pics in min n finnally its awsome bt dont install any new locks it gives aa head ache to u",
            "date": "08 Nov 2014",
            "name": "chiru rockzzzzzzz",
            "stars": "4 stars"
        },
        {
            "comment": "Got it after some delay but product was in good shape and overall satisfactory. Moto G is upto the expectations and is certainly much better than other phone in the same prices range!!",
            "date": "08 Nov 2014",
            "name": "Shishupal Sing...",
            "stars": "4 stars"
        },
        {
            "comment": "After 1 month usage.. now i facing signal problem.. call automatically cuts while speaking...1st i taught tat as sim problem.. but now tried with 2-3 operators... guys plz aware of tat.. for me 1 and half month over ..so flipkart wont care about tis here after...",
            "date": "08 Nov 2014",
            "name": "Gokul",
            "stars": "1 star"
        },
        {
            "comment": "Great phone with buttery smooth UI. Features are great in this price range though some rivals throwing a lot more in this range but it is from Moto. Solid built body and confirm OS update in future direct from Google. What else one need?",
            "date": "08 Nov 2014",
            "name": "Ajit Behera",
            "stars": "5 stars"
        },
        {
            "comment": "Just Bought a MOTO G2 via flipkart on 28th Oct.. Looks Pretty cool ..But after using Now m Facing issues Like : Network issues : intermittently getting down (Network unavailable ) , Its charger Getting heated Up after putting in charging port . No separate data cable In package for connectivity to pc . The main thing that's Irritating me is Its network issue . that i have to search it manually after network went off automatically . escalated this issue to Flipkart also .",
            "date": "08 Nov 2014",
            "name": "Dheeraj verma",
            "stars": "3 stars"
        },
        {
            "comment": "This won't be a phone that you fall hard and fast for. It won't sweep you off your feet, nor will it dazzle you with a slew of whizbang features. That's just fine, though. Because none of that changes the fact that the Moto G is still the best budget smartphone you can buy today. and FLIPKART delivers it in a DAY ! excellent service from flipkart and packaging was good.. final words MOTO & FLIPKART ROCKS",
            "date": "08 Nov 2014",
            "name": "Ravi kiran pula",
            "stars": "5 stars"
        },
        {
            "comment": "I really like this product.awesome display quality, sound, design build, its really good mid range android smart phone",
            "date": "08 Nov 2014",
            "name": "average mobile",
            "stars": "5 stars"
        },
        {
            "comment": "I received the product on 27th October. Design & look is all nice. But while taking on the phone the voice cracks so its difficult to hear what the other person is saying. have complained to Flipkart but still no response from them",
            "date": "08 Nov 2014",
            "name": "Rohit Gupta",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g2 on 9th sep after using it for 10days, I faced a problem with my mobile charger, since chargers are out of stock. I asked flipkart to replace, they replaced in 2days. I got my 2nd one after 15days, I got serious bug whenever I take a snap closer objects flash light gets ON it wont go OFF even after taking snap. even if I switch OFF my mobile flash light will be ON. So I requested filpkart to refund.I got my money back.",
            "date": "08 Nov 2014",
            "name": "Avinash",
            "stars": "3 stars"
        },
        {
            "comment": "i ordered this phone during diwali..the phone is working good as the camera its good..to increase the battery life drain the battery on purchase then charge fully and again drain it repeat it for 3 days...battery stand by improves..worthable for this price",
            "date": "08 Nov 2014",
            "name": "SUBBIAH SR",
            "stars": "5 stars"
        },
        {
            "comment": "best mob. phone good battery, good camera, good touch screen , great mobile..........full paisa wasool mobile....",
            "date": "08 Nov 2014",
            "name": "Manish Dewan",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this phone as part of Big Billion Day Offer. The phone was delivered by 10th October. The phone's display, touch and everything was perfect. Only issue is the first sim card slot which is shown as disabled. Have tried using sim cards of different carriers to check if problem was with the sim card. The sim cards worked in second slot. Since its a hardware issue, I requested for a replacement. I got a call from Flipkart service center. The person gave some troubleshooting steps and said the issue would be resolved. I thought since I haven't updated the result of troubleshooting, the request's status would be 'In Progress' but to my surprise the status was 'Replacement Rejected' How can the request be rejected when my issue was not resolved? Thoroughly disappointed by the way Flipkart's Customer Care team handles replacement requests. Have raised another request in the system. My 30 day replacement period would end on 10th and these customer care people have delayed by request till 9th. My request should not be rejected again based on some senseless ground.",
            "date": "08 Nov 2014",
            "name": "Richa Bh",
            "stars": "1 star"
        },
        {
            "comment": "very thing is good compare to moto g 1 gen and also budgeted phone, many drawbacks a moto g 1 gen switched off and sim problem.",
            "date": "08 Nov 2014",
            "name": "Shekar T.S",
            "stars": "5 stars"
        },
        {
            "comment": "Good:- Picture quality and processor is good. Bad:- Difficult interface. Worssstttt battery backup. taking 3 hours even more than that to charge & less than that hours to empty it. No data cable provided with cell. Can't charge with USB cable. if you are frequent traveler can't carry charger don't buy this product. Only for those stick to one place can put it on charging all the time.",
            "date": "08 Nov 2014",
            "name": "rahul bansal",
            "stars": "2 stars"
        },
        {
            "comment": "Simple phone was delivered in 20 Days, Once Canceled by Seller then second time it is delivered. Airtel offer which available at the time of placing order is noot activated till now. when i asked customer care, thaey replied it's not showing in our system. Hell lot of follow up mails and output is late delivery with poor logistics and poor IT system.",
            "date": "08 Nov 2014",
            "name": "sankalp arora",
            "stars": "1 star"
        },
        {
            "comment": "My first order from flipkart , ordered it from the flipkart mobile app . recieved the product in just 3 days without any hassles or issues. coming to the phone..it looks amazing and feels great in the hand for a 5 inch phone , its not heavy , the back is not slippery and one handed use is very much possible. the screen display is very impressive and gives you a feel of a premium phone rather than a entry level phone, the touch is pretty neat , the camera is a 8mp camera and the picture quality is pretty usable , it will not disappoint you. the front facing cam delivers only in good lighting conditions. the stereo speakers are placed nicely in the front and perform very well. the phone supports dual sim. Now coming to one of the main attractions of this phone STOCK ANDROID !!! Easy to use , lag free, no gimmicks , responsive , friendly UI , and priority for future updates is what makes the using experience amazing. The 2070 mAh battery performs very well and gives you a days use with moderate to heavy use. All in all its a pound for pound phone and considering the price range and competitors its the best buy available with a good brand and good build quality and longer lasting phone.",
            "date": "08 Nov 2014",
            "name": "kirk antao",
            "stars": "4 stars"
        },
        {
            "comment": "Sound Quality: Very good in general but not good headset provide by motoG2 (improvement is required) Video Quality: Best Call Clarity: Very good Battery Life: Very good Camera: Just Awesome Looks: Obviously Sexy Important, In low budget best features available in Moto G2. Please buy don't think more.",
            "date": "08 Nov 2014",
            "name": "Jignesh Thaker",
            "stars": "5 stars"
        },
        {
            "comment": "The phone looks quite good but the problem that existed in 1st Gen Moto G still seem to exist. eg 1) Phone seem to have problem starting up or charging after getting fully drained. 2)The phone gets very heated up after clicking 10 or more photographs with/without flash. 3)the charger seems to be of very inferior quality . You need to push it from different angles to get it working Its strange that these problem were already discovered in gen 1 and still seem to exist. Now the easiest thing is the get a return or replacement. But it would help only if my handset has those problem . Can anyone else point out if they face similar problems.",
            "date": "08 Nov 2014",
            "name": "Sam",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2nd Gen meet my requirement and it is in my budget. but there is no short cut bar on screen. Every time I need to go in setting to change. Please let me know how to copy stuff from my Pc to Phone, I attached data cable and tried to copy songs to phone but it cant.",
            "date": "08 Nov 2014",
            "name": "Kailas Pawar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone was good looking good processor camera quality excellent phone design is superb. I liked this phone very good product.",
            "date": "08 Nov 2014",
            "name": "Mahi",
            "stars": "5 stars"
        },
        {
            "comment": "I ORDERED THE PRODUCT WITH EXCHANGE WITH SAMSUNG INVOICE RAISED WITH 50 RS EXTRA FOR PICKUP PRODUCT NOT DISPATCHED AND MARKED AS REFUSED.TILL DATE STOPPED ALL FURTHER PURCHAES FROM FLIP KART. ISSUE PENDING NOT SOLVED TILL DATE. GREVIANCE OFFICER NOT LOOKING IN THE MATTER",
            "date": "08 Nov 2014",
            "name": "MANOJ DHAWAN",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased this mobile last month 13th but one week later i faced speaker problem continuously and the same was requested replacement but there is no reply from flipkart",
            "date": "08 Nov 2014",
            "name": "Kiran Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "battery not charging ... looks r god ... display is also good.. but battery charger got heated up 1st time and den 2nd time mobile itself is not charging",
            "date": "08 Nov 2014",
            "name": "vaishnav nair",
            "stars": "1 star"
        },
        {
            "comment": "sleek slick and slithery beast of a phone :) awesome features at a very reasonable price from a reputed brand",
            "date": "08 Nov 2014",
            "name": "Nagaraj Ravinu...",
            "stars": "4 stars"
        },
        {
            "comment": "You can compare any mobile with Moto G.. nothing can replace this model :) The best specifications, at the best price :) Worthy buy...also, Android version will be automatically updated once Google launches... Best In Class - Moto G :)",
            "date": "08 Nov 2014",
            "name": "Babu Vignesh",
            "stars": "5 stars"
        },
        {
            "comment": "Good Looking Phone @ Great Price. I Purchased 2 Moto G (2 Gen) for me and My Wife Both of us love the phone.. .. Excellent Phone !!!",
            "date": "08 Nov 2014",
            "name": "NAVANEETHA BHA...",
            "stars": "4 stars"
        },
        {
            "comment": "very gud product. value for money. But the earphones cud have been of much superior quality. Also the voice in speakers (without turning on) is very loud is clearly audible to others while speaking. else a very gud phone",
            "date": "07 Nov 2014",
            "name": "honey",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone, I bought 10 days back the phone is working very nicely.Only thing is the battery runs for a day.",
            "date": "07 Nov 2014",
            "name": "Tarun Parekh",
            "stars": "5 stars"
        },
        {
            "comment": "one of the best product in market.. and one of the best delivery service by flipkart.... the product was packet nicely .. and the important thing is i got the product within a week.. MOTO G excellent performance.... trustfull product to buy...",
            "date": "07 Nov 2014",
            "name": "prabhakaran si...",
            "stars": "5 stars"
        },
        {
            "comment": "I love the look and feel of the mobile. Really a nice product & the best thing is that it got delivered to me in just a day. Nice service. Thanks Flipkart Team.",
            "date": "07 Nov 2014",
            "name": "Vamsi Krishna...",
            "stars": "5 stars"
        },
        {
            "comment": "* Budget friendly phone. * Pure android experience. * Love the auto focus & slow motion. * Awesome configuration. In a nutshell its a great buddy.",
            "date": "07 Nov 2014",
            "name": "Vijay Raj",
            "stars": "5 stars"
        },
        {
            "comment": "Hardware is enough good in this price range, used almost for two months main probs are realeted ram and software malfunctioning, it removes sd card automatically and unexpectedly, similarly it disables SIM. Sometime few android process stops unexpectedly................................needed that Motorola should give good attention to OS design. Rest every thing works fine. Based on my experience with handset in approx. Two months and finally flipkart refunded me. Wait for android L update, hope Motorola will fix these problems or go for HTC desire 816.",
            "date": "07 Nov 2014",
            "name": "Sp Chaudhary",
            "stars": "3 stars"
        },
        {
            "comment": "its really bad to see that this product also have many problems like contacts name not showing while calling.Google chrome automatically opens while closing other apps.and the Big 1...wifi hotspot 3G internet speed around 50-60 kbps.",
            "date": "07 Nov 2014",
            "name": "vishal Kumar",
            "stars": "1 star"
        },
        {
            "comment": "I had ordered Moto G2 first and didnt receive it for 10 days. Then after contacting flipkart, realised that I had chosen credit card but assumed Cod. I re-ordered the product and got it immediately. The phone is very good for 13k. Good screen, very responsive. Loads of apps from Play store, feels good to look and hold. Havent used the camera, so no comments about it.",
            "date": "07 Nov 2014",
            "name": "Sudhindra NR",
            "stars": "5 stars"
        },
        {
            "comment": "Received the phone in 3 days and am very impressed with the phone. Best phone in the budget. I had read some problems with the phone regarding the sim car but it would perfect for me. Brilliant flipkart as always.",
            "date": "07 Nov 2014",
            "name": "Dheeraj Amarnani",
            "stars": "5 stars"
        },
        {
            "comment": "Got the product within stipulated time. There were scratches on the screen. I have a query that- How the product will be covered under warranty?",
            "date": "07 Nov 2014",
            "name": "MOHIT RASTOGI",
            "stars": "3 stars"
        },
        {
            "comment": "overall it is best phone in the mid range. but battery back up is less. Not even half day back up. video clarity is good. camera clarity is good. No USB cable. And the ear phone's music output is good but it doesnt fit in ear. even sony is providing the same ear phones for buying phone for 27k. compared to other phones this is better.",
            "date": "07 Nov 2014",
            "name": "wolverine",
            "stars": "4 stars"
        },
        {
            "comment": "Seven Star.............................................................................................................",
            "date": "07 Nov 2014",
            "name": "Arjun Mohan",
            "stars": "5 stars"
        },
        {
            "comment": "nice & excellent phone in all means but battery goes down quickly when we working on apps,buying smart phones is to use the apps, manufacturers must should have this in their mind, other than this, its a excellent phone!!!!!!!!!!",
            "date": "07 Nov 2014",
            "name": "vijaykarthikey...",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is very good. But I am getting problem with the touch it is not responding fast ( few times ).",
            "date": "07 Nov 2014",
            "name": "Naresh Aachanta",
            "stars": "4 stars"
        },
        {
            "comment": "Wonderful phone for the price point. Super fast, Nice photos, Sufficient storage. One slot could have been regular SIM would have a great",
            "date": "07 Nov 2014",
            "name": "Balaji Rajan",
            "stars": "5 stars"
        },
        {
            "comment": "It's before I used several android phones but the smoothness of this phone is really excellent . I'll refer to all of you guys within this price range you can't find the same quality product.",
            "date": "07 Nov 2014",
            "name": "Rakesh Nayak",
            "stars": "5 stars"
        },
        {
            "comment": "The service is just awful. My phone developed some problems and had to sent to the service center for repairs. Even after 15 days, the phone is not repaired. The local service center says the parts are not available and Motorola has not dispatched them. The call center says the parts have been dispatched 3 days ago. I tried chatting with Motorola, e-mailing them, calling them up but to no avail. Motorola has not provided a standby phone also despite repeated requests to do so. No matter how good the phone - it is a absolute NO NO for the service provided",
            "date": "07 Nov 2014",
            "name": "Rajeev Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Best overall: Motorola Moto G (Gen 2) KEY SPECS Design 8 Display 8 Software 8 Performance 8 Battery life 8 Camera 8.5 Value for money Good Good performance Good camera Great battery life Excellent value for money Bad Average looks and material quality Best value for money: Asus ZenFone 5 (8GB) Asus ZenFone 5 REVIEWS KEY SPECS Design 8 Display 7 Software 6.5 Performance 8 Battery life 8.5 Camera 7.5 verdict Value for money Good Great Pricing Solid build quality Fantastic performance and battery life Bad Still running Android 4.3 Scratch-prone camera lens Occasional heat problem Best camera: Panasonic P81 KEY SPECS NEWS Design 6.5 Display 7 Software 7 Performance 8 Battery life 8 Camera 8.5 Value for money Good Camera captures great low-light pictures Good performance Value for money Bad Crude Android skin Unattractive finish Best battery life: Micromax Canvas Nitro Micromax Canvas Nitro KEY SPECS Design 7 Display 7.5 Software 6 Performance 7.5 Battery life 8.5 Camera 5 Value for money Good Insane battery life Good value for money Decent performance Bad Bad camera performance Unwanted bloatware",
            "date": "07 Nov 2014",
            "name": "Gurudev Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Nine mobile but battery backup is very low maximum 5 hours I am unhappy for battery. other side is OK.",
            "date": "07 Nov 2014",
            "name": "JARGI ULLAH",
            "stars": "3 stars"
        },
        {
            "comment": "all options is good but only thing is battery backup is pooooor,we want upgrade version of lolipop then every thing is fine.",
            "date": "07 Nov 2014",
            "name": "jayakrishna",
            "stars": "4 stars"
        },
        {
            "comment": "Hello guys I bought this phone on 26 Nov 14 n after using it for 10 days I can surely says that this is the best phone in its price range. My phone never lags till now and response was very good from d phone. Looks was very pleasant n makes ur mark in ur frnd circle. Very slim n easy to hold in one hand n grip is also nice Battery gives a decent output of 1 day wid moderate to little bit heavy use. So I'll definitely suggest u frnds to do consider about buying it. Although there r many other phones in dis price range BT this handset provides a better performance n has a better luk den rest all.",
            "date": "07 Nov 2014",
            "name": "RANDEEP SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "hone Phone and phone charge heat problem.... If capture pics continuously then phone run very slow and show like hang ...... Poor battery performance ......... If u play any normal game phone too heat ..... I'm very disappointed with moto g 2nd Gen......",
            "date": "07 Nov 2014",
            "name": "Hariom",
            "stars": "1 star"
        },
        {
            "comment": "Mobile is good but there is some lag between open and close of some applications. Delay in charging. But Best Android for Best Price.",
            "date": "07 Nov 2014",
            "name": "Dinesh Raja",
            "stars": "4 stars"
        },
        {
            "comment": "Got this delivered in the stipulated week's time frame. Good packing. Pros: - All the positives as per original Android interface. - Good form factor - Adequate weight as per the size - Very responsive touch-screen - Lovely cameras (primary and secondary) and LED flash - Didn't feel any hitch using 1GB RAM for normal work (not included any games) - 16GB internal memory - Inclusion of expandable micro SD slot. - Lovely display resolution Cons: - Volume level is not adequate (even on headphones too) for listening to music or watching movies (unless you are quite close to it or listening to it in the dead of a silent night). - Sometimes misses getting read by Laptop when connected by USB cord, works ok when restarted - Since Google Play Store has a ton of apps, once you download the essentials, the battery life is too short at 2070 mAh, needs charging atleast once each day. - Should have included a micro USB connector in the box.",
            "date": "07 Nov 2014",
            "name": "Vincent Albert",
            "stars": "4 stars"
        },
        {
            "comment": "good product from MOTOROLA for moto g2 and the ram should have been 2 gb and 4g lte is missing and battery should have been 3500 mah for grater back up",
            "date": "07 Nov 2014",
            "name": "manoj manu",
            "stars": "4 stars"
        },
        {
            "comment": "i have purchased moto g 2nd gen and i am very satisfied with this. good battery backup, fine screen touch, no hanging problem.",
            "date": "07 Nov 2014",
            "name": "pawan singh",
            "stars": "3 stars"
        },
        {
            "comment": "Brought my Moto G 2nd Gen last month (6th Oct). Its been not even more than 5 times i used my earphone. Now after ten days gap i am using it again and found the left ear piece is not working at all. There was no any damage happened to that. Wrote a mail to Flipkart, but no reply till now. Is this the way the earphone functionality designed to work? Is it limited for only one month usuage?",
            "date": "07 Nov 2014",
            "name": "Afzal Ahmed",
            "stars": "1 star"
        },
        {
            "comment": "I got my MOTO G2 -with Kitkat 4.4.4 today. The device is good to hold and the looks are cool. Best budgeted mobile - totally worth it I suggust anyone who wants to buy this phone, not worry about negative reviews. Just buy it and you wont regret. Only one issue though - by default the notification led not lit while charging . You've to press power button every time to check the charging status - whether the phone charging or not Other than that everything is nice.",
            "date": "07 Nov 2014",
            "name": "Gowtham Babu",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is good except the batter backup is not good. No shortcut to on/ off internet data. Some times app get stuck",
            "date": "07 Nov 2014",
            "name": "Amol Pawar",
            "stars": "4 stars"
        },
        {
            "comment": "hi guys...i bought a google phone where the inbuild google apps itself is not working.asked for a replacement request.",
            "date": "07 Nov 2014",
            "name": "arun gandhi",
            "stars": "1 star"
        },
        {
            "comment": "I have received the product in two days. Flipkart delivery is good. Product packaging was good, Moto G 2nd Gen phone is just awesome... I love it",
            "date": "07 Nov 2014",
            "name": "Ashwath K Dass",
            "stars": "4 stars"
        },
        {
            "comment": "I received my MOTO G (2nd Gen) yesterday (7th Nov) and I am facing a quality issue as my new handset outgoing voice is not working. Will update on flipkart return policy. I got replacement on 10th Nov. The product is excellent. Thanks for quick replacement.",
            "date": "07 Nov 2014",
            "name": "Sharafat Khan",
            "stars": "4 stars"
        },
        {
            "comment": "I am looking for an option for less than a star. After the purchase and infinite request the product was not delivered and I got to know how fake and fraud flipkart services are , I have cancelled the order 20 days back and not received my money till date. WILL NEVER EVER BUY ANYTHING FROM THIS PATHETIC WEB FLIPKART.",
            "date": "07 Nov 2014",
            "name": "abhijeet jain",
            "stars": "1 star"
        },
        {
            "comment": "this is a good product. only problem is battery. It does not even last for 20 hrs. with net on. well smart ph means u will have net on. what is the point of having 5 inch screen if u have to constantly think of charging it.... Motorola must do something about it.",
            "date": "07 Nov 2014",
            "name": "SUMANGAL DEBNATH",
            "stars": "4 stars"
        },
        {
            "comment": "I Am using this product from one month and fully satisfied . 1) Can play almost any game 2) Call quality is better than best 3) loud speaker is good but not the best 4)Battery back up good for average user",
            "date": "07 Nov 2014",
            "name": "Mithun",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome mobile but battery is not good. Can I stop automatic application to run and save data. How? Its battery has not good backup but net browsing is good. It good camera and good video quality.",
            "date": "07 Nov 2014",
            "name": "manoj kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Feels like a premium phone with excellent display and a very smooth processor. The only trouble is the battery problem, drains very fast with only 6-8 hrs of heavy usage.",
            "date": "07 Nov 2014",
            "name": "Shubham Satyarth",
            "stars": "4 stars"
        },
        {
            "comment": "I found this product as i wish,,,,,new camera i love it n for more stuff can add more space,,,,,,no hanging till......new android 5(lolipop) lokin awesome,,,,,,,,,no doubt it was an paisa wasul deal,,,,",
            "date": "07 Nov 2014",
            "name": "Arjun lal kumawat",
            "stars": "5 stars"
        },
        {
            "comment": "Just got the device on 6th Nov'14. Really like the design. Its sleek and resolution is very good. However I am having issues with the internet connectivity. I was using a Lumia before and the internet speed was really good on that device but now on Moto G the internet speed is very slow and shows an error of \"connection timed out\" frequently. This happens when we are on the play store. Another thing which I didnt like is that Moto G hasn't come with a USB cable. The phone isnt getting overheated and not is the charger for now. But the phone takes quite a bit of time to charge fully.",
            "date": "07 Nov 2014",
            "name": "Saurabh",
            "stars": "4 stars"
        },
        {
            "comment": "Battery drain very fast. Eery bad experience with my new phone and flipkart Electric shock from the speaker metal while charging with my laptop usb, Battery Draining so fast, phone getting heated up quickly",
            "date": "07 Nov 2014",
            "name": "Hanumant Ghuge",
            "stars": "1 star"
        },
        {
            "comment": "no words to say just awesome i have been using since a week fantastic display and battery with stand is good and better than other phones",
            "date": "07 Nov 2014",
            "name": "Vasanthkumar.ch",
            "stars": "5 stars"
        },
        {
            "comment": "nothing to say about the product, it's simply awesome.Thank u flipkart. i bought this phone on big billion day by exchanging my old phone sony xperia go.i got some problems with the micro phone, speaker and camera.i spoke with the customer care guy about the issue and really they responded very well.I got replacement and it is working absolutely fine.Once again thank u flipkart for ur kind support.",
            "date": "07 Nov 2014",
            "name": "muddada kishore",
            "stars": "5 stars"
        },
        {
            "comment": "your service is one of the worst its seems. already i told the problem then your not listening. and now there is no option for return. Please stop your online shopping. dont cheat like this . this not good for your service . further i will contact for legal cell",
            "date": "07 Nov 2014",
            "name": "shailendra kumar",
            "stars": "1 star"
        },
        {
            "comment": "Just received Moto g2 from flipkart. Phone is nice for 13k. But video playback is not upto the mark. I have tried VLC /default media player/Mx Player. Video playback interrupts sometimes.",
            "date": "07 Nov 2014",
            "name": "Jitendra Patil",
            "stars": "5 stars"
        },
        {
            "comment": "> Well to start with, the design, I would say, is the best.. The curved body fits perfectly in the hand... The ports are placed in perfect positions and it does really give a great look when held.. > Next, the camera, I still wonder if the front one is really 2mpx .. It feels like a 5mpx cam .. The shots in the front and back are solid, but it clearly misses some details in natural daylight .. That is one big con with the phone, but considering the price, I would say it is the best... > The touchscreen is buttery smooth and the response is great.. I haven't seen any phone respond so quick.. > Speakers : Dual ?? Really ?? Not that great.. Yes it is loud but not really clear.. > Battery standby is not up to the mark.. But if you are a mid range user, you could expect it to stand for a full day.. I tried using it continuously in 3G and i had to recharge after 4 hours.. So battery, honestly not good, not even close to good.. Could have been better even in this price range.. Maybe with the lollypop update, we could expect more > Stock android experience is great.. Still waiting for Lollypop update.. > The sensors, yes they work good.. I installed CPU-Z and found about 10 sensors and I don't know most of its working.. > RAM could have been better.. But if you are not a heavy user, you need not worry, Just go for it.. > The supplied headset could have been better and data cable is missing.. Price has no effect on the accessories supplied.. So it could have been better.. >> On the whole, this phone stands up to the expectations, but of course, could have been better... I would recommend this phone for mid range users.. If you are a heavy user, strictly don't buy this.. Considering the price and specs, I would rate it 4.75 (5 in stars) If not for the battery, I would have rated it 5..",
            "date": "07 Nov 2014",
            "name": "Subramanian Ar",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered the MotoG 2nd Gen, black on 5th Nov, 2014 with extra INR 90 charge for one day delivery, I got the delivery by 6th Nov, 2014, which is quite satisfying. After charging the mobile for sometime I tried to switch it on, it took a long time, I thought this is the very first time that's why it's taking some time. Then I tried to switch it off, but every time I pressed the power button it was taking screenshot. Some times the power button was working as volume key. For long pressing of the power button the device was getting restarted in lieu of getting switched off. How can flipkart deliver a product which costs 14000 bucks without even minimal checking of basic functionality. I mean the power button is screwed up, the first and foremost function! I am going to return this phone.",
            "date": "07 Nov 2014",
            "name": "Aindrila Choudhuri",
            "stars": "1 star"
        },
        {
            "comment": "Phone is Very Good overall.Good Bright Screen,Good Battery and other good function are also in it.and flipkart service is very bad i got phone in 12 days after ordering it so its needs to be improve .overall good exepierience .",
            "date": "07 Nov 2014",
            "name": "AbdeAli Tunkiwala",
            "stars": "4 stars"
        },
        {
            "comment": "Its good product with low price and more features.Please update Volume and Power on Button and also heating is very cool",
            "date": "07 Nov 2014",
            "name": "NAIDU KP",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is the best smartphone in its price range. The device do not lag during Games or working on assignments. A pure android experience. The Motorola Assist is also a great app.I have ordered this phone on the very first day of its launch and would recommend to those who seek to buy a smartphone within a price range of 10-15k. Good camera. You get updates of apps in time Good delivery and feedback service from flipkart.!!",
            "date": "07 Nov 2014",
            "name": "Navinchandra R...",
            "stars": "3 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "07 Nov 2014",
            "name": "Rakesh Rajan",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart service is ok, not as fast as it was before, phone reached me in 5 days after order. After use of 3 days I found a white/black screen comes for 1 second when I see photos from camera gallery or when I dial a number. I want to know, is this with my phone only or others are also facing same issue. Flipkart team please check on this.",
            "date": "07 Nov 2014",
            "name": "user",
            "stars": "3 stars"
        },
        {
            "comment": "Hello. I did a month research on this phone since its not available in market..so was bit reluctant...but finally I GOT IT About Flipkart:- I ordered it on 3rd Nov late night and got it on 6th Nov.Afternoon..so pretty good service on their part...package in best possible condition. About Phone:- U r surely gonna fell in love this phone... 1. Screen is 5 inch but it feels very comfortable in hand....Screen is Awesum...and 2. few people out here had complained about phone getting heated...well on the very first day im not feeling the same... 3.Headphones..bit problamatic..but i was pretty aware of the headphones being delivered.. 4. One thing i noticed...my phone battery dropped to 14% and suddenly my phone showed some computer rebooting type mesages...I locked it ...and then it worked absolutely normal. Hope....It works fine for the times to come... 5. Some people have complained about sound quality and camera...sound is awesum and camera is gud not xcellant and front is ok ok,,,,, 6. Overall 9.8/10 Rating. SOme body plx tell me how to change lock screen wallpaper..... Well I bought this phone for dad...now I m planning to buy one for me as well...but let me test it for a month",
            "date": "06 Nov 2014",
            "name": "Tanpreet Mehnd...",
            "stars": "5 stars"
        },
        {
            "comment": "really awesome mobile...i felt it after using 10 days.its a big but good mobile with smooth functioning..just go fr it ..",
            "date": "06 Nov 2014",
            "name": "durga",
            "stars": "5 stars"
        },
        {
            "comment": "Butter smooth Good cam Decent battery and display Loud speakers and good built quality Con.. Overpriced assessories",
            "date": "06 Nov 2014",
            "name": "Sam Nelson",
            "stars": "5 stars"
        },
        {
            "comment": "Today I received it in Afternoon ordered a day before...Superb delivery by FK Hats Off....Ordered day before took standard delivery and due date by Saturday but received beforehand....Unboxing it like superb experience Product is New although I had doubt on WS Retail Products since I read many negative reviews on it....But Ultimately this product is good in this price range I was worried how it would be but it completely satisfy my mobile image and i used for 4-5 hours of now battery still running waiting to drain so that can charge it till now application working fine no lagging issue so far experience is good overall I say if they lower price till 11-12k it would be must buy!",
            "date": "06 Nov 2014",
            "name": "Prasad Bhatkar",
            "stars": "5 stars"
        },
        {
            "comment": "This is my First android phone, was a blackberry fanatic earlier. Decided to purchase Moto G instead of Blackberry Z3. Pros: - Good Battery Life( with minimal usage of wifi and internet) - Easy to hold - Call quality is better compared to other phones Cons: - Would not be suitable for users who would like to install dozens of Apps which runs in back ground. Worth the Money. Headphones could be better.",
            "date": "06 Nov 2014",
            "name": "Dinesh Babu",
            "stars": "4 stars"
        },
        {
            "comment": "It is a really good phone in this price range, I previously had a Lava Iris 504Q, and although the prices are similar, you can really feel the step up when you use the Moto G. The display, sound quality, camera everything is really good. If I had to write about some negative, then it would be the battery life- but I find that it's the same case in all smartphones! Definitely a phone I would recommend.",
            "date": "06 Nov 2014",
            "name": "Riyan Vatcha",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased the phone two weeks back, overall the phone is fantastic at this price range. The 2 things i hated most for this device- -Poor camera quality- Images are so noisy that even Samsung's 5 mp camera is better. -Phone heats up very frequently with even normal use. Even the burning smell comes out of the 3.5 mm audio jack. I have placed a replacement, let's see if i get a better device or same.",
            "date": "06 Nov 2014",
            "name": "Mohd Mubin",
            "stars": "3 stars"
        },
        {
            "comment": "I am writing this review after using the phone for more than a week. Earlier I was using Canvas4 mobile and I decided to buy this (with little bit of hesitation due to negative reviews in web sites). But I feel I am lucky to choose MotoG2. The phone has an awesome cool display resolution and clarity with a 5\" screen. Touch response is smooth and faaast,, It Can run full HD videos, arcade games or multitasking with out any lag. GPS is extremely responsive with in milliseconds when turned on. Loudspeaker is front facing and can hear the phone ringing even while driving, Screen is quite clear and visible in direct sunlight with basic display brightness settings itself. I am not using any screen guard till now and I can hardly find any scratches in the screen after a weeks use(Thanks for Gorilla corning 3).Camera quality is decent under sufficient light exposure. Lollipop OS upgrade will roll on soon.. What more do you expect from a smart phone at this price range..? Just go for it- Now coming to the Cons section.(It doesn't bother me though) Battery back up is not up to the mark (I need to charge twice a day) Not rigid like Canvas 4. I feel if it is dropped down surely the display will get cracked.",
            "date": "06 Nov 2014",
            "name": "Karthikeyan C",
            "stars": "5 stars"
        },
        {
            "comment": "No doubt the product is better for a user but the quality issues and defects that users are facing are bad. My friends and me purchased the phone a month ago and we are happy with the performance of device only battery issue that is common for such phones but we are having different kinds of problems in phones. Even after replacement problems are not solved because new set even having different problems. Issues are : 1. 2nd person sound doesn't come during calls 2. volume key icon comes repeatedly 3. notification panel doesn't works many times 4. Touch response doesn't work and many more. So overall average marks for the phone not up to the mark.",
            "date": "06 Nov 2014",
            "name": "saurabh meena",
            "stars": "2 stars"
        },
        {
            "comment": "It is good phone if you are looking for budget phone with good spec. Good Display Good camera And memory expend option also available",
            "date": "06 Nov 2014",
            "name": "Pushpendr Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "1. Phone is heated up-to 43 degree Celsius while playing games. 2. Camera crashes after taking 8-10 pics. Each time need to restart the phone to start the camera again. 3. Screen rotation is not working most of times. 4. Flash is also not working properly.",
            "date": "06 Nov 2014",
            "name": "Mitu Jain",
            "stars": "1 star"
        },
        {
            "comment": "Talking about the headset it is really awesome , but when it comes to service from flipkart they suck. The headset that was delivered to me has issue with the second sim slot and fipkart guys keeps on telling useless things to correct it but in the end they agreed to return it when asked about the replacement they said they donot have the headset but on website the set was available ideally it should be out of stock as the headset is not available, now coming to the return point they have screwed us to such an extent that some how finally I have got my every penny back from them. I would recommend never buy from flipkart in future Cheers",
            "date": "06 Nov 2014",
            "name": "Pulkit",
            "stars": "1 star"
        },
        {
            "comment": "Beautiful phone. Super-fast delivery as promised. Gift wrap was apt and even had a note 'Happy Birthday' with the product. Fully Satisfied, so far.",
            "date": "06 Nov 2014",
            "name": "Anshul Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is handy, great to use and comes with almost the stock Android OS, with hardly any bloat software installed. The screen clarity is great, the response to input superb.",
            "date": "06 Nov 2014",
            "name": "Arun",
            "stars": "5 stars"
        },
        {
            "comment": "The phone hangs does not work properly, it case with scratch screen guard, looked used, it seems like a duplicate item which has been delivered... requested for replacement.. seller refused..... Horrible customer service....",
            "date": "06 Nov 2014",
            "name": "Allan Maxfield",
            "stars": "1 star"
        },
        {
            "comment": "SUPER PHONE with wonderful features purchased on 06 OCT 14.Till now no problem with phone.camera quality nice. NO PROBLEM in internet use fast browsing.it is a very strong phone with gorilla screen.Voice quality is very good. low light picture in camera is EXTEREMLY GOOD. Fliparkt.. Keep up your good work. Delivered the product before the given date. Good phone at this price range.Nice screen, very fast phone, can run any game i was searching for a phone like this....very good price 5 star don't hesitate just buy. Look and feel of the device is also good. NEGATIVE POINTi find 1. charger heats while charging. Rest all is good.",
            "date": "06 Nov 2014",
            "name": "MK SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "stanadard delivery of flipkart services. moto g is the nice smart phones in mid price range .nice process,nice front camra n back cam. but there is problem in the battery losses. because the moto g is 5 inch display but the battery capacity is remains same that is 2070 MAH . all are nice except battery",
            "date": "06 Nov 2014",
            "name": "Mohammed Faizan",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is very good phone. Nice performance. Most useful is that its Not heating at all. Camera Good. Gaming performance is also good. Now about flipkart. when i ordered this phone, i was eligible for offer pf airtel data of 1gb for 2 months. But after 6days i didn't recieved any code via mail. so i contacted them & their reply was u are not eligible for this offer. and they show me the list which phones are eligible for this offer. Most shocking i saw in that list was Nokia 105 gets this offer. How disgusting it is that they are giving airtel internet offer to nokia phone which doesn't support any internet facility.",
            "date": "06 Nov 2014",
            "name": "Vinod Kale",
            "stars": "4 stars"
        },
        {
            "comment": "I would write my review in two sections 1. Phone 2. Flipkart buying experience of the phone. 1. On Phone 1. Excellent phone 2. Feels like premium smart phone. 3. No nonsense UI layer, stock android experience 4. Useful default apps pre-installed. My Rating for Moto G 2nd gen : 4/5 2. On Flipkart purchase experience: 1. With my 2nd bad experience in purchase i can now surely say that quality on the flipkart side is deteriorating. 2. Faced problems while performing payment. My account got debited but amount was not received on flipkart side. there were no errors during payment process. 3. When contacted flipkart support, rather correcting on their side, support was suggesting me that they will cancel the order, and i have to place a new order. which was not feasible as i had to make another transaction of 12999 . and i had to wait for 7-8 days for my earlier payment to get returned. 4. One support member without solving my problem started guiding me to place a new order than addressing the issue. 5. Finally after few days , looks like they corrected the problem and phone was shipped. 6. This time flipkart took lot of time to deliver the phone. My Rating on flipkart : 2/5",
            "date": "06 Nov 2014",
            "name": "Anand Pandit",
            "stars": "4 stars"
        },
        {
            "comment": "Worst deliveryyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy",
            "date": "06 Nov 2014",
            "name": "C P Narasimman",
            "stars": "1 star"
        },
        {
            "comment": "As a package for the price, it's an excellent phone. Sleek, light, great configuration etc. However, it's just over 10 days I am using it, but perplexed about couple of issues already. 1. While on call, the voice gets feeble often, in almost all calls. I initially thought the person other end isn't holding their handset properly, however, I realized it's not the case after clarifying it a couple of times. Moreover, we can see a lot of others raised the same issue too. 2. The voice / music on headset speaker is distorted. Not expected as the dual front speaker is one of the key USPs of this phone. 3. Started lagging! Strange, considering the pure stock Android OS and great configuration. The animation / graphics isn't smooth as it generally when you get back to the home screen. It lags for a second and all icons appears together without any animation. That's for now. Do they have fixtures or need to look for replacement? Thanx - Subbu.",
            "date": "06 Nov 2014",
            "name": "Subramani Soman",
            "stars": "3 stars"
        },
        {
            "comment": "rate is fine, kitkat advancement ok, memory space 16 GB is use ful, fine product, camera mega pixel was good",
            "date": "06 Nov 2014",
            "name": "sakkaravarthi",
            "stars": "4 stars"
        },
        {
            "comment": "This product is so awesome but its my bad luck that I lost my mobile after 2 days of use. Camera Quality: Awesome Video Quality: Awesome Stand By : Good Look: Awesome",
            "date": "06 Nov 2014",
            "name": "Prafulla sahu",
            "stars": "5 stars"
        },
        {
            "comment": "The phone that i received is defected....very bad service by flipkart..how can you deliver a faulty product?? you just lost a customer.. After waiting again for 5 days..What i receive ?? Another faulty mobile...i mean srsly people...why can't you deliver a phone which is in proper working condition? How i wish i would have never ordered a phone from ur website...",
            "date": "06 Nov 2014",
            "name": "Ayush Malla",
            "stars": "1 star"
        },
        {
            "comment": "I ordered the phone on 24th oct but received on 4th november, the delivery services of Flipkart are getting worst day by day,Flipkart team please do not take customers for granted.Now come to the Phone ,I have only one word to say \"Awesome\".The camera is very good even the front cam is very decent.The Phone is easily a winner in the low Budget segment.In Rs. 15000 you can not get better than this.I am loving my Phone.The Only drawback is the battery which takes near 3 hours to get fully charged, Otherwise the Phone is excellent in all other specifications.",
            "date": "06 Nov 2014",
            "name": "HEMANT PANDEY",
            "stars": "5 stars"
        },
        {
            "comment": "i have got a best deal from flipkart...very good product,best mobile,best price and quality at its best",
            "date": "06 Nov 2014",
            "name": "adnan",
            "stars": "5 stars"
        },
        {
            "comment": "I have used this phone for a week. moto g 2 is a good mid range phone. it is worth buying. there are some drawbacks which are as follows: 1.the charger and the phone itself becomes very hot while charging. 2.when we use camera for more time the phone gets hot and starts to hang up. 3.when we access many applications at a time the phone hangs and the speed decreases. 4.there is no usb cable in the box. but in my opinion if someone asks me to buy a phone in this range i will refer him to the moto g 2.",
            "date": "06 Nov 2014",
            "name": "Ojasva tongia",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is outstanding in peroformance...it does not lag at all..processor speed is mindblowing..camera is outstanding have no words to describes its sharpness at this price point..front facing cam is very good for selfie..runs every app smoother as it says..the wow factor of this phone is its speakers one word only holly shit..The only drawback is its headphone its of cheap quality it should have beeing atleast decent quality..thats it.. so my review is go for it if u are looking for low budget smartphone having highend specs...",
            "date": "06 Nov 2014",
            "name": "Ashish.A",
            "stars": "4 stars"
        },
        {
            "comment": "Very good phone.. Fliparkt.. Keep up your good work. Delivered the product before the given date. Good phone at this price range.",
            "date": "06 Nov 2014",
            "name": "Ganeshram Saty...",
            "stars": "5 stars"
        },
        {
            "comment": "nice screen, very fast phone, can run any game i was searching for a phone like this....very good price 5 star don't hesitate just buy, dont see negative reviews and judge the phone use it yourself. you will like it.......",
            "date": "06 Nov 2014",
            "name": "Vivek Barman",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g 2nd generation is a good mobile with nice build quality and design. Look and feel of the device is also good. Camera quality is average.battery backup is good. But when recording videos the sound recording quality is very bad. Overall device is good with this price tag ,it should be more cheaper.",
            "date": "06 Nov 2014",
            "name": "Shubham Praja...",
            "stars": "5 stars"
        },
        {
            "comment": "Using it for around two month. Nice product from Moto. They have improved it from first generation Moto G. Its the best phone available in this price range.",
            "date": "06 Nov 2014",
            "name": "Anurag Srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this moto g 2nd generation 2 months back, After 10 days microphone and speakers are not working, so I raised a request for replacement. Again after 4 days, I got another new moto g 2nd generation mobile. thanks to the flipkart for replacement. For the first 20 days I didn't faced any problem again I am getting disturbance when I make calls, Initially it was very low but now it's too much. I raised a request for replacement again let's see what happens So guys please be careful while purchasing moto g2",
            "date": "06 Nov 2014",
            "name": "Aswinidattu Ch",
            "stars": "1 star"
        },
        {
            "comment": "Good amazing and i chose good product, have been using for each day ever since i bought it from Flipkart. Service delivery of flipkart was fast as well.",
            "date": "06 Nov 2014",
            "name": "Mayank Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "The worst Mobile which i have seen so far. It doesnt have file manager you have to download it to get your memory card. It doesnt have proper calling options. No maintenance of No of messages unread/read. Totally unhappy with what i purchased.",
            "date": "06 Nov 2014",
            "name": "Yogesh Biguvu",
            "stars": "1 star"
        },
        {
            "comment": "The phone performance is good. But it get heated when u charge the phone. However it get cool down soon. The phone had a small scratch on the panel. Over all phone was good.",
            "date": "06 Nov 2014",
            "name": "Pavan.",
            "stars": "3 stars"
        },
        {
            "comment": "After using it for month. Yes, price to performance ratio is important. but Quality also matters and Moto G 2014 will give you that! Specs doesn't matter at all. Apple is proving that every second but those are high end phone. not made for common man. If you are a student or on a tight budget. buy moto g 2014 and you won't regret your choice.oh! Lollipop is on the way! :-D Still I gave 4 star not 5, why? Rear Camera is not that great. I mean you are getting what you paid for and maybe more but don't compare to other 8mp SmartPhones. also color don't feel realistic and processor is old but again specs are not that important. Verdict: Best in this Budget (below 20k!!!!) Go for it!",
            "date": "06 Nov 2014",
            "name": "sushant parab",
            "stars": "4 stars"
        },
        {
            "comment": "How can get the insurance to the product which was I purchased from flipkart product (moto g) regards A.srikanth",
            "date": "06 Nov 2014",
            "name": "srikanth",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased my moto g2nd gen on September 12 and its nearly 2 months that I have used the phone. Its a nice phone from Motorola at such a decent prize has a cool tapered look with adequate features and remarkable performance. I didn't faced any kind of problem all apps and games are running smooth. Battery backup is also good lasts 8 hrs on moderate usage of music gaming n internet but last 4 only 2 hrs on excessive 3g browsng. Cool to open apps n other do other simple tasks through google voice recognition. Both rear n front camera pics have good quality. On a whole at this price on comparison with other smart phones i found moto g2 better in all ways...",
            "date": "06 Nov 2014",
            "name": "JAYANT",
            "stars": "4 stars"
        },
        {
            "comment": "Its been month with this phone with no issues everything is perfect . Best buy in this range. Waiting for lollipop udate.",
            "date": "06 Nov 2014",
            "name": "rajeev kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is just beyond expectation in that price point. Quite satisfied with the product. I specifically ordered it for my DAD. For him its quite user friendly and is enjoining using it. Thanks moto and flipkart.",
            "date": "06 Nov 2014",
            "name": "Shrey",
            "stars": "5 stars"
        },
        {
            "comment": "Mostly calls are get drop in between the call. and Phone get heat if we use the more than 2 application.",
            "date": "06 Nov 2014",
            "name": "Surojit Mondal",
            "stars": "1 star"
        },
        {
            "comment": "THIS IS A HANDSET WITH FULL OF SPECIFICATION AND FUN...............I M nJOING IT....................IF U WANT TO................THEN HURRYY..........BRING IT HOME............ :)",
            "date": "06 Nov 2014",
            "name": "ARNAB BANERJEE",
            "stars": "5 stars"
        },
        {
            "comment": "hai..friend... this phone having only voice calling otion only....and front used for skype calling and self pics purpose only....disappointment with this draw back 2>sim1 only access 3g signels if we want access 3g internet on ur sim2 it's not wrking",
            "date": "06 Nov 2014",
            "name": "Nagella Desaiah",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered this Product on 21st October. Got it delivered by 23rd. Excellent Package and delivered before the promised date. Actual delivery was on 29th due to festive season. Ofcourse its a known fantastic product. Gifted it to ma beloved one.",
            "date": "06 Nov 2014",
            "name": "Krithika Raju",
            "stars": "5 stars"
        },
        {
            "comment": "i have received moto g2 ,its battery backup is worst and service by flipkart is also worst. reply from the customer care is vary for each time i contact them even not responding to call even they take up they are not listening to my words and saying that complaint has taken.but the complaint is not solved even when i called agin they are extending complaint dates it is very worst site dont buy any products from FLIPKART",
            "date": "06 Nov 2014",
            "name": "bethireddy ve...",
            "stars": "1 star"
        },
        {
            "comment": "I am in love with this mobile and even suggested to my friends who are looking for a new mobile with all good features at reasonable price....thankyou Flipkart for trustful and superfast service you provide to your customers....",
            "date": "06 Nov 2014",
            "name": "deeps",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G(2nd Gen) is a great phone. Battery backup, camera, speaker volume are really very good. It comes with android kitkat and upgradable to android L. It really a worthy phone at this price point.",
            "date": "06 Nov 2014",
            "name": "Anshul Rastogi",
            "stars": "5 stars"
        },
        {
            "comment": "1) Timely delivery 2) Good Quality I felt bad is only with the backdoor..So thin. Worth buying..Money spent have a value.",
            "date": "06 Nov 2014",
            "name": "Dhivya Sathesh",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is great, as expected from Moto. Only drawback is the courier company it was shipped through. Delhivery is the worst courier company, they don't pickup your call, don't respond to your enquiries, their tracking system is bad. 5 star for product 1 star for Delhivery (Delivery company)",
            "date": "06 Nov 2014",
            "name": "Puneet Singh C...",
            "stars": "3 stars"
        },
        {
            "comment": "This has to be the best phone available under 15,000. Just go for it !!! I had to make a choice between asus zenfone 5 vs moto g (2nd Gen). Though asus zenfone 5 might score better in terms of features, moto g (2nd Gen) is a winner overall.",
            "date": "06 Nov 2014",
            "name": "Deepak Behera",
            "stars": "5 stars"
        },
        {
            "comment": "Nexus looking phone plus stock android with exceptional price. Also the device is waterproof, dust proof and scratch proof. Device have gorilla glass 3 on it which makes it scratch proof. 1 gb ram is enough for phone and you will know once you use it. Overall great device, thanks to moto.",
            "date": "06 Nov 2014",
            "name": "Rahul Thorat",
            "stars": "5 stars"
        },
        {
            "comment": "This is the perfect phone in this price band and highly recommend this to others. I have downgraded from nexus 5 to Moto G (2 gen ) for this reason. Flipkart / Ekart : fail in delivering on time. I had to call, email and send many complaints for it to be delivered. I got it a day or 2 after promised delivery day. #fail",
            "date": "06 Nov 2014",
            "name": "Antony Rubin",
            "stars": "5 stars"
        },
        {
            "comment": "This is the perfect product for which I was looking for last 8 month. This is perfect and this product performance is also amazing. But I think camera quality is not so good as 8mp stranded. All other things are perfect as per price stranded.",
            "date": "06 Nov 2014",
            "name": "Manish Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I ALWAYS WONDER HOW FLIPCART BECAME OFFICIAL WEBSITE FOR MOTO SERIES. FLIPCART IS DOING EXCELLENT WORK BY SELLING THIS WORTHY PRODUCT AT THE ADORABLE PRICE. I HAD MOTO G FIRST GENERATION AND NOW, THIS 2ND GENERATION IS REALLY FINE AND COMFORTABLE SPECIALLY 5 INCHES DISPLAY.",
            "date": "06 Nov 2014",
            "name": "HUMAYUN",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is too good and received at less time. Thanks Flipkart...................................................",
            "date": "06 Nov 2014",
            "name": "Sahil",
            "stars": "5 stars"
        },
        {
            "comment": "Exceptional phone at an exceptional price, features and camera clarity is just awesome! only issue is the battery did not lasting long may be because of overuse by me! thank you Flipkart!",
            "date": "06 Nov 2014",
            "name": "Dr Chandra She...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd gen is the best available phone at such a good price that offers so many features that i need not to tell... however it hangs a little bit",
            "date": "06 Nov 2014",
            "name": "Mohit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "This is a wonderful phone. It is value for money. The camera is wonderful. I have installed couple of applications like WebEx, Skype, Whatsapp & few other games like subway surf, candy crush & 2048. Havent faced any lag in any games. This is a wonderful phone.",
            "date": "05 Nov 2014",
            "name": "Abdul Rawoof Lohar",
            "stars": "5 stars"
        },
        {
            "comment": "satisfied good built quality stereo speakers better than what i expected. cam clarity is fine battery comes for a whole day with moderate usage",
            "date": "05 Nov 2014",
            "name": "Vignesh Kannan",
            "stars": "5 stars"
        },
        {
            "comment": "Let me put the review in a simple way,, PROS: 1.Processor is too good,no lag during usual operations,but i have observed lag of only 1-2 seconds while multitasking. 2.Display is awesome. 3.camera quality and features are better than moto g first gen. 4.Easy to access dual sim settings. 5.front speakers are loud n clear. CONS: 1.Performance of the Battery is one of the major problems of this phone,it takes 3.5 hours to get charged from 14% to 90%.Also for optimum use the discharge period is 7.5-8 hours.But if you use phone for high end games,continues 3g network and carryout multitasking,the battery life reduces to 5.5-6 hours 2.In box accessories are pathetic.The ear phones are not of good quality and charger is also not impressive. 3.Battery heats up severely. VERDICT:MOTO G 2nd GEN is awesome phone with very few drawbacks.A more than worth buy for its price.But it is definitely not a phone for game gigs,unless you can carry a power bank.",
            "date": "05 Nov 2014",
            "name": "NITHEESH",
            "stars": "4 stars"
        },
        {
            "comment": "i ve got this hone on 14 of Nov so this is a well examined review. first impression was awestruck. i ordered a black one and it is beautiful . i love it most because of it unique look when screen is locked its pure black . Build quality- built quality is nowhere compromised . it feels rich and comfortable on handing and it is surprisingly usable with single hand despite of 5 inch. it is too handy and fun to use Features - i will not brag about the obvious features that you can find anywhere on net, but what i liked most about this phone it it supports any game you can think of and it runs too well. if u are a gaming kind of person it is for you. notification light is beautiful. no seriously it is too pleasing. Being a Google phone its like icing on cake. voice command and assist are the features for real use lot just for name. Battery backup- i seriously want to highlight it BATTERY BACKUP IS NOWHERE LESS. i ve been using it for a long lime and i have no complaints it gives a back up of 8-10 hrs on nominal use and continuous WiFi usage which is not at all bad for a 5 inch screen phone. but the only prob is when you are playing high end games u can see a drop of 10-15% battery in 15 mins.so get POWER BANK in that case. Performance- overall performance of this device is 4 at the scale of 5. cons- Heating problem - this device gets heated up very soon. while gaming and also while using some heavy application it gets significantly heated up. sound output - it is amazing during calls very clear and crisp but if you are willing to listen music at loud speaker it will be a disappointment. sound in feeble and also poor in quality. Also you will have to buy a new headset because stock headset are just OK nothing more than that. sound output is very low. HATS OFF TO FLIP KART by this purchase flip kart seriously won my heart . i bought 2 sets out of which one was getting too much heated up. i just called up and complained. second day i got a call back and with due Curtsy they asked me to hard reset the phone i did it and reported back that problem is not solved. i received a call and without any request and obligation they just told me that i ll get a new phone with in 3 days and it will be an hand to hand replacement. i mean seriously it so simple !! i bet you will not get this kind of service at any store and at any cost. just go for it guys its i the best deal you can get under 16k",
            "date": "05 Nov 2014",
            "name": "Siddhant Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "Kudos for the fast delivery delivered exactly in a day Coming to phone its fast and responsive my iPhone 5s But the The 5 inch display is good for watching movies but its hard to read pdf. text isn't sharp as expected. The worst part is the charger its slow charger. It takes 4hr to charge this phone. It is 500mah charger while most chargers are rated at 1000mah-2000mah. People buying this phone consider to buy a charger with 1am-1.5am or if you own a microusb charger then use that. These are my intial impressions about the phone. I will write another review soon.",
            "date": "05 Nov 2014",
            "name": "krishna lingam",
            "stars": "4 stars"
        },
        {
            "comment": "I own a moto g first generation which i was totally impressed.And now i Got this one for my mom,She loves it. Camera is terrific and shots great photos.This Moto G second generation as Gyroscope which the first one didn't. We can take awesome photos sphere pictures with google camera.",
            "date": "05 Nov 2014",
            "name": "Varun G",
            "stars": "5 stars"
        },
        {
            "comment": "within 10 days of purchase . noticed battery problem. need to recharge twice or thrice daily .. reported this problem to Flipkart and requested for return... got only 1 call from their technical team to reset the phone. done .... no improvement .. even so called flipkart didnt called back to recheck if my problem is solved or not .. even no response to return also... i would suggest not to go ahead with this brand and of course with Flipkart.. and its mandate that i need to put some star mark during giving my review... where as i do want want to rate this even single star.... its not worth..",
            "date": "05 Nov 2014",
            "name": "Anjan Banerjee",
            "stars": "1 star"
        },
        {
            "comment": "Honestly,I didnot read the reviews before ordering for the phone.The brand name of Motorolla and the specification as well as the trust of flipkart propelled me.On one hand ,phone is enchanting package of buttersmooth processor ,excellent camera output,audio quality,sleak design ,userfriendly operation etc.But the device is a drag on battery, which drains so fast even after moderate use after full charge.Takes very long time for full charge say roughly two hours.There is poor network after switching the same sets of sim from my old phone.Post experience,when I read the reviews,I found that the battery letdown is felt by most buyer and network issue also by many. Could,it be possible, with the joint effort of Motorrola and flipkart that they join the bandwagon of big automobile names to recall sets and fix the common problem faced by many.",
            "date": "05 Nov 2014",
            "name": "Pranay Jha, Ja...",
            "stars": "3 stars"
        },
        {
            "comment": "This phone is one of the best choices available in android phones right now. I have researched on all phones and personally experienced many phones Red mi which has comparable specs for much lesser price. The conclusion is that this is the best one available in the price band with a Moto Brand.",
            "date": "05 Nov 2014",
            "name": "Akhil Bajaj",
            "stars": "5 stars"
        },
        {
            "comment": "A very good handset at a reasonable price. Very smooth performance. Motorola has done a good come back with the device. Though the display quality is good but for me display is lacking a little bit.",
            "date": "05 Nov 2014",
            "name": "Sanjay Singh",
            "stars": "4 stars"
        },
        {
            "comment": "The Moto G 2 awsm phone with exclnt camera quality;a micro SD card slot,beautiful 5\" inch display. Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device. And battery performance is good",
            "date": "05 Nov 2014",
            "name": "asif khan",
            "stars": "5 stars"
        },
        {
            "comment": "Received MOTO G2 on 11.10.2014, but touchpad is not working since 4.11.2014. No response/help from flipkart. I also applied for return of product, but no response fron flipkart. Very disappointed from MOTO G 2nd Generation and my purchase with flipkart",
            "date": "05 Nov 2014",
            "name": "hsgillrcf",
            "stars": "1 star"
        },
        {
            "comment": "Vert gud mobile. Worth a price. Very cheap compared to otheother mobile with features. Batt back up is less. Otherwise , best mobile in market at present at this range.",
            "date": "05 Nov 2014",
            "name": "Prajwal Dhanya",
            "stars": "5 stars"
        },
        {
            "comment": "Just bought MOTO G for my friend last week and So far its really good. Only thing is battery draining faster. But I have to admit most of the smartphone have the same problem.",
            "date": "05 Nov 2014",
            "name": "Surjith SM",
            "stars": "5 stars"
        },
        {
            "comment": "flipkart you were giving offer of 1GB 2g/3g internet data in airtel connection prepaid/postpaid after diwali, i got the phone on 27th oct, and bought the new airtel sim the same day, but airtel is playing fraud games with me, saying they dont know about any scheme , Who is responsible????????? i am giving 1 star because its mandatory to click",
            "date": "05 Nov 2014",
            "name": "Ankur Goyal",
            "stars": "1 star"
        },
        {
            "comment": "1. Flipkart delivery one day before committed date. 2. Handset looks good with white back cover 3. Moto G had a small (6-8\") Data Cable but 2nd Gen has none; guess, it's cost cutting measure 4. I had earlier bought a Moto G for 11,999 which had two major manufacturing defects: (1) sound quality when speaking to anyone including Flipkart; and (2) battery began to show bulges within a week of delivery. Flipkart took it back and sent to manufacturer, and credited my wallet a/c with 11,999. After debating for a month whether to or not to, I made up my mind, added 1,000 to the kitty, and ordered for Moto G 2nd Gen for 12,999 (say, 13,000 those 999s are deceptive) This time as I opened the back cover to put in SIM card, I noticed the battery isn't any more visible. Result: user can't keep a watch if the battery is drying up too soon to be acceptable. Motorola too has learned from experience of earlier model what to reveal and what not to. 5. I shall use the mobile and add further feedback, if I have any. Till then, good by my friends.",
            "date": "05 Nov 2014",
            "name": "Maanoj Rakhit",
            "stars": "4 stars"
        },
        {
            "comment": "The product is good but the delivary of the ecomm is very worst they are not able to deliver in time from bangalore to bangalore they are delivering they required 5 days",
            "date": "05 Nov 2014",
            "name": "K M UDAY KUMAR",
            "stars": "3 stars"
        },
        {
            "comment": "Got this in the Big billion day. Awesome features...Moto has completely destroyed the so called Samsung market base. This phone has absolutely no flaws. Its clean, nice durable, good battery backup, excellent camera, nice hardware, absolutely NO HANGS Plus its MOTO...You have the service with you, If you are looking out for a decent smartphone within 12-13k, then this is the one.... Rajiv",
            "date": "05 Nov 2014",
            "name": "Rajiv",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone from over a month now. I'll only write the important things you think whle buying this smartphone. PROs: Everything is the best you can get in this price range, from Display,sound,touch,Camera,performance,memory to build,look,buttons etc CONS: Front stereo speakers really not that loud. Though far better than MOTO g 1st gen. Battery performance is Average. Lags on heavy games, even crashes sometimes. Bad Multi-tasking, games & apps restart while opening back from recent apps menu. Thanks for reading.",
            "date": "05 Nov 2014",
            "name": "Ankit",
            "stars": "5 stars"
        },
        {
            "comment": "i am using last 20 days MOTO G2. FIRST CLASS PRODUCT,CAMERA,VOICE CLARITY,SOFTWARE ACCESS&NET SPEED IS FIRST CLASS,ITS 100% WORTH OF MONEY.",
            "date": "05 Nov 2014",
            "name": "VIJAYAKUMAR J",
            "stars": "5 stars"
        },
        {
            "comment": "mobile promises everything in its price range.But the problem is with speakers.The speaker problem still exists in the moto g2.I requested for a replacement today.Make sure the speaker is good and doesn't make any noise while making/during a call.I recommend it.",
            "date": "05 Nov 2014",
            "name": "Sriram Dharani...",
            "stars": "4 stars"
        },
        {
            "comment": "As i have not explored much of the device. Upto now there is no problem. One disappoint thing is earphones are not upto the mark...",
            "date": "05 Nov 2014",
            "name": "Sivaramakrishn...",
            "stars": "4 stars"
        },
        {
            "comment": "pros...... 1)value for money ..better than redmi 1s..in camera quality..and in user interface 2)doesn't gets heated..like redmi 1s.. cons.... 1)battery capacity can be improved to 3000mA....(hope so lollipop saves battery) 2) coloured back panels are sooo...costly",
            "date": "05 Nov 2014",
            "name": "Avinash J",
            "stars": "4 stars"
        },
        {
            "comment": "I evolved from Micromax A110 (Canvas 2) to the New Moto G 2gen, It is worth a Phone. Here's my review after I bought it.. Pros.... 1) No Lags - Every User primarily looks at this thing first, simply no lags, even after forcing my phone to show me some it failed showing any..... What else do you need :) 2) Phone is Handy - Fits in my palm so no need to use both hands and doesnt fall on my face when using it lying down on my bed :P 3) Light weight - As compared to my A110 its Light.... enough said 4) Durable - I actually dropped my phone the other day from a height of 4 feet and had a mini Heart Attack but lucky me its still working no scratch nothing :P remembered those days when i used to fling my Nokia phones around without worrying about a single thing...... :) (Warning dont try this stunt you will end up loosing all that you paid for) 5) Probably I think I was the first one to get an update as no one mentioned about it at that time 10th Sep'14 to be precise :D as soon as i unboxed the phone and connected it to my WiFi I had an update waiting, so expecting Lollipop sooner than other folks :P 6) Sound - OMG the sound is awesome, Dual speakers blow the sound like a stereo set, that is if you have the right media 7) No Heating - Unlike other I didnt notice any heating during calls it only gets heated if Im under the sun for a long time with my Phone exposed to it ... (Its a Black Phone, and Black absorbs Heat, so no complaints) 8) 12.9GB free internal storage - Yes all the apps you want to fill in your phone, Currently I have 94 excluding the pre-installed, so this is enough to prove the phone doenst lag 9) No Boltware - Purely stock android, that means no unwanted apps pre-installed which you wont be using 10) Looks Rich - Yes It does look elegant 11) Games - Works smooth FIFA 14, FIFA 15, Real Racing 3, temple Run works smooooth except for subway surf it lags a bit again no complaints coz my Sis is a crazy fan of Subway and she noticed lags in almost every phone she played on, so no complaints Cons... 1) charge time 3 hrs - Thats not good coz im a impatient man 2) Camera - Camera is a bit grainy in the indoor's but is excellent in the Outdoors.. 3) Ringtone - ascending ringtone wastes 3 second of ring time 4) only ~300mb ram free (Doesnt make a difference to me if there is no lags and no force close, Its only for the Ram hungry guys out there ) hunting for more !!!!!!!!!!!!!!!!! and yes awaiting Android Lollipop..................",
            "date": "05 Nov 2014",
            "name": "Theophilus Diniz",
            "stars": "5 stars"
        },
        {
            "comment": "The item did not arrive on time. This was my first purchase on Flip-kart, one of the worst experience. I will not prefer Flip-kart any,ore.",
            "date": "05 Nov 2014",
            "name": "Gopinath V",
            "stars": "1 star"
        },
        {
            "comment": "At the same price tag you may have so may options to buy but i can say just trust the brand and go for it u will never be disappointed.now some pros and cons of this device- pros- 1-feels and looks very good. 2-pure android and gaurrented updates 3-very good battery backup(upto 2 days in normal use) 4-smooth performance-no lag at all 5-very light weight 6-good camera cons 1-slightly low resolution display. definitely go for it as i say u will never be dissapointed.",
            "date": "05 Nov 2014",
            "name": "sarthak sarath...",
            "stars": "5 stars"
        },
        {
            "comment": "Just Awesome.Its an excellent phone i have seen so far in a friendly budget with all features. Will suggest others to buy",
            "date": "05 Nov 2014",
            "name": "Suresh Moturi",
            "stars": "4 stars"
        },
        {
            "comment": "After long consider i decide to buy this Moto G 2, I order this on Flipkart 8th Nov and received 20th Nov. my friend brought this mobile for me from India. as Im from Sri Lanka. I am happy with this product, that 8 mp camera does the job well. screen is good, light weight. all over good product.",
            "date": "05 Nov 2014",
            "name": "Saravana - Sri...",
            "stars": "4 stars"
        },
        {
            "comment": "excellent features value for money , execellent touch , music and battery back up i ilked the sound quality of the phone , look is also elegant",
            "date": "05 Nov 2014",
            "name": "Bansidhar honw...",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is fine with this phone except the build quality of the display glass. It fell from a height of 2 feet and the glass was smashed. Similar thing happened with a colleague of mine, who did not even drop his phone. The worst thing is that the motorola service centre in chennai is so bad that firstly they don't even pick your calls, so you have to visit them personally just to find out that the replacement costs around Rs. 6000 which is half the cost of the phone. Phone's performance itself is good, but if you are even a little bit of rough user, do not buy this phone.",
            "date": "05 Nov 2014",
            "name": "Shiva",
            "stars": "2 stars"
        },
        {
            "comment": "Got the phone and used for a month. Here is my review on the gadget. Pros: - Memory expandable feature (with micro SD slot). - Speakers output on front side. - Camera 8 MP rear and 2 MP front. - Updated Android v4.4.4 (KitKat) OS. - Screen size 5-inch HD Screen. Cons: - Screen Resolution Display Appearance is not so good as 1st Gen Moto G. - ICON size is big, which looks odd. (no option to reduce). - There is no 2-in-1 Charger cum Data cable. - No LED indication when device is charge. - Poor Back. Verdict: As I mentioned worth for your penny with upgraded features and missed out the durability of the device when compared to 1st Gen Moto G. If your are looking for a best MANGO in this price range, just go for this.",
            "date": "05 Nov 2014",
            "name": "Ganesh Chalama...",
            "stars": "4 stars"
        },
        {
            "comment": "Superfast delivery by flipkart and if you are looking for a midrange phone just go for it without any second thought!",
            "date": "05 Nov 2014",
            "name": "vivek advani",
            "stars": "5 stars"
        },
        {
            "comment": "good product with add on feature of memory card storage and 5 inch is best....no words as such only feel a bit about the build quality of the back cover.",
            "date": "05 Nov 2014",
            "name": "Gaurav C",
            "stars": "4 stars"
        },
        {
            "comment": "Pretty good. Sound quality not the best. Rest is fine. good phone in medium budget. look wise good, compact, battery life is good, camera is OK in its range it is a good option.",
            "date": "05 Nov 2014",
            "name": "Sankalp",
            "stars": "4 stars"
        },
        {
            "comment": "I wanted to buy white colour for this model. But when I had to purchase, it went out of stock. Otherwise no complaints regarding the device till now.",
            "date": "05 Nov 2014",
            "name": "meenakshi raina",
            "stars": "5 stars"
        },
        {
            "comment": "It's really worth for money. No doubt.. A good productreally nice hardwRe. Good screen.. Head set is not that much good. But overall mot of 2 is agood phone",
            "date": "05 Nov 2014",
            "name": "Ajithkumar Ra...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen) is the King of Budget Smartphones, it's hard to find a branded phone with a pleasing 720p IPS display, expandable storage, good voice quality and a Snapdragon 400 processor for less than 15K. It may be inexpensive, but it doesn't look cheap. NFS - Most Wanted, Vice City runs smoothly without any lag. Minor drawbacks, Battery Life is good but not great, then it requires too much time for charging. Final waiting for Andriod L update.",
            "date": "05 Nov 2014",
            "name": "Raghu.G",
            "stars": "4 stars"
        },
        {
            "comment": "Thanks to flipkart good delivery. Coming to phone everything is awesome ... And the ppi very good. Camera,processor, build quality. Everything is perfect I facing one problem that is when playing music with high volume, on that time anyone call then speaker and mic does not works until restart. But I face this problem on second day only. Further it's working good no problem anything like that Battery life is very good as for average use gives 15-18h and continuous use gives 4.30-5h. The charger is very bad comes in box it charges phone 3.30-4h (0-100%) so I using Samsung Galaxy core charger(5v,1A) which charges just 2.20h (0-100%). No problem with 1gigs ram I installed 32 average apps no lags to be found.working very fine Phone is really water repellent I tested my phone 3 times don't worry about water slash. And never facing any heating problem even when play games, camera ,video playing, charging with Samsung charger (with moto charger it will heats up to 45°c). But it commonly heats up to 39°-40°c in my phone.. Great things • HD slow motion video • 16 GB internal memory • 8 mp camera 2mp font can • HD screen resolution • quick charg with sams charger • water resistance & gorilla glass • SD card support • stereo speakers • good process even it's 1 GB ram Best phone ever just closs eyes. and buy..",
            "date": "05 Nov 2014",
            "name": "Prathap Pruthviraj",
            "stars": "5 stars"
        },
        {
            "comment": "ITS A GOOD ON LINE MEGASTORE & HAPPY WITH THE RESPONSE KEEP GOING ALL THE BEST THE MOTO 2G IS A VERY EXCELLENT MOBILE.",
            "date": "05 Nov 2014",
            "name": "MAHESH MENDA",
            "stars": "5 stars"
        },
        {
            "comment": "This device is absolutely worth it !!! Plus the delivery time was really quick considering I ordered one during Diwali. The only downside was that the headphones(or earphones) that come along with the handset are not really that great, so if you really like to hear your music, get a different set. The combo offers on flipkart for the same are decent ; feel free to check them out.",
            "date": "05 Nov 2014",
            "name": "Darpagiri Mondal",
            "stars": "4 stars"
        },
        {
            "comment": "Nice product but it could be more better if the RAM would be 2GB & battery should be 3500 mah, flash light could be cool day white colour instead of warm white.",
            "date": "05 Nov 2014",
            "name": "Rahul Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product at best price.... Flipkart packaging is impressive but not deliver to most of the locations now which was earlier available to that location why??",
            "date": "05 Nov 2014",
            "name": "poorva jain",
            "stars": "5 stars"
        },
        {
            "comment": "Great performance at its price is too cool... Having fun... with minor bugs in andriod kitkat ...but like it..",
            "date": "05 Nov 2014",
            "name": "poorva jain",
            "stars": "5 stars"
        },
        {
            "comment": "i got nice piece I liked it very much..but some features are not up to mark,like calender, FM Radio etc, these apps have average features.",
            "date": "05 Nov 2014",
            "name": "Vishwanath Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "flipkart thank you!!!! the best service moto g has come a day before delivery information were provided at its best best service",
            "date": "05 Nov 2014",
            "name": "janaki vadivelu",
            "stars": "5 stars"
        },
        {
            "comment": "Overall nice phone. But you know if there are pros then there are cons too. It's been almost two weeks since i purchased it through flipkart. Its going nice and easy as till now not much apps or files loaded into it. Eager to know how it would behave under heavy load conditions. One biggest con is that there is no USB cable provided with the product. Camera quality is good but it doesn't zoom more than 4X. No video zooming also. Nice latest OS android 4.4.4 kitkat, upgradable to Upcoming Android5 lollipop. But processor is 1.2ghz only. RAM is also only 1 GB will face difficulty under heavy load conditions, must have atleast 1.5 or 2 GB . Two stereo speakers are given on top and bottom plays nice sound without earphones, But with earphones sound quality is so low ,It's almost unhearable with earphones. Nice sexy look overall. I will rate it 3 and half as below there is option of rating it only either 3 or 4, but i rate it according to overall performance till now. Quality is worth according to its price again i would say \"till now\" :-)",
            "date": "05 Nov 2014",
            "name": "Ashish Rawat",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G a super android phone bought for my DAD, and he is loving it. He feels headphones are mediocre could have been happy if had earplug headphones with good quality music. Also he didnot find any USB chord in the box. Over all He liked the phone..",
            "date": "05 Nov 2014",
            "name": "Nilesh Pokale",
            "stars": "4 stars"
        },
        {
            "comment": "I guess I don't need to review much but guess what this phone deserves how much ever compliment we can say. What a beauty in 5.5'. No lag, the smooth with which the phone functions and the camera. It compliments with each other. Awesome! Recommended.",
            "date": "05 Nov 2014",
            "name": "Karthika",
            "stars": "5 stars"
        },
        {
            "comment": "Cell is fast and good but when we keep for charging. Charger will heats up like hot molten. So, am charging through my samsung charger. Battery back up is not upto mark. Where to complain about charger? Now from past day my charger is not working. I need a replacement.",
            "date": "05 Nov 2014",
            "name": "Manjunath M B",
            "stars": "4 stars"
        },
        {
            "comment": "An amazing phone at a very reasonable price. Phone has minor heating. Probably, much awaited L update will be helpfull. I am enjoying this phone and flipkart did its best to deliver it to me.",
            "date": "05 Nov 2014",
            "name": "Shray Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, Now it is my turn to write a review. After reading lots of good reviews I have decided to buy this product. I ordered(OD100945372712260100) and with exceptional flipkart service I received it on 8th of Oct 2014. I switched on ...but to my surprised nothing appeared on screen, instead there was burning secession on my fingers. I tried multiple time but failed to switch on the device. Initially burning smell was coming out but stopped after few minutes. Unfortunately this time the device was not switched on. I requested for return to flipkart (Return ID: 9582841). Flipkart replaced the product and I got another new set which was switched on successfully. I configured you-tube and starts playing video. After 15-20 minutes I observed that it was started heating up to an extend such that I can not put it on my ear. I turned off wifi/3g data/ location service etc and execute same you-tube tests. Test fails. It was heating up. I have requested another return Return ID: 8364911 Finally I have received my final handset and I am very happy with this product. There is no heating issue at all. 4 star for overall experience. 1 star is deducted for multiple return request. -- Samarjit",
            "date": "05 Nov 2014",
            "name": "Samarjit Adhikari",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is under budget.....n worth for buying........4 weeks over........n the functions in this phone ve nice flexibility .I just loved it....and also I ll recommend others to buy this.....its really a great innovation of Motorola co LOVING it .....:-)",
            "date": "05 Nov 2014",
            "name": "sandeep choudhary",
            "stars": "5 stars"
        },
        {
            "comment": "I Think which mobile i have order in flipkart , that product is replacement product or used, because their is some screwdriver spot on the nut whick was in backside cover, phone is getting hanged sometimes and have a network problem. i have paid money for a new motorola mobile phone, then why flipkart is selling used & defective products to me.",
            "date": "05 Nov 2014",
            "name": "ANKIT TANWAR",
            "stars": "1 star"
        },
        {
            "comment": "1. India is country of Music lovers, Moto gave FM, Music player including good pair of speakers but FM don't have option to enable loudspeakers 2. Flip cover and back covers and good colored and attractive but those are very expensive if I compare the actual price of a device 3. Rest performance is average to good I can say 4. Battery is again good for fair usage 5. camera has some issues getting blur images when no sunlight but I am still happy with it as I am not camera freak over all I can see 3+ rating out of 5. and its good to have kind of phone if your budget is 12k",
            "date": "05 Nov 2014",
            "name": "Lalit",
            "stars": "4 stars"
        },
        {
            "comment": "Very nice to operate....just awesome....No issues like heating or loading like other phones....Camera quality is very good..Speaker quality is also good..touch is very smooth..impressed with the phone",
            "date": "05 Nov 2014",
            "name": "Meet Shah",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is a masterpiece by Moto. Nice Design, Brilliant Display and above all fast processing, which makes this device unbeatable. The only thing I found is, Moto Should have opted for 2500/3000 mAh battery for this. Last but not the least Hats off to Flipkart's delivery services...",
            "date": "05 Nov 2014",
            "name": "Yogesh Sathe",
            "stars": "4 stars"
        },
        {
            "comment": "Such a nice experience with moto g.. Moto G (2nd Gen) is absolutely value for money. People have the perception that this is a low performance device just because it is low cost. For me Moto G is simply is as good as any other high-end phone which costs double or more. Don't mind the extra weight and thickness; the build quality is definitely superior than any of the Samsung phones.",
            "date": "05 Nov 2014",
            "name": "Deepak dalimbe",
            "stars": "5 stars"
        },
        {
            "comment": "I dont know if others are facing this issue with Moto g2, I am seeing that after usage of around 10 to 15 mnts, screen is becoming insensitive to touch. No tab is working. I need keep on pressing the same tab for more than 10 times. Even to stop a song also, I need to press the stop tab around 10 times. I didnt see this issue with other phones I used. I have not downloaded any apps yet, to blame the memory shortage.",
            "date": "05 Nov 2014",
            "name": "Bhanu prakash kes...",
            "stars": "1 star"
        },
        {
            "comment": "Price :below 15k very economical Camera : capture HD Quality is very good 8Pixel 2mega pixel front Body : Very Slim think If you are searching below 15k phone then go for this This phone give you style fast processing speed ram is 1GB which is more enough for suffering is very easy pure KITKAT low light picture quality is extremely good screen Moto g launch good product in 13k I think",
            "date": "05 Nov 2014",
            "name": "Sagar Rao",
            "stars": "5 stars"
        },
        {
            "comment": "The product shape and look are good. But, battery performance is very bad. It is not lasting even half a day.",
            "date": "05 Nov 2014",
            "name": "Hari Charan G",
            "stars": "4 stars"
        },
        {
            "comment": "i like Moto G 2nd gen in mid range phone. PROS: Its Moto so obvious it's good. Best stock android phone under Rs 15000 Camera in daylight Nice grip and easy to hold CONS: Battery backup is way too bad compared to moto g 1st gen Camera in night or low light. Speakers give cracking noise at maximum volume level Requires too much time for charging ....worth Money...GOOD DEAL.. Does not get Airtel offer come with my phone because of poor Customer Support of flipkart...",
            "date": "05 Nov 2014",
            "name": "Mihir Patel",
            "stars": "4 stars"
        },
        {
            "comment": "I was very confused to spend more than 18 K for my smart phone. I compared Azus,MI, MOTO G 2nd Gen,Samsung Grand 2 ,etc which are all similar configurations.Samsung Grand 2 has a diff look but 5 K more.MOTO G 2nd Gen is very good Not bulky as u imagine looking at the image. This has a elegant look and strong compared to Asus , MI and all similar category phones.Some phones say 13 Megapixel camera and all but pic quality may not be good. For a layman, Sound quality, Speaker quality,camera , speed is important .He can buy this blindly.No regret .",
            "date": "05 Nov 2014",
            "name": "Kiran Jose",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased moto g 2nd gen , 2 weeks ago .. everything is awesome except battery back up .. i need to charge it for two and half hr and it hardly gives me 70% of the day with normal use age and if i use constantly with some calls ,games and texting it not even gives me half a day ... and coming to camera while taking pic is good and view is also good when i zoom a little it pixltes and also when i sync them to my pc even can easily fined out pic is pixlating ....... and also it becomes over heat when i use camera or play games more than 5 mints i don't know whether i am the one facing this problem or every one ...",
            "date": "05 Nov 2014",
            "name": "Deepak",
            "stars": "3 stars"
        },
        {
            "comment": "camera - superfine front camera - 2 megapiels best for selfie i hav ever seen sound - 7 out of 10 very smooth & comfortable 2 use Corning Gorilla Glass 3 i m totally satisfied after getting my Moto G (2nd Gen.) & thank u so much to flipkart 4 fast delivery",
            "date": "05 Nov 2014",
            "name": "Shubham Biswas",
            "stars": "4 stars"
        },
        {
            "comment": "There is a problem with camera. Problem with touch (Lagging) Poor battery backup. Heating Many Hardware issues.... Etc.... G is 100% better best mobile than G2.....",
            "date": "05 Nov 2014",
            "name": "SHANMUKHSAI GA...",
            "stars": "1 star"
        },
        {
            "comment": "Hi Guys, Sadly I have to say MOTO G2 was below par of my expectation. I ordered the phone during diwali sale I received my phone 8th Oct. the 1st issue 1 faced was my volume display comes automatically i was still alright with it as it dint bother my day to day activities then with in a month my camera stopped working said camera error: cannot connect to camera. then a unique issue came up there was no noise(no ringtone) during anyone calls but my music and all other files were working fine. Then I placed a replace order thanks to flipkart I got my product replaced within a day. Seriously, I had never expected this from a Motorola product. Thanks, Rishav",
            "date": "05 Nov 2014",
            "name": "Rishav Sinha",
            "stars": "1 star"
        },
        {
            "comment": "* No Conference Call & Video Call option * Not useful for business person. * Product is good it works very fast. rarely it will get hang based on the usage, but the battery backup is not at all satisfied.",
            "date": "05 Nov 2014",
            "name": "Chandan P",
            "stars": "3 stars"
        },
        {
            "comment": "* No Conference Call & Video Call option * Not useful for business person. * Product is good it works very fast. rarely it will get hang based on the usage, but the battery backup is not at all satisfied.",
            "date": "05 Nov 2014",
            "name": "Chandan P",
            "stars": "1 star"
        },
        {
            "comment": "really nice phone in this price. have all the features one look for in the phone. found no glitches.....",
            "date": "05 Nov 2014",
            "name": "Mukul Verma",
            "stars": "4 stars"
        },
        {
            "comment": "Very fast manner the item delivered. Awesome that's good. I am still exploring the device. Will post pros and corns sooner in detail. I really appreciate the seller WS RETAIL. You people are rocking. keep it up. Thanks Flipkart.",
            "date": "05 Nov 2014",
            "name": "ALOYSIUS A",
            "stars": "5 stars"
        },
        {
            "comment": "my replacement for moto g 2 gen is still pending. its almost 25 days since i have placed order for replacement, still its not been replaced. Kindly make sure before buying the product whether to take the risk of buying it or not.",
            "date": "05 Nov 2014",
            "name": "Sagar Joshi",
            "stars": "1 star"
        },
        {
            "comment": "Excellent device given the price range it is offered. Loved the screen sensitivity. Stock Android 4.4.4. waiting for Lollipop update to see more of it.",
            "date": "05 Nov 2014",
            "name": "Manjunath Panc...",
            "stars": "4 stars"
        },
        {
            "comment": "Superb phone at this range. This phone has become the top priority budget phone for the indian consumers. Thanks for flipkart & motorola to bring this phone to us",
            "date": "05 Nov 2014",
            "name": "Jayakumar N",
            "stars": "5 stars"
        },
        {
            "comment": "I will never buy any product from this site.I was told my product will be delivered by 4th november but on 5th november when I called at customer care I was told that delivery will be done by 8th of november.I canclled the order.",
            "date": "05 Nov 2014",
            "name": "Rahul Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "I got the phone delivered in standard time. I was very happy to buy MOTO G 2. The phone has a rich finish. Very good speakers, mindblowing camera. But the problem with this handset is the aftersales service which I would like to state is below average. NObody in the company seems o have a knowledge about this handset. The company boasts that the handset is customisable but it is not so. The flip covers you are getting for such a handset is not good and very Expensive too. So for the first time buyers its an awesome phone... and lastly the phone is very good in its range and from a good brand too.",
            "date": "05 Nov 2014",
            "name": "S K Tyagi",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 phone is gud at this price list there is an issue with phone battery backup is very poor and phone brightness is less when compare with same display resolution phone",
            "date": "05 Nov 2014",
            "name": "ys",
            "stars": "2 stars"
        },
        {
            "comment": "From the first day i m facing problems.i m not satisfied with the product.It's not up to the expectations.I contacted the customer service but they refuse to resolve to my problem.Your service is pathetic.I need replacement or refund within a day.",
            "date": "05 Nov 2014",
            "name": "Gautam Dhiman",
            "stars": "2 stars"
        },
        {
            "comment": "Its an awesome phone and very easy to setup...Thanks to flipkart and motorola....although delivery was delayed but it was worth waiting...",
            "date": "05 Nov 2014",
            "name": "Mandeep Singh",
            "stars": "5 stars"
        },
        {
            "comment": "GOOD 1) NET USING IS GOOD. 2) CALL VOICE GOOD. BUT 1) NO INBUILT VIDEO CALLING. 2) NOT DETECTING PENDRIVE. 3) AUDIO EAR PHONES QUALITY VERY BAD.",
            "date": "05 Nov 2014",
            "name": "MADHUSUDHAN CH...",
            "stars": "2 stars"
        },
        {
            "comment": "I've been using the Moto G 2nd Gen for exactly a month now and I love it! Considering my pretty high usage of WhatsApp and Facebook, battery still lasts for an entire day and no, phone doesn't heat up or anything when charging. Camera quality is pretty decent, memory is good too. Just had one problem with phone hanging / freezing in a week's time but that was because of an app I had downloaded, deleted the app, phone back to being awesome since that. (processor maybe)... No USB cable in the box, using my old phone's cable and no, it's not like one of those chargers where USB and charger are same/ connected, there's deff no USB cable and I have checked the box thoroughly. In the box headset is also pretty bad, doesn't fit, is ancient style, deff not cool and hurts my ears. I'm using another headset with the phone so big flop on accessories! Also had to buy the Moto flip case separately- its an awesome case to go with this phone but could have been cheaper, I get great compliments on the case and the phone both! To sum it up, if you want all the features that this phone has (on a universally known and good brand), you deff need to pay around 5-10k more than this. So just because of the disappointing accessories, I give it a 4, else would have been 5 stars with 2 thumbs up!",
            "date": "05 Nov 2014",
            "name": "Sonia Samra",
            "stars": "4 stars"
        },
        {
            "comment": "I'm only going to talk about their delivery because the phone was just as described. I live pretty much at the center of Hyderabad - near Ameerpet - which is why I think this review is important. Flipkart does not deal with the local courier services anymore. We, as Indians, know how these couriers can be erratic and unorganized. But E-kart is a whole new thing. Apparently it is somehow associated with Flipkart - as the driver explains it - and the deliveries are made from a moving truck. This is how it broke down for me. The truck driver calls me 2 hours before hand. He calls me again 30 mins before the delivery. Since I have some business to tend to, I tell him I'd rather pick it up. He tells me exactly where he is (he is delivering at some other address) and asks me to come there. I show up exactly 10 mins later. I pay the money and he has a bill printer with him with which he instantly gives me the bill - just like in a regular retail store. And I have a brand new Moto G! P.S. - The phone is awesome. Pura pysa wasool.",
            "date": "05 Nov 2014",
            "name": "Ananth Pedapudi",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone and I planned to return. after I used this phone, i dont want to return it is such good phone. battery stays one day with rough use. camera is good. display is good those who wants to have more features with less money can go for it.",
            "date": "05 Nov 2014",
            "name": "5",
            "stars": "5 stars"
        },
        {
            "comment": "Bought it on the launch day and received on time! Kudos to Flipkart! Haven't had any challenge as such except on the navigation (while accessing settings), which I presume coz of kitkat. My Micromax canvas a111 with 4.1 is much better than Moto G 2nd Gen Navigation. However, this can be resolved by downloading apps like cleanmaster with it's notification toggle. Launch day offer wasn't that impressive except Mytra.com's 35% discount. If you want to avail 1GB Ram, with good internal memory, then this would be surely a great choice!",
            "date": "05 Nov 2014",
            "name": "Vijay G",
            "stars": "4 stars"
        },
        {
            "comment": "I recently brought Moto G (2nd Gen) mobile through flipkart. The overall performance and other aspects of this phone are excellent but there is one major flaw with the my Moto G (2nd Gen) mobile back cover it is not fitted properly. i try to fit but same issue . if going to buy also back cove it was nearly Rs800 which is EXPENSIVE And Battery also not so good cam it is ok bot sound not good for 10k mobile and head set also",
            "date": "05 Nov 2014",
            "name": "veerachari ari...",
            "stars": "1 star"
        },
        {
            "comment": "there is a damage in the handset in the left down corner of the mobile. Black panel got damaged. it is my first purchase in flipkart. why some people in flipkart,doing like this and degrading the name of flipkart",
            "date": "04 Nov 2014",
            "name": "ananth",
            "stars": "3 stars"
        },
        {
            "comment": "yup bought moto g 2nd gen black on 18th got it on 23 oct..using it totally satisfied .this fon rocks.....could hav been bettr had they boast baatry wid 3000 or 2500mah....n also should hav been removable...",
            "date": "04 Nov 2014",
            "name": "ravi sourav",
            "stars": "4 stars"
        },
        {
            "comment": "I placed an order for motog2 on 31st oct,2014 and it got delivered on 4th nov,2014 fine with the speed at which flipkart delivers the goods. But i am totally disappointed the performance of the piece when it is compared with samsung galaxy star2. both devices are connected to wi-fi winlge, and turned on mobile network alternatively to access internet, no problem with other device but moto moto is not showing any promise.....pals could any one suggest what to do...shall i claim my money back by sending the piece back to flipkart..? you know on either side of the front panel there are scratches as well, is it 1st hand piece or?? ? I am convinced to write this bcz the problem i shared with flipkart team has got responded and got processed the replacement of earlier dispatched old one with new piece on 11th November. The first motog2 took nearly 5+ hours to charge fully and briskly getting discharged for about 8 hours of normal usage with out internet but new one lasts for longer time,internet access is good on new device.exclusive moto apps make the piece bit unique. It would be good if there are no such dispatching of stale ones either by accidentally or deliberately.",
            "date": "04 Nov 2014",
            "name": "satish",
            "stars": "4 stars"
        },
        {
            "comment": "Hello, I buyed it 1 week before for the past 7 days I felt awesome about the phone performance it's having brilliant display and speakers are good, internet usage is awesome pages will load so quickly, but the phone is heating around the rear camera it always heats I don't know why, and in multitasking if you jumps from game and if you return to it the game will restarted this is kind of ugly, Using 3g in this mobile is not good for 10 minutes usage your phone will get heats a lot around the rear camera.",
            "date": "04 Nov 2014",
            "name": "Nirmal kumar. S",
            "stars": "4 stars"
        },
        {
            "comment": "Been using it for 1 week now. So far the performance is excellent. Excellent touch, decent battery life",
            "date": "04 Nov 2014",
            "name": "Uday Jain",
            "stars": "5 stars"
        },
        {
            "comment": "This is a feedback on the delivery delay of I experienced this time around. I bought the device on 21st Oct and was promised delivery on 27th Oct, but it only got it on 29th, only after repeated follow-ups. It will really help if such delays are not repeated, such experiences leave major sour taste in people.",
            "date": "04 Nov 2014",
            "name": "Chandan Narayan",
            "stars": "2 stars"
        },
        {
            "comment": "You have already read pros and cons by many reviews :) as a gamer i used this mobile to play HD games like, asphalt 8 and fifa 15 etc, mobile runs them very smooth. no lagging or no abrupt app closing. only con i found that is battery backup while using 2G or 3G data :) ignoring that then its best mobile by all means :)",
            "date": "04 Nov 2014",
            "name": "Sharath Koushik",
            "stars": "5 stars"
        },
        {
            "comment": "This was my first online purchase so I was worried about the quality of product. But Flipkart gives its best when it comes to quality.. Now the main point:- The phone is absolutely amazing with blazing processor speed, never lags while playing games or multitasking.Internet speed is pretty good.Good GUI. MOTO G SECOND GEN is full of awesomeness >Images captured with camera are good in quality, front cam though 2 MP is pretty decent. >Lag free performance. >Great for multitasking. >Stereo speakers are also very good. >Call quality is also fine. >Android L is coming to this phone. Lastly the battery life is average but then it again depends upon use.. People looking for new phone must definately go for it..",
            "date": "04 Nov 2014",
            "name": "Dhaval Mistry",
            "stars": "5 stars"
        },
        {
            "comment": "Build quality of the phone is fantastic. Superb sound from the front dual speakers. Camera-Motorola has really worked on the camera.the picture clarity has improved by a huge margin.the 8mp camera is way better than the 5mp camera of the Moto G.even the front camera is now better.So full marks to Motorola for improving the camera. Screen Quality-its a 5 inch 720 IPS LCD screen and as usual the quality of the display panel is very good,viewing angles are good too.color reproduction is also very natural and not over saturated. Stock Android experience-The phone is running the latest version of Android.i.e.4.4.4.Kitkat.apart from the 2-3 Motorola apps,there is no bloatware.that's the main reason Motorola did not bump up the processor and the Ram.as the hardware can easily work,multi tasking is also smooth on the phone.no lags. gaming experience is also fun now because of the front dual speakers. Micro SD expansion upto 32gb another feather added in the cap. cons- Motorola could have bumped up the battery capacity upto 2300mah. The phone could be a bit more sleek. Overall i would say this phone is here to stay inspite of the stiff competition.",
            "date": "04 Nov 2014",
            "name": "Gautam Rane",
            "stars": "4 stars"
        },
        {
            "comment": "I PAY MONEY FROM C. CARD I GOT DELIVER MOTO G AFTER 20 DAYS. ON FIRST DAY AT THE TIME DOWNLOADING MOTO G HANG . ITS LOOKING USED PIECE DELIVERS TO ME",
            "date": "04 Nov 2014",
            "name": "Rajesh Jain",
            "stars": "1 star"
        },
        {
            "comment": "It is a good cell, After I have used Samsung I thought of buying samsung again but I got the best deal and the phone by Moto. The screen is awesome and functions are very good. I got lot to explore than samsung and the best thing is this cell will drive you and ask you to reach out to the updates.",
            "date": "04 Nov 2014",
            "name": "Rohan Vasal",
            "stars": "5 stars"
        },
        {
            "comment": "I always had high regards for Flipkart and their service. But this transaction shattered all my beliefs. When I tried ordering Moto G 2nd gen on Oct 4th, the payment was debited twice. I was not bothered too much because it had happened earlier too and normally the amount would be credited back in a couple of days or maximum one week. Even after a week passed, when I didn't get my money back, I wrote an email to the customer service and have been following up with them till date. Today when I called the Customer care, I was informed that only one order was finalised and the other order (for which the second payment was debited) was only initiated. As I didn't refer the other order number, my complaint has been kept pending for such a long time. I can't understand how I am supposed to quote an order number which I don't know. Now it is almost a month and the customer care guy coolly responds that it will be refunded by November 11th. So, I have got no other go but to pay the credit card bill and wait patiently for these people to refund my amount. I never expected such poor service from Flipkart and mostly this would be my last transaction with Flipkart. Bye. Bye.",
            "date": "04 Nov 2014",
            "name": "Senthilvel T",
            "stars": "1 star"
        },
        {
            "comment": "hi sir my mobile moto g 2 genration bill sent me my email id not for service center accept only waranty card and bill so plz sent my mobile bill",
            "date": "04 Nov 2014",
            "name": "nandha siva",
            "stars": "1 star"
        },
        {
            "comment": "Battery not withstand for more than 4 hours... Not recommended for Normal users..................................................................................................",
            "date": "04 Nov 2014",
            "name": "Thands",
            "stars": "1 star"
        },
        {
            "comment": "1.Having problem with camera flash. Once camera flash is on, it doesn't off until we switch off the phone. 2. For people who used Samsung devices earlier may get confused with interface. 3. Doesn't have any inbuilt explorer. so, we have to install apps like es file explorer etc.",
            "date": "04 Nov 2014",
            "name": "Thrilokadhipat...",
            "stars": "4 stars"
        },
        {
            "comment": "i have ordered this mobile with an extra casing but on first time i received a mobile which has issues which is not new one defenetly later but got a replacement which is working fine. I dont know whose fault it was as the piece which i received must alredy had a problem and was re sold to be based on packing but you guys promised me a new one which is company packed not the one returened by some one else Please see your customers receive the brand new pieces instead of returned items by others.",
            "date": "04 Nov 2014",
            "name": "kalyan perugu",
            "stars": "1 star"
        },
        {
            "comment": "I received my phone the very second day I ordered. As far as features are concerned surely the best phone in less than 15k range.",
            "date": "04 Nov 2014",
            "name": "Vishal Shrivas...",
            "stars": "5 stars"
        },
        {
            "comment": "Dear all, I purchased this set before 4 & 5 Days but he is much of heat without any using and mobile delivered to me without data cable, if any solution please reply otherwise replace my mobile.",
            "date": "04 Nov 2014",
            "name": "satinder singh",
            "stars": "1 star"
        },
        {
            "comment": "I booked my Moto G on 14th October and expected date of delivery was 27th Oct. With all the excitement getting vanished i dint get any update from Flipkart or his courier partner about the progress or status of the package. On 28th i called FK customer care and giving full hope the delivery date was moved to 1st November. Dint hear anything till 1st Nov..I missed all happy moments which i thought i will enjoy with this mobile. Then i wrote mail to FK and got response saying i will get my mobile by 5th Novembr. Today 4th of November i see Mobile has been delivered on 26th October. How come FK is able to go to Past and deliver items? I dint receive my Phone and making the situation worse the status suddenly Poped up as Item delivere? Why FK is so ignorant with the delivery part? How can ur logistics can say the item has been delivered? This is first and last purchase with FK and i will suggest my friends to not to book anything with this cheating site. Thanks for making me to wait and giving this shock of item delivered and saying item dint deliver.",
            "date": "04 Nov 2014",
            "name": "Imran Basha",
            "stars": "1 star"
        },
        {
            "comment": "i had lost my money ....my new mobile phone got automatically switch off ...and no its not starting ...very bad quality.. never shop again from flipkart ...",
            "date": "04 Nov 2014",
            "name": "ASHUTOSH SINGH",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone with balanced configuration. The camera quality is okay. best thing is its a dual sim phone",
            "date": "04 Nov 2014",
            "name": "Sushant Tare",
            "stars": "5 stars"
        },
        {
            "comment": "I had a very good impression on Flipkart. Bec of their on-time shipping and the quality of the product. But i feel that nowadays Flipkart take long time similar to all other websites. :(",
            "date": "04 Nov 2014",
            "name": "Vishnu Shankar N",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome! mobile phone Great Display with Corning Gorilla Glass 3 Protection which is great Feels very Good in Hands Battery Life is very good.a full day battery backup with mixed usage I have played Asphalt 8,Gta 3,COD, Modern combat 5&4 and during gameplay there is no lag or no framedrop Touch is very responsive provides Very smooth android experience",
            "date": "04 Nov 2014",
            "name": "Yash Vashishtha",
            "stars": "5 stars"
        },
        {
            "comment": "I dont feel the need to write about the various Pro's that this phone has, as other members have already written about them. However, as has been rightly pointed out by many, the battery life is pathetic. Hence for that purpose, I have been experimenting about various steps that one can take to ensure satisfactory battery backup. Three things that worked for me: 1. Turn off 3G mode and use 2G, (if you are not a 3G user). 2. Turn off Location. (I saw this as a major contributor to battery life). 3. Turn off Google Now. Or for that matter turn off \"Google Now notifications\" only if you want to use \"OK GOOGLE\" feature. These three turn off's have made my life easier. And my battery life increased two-fold. Thumbs up if you find this useful and let everybody see it. Good Luck. (y)",
            "date": "04 Nov 2014",
            "name": "Junaid",
            "stars": "4 stars"
        },
        {
            "comment": "I was a fan of Motorola, been using Moto Defy XT535 and Moto Razr Droid since the time Motorola has come into the smartphone world, I recently purchased Moto G2 one for my dad's elder brother and one for my dad, after getting to know its just an evolutionary upgrade from G to G2 with minor hardware and software changes. I had seen Moto G 1st gen got to know its performance through friends and decided to take the 2nd gen for my dad, too bad the battery drains so fast even when days when absolutely no calls were made and no data transfer, i mean when WiFi and Mobile data were used occasionally. The battery is a big disappointment according to me. Although it has promised for the Lollipop upgrade must wait and see if it can help the battery backup on this device. A big zero for the battery for a tier1 brand like Moto to come up with this big disappointment in Moto G 2nd Gen",
            "date": "04 Nov 2014",
            "name": "Venkata Ravi C...",
            "stars": "3 stars"
        },
        {
            "comment": "Order ID (OD300944800440674700) Replaced the handset for Speaker problem, while speaking speaker give noisy sound in the background. Replaced handset also had the same problem.... and finally asked for the refund. seems that Motorola launched the phone in a hurry without proper testing of the product. Moreover Flipkart did not provide the pickup of the phone, i had to courier it to them. Expenses incurred will be reimbursed in to the user wallet, forcing me to make future purchases from Flipkart in order to get back the courier expenses incurred.",
            "date": "04 Nov 2014",
            "name": "Subrata Maji",
            "stars": "1 star"
        },
        {
            "comment": "Hi Guys, After the using this phone for about 2 days I am writing this review. The phone works extremely well and it never lags in any situation. The performance is outstanding; look wise it deserves 5 star; no game hangs on it; Camera quality is awesome; after comparing it with other phones at this price range it stands out to be the best. Guys believe me - its a must have at this price range. Overall rating 5 stars",
            "date": "04 Nov 2014",
            "name": "Prashant Shishodia",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product in lowest price.............................................................................................................................................................................",
            "date": "04 Nov 2014",
            "name": "Krishna kumar,...",
            "stars": "5 stars"
        },
        {
            "comment": "I has used MI3,MOTO E,IPHONE 4S,but this one grab my attention,looks sturdy,amazing performance,but battery drains quickly,expandeble memory option really good,fits in hands,so far no defects detected,black is awesome,but ordered a white one waiting for it.",
            "date": "04 Nov 2014",
            "name": "sundar rajan s...",
            "stars": "4 stars"
        },
        {
            "comment": "I have recently purchased this phone and found good prima facie. As soon as i started using this found two major issues- viz Battery back up and SD card slot. And the major issue is with the flipkart services. I received this product right 11th day from the date of purchase in Ahmedabad town. I will assign only 0 marks for the delivery services. Furthermore When tried to convey my grievance regarding the defects of this product to flipkart executive he simply put phone on hold every time. The battery back is not good as it does not last more than 10 hrs. The SD card slot is not working. I do not understand why flipkart is doing such nonsense by deputing such irresponsible excutive and selling defective product.",
            "date": "04 Nov 2014",
            "name": "kumar saurabh",
            "stars": "1 star"
        },
        {
            "comment": "Moto g 2nd generation is an average smartphone,but flipkart has made it look very bad by delivering defective products every time.I replaced my device twice but both the times i got a defective piece.Motorola has done a bad job by selecting only flipkart as their seller.There are other e commerce sites which are very good than this flipkart. Coming to the phone,it has many issues.The battery is very weak,The ear piece produces a cracking sound during calls,The mobile and the charger heats a lot,The mobile takes nearly 4 hrs to charge,The volume and power buttons are very loose,The ear phone provided is a piece of crap,The touch is not responsive,we can feel the issue with touch screen when we are typing a message(you can test the touch screen issue by keeping your mobile on a flat surface and then type some letters or numbers and try deleting them one by one,by continuously pressing the delete key). The available 400 mb ram falls short during multi tasking,Thinking about motorola service centers is a nightmare. The only good about this phone is that its going to get android L,nothing other than that. I don't know whether it was my bad luck to get defective pieces thrice,or was motorola responsible to ship defective pieces or is flipkart selling us defective and rejected phones. So think before you buy. And one more thing,The mobile comes in different variants some have a good screen,in some the screen is worst,with pink or reddish tint all over it.I have uploaded the images regarding display quality in moto g2 forum,you can check it.",
            "date": "04 Nov 2014",
            "name": "sasikanth",
            "stars": "1 star"
        },
        {
            "comment": "Product is very Good and its delivery is also awesome. Just on next day it was in my Hand. Nice Flipkart.",
            "date": "04 Nov 2014",
            "name": "Mayur Zade",
            "stars": "5 stars"
        },
        {
            "comment": "product is good but the only biggest cons is battery backup if used for internet or taking pictures or using any application battery drains 1% for 1 minute.",
            "date": "04 Nov 2014",
            "name": "Kotresh",
            "stars": "4 stars"
        },
        {
            "comment": "I had ordered the product on 20th October & due to Diwali holidays, flipkart gave 30th October as the expected date of delivery which is acceptable. They had shipped the product by E-com prepaid But it is 4th November today & I still have not received my order. I must have contacted the flipkart customer care around a dozen times & they lack commitment as well as info regarding the order placed. They are giving commitment of dates which have already passed. I also tried to get in touch with the E-com Prepaid guys but no one answers the damn phone. Now they have cancelled the shipment & are re-shipping the product. Hope it reaches me on time. It was meant to be a birthday gift for someone & now here I am having nothing to give as a present on the day because of flipkart & E-com Prepaid. I am just sharing my experience with flipkart & e-com prepaid so that you can be aware about it before ordering your MOTO G. Please note that I have a similar make & model already purchased from flipkart a month back & the phone is value for money but the site you're buying it from lacks the ability to value its customers.",
            "date": "04 Nov 2014",
            "name": "AMIT PATWARDHAN",
            "stars": "1 star"
        },
        {
            "comment": "when i bought this , sim is not reading, i paid 200 rupees for same day delivery. But it seems like i have to wait another 1 week to get a replacement.",
            "date": "04 Nov 2014",
            "name": "kaushik shankar",
            "stars": "1 star"
        },
        {
            "comment": "Excellent...i was little scepticle when i had placed the order for it and did not get the delivery.Somehow i placed the order again after Diwali..and i am totally satisfied by the gadget that i recieved.Its really good.Using Moto-brand for the first time..No doubt Moto-G is quite smart in looks and features. Every thing was intact as displayed on flipkart but i wish data-cable could have made this package absolutely complete.(Data -cable should also be provided).",
            "date": "04 Nov 2014",
            "name": "Sunita Seth",
            "stars": "5 stars"
        },
        {
            "comment": "Before I start to review it, I wants to say something about Flipkart's delivery service. It was a horrible and nightmarish experience, So a suggestion, if you are paying 13K, you can certainly pay another Rs 90 for a \"in-a-day\" delivery (if it's available in your pincode). Go for the fast delivery. Don't choose free delivery, it's horrible and terrifying. Now I come to the Review of MOTO G (2nd Gen). I got this phone on 31st october 2014 morning. I'm using this device for 4 days now, so got a decent idea about this phone. >>PROS: 1. GORILLA GLASS 3 Protection. Even Grand 2 don't have this. 2. Water Resistance coating, you can use this phone even in rain. I tested water, It's superbly Water resistant. 3. Android 4.4.4 with guaranteed update to Android L. This mean, you'll have latest android. 4. Excellent HD screen with superb brightness, you can do your work even in sunlight. Just turn the Auto Brightness On. 5. Dual Stereo front speakers are decent. 6. Camera quality is EXCELLENT. I mean it. Superb and fine Pictures are taken from Moto G's default Camera App. Even you can increase it's performance via downloading some awesome camera app from Play Store. 7. Graphic quality and GPU works very fine. Pretty decent experience with gaming and heavy HD gaming. 8. 1GB RAM is good enough for your work. 9. 16 GB Internal storage with 12.3GB of Free space! That is brilliant! 10. I really haven't tested WiFi yet, so can't tell anything about it. 11. Pure Android experience is a big plus. 12. Build quality of Moto G is one of the finest you'll find. 13. Customer care of Motorola is surprisingly awesome. Their Cust. service website's LIve Chat system is Superb! You can solve any of ur problem instantly there! It's a Big Big Help for your any Motorola smartphones. 14. Well, It covers almost all of my needs and hopefully yours also if you have a budget of under 20K. Trust me, I did a long and detailed research about smartphones of Under 20K range, and this is an excellent device to buy! >>> CONS:: 1. Sadly, like EVERY other phone, it has some disadvantages as well, 1st of all id BATTERY. Moto G (2nd Gen) has a bettery of 2070 mAh. Battery drains out pretty fast while you use data connection little bit. while downloading, if you play games, it'll be drains out battery extremely fast. It's very Hard to keep the phone on in a single full charge for 24 Hours. Its Impossible really. Max battery can last 16-18 hours with very moderate use. If you use more than that, you have to charge atleast for a hour to keep it on. So twice charging in a day is must even in a brand new phone! But Charging to 100% don't take too long. Even you can charge it fast by buying a powerfull power bank or anything like that. 2. Quality of headphone is very poor. I suggest, buy a good headset to have a excellent music experience. 3. Moto G 2nd Gen DON\"T HAVE a USB data cable to connect it with PC. So you have to buy it again. It's really sad. 4. Keep the brightness to very low to save battery. Unless its cost too much battery which you can't afford. But With this low brightness, you can do everything superbly. Now, as you can see, Moto G has almost everything to fulfill your demand, but it lacks a strong battery power. But If you use it smartly, and there are several apps in play store to save battery life, which are quite useful, it'll last enough long to serve you. and, Go for official Moto G Shells from Flipkart, yes, it's costly, but It add a brilliant looks and suparb grips to the phone. So I strongly suggests, Use original Moto G shells, it's very very good! Final word: Thumbs Up! You can go for it!",
            "date": "04 Nov 2014",
            "name": "Aritra nag",
            "stars": "4 stars"
        },
        {
            "comment": "Hi Folks & Readers Its a good phone and awesome working with provided features. For Folks/Note: Handset become unresponsive while taking continous pics in hot atmosphere(on normal hot sunny day) Is there chance of replacement? Android L is launched in market from today...so when is MOTO G 2nd Gen getting updates of Android L.",
            "date": "04 Nov 2014",
            "name": "Nishat",
            "stars": "4 stars"
        },
        {
            "comment": "the mobile looking was nice, rear and front camera was good quality , charger was more heat during the charge the mobile, please care while charging , i request the delear to solve the problem and make the mobile good, the net acess was not much speed, , the audion was little bit onle, the internal memory was 12.975GB only instead of 16GB, remainning was internal applications. the inbuilt applications were not enough in smart phone and battery was not long lasting using limited applications also , please improve the battery backup life",
            "date": "04 Nov 2014",
            "name": "GUMASA RAVI",
            "stars": "3 stars"
        },
        {
            "comment": "price is reasonable for the features it have, but the earphones are not very standard. battery backup is good. camera clarity is excellent. music output from speakers is awesome.",
            "date": "04 Nov 2014",
            "name": "kranthi kommar...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this phone on 4-5th day after launch... i have used phones of other major brands too, like samsung, micromax, sony,.. but i found this as best fit phone in my budget... i'm surprised to see some people commenting negative about phone, but till now i do not have any issue with this phone and it works excellent... I'll highly recommend this phone to people... This phone have much better build quality and speed as compared to any of the samsung phone upto 20k price range... this phone have great specifications and features which i'm going to mention below... Display, Processor and OS The New Moto G (2nd gen) arrives with a 5-inch IPS multi-touch display that provides sharp visual experience with a resolution of 720 x 1,280 pixels (HD). The Corning Gorilla Glass 3 protected touch responsive display enables you to make transitions between screens, edit photos or access apps at the expense of crisp touches. At the heart of the smartphone, you can find the same 1.2GHz Qualcomm Snapdragon 400 quad-core processor functioning in combination with 1GB of RAM to deliver seamless and fast performance with anything you throw at it. It comes preloaded with the stock version of the recently launched Android v4.4.2 KitKat OS. Also in few days probably in mid of nov. 14 this phone will get android L... Camera and Storage The New Moto G (2nd gen) is armed with an excellent 8MP snapper at the rear end which is far better than the 5MP camera available in the outgoing model Moto G. It comes with an LED flash and accompanied by a 2MP shooter above the display. The on board storage capacity of the smartphone is 16GB, which is further expandable by 32GB using a micro SD card. Phone supports OTG also for accessing pendrives and other storage devices.. And works excellent...(u can get a OTG from any phone shop at 50-60 bucks) Battery and Connectivity The New Moto G is furnished with the regular connectivity features like 3G, dual SIM slots, Wi-Fi, Bluetooth, GPS and USB port. For running the show for a decent amount of time, the smartphone relies on a 2,070mAh li-ion bbatter which runs phone approximatly for whole day. About 19-20hrs of battery backup on 2g.. I used to charge it during night and use it whole day. Cons. Charger is poor, takes too much to charge phone... Approx 4 hrs from 5% to 100%.. Internet surfing is quite decent and smooth. Phone supports both micro sims. Build quality Excellent build quality and really looks great on hands. Back is mat finish with finger print resistance and front part have gorilla glass 3 which is amazingly hard to withstand almost every harsh condition. Phone is splash resistant and repel water coming over it.. Great phone at this price range... Go for it... Have a good day..",
            "date": "04 Nov 2014",
            "name": "RAVIKANT SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "Firstly I was hesitant to go for buying Moto G2 reading some of the reviews. Later one of my friend bought him. I checked it out and the same day I ordered one. 1) Super delivery...... just 2.5 days to soon to early. 2) 8 MP is 8 MP... not like others promising 8 mp and clarity is not even 5MP 3) Battery.. 5 star to the battery. but The charger heats up. Same issue pertains with moto g and E 4) Processor is awesome. Android 4.4.4 Rocks. no issues with the ram. I even played fifa 14 in it. 5) Speakers are loud and clear. 6) Touch is awesome and royal. Thus I conclude that Moto G2 is a superb pick keeping in mind that u are upgrading your self i.e. after using a low budget cell around 6 - 9k. Wont recommend this phone to all those who were earlier using cells arnd 25-30k. they will never like it. Best cell at its price.",
            "date": "04 Nov 2014",
            "name": "Nitesh Shinde",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart delivered this product within 2 days. I am expecting this kind of fast service from Flipkart and Product is value for money 1 GB Ram, 5 Inch screen and 16 GB Memory. Great product.",
            "date": "04 Nov 2014",
            "name": "Vivek Chaudhary",
            "stars": "5 stars"
        },
        {
            "comment": "Best dealer and quality of the product supplied is original and upto the mark and hope to be in deal with u againg in future",
            "date": "03 Nov 2014",
            "name": "Prerna Dugar",
            "stars": "5 stars"
        },
        {
            "comment": "Packing was good i took this mobile on Bilion day Day exchange Offer .. But not as per my expectation Battery backup is poor hardly not even one day and loud speaker quality is bad..",
            "date": "03 Nov 2014",
            "name": "Kushal Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, Firstly I will start with its positive points:- • Best Android phone at this price only on Flipkart. • Best Delivery before its delivery time and excellent packaging. Now let’s start some of its negative points:- • The rear camera glass is having spots and minor scratches. • The Camera stopped responding 3-4 times in a day. Then I have to restart the phone. • Camera Auto Focus feature hang the phone, due to which phone need to be restarted • Unable to apply Google Drive 50GB offer. • After that Flipkart arranged the Replacement. But after replacement I found another issue in new one and that was; • SIM 2 Slot is having some internal defect:- If I want to insert micro SIM into slot number 2 then the SIM lock mechanism will not hold the micro SIM until I try to insert it again and again for 15 – 20 times. The same SIM is getting insert only in one time into slot number 1. Even tried to replace the micro SIM but the problem with SIM slot number 2 is same. Note: - Flipkart provided the best support to resolve all problems but these are the manufacturing defects. Flipkart delivered the manufacture sealed product both times, so how can anybody know about these issue before using the product. Motorola must ensure the quality of their products than the sale quantity and Flipkart must escalate these issues to Motorola quality check team.",
            "date": "03 Nov 2014",
            "name": "Rahul Malhotra",
            "stars": "2 stars"
        },
        {
            "comment": "The Features of this Phone is good overall but it lacks in certain points 1-Camera-The Camera works well in dark light as well so thats good.But it could have been a notch better.Also the camera is not that compatible with Apps like Whatsapp.It gets stuck and not easy to send images then. 2-Battery-The battery gets drained very fast and passing even a day without charge becomes tough. 3-Sound-The Sound effect with Speakers is good overall.But the Voice clarity needs to be even more polished. Overall the Phone just about meets expectations but could have been better.",
            "date": "03 Nov 2014",
            "name": "nikshith ananth",
            "stars": "2 stars"
        },
        {
            "comment": "Touch is very good. No Lag while using multiple application. Camera Good. Though 8MP but not as good as Samsung Grand. Battery life is Good. Looks is fantastic.",
            "date": "03 Nov 2014",
            "name": "Abhisek Banerjee",
            "stars": "4 stars"
        },
        {
            "comment": "this is the best phone in this price range. i got it for 11750 from flipkart. i m in love wid this phone. i feel as if m using 22-25k phone.very nice camera quality. well i m aselfie n i love dis phone. motorolla has really done a great work. but ..only problem is...sometimes when i click a photo and slide back to see the pic some flash comes on my screen and den d picture is displayed. well i dun knw wots dat.",
            "date": "03 Nov 2014",
            "name": "ritu Raj Surya...",
            "stars": "5 stars"
        },
        {
            "comment": "well I bought this phone during the SBI card offer and got a 10% discount so got this phone for 11750 which was a steal for me. Overall the phone is awesome. Had been using it for a week and no complaints, best in this price range",
            "date": "03 Nov 2014",
            "name": "Anubhav Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is cheating by taking extra money to deliver in-a-day guarantee. They have failed to deliver my product 3 times. This is worst service. This is worst than any other website.",
            "date": "03 Nov 2014",
            "name": "Jayachandra DN",
            "stars": "1 star"
        },
        {
            "comment": "Awesome mobile, all features given in the site was perfect match, worth buying a mobile in this cheap price with best specification. And abt filpkart really express delivery with on time updates from the time we book till the item was received, gud packing working in perfect condition, just feel tht the headset of moto can be better but we cant expect more thn this with this price really a gud mobile for any kind of users. Love shopping with Flipkart..",
            "date": "03 Nov 2014",
            "name": "Arun Balaji PM",
            "stars": "5 stars"
        },
        {
            "comment": "Thanx flipkart... I got the phone in just 3 days ... Now about the phone, One of the best 8 mp camera ... best display experience ...",
            "date": "03 Nov 2014",
            "name": "Syamlal CM",
            "stars": "4 stars"
        },
        {
            "comment": "Provide a relevant, unbiased overview of the product. Readers are interested in the pros and the cons of the product. Be yourself, be informative Let your personality shine through, but it's equally important to provide facts to back up your opinion. Get your facts right! Nothing is worse than inaccurate information. If you're not really sure, research always helps.",
            "date": "03 Nov 2014",
            "name": "hari",
            "stars": "2 stars"
        },
        {
            "comment": "got it yesterday from flipkart....my review for 1st look of cell....it is great phone look wise.great to hold in hand.the camera is nice and good feature. thnaks moto",
            "date": "03 Nov 2014",
            "name": "GAUTAM BOGHARA",
            "stars": "5 stars"
        },
        {
            "comment": "It is good phone by moto as compared with other phones. because moto g contains hardware of google and also software of google. so it gives superb result in graphics or in processing. go buy for this. :)",
            "date": "03 Nov 2014",
            "name": "Harsh Khandelwal",
            "stars": "5 stars"
        },
        {
            "comment": "The phone works without lags with the superb processor it has. Speaking about the display, having ppi (294) the display is also good.and plays HD videos with ease. The camera takes clear images with its 8mp camera, .only i didn't like the pre-installed camera app. later i downloaded Google Camera app from play store which is better than the app that comes with the phone . The front speakers are loud and clear . Battery-the major drawback with this phone with 3G surfing you could go for about 6-8 hours while playing games for about half an hour the device heats up too much . The wall charging unit provided by Moto is heating like anything. Conclusion -happy with overall performance only drawback is its battery and heating .",
            "date": "03 Nov 2014",
            "name": "Rajat Halarnekar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is great. The best in this price range. Many Samsung phones upto Rs 20000 cannot beat this phone. Go for it without any hesitation.",
            "date": "03 Nov 2014",
            "name": "Pallavi Datey",
            "stars": "5 stars"
        },
        {
            "comment": "I am ordering Moto G 2nd Gen 2014 on 17 Oct. with make payment trough SBI Card . Flipkart give estimate delivery Date 5 Nov. my Shipment reach First Flight Nearest hub Ambikapur on27 Oct. then First Flight Return my Shipment to Origin says \"No Field Station\". i quickly contact Flipkart care they say me your order is canceled due to technical error. i can't Expect like this From India's Biggest Online mega store. then i receive an Email form Flipkart regard \" We sincerely apologize for the inconvenience this may have caused you\". What you Say ? my Dhanteras porches wash out. And also says if you interested Moto G 2nd Gen Then Reorder it, i Want to know that Flipkart Still Offer me 1250rs Cash Back. for their Fault.",
            "date": "03 Nov 2014",
            "name": "MANGAL SAI",
            "stars": "4 stars"
        },
        {
            "comment": "Very nice phone at 13k. Good battery life , grt screen display, never hangs up, sound and signal quality is superb , camera is good in both indoor and outdoor.",
            "date": "03 Nov 2014",
            "name": "Sandipan Nag",
            "stars": "5 stars"
        },
        {
            "comment": "Its a very good phone considering its price, had no issues till now. Good performance, hardly had any lags, games also run fine no issues whatsoever Just want to say that battery isn't great on this device but am fully satisfied with the phone. Best part is that this device will be getting android updates earlier than other heavyweight android OEM's like Samsung and HTC. Good job Moto!!",
            "date": "03 Nov 2014",
            "name": "Diptesh Suryaw...",
            "stars": "4 stars"
        },
        {
            "comment": "I BROUGHT MOTO G 2ND GENERATION MOBILE 2 MONTH BACK.THE CHARGER OF THIS MOBILE WORK PROPERLY FOR 15 DAYS ONLY . AFTER THIS PERIOD THE CHARGER NOT WORK PROPERLY .AFTER CONNECTING THIS TO THE MOBILE THE MOBILE SET HANGS .",
            "date": "03 Nov 2014",
            "name": "ajay gupta",
            "stars": "2 stars"
        },
        {
            "comment": "I am happy with mobile, But the Airtel Offer Listed in the page is fake. It was already 15 days i purchased mobile, still Flipkart is not responding. Airtel Customer Care guy said, They don't have any tie-up with Motorola/Flipkart. Apart from this mobile is Good.",
            "date": "03 Nov 2014",
            "name": "Kartheek Sunkara",
            "stars": "2 stars"
        },
        {
            "comment": "The phone is value for money. Amazing speed, camera and other features. A few things that needs to be changed in the product are - Headphones are not of good quality as compared to the ones which come with Samsung phones. - Quality of sound not so good with the headphones given along with the product, the same performs good with other ones. - Did not like the inbuilt FM App. Overall good product, value for money. Flipkart delievery was pathetic and it was delayed by 9 days.",
            "date": "03 Nov 2014",
            "name": "Abhishek Shakure",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone for my dad. Its a wonderful phone , i guess the best at this price right now. The android OS is also kind of similar the plain vanilla one on Nexus , hence its smooth and responsive. And transferring the contacts from my dads old Nokia 2960 to the phone was a breeze with the built in Motorola transfer app. And i placed the order at 8PM one night, and Flipkart delivered it to me the next day afternoon, what more can u ask for. Overall we are extremely satisfied with the purchase.",
            "date": "03 Nov 2014",
            "name": "Pradeep K.A",
            "stars": "5 stars"
        },
        {
            "comment": "Guys, Please do not trust Flipkart service. All are cheaters. I have ordered Moto G 2nd Gen on 21st Dec 2014 and cancelled it as it was with EMI. So I have placed the same order again on the same day for without EMI. Got the product on 24th it self. But the twist is here on 3rd Nov I have got the cancelled product delivered to me, where as the request got cancelled and the customer care said the product also has been received with in 2 days to them. I wondered today, when I received the product. It was in the process if giving the money back to me. I was waiting for a long time for the refund of money as they asked 8 business days. When I called them today they are telling that they will need 3 more days for pick up the product and another 8 days for processing. Are they thing I am a fool. Now Bank is asking me to pay for both the transaction. Really I got mad because of Flipkart and running behind them on call. No proper service as well.",
            "date": "03 Nov 2014",
            "name": "Sandeep Patro",
            "stars": "1 star"
        },
        {
            "comment": "i got this phone for my sister, it has all the qualities of a good phone, some shortcomings of previous generation device are addressed in this update, the build quality is good, but as it is exclusive to Flipkart there is no bargain for it, but kudos to flipkart for keeping the price resonable.",
            "date": "03 Nov 2014",
            "name": "shahbaaz rasheed",
            "stars": "5 stars"
        },
        {
            "comment": "Ordered this phone during the \"Big Billion Day\" sale but when recieved I realised that its a 1st Gen phone in the box of 2nd Gen. When I registered the complaint with Flipkart on 23rd Oct,14, they assured me that they will get back to me within 3 days. But they didnt and extend the time required after every 2nd day, still yet to get the replacement. Their product specialist was supposed to call me to crosscheck the phone on 31st Oct,14, but no response yet. This is really frustrating as I have never expected this kind of service from Flipkart..........",
            "date": "03 Nov 2014",
            "name": "Shyam Tidke",
            "stars": "1 star"
        },
        {
            "comment": "The charger came along with MOTO G 2nd gen is extremely slow, it takes almost 4 to 4.5 hrs to charge the phone completely, once i used samsung's galaxy pocket duos charger and it charges the battery from 8% to 75 % within 45 to 55 min. MOtorola should think about it and need to change the chargers. Overalll phone is very very good the only problem is it take 4+ hrs to get charged completely using moto g 2nd g charger",
            "date": "03 Nov 2014",
            "name": "Parvez Alam",
            "stars": "3 stars"
        },
        {
            "comment": "Whoa ! That was my first reaction when I took the thing in my hands ! I have had this for the past 2 weeks, and it has in no way dissapointed me. Going by the price this seems to be the best smartphone running android in the market right now The interface is super smooth and lag free, pure android experience adds to the joy. Music quality is mind blowing. The camera is also good, image quality far improved from the 1st gen And 5 \" screen is what makes it a joy to look at. Add to it the sleek looks of the device, and you won't regret buying this piece of tech. And yes, I ve owned a lot of smart phones. This is by far the best.",
            "date": "03 Nov 2014",
            "name": "Archya Sengupta",
            "stars": "5 stars"
        },
        {
            "comment": "This is a phone i bought recently. One of the best phones in this price range and awesome graphics support being supported on the phone. Motorola has increased the internal memory space and also provided a bigger screen compared to generation one which enables better experience during gaming. The phone also has a faster GUI which displays the efficiency of the processor inside. Overall a very good product from Motorola and fast service from Flipkart.",
            "date": "03 Nov 2014",
            "name": "Sandeep Nayak",
            "stars": "5 stars"
        },
        {
            "comment": "waste of money waste of time not reached my expectations bad interface worst performance biggest failure in moto g version plz don't buy still its asking for rating what a foolishness its not worth value to give rating -00000",
            "date": "03 Nov 2014",
            "name": "V.s.srinivas s...",
            "stars": "1 star"
        },
        {
            "comment": "It was one of the wisest decisions I took in my life to buy this awesome product. Not pricey, matches my requirements and works perfectly well :)",
            "date": "03 Nov 2014",
            "name": "Arunanand TA",
            "stars": "4 stars"
        },
        {
            "comment": "I simply am in love with this.. fantastic camera, great looks.. only issue is that the speed sometime is less but overall a good phone",
            "date": "03 Nov 2014",
            "name": "Venkatesh Gourav",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered the MOTO G2 phone in the night at about 12.30 on 31/10, I got the confirmation within 20 mins. And I received the phone on 02/01. Nice fast delivery. I was willing to give gift to my cousin so I selected this nice phone and ordered. MOTO G2 Phone is very nice phone. Value for money. I don't know much about phone as it was the gift for my bro. But I can say service of flipkart is very good. Thank you FLIPKART",
            "date": "03 Nov 2014",
            "name": "Milan Budhabhatti",
            "stars": "5 stars"
        },
        {
            "comment": "i ordered this phone from flipkart and must say their delivery is very prompt, i received the product in two days, everything was perfect until i saw the front camera, it was showing some weird image in blue/green colours... seems like the front camera was damaged. its very bad to receive such product from flipkart. hope i get the replacement soon. rest all the phone is perfect, for phone i will give 5 stars. wonderful feel and smooth transition and it never gets stuck. superb phone!!!",
            "date": "03 Nov 2014",
            "name": "Apoorva Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "Faulty Piece - Black Screen I received this piece with-in 7 days of ordering on thE 29 OCTt. The first problems crept in with-in 7-8 hours of receipt. The display screen first had some random lines and with-in a few seconds I got a black screen. After 30-40 minutes, I was able to power it on again. I used it for 15-20 minutes and the same sequence repeated. This happened around 4 times already. The most annoying fact is that even a few minutes Quality checks would have identified this problem.",
            "date": "03 Nov 2014",
            "name": "sahil",
            "stars": "1 star"
        },
        {
            "comment": "Keyboard will be visible and invisible alternate itself at a time entering any values in mobile chrome browser/any from mobile keyboard If we are talking on phone with someone after some display light will off but not will on itself if u want to see call times again during call-Sensor issue Cellphone box was not sealed Unable to receive call via headphone and radio will start When I pick call through mobile if I used headphone for talking after sometime call will disconnect itself. Incoming call voice is not clear. I think speakers issue. No call record option on call I m not getting battery backup",
            "date": "03 Nov 2014",
            "name": "Jaivir Singh",
            "stars": "1 star"
        },
        {
            "comment": "GOOD PHONE WITH IN BUDGET, IT'S MONEY WORTH PRODUCT, GOOD CAMERA FEATURES, COMPARE TO OTHER BRAND S THIS PHONE AWESOME AND WITH IN BUDGET, I SUGGEST GO FOR THIS PHONE............. IF YOU WANTS TO USE ROUGH AND TOUGH BETTER USE MOTOROLA FLIP SHELL COVER AND ENJOY PHONE ROUGH AND TOUGH THANK S TO FLIPKART",
            "date": "03 Nov 2014",
            "name": "Praveenkumar M...",
            "stars": "5 stars"
        },
        {
            "comment": "Be aware of manufacturing defects: First I thank Flipkart for there excellent customer support. But, I'm not satisfied with the brand Motorola because I replaced my phone two times. 1st replacement is for defective top speaker. 2nd replacement is for not receiving latest update and a damaged pixel. Battery: 1. After a week usage found that average screen time (phone usage time) is 5 Hours and 30 minutes only which is really terrible. 2. It will take at least 3 Hours and 40 minutes to charge from 1% to 100%. Now I feel like its again a defective piece that I got. Accessories recommendation: 1. Noise Back Cover for Moto G (2nd Gen). 2. Do not buy cheap Tempered glass because it will affect touch sensitivity. Design: * It feels and looks like a premium phone. * But when it comes to its physical size Moto G 1st gen feels compact. * Feels bit heavier. Features: * Simple and beautiful launcher UI which better than Moto G 1st gen. * After updating to System version 21.11.23 we will get \"Ok Google\" support. * It is one of the few phones which will get Android L upgrade. Performance: * Pictures taken with LED flash and artificial lighting are good. * Front camera lags always. * After installing \"clean master\" with enabled real time protection battery like is OK for normal use otherwise it is worst. But I hope it will be fixed in Android L upgrade. * It takes 3hrs to charge from 1% to 100% with the given adapter. * WiFi connectivity is not so good its almost like that we have to sit in the same room where the WiFi router is installed. * Great GPS and GLONASS connectivity(Good navigation system).",
            "date": "03 Nov 2014",
            "name": "Balakrishnan",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G2: Excellent phone with great look. Front screen have dynamic look with great sound effect. Touch is also good. Overall gr8 product at this price. Flipkart: What can I say other then Excellence. Satisfied with the service.",
            "date": "03 Nov 2014",
            "name": "Mehul Javia",
            "stars": "5 stars"
        },
        {
            "comment": "I had purchased Moto G2 Gen from Flipkart on 06.309.2014. It worked ok for 1 month and the problem started then its touch was not working. Flipkart said 1 month was done and I had to go to Moto service center. I gave my mobile at service center they repaired and still touch was not working. I had to give it back to service center. And I could not also avail offer for flip cover & cases and flipkart did not solve my issue",
            "date": "03 Nov 2014",
            "name": "VS Naveen Jaya...",
            "stars": "1 star"
        },
        {
            "comment": "product is excellent but earphone is very BAD....................................................................................................................",
            "date": "03 Nov 2014",
            "name": "KARNA HM",
            "stars": "4 stars"
        },
        {
            "comment": "i purchased this phone only reason is that to get regular update there are so many negative points in this phone it dont record full hd videos also it has very less mah battery which drains pretty first after playing some high end games and heats up too much which is unbearable at times",
            "date": "03 Nov 2014",
            "name": "Saptarshi Paul Ch...",
            "stars": "4 stars"
        },
        {
            "comment": "Super phone !!!!! With super specs for the pricing I would give it 10 / 10. Surely I would recommend the phone for anyone who has a budget of 10 - 15 K. Thanks Flip-kart and Moto G for the awesome product.",
            "date": "03 Nov 2014",
            "name": "Deepak Sugumaran",
            "stars": "5 stars"
        },
        {
            "comment": "- Simply awesome product from Motorola - Touch response is buttery smooth - Processor performance brilliant - Camera quality is great - Vibrant screen colours - Solid built Overall: Just go for it, Best budget smartphone in the market right now.",
            "date": "03 Nov 2014",
            "name": "Sumit Boaz",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is Absolutely Awesome !!! Best Phone within the Budget Range. Pros : 1. Sound is Good. 2. Display is Perfect. 3. Easy to Use Cons : Battery Backup. Anyways, a good product by Motorola... Moto G2 Gen ROCKS !!!",
            "date": "03 Nov 2014",
            "name": "Arun Kumar R",
            "stars": "5 stars"
        },
        {
            "comment": "Having used moto G 1st edition and currently using this latest edition, I am a true moto loyalist! The built quality of the phone is superb. The specifications are more than sufficient for a normal user. Firstly if you use your phone a lot of phone calls and emails, I would only recommend this phone. The quality of the phone is very important. Mi3 lacks this big time. The phone does heat up eventually! Secondly moto g shape is amazing. It fits in your hand & pockets easily thanks to its design. Mi3 is straight and usually it does fall out. Mi3 has a much better screen but its not that big a factor! Pros: Brilliant design and built quality. Very user friendly Amazing after sales service Output on headphones is superb! Doesn't hang/lag at all!! (Irrespective of ram size) Made for business use Cons: Camera is strictly OK Not great for experimentation like if you are a developer! USB cable is not included! Go ahead and buy it. U won't regret!",
            "date": "03 Nov 2014",
            "name": "Yashveer Jain",
            "stars": "5 stars"
        },
        {
            "comment": "First of all a word for Flipkart's delivery:\"Poor\" and believe me poor is a kind word in my scenario. It took them 12 days to deliver from bangalore to bangalore. Now coming to device ,I am posting this review after using for 2 weeks. Looks of Device is Good,Though i didn't like those front facing speakers look wise,they look better in previous version.Display is bright enough and touch is crispy. Pros: Good Performance Decent Camera Display Quality Good Cons: Battery Life is not good(giving me 12-14 hours on average uses on 3G network) I didn't like look of front Speakers (Looks cheap to me) though its my personal opinion.",
            "date": "03 Nov 2014",
            "name": "Aditya Bajaj",
            "stars": "4 stars"
        },
        {
            "comment": "Review on 12999 Spent - Built Quality: A strong body with fine edges and a sexy curve, like you are holding a beautiful girl in your hand. Screen: Bright and colorful with awesome viewing angles and a screen to fall in love with. Sound: This what I loved the most, two front facing speakers - Loud & Crisp quality. Camera: A necessary upgrade from last years Moto G, now with 8MP and a quality to be cherished and a breathtaking Slow motion video capturing. Front also serves a decent quality. Battery: Though the same size battery should be a drawback, but it serves more than what one can think. It last for more than 30 hours. To sum up, It is Magical to hold a Moto G2 as it is Sexy, beautiful and bold. Proud owner of a MOTO. :)",
            "date": "02 Nov 2014",
            "name": "Ranveer Singh Sis...",
            "stars": "5 stars"
        },
        {
            "comment": "sound quality great (speakers) touch perfect gorilla glass is awesome camera is great in starting it will heat while charging.. but dont worry after few days of use it become normal head phone sound is not good battry life is ok ok",
            "date": "02 Nov 2014",
            "name": "meghana singh",
            "stars": "4 stars"
        },
        {
            "comment": "it is gud in all aspects but the battery backup was not up to the mark ...?im unhappy with the battery backup..",
            "date": "02 Nov 2014",
            "name": "Amrutham Sandeep",
            "stars": "1 star"
        },
        {
            "comment": "Iam using this product last 1.5 months every thing is fine but have some some problem when change the internt from 1 sim to another it shows RED TRIANGLE shape in the network signs...for few minutes , HEATING PROBLEM , SOMETIMES FLASH OF THE CAMERA DIDNT OFF I HAVE TO SWITCH OFF THE PHONE BUT STILL FLASH IS ON...THEN AGAIN I HAVE TO START A CAMERA THEN THE FLASH IS OFF",
            "date": "02 Nov 2014",
            "name": "RAKESH KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "1. NICE CAMERA QUALITY 2. OUT STANDING DISPLAY 3. AWESOME RESOLUTION 4. GOOD SOUND QUALITY ONLY TWO LIMITATIONS... :'( 1. NOT A GOOD QUALITY OF EAR PHONE 2. NO USB CABLE GIVEN",
            "date": "02 Nov 2014",
            "name": "KASHYAP PATNAIK",
            "stars": "5 stars"
        },
        {
            "comment": "I got my moto G2nd Gen on 9th September. After using 7 or 8 days, unfortunately i had bad experience regarding the sound. Others can't hear me while calling.. this happened three or four times so far.So i am Requested to Flipkart Kindly Replaced my Mobile set.",
            "date": "02 Nov 2014",
            "name": "SANJAY KUMAR D...",
            "stars": "1 star"
        },
        {
            "comment": "Nothing negative to wright about this phone, everything is fantastic. Love the camera quality, and battery life with good touch screen.",
            "date": "02 Nov 2014",
            "name": "Yuvraj Patel",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 phone very good for this price but calculator gives wrong trigonometry results i think motorola load good calculator in future",
            "date": "02 Nov 2014",
            "name": "kottapalli sushma",
            "stars": "5 stars"
        },
        {
            "comment": "Hello All, I have purchased this mobile on big billion day and after a use of 2/3 week i just wanted to share fes things which may be useful for other buyers 1) The most annoyed thing for me is that the mobile gets heated up exceptionally high. You are not able to speak continiously for more than 15/20 mins. It is not bearable near your ear. so think twice before investing in this phone The reply from flipkart to this complaint was more annoyed. As per flipkart this is normal and it is not a defect. 2) The 3.5 mm jack is not working with all the headphones. I tried with my last nokia headphones and it is not working Again the answer for the same was more annoyed. Flipkar conveyed me that it is recommended that you should only use motoroal headset. I dont know if flipkart and motorola really had any engineers with with them to convey the meaning of standardisation. The bottom line moto g has their exclusive 3.5 mm jack and if it works with other headphones then you are really lucky 3) On playing video or recording vidieos it heats up exceptionally. Again flipkart says it is normal.. and you will not get any replacement. Please beware of purchasing on discount as you may get substandard mobiles",
            "date": "02 Nov 2014",
            "name": "Aks Soundenkar",
            "stars": "1 star"
        },
        {
            "comment": "just got my moto g....some says it have lower resolution than previous edition,some says its speakers tear at full volume..........\"people,get a life\" .before starting i wna tell that previously i owned a LG Optimus L9 coming to the phone .......awesome phone nd awesome price really..! those who have reviewed it negatively may have been shipped a faulty piece,may be display is sharp nd good nd as good as moto g 1st gen.....looks awesome with a antiglare screen gaurd :) i wanna clear the stereo speakers are awesome.....some says they crack a bit at full volume...bt actually any mobile speaker can crack at full volume... the speakers are loud enough even at 50-60 % nd they dont crack untill its v v high volume.......yes they crack a bit at full bt who listen songs at tht loud sound...may be some people do that,for those i have suggestion buy a subwoofer system instead :p....still i would say motorolla could have set the full volume at 60-70% of the full volume now so that people couldnt have got a chance to critisize.......",
            "date": "02 Nov 2014",
            "name": "Vijay Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "PROS: The screen size is a plus. The battery stays all day with you. Not at all lagging. Camera is decent enough. Touch is great. Speaker output is commendable as compared to HTC phones. Boy design is really great. CONS: The headphones provided are not at all upto the mark.Instead buy the hawkers headphones,they might be better than the provided ones. The battery really takes too long to charge fully but its ok. N finally my take on it is do buy it and worthy phone coz ITNE PAISE MAIN ITNA ECH MILEGA!!!",
            "date": "02 Nov 2014",
            "name": "Harsh Shah",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this moto g 2nd gen from 1 month. Feeling Battery backup is not good even i have removed many apps from phone. But is giving only 4 hours screen time. Feeling Worst Battery backup.",
            "date": "02 Nov 2014",
            "name": "Midhun",
            "stars": "1 star"
        },
        {
            "comment": "+ves Very good display. 2 to 3 day battery backup while normal use. loud speakers. fast processor. camera clarity good. good gps,wifi reception. -ves camera flash poor. ear speakers average.",
            "date": "02 Nov 2014",
            "name": "Emil Zacharia",
            "stars": "5 stars"
        },
        {
            "comment": "Thnx to flipkart for faster delivery. I was analyzing this moto g 2nd gen wid other phones for last two months so that my investment will be worthy. Seriously guys, just go for it without any hesitation. Only one drawback is battery gets 3-4 hours to charge completely and drains somewat fastly than moto g 1st version. Overall its awesome.",
            "date": "02 Nov 2014",
            "name": "MD SHAKIR",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered a white G. Flipkart sent a black unit. Requested a return and received text messages saying someone would call me to \"APPROVE\" the return request. Never received a call. Called in and the CSR was unhelpful. Just received an email saying the return request was rejected. Flipkart has sent me the wrong product for 2 out of my last 3 orders. The last order they sent me the wrong product twice and I finally had to cancel the order. This is a great phone but buy it elsewhere even if you pay more for it. Flipkart's awful service and customer support is not worth the hassle",
            "date": "02 Nov 2014",
            "name": "Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone and to top it, I got it on the Billion Day sale at a very good price. the phone looks and feels good, is very fast and I am not experiencing any lag - particularly after using Samsung galaxy Y earlier. Display is vivid and the colours are striking and life-like !! Would recommend it to anyone who wants to have a good smartphone. I am not giving a 5 star rating only because I believe there is always room for improvement. The only disappointment is that flipkart delivered it very late because I ordered it on the Billion Day sale and probably they had huge orders to clear !!",
            "date": "02 Nov 2014",
            "name": "Dikayem",
            "stars": "4 stars"
        },
        {
            "comment": "every thing is delivered over the price.... and even after this if person is not satisfied than please buy an apple.. any device specific problems are exceptional... but the product is good...",
            "date": "02 Nov 2014",
            "name": "a user of this...",
            "stars": "4 stars"
        },
        {
            "comment": "This is just another horrible experience for me from Flipkart. Have bought numerous phones from them and most i had to return coz of \"grey\" market phones they are. In the bargain I have lost 7000 bucks from februaury till november 2014. Plus enough inconveniences and loss of time energy and data. Moto G 2nd gen, is a faulty phone. Promises 1GB RAM but still most of he Apps crash mid way. Awful display, one odd day i saw all blurred display, swicthed off and then turned on then it got sorted. Happens every now and then. Volume is a complete turn off and so is the experience. Had ordered for a refund on 16th Oct and they are still \"getting back to\" me. This time I will make sure that Flipkart repays me all the money and time and energy lost in \"trusting in\" them. Moto G is just an OK phone, a poor man's nexus!! But flipkart, of late, has been a big pain in the u-know-where",
            "date": "02 Nov 2014",
            "name": "Dhanya Venkata...",
            "stars": "1 star"
        },
        {
            "comment": "0First of all, KUDOS to flipkart for a quick delivery. Very nice packaging. Ordered the phone along with a flip cover. The phone runs very smooth. apps open up very quickly. the 8mp rear camera is...okay. video recording is awesome(can shot HD videos of up to 720p). the phone's charger gets heated up quickly at times.Overall, it's a great value for money.",
            "date": "02 Nov 2014",
            "name": "cherryfruit8888",
            "stars": "4 stars"
        },
        {
            "comment": "This is an awesome mobile.......specially its front dual speaker....camera flash.........and a special feature water resistant and scratch free.........battery also good, at lest forget about to charge before evening",
            "date": "02 Nov 2014",
            "name": "Chinmoy Baidya",
            "stars": "5 stars"
        },
        {
            "comment": "i received this mobile in well packed cover.it has good battery back up and goods quality camera.during charging device is not getting hot.",
            "date": "02 Nov 2014",
            "name": "O K SUMANTH OR...",
            "stars": "5 stars"
        },
        {
            "comment": "Great mobile.received his product a month earlier and still working perfect as it was on the first day.... Overall I give 9 out of 10 for the product.... No sign of lag of application....very smooth to handle and quite at a good price.",
            "date": "02 Nov 2014",
            "name": "Praveen Bhansali",
            "stars": "5 stars"
        },
        {
            "comment": "Overall Good Phone.The only negative aspect i found was battery backup.If you are a continuous data user then it will give only 8-10 hrs battery. Overall valuable for money & a Decent phone among Branded mobiles.",
            "date": "02 Nov 2014",
            "name": "Prawinkumar Rajan",
            "stars": "4 stars"
        },
        {
            "comment": "the flipkart delivery was very bad.but the mobile was amazing.the user interfase is very nice.the camera quality is very nice.the front camera was amazing",
            "date": "02 Nov 2014",
            "name": "Kiran Raj R",
            "stars": "5 stars"
        },
        {
            "comment": "the display goes off every 2 hours or so. flipkart tech support unhelpful. to reset the phone we have to hold the power key and volume down key for two minutes. very inconvenient. I would not recommend this phone to anyone.",
            "date": "02 Nov 2014",
            "name": "ak",
            "stars": "1 star"
        },
        {
            "comment": "I got moto g 2nd gen.10 days back and started using it.initially dint notice the performance of the battery.but by 2nd and 3rd day started noticing the battery unsually was taking more time to get charged fully,around 5-6 hours.and also draining of the battery was faster within 6-8 hours.i called to cust. care and the product expert asked me to use for 2 more days with phone switched off and also try it with other chargers or usb cables.followed the same still facing similar problems.finally called up flipkart and asked for replacement.they replaced it with new one and when i checked its battery again it was still taking around 4 hours to charge.again i raised a complaint and had to go for return option and refunding as i was not at all happy with the phone performance which is very very poor.also the gaming quality also very poor. SO PLEASE GUYS BUY MOTO G 2ND GEN AT UR OWN RISK.ORASK FLIPKART TO HAVE A QUALITY CHECK OVER ITS BATTERY PERFORMANCE BOTH WHILE CHARGING AND OUTPUT.... I DONT WANT TO GIVE EVEN HALF A STAR TO THE PRODUCT AS IT TOOK MY WHOLE 10 DAYS WORRYING ABOUT IT.....",
            "date": "02 Nov 2014",
            "name": "PRAVEEN KUMAR...",
            "stars": "1 star"
        },
        {
            "comment": "l was order in 29thOctober .deverily in 01 November flickart Veryfast... Awsome nice I like it...But Battery 1 Charge in very single day .And touch will more fast ,,, Moto G (2nd Gen) phone is good ..5 inch display will be awsome,I like it",
            "date": "02 Nov 2014",
            "name": "Ajesh.S",
            "stars": "5 stars"
        },
        {
            "comment": "Fell in love with this mobile as it looks stylish and works fine. But sometimes the phone has problems like hanging and improper functioning. Also the video recording is not functioning properly. But above those things this phone is worth buying..",
            "date": "02 Nov 2014",
            "name": "Kousik",
            "stars": "4 stars"
        },
        {
            "comment": "excellent phone. if battery backup still more capable then I give it 5 into 5. rather than excellent phone in small budget.",
            "date": "02 Nov 2014",
            "name": "pradeep kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile is just a brilliant in all fileds speedy, camera quality is too good ,voice also clear bt tere is only pre crack on back panel.",
            "date": "02 Nov 2014",
            "name": "ramanpreet singh",
            "stars": "4 stars"
        },
        {
            "comment": "its a very fantastic product....Good looking mobile phone with all essential features..just go through it and buy it.do not wait for this mobile, just order it...its a Google product...",
            "date": "02 Nov 2014",
            "name": "Gautam Rana",
            "stars": "5 stars"
        },
        {
            "comment": "very poor battery back-up like china cheap phone , android software is just install not any change like Samsung or Sony some additional app .performance is like 3000 to 5000 rupee phone perform. battery charge in 6hr and drain in 6 hr",
            "date": "02 Nov 2014",
            "name": "Rajiv Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Good: 1. Pure stock Android experience. 2. Value for money. 3. Good battery (Full day lasting). 4. Screen Is Nice and impressive HD. 5. Gripping is awesome (handling). 6. Dual Stereo speakers best in this class. 7. Design is best, Build very nicely . 8. Support service is Best ( 1 year warranty on all ). 9. Touch is good responsive. 10. Call quality in earpiece good, clear and loud. 11. Front camera is good. Bad things 1. Camera quality is average, After taking 10 to 12 images in normal use it is not responding as well as whole device gets hang, and warming up no it is not correct word it is heating up very high temperature. Upper area around the camera hardware. 2. Internet connectivity is also not impressive having much trouble to using 3G. 3. Loud speaker for calling is not good and notification sound+ vibration is too low. 4. Service centers are available only in big cities. But I am 100% sure that Motorola / Google will fix this Camera and connectivity problem. UI has to be improve. I also request to flipkart that please convey this message with Motorola. I got replacement for same problem & other one. Motorola and Flipkart gives me full attention both made goodwill. I appreciate to both of these organization. This is my own genuine experience.",
            "date": "02 Nov 2014",
            "name": "Praveen Sherke",
            "stars": "4 stars"
        },
        {
            "comment": "I worst service have been felt from Flipkart on my purchase of Moto G 2nd Gen. Please go on purchase from Amazon or ebay something else.",
            "date": "02 Nov 2014",
            "name": "Niyaz Ahamed",
            "stars": "1 star"
        },
        {
            "comment": "i bought that mobile...the performance is good enough. welldone camera. & no network problem at alll......but i have one problem when i do call nothing can hear at that time no voice is coming...i have to use my earphones to talk...pls anyone suggest me something gud.......thanks in advance.....",
            "date": "02 Nov 2014",
            "name": "SHANK",
            "stars": "4 stars"
        },
        {
            "comment": "* camera is gud, 2 of them * stereo sound is gud * it does not comes with a data cable its a fixed charger",
            "date": "01 Nov 2014",
            "name": "Bibin Varghese",
            "stars": "5 stars"
        },
        {
            "comment": "before the product review i would like to address flipkart first . Dear flipkart , Your customer service sucks period .....I bought moto g 2nd gen on 7 oct with promised delivery date of 10th oct . then it shifted to 17th oct and finally product was delivered on 29th oct, i not joking . there was no communication from flipkart . your so called call canter have no clue when product is going to deliver . ............if flipkart did't have monopoly over moto product i would have cancelled my order and bought it from some where else .. product review :- moto g is very attractive phone in person and in specs but there is dark side to moto g pro 1.moto g is made of soft plastic it feels excellent in hand . 2.pure android cons 1.flipkart sucks 2.moto g have major battery issue . phone takes more than 5hrs to charge fully . if your a heavy user like me you need look some where where else (heavy on call not on games) . 3.moto is pure android but it started to lag within two days. (no games installed) 4.camera is not up to the mark . a.software lags b. bad in low lighting overall camera performance is disappointing. 5.google search is not working properly . 6. volume and power button are of very bad quality. it doesn't give confidence at all. i have previously owned blackberry bold , nokia e72 and lg l5 . conclusion if your a college student and want a phone for cheap wait for some time because there will be second hand market soon. don't buy this phone if your caller, gamer .",
            "date": "01 Nov 2014",
            "name": "anurag tanwar",
            "stars": "2 stars"
        },
        {
            "comment": "I recieved faulty product. If i plug ear phones & unplug it then its not able to come in normal mode.. it still continue with ear phone pluged in. mobile switch off in between . & speaker problem",
            "date": "01 Nov 2014",
            "name": "Vishweshwar",
            "stars": "1 star"
        },
        {
            "comment": "Faster delivery thanks flipkart. Good product worth every penny. Nice phone great to use and easy to handle.",
            "date": "01 Nov 2014",
            "name": "Rudraganesh",
            "stars": "5 stars"
        },
        {
            "comment": "After going through a lot of reviews on various websites I finally picked one for myself. After a week's usage I'd like to say that the device is fluid. No lag occur whatsoever. Though 1GB RAM does look less at times it doesn't affect a lot provided you aren't doing heavy multitasking. The battery life will seem a bit less for people into gaming. Rest assured. If you aren't interested in getting into Xiaomi and Micromax and want a product with stock android and guaranteed software updates, moto g 2014 is the best at this price.",
            "date": "01 Nov 2014",
            "name": "Parth Garg",
            "stars": "4 stars"
        },
        {
            "comment": "great phn but medium battery.................... with great features......... like otg... camera is medium....... screen is very good....................",
            "date": "01 Nov 2014",
            "name": "Supratik Nandi",
            "stars": "5 stars"
        },
        {
            "comment": "Wel frst thanks to Flipkart for their prompt delivery nd the phone, yes u may expect everything u can get from a flagship device of a brand . The stock UI is super smooth only con would be that 1 GB of RAM(actually 858 MB usable) and the battery consumption is quite high(only one day on a full charge after rigorous use), rest is more than u can expect.",
            "date": "01 Nov 2014",
            "name": "Arpan Chatterjee",
            "stars": "4 stars"
        },
        {
            "comment": "1st time i ordered the phone and the one i received has battery issues. so i ordered for a replacement product, and i received it after 4 days. and the replacement product also have issues. if i talk or hear music for 10-15 mins iam getting burning smell from the phone. again i've requested for a replacement product. at least the new replacement product should not have issues. not so satisfied:-(",
            "date": "01 Nov 2014",
            "name": "Anand",
            "stars": "2 stars"
        },
        {
            "comment": "I have received the phone a week back, I was really happy with the product and also the fast delivery by Flipkart but following issues popped up. First of all, when I got this product,there weren't any Motorola logo or name on the screen guard(I seen it when one of my friend bought it). I didn't care about it initially but when these issues came up I got a feeling like my phone is already used(?). 2.sometimes I cannot accept calls, when i swipe to receive the calls the phone just don't respond. 3.I got electric shock from the speaker when connected to my laptop via USB cable. It is taking a pretty long time (About 4 hrs)to charge the phone fully. 4.when I unplug the headphone during call, the phone puts the call on loudspeaker automatically. I have raised an issue already, hope you guys will provide me a good customer service.",
            "date": "01 Nov 2014",
            "name": "Mohammed Jasir",
            "stars": "3 stars"
        },
        {
            "comment": "i want to buy this monster but i read many issues about battery 1. it takes 6 to 7 hours to complete charge ,is it true ? 2.battery drain fast ? i m normal user i will use this phone only calling and whatsapp ? it will run a day of my uses ?",
            "date": "01 Nov 2014",
            "name": "Deeppak Guupta",
            "stars": "5 stars"
        },
        {
            "comment": "good looking,good camera,nice battery backup,good touch pad,and a nice display......thanks moto team and flipkrat....thanks a lot",
            "date": "01 Nov 2014",
            "name": "sajjad ahmad khan",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing this review after using the phone for about 25 days. I would like to highlight the cons only. Cons- 1 .Battery backup is not upto the mark. Hardly gives battery backup of 15 hours with medium usage. 2. Touch sensitivity is bad and some time it will not work. 3. Worst earphones. It itches in the ear and sound quality is very very poor. Everything else is excellent. Camera ,display,performance is excellent",
            "date": "01 Nov 2014",
            "name": "Akshay Nawale",
            "stars": "5 stars"
        },
        {
            "comment": "Good battery Good touch Nice ions I brought one week back.It is same according to the review. Cons; heavy weight big soze",
            "date": "01 Nov 2014",
            "name": "Vimukthi",
            "stars": "4 stars"
        },
        {
            "comment": "i ordered the mobile on 12th sept 2014, received it on 20th by going to the (first flight) courier office. it was performing very good for the duration i used it. but, on 23rd october '14 the mobile crashed and it is stuck at the start up motorola logo, even after contacting the moto help line the problem remains unresolved, i was recommended to visit an authorised service centre, nearest one to me is in guwahati and being in a remote location i am still unable to get it working. performance wise in the price range it is a very good mobile but i am afraid that i won't recommend it to others till i can get it serviced easily and successfully.",
            "date": "01 Nov 2014",
            "name": "Ngangbam Singh",
            "stars": "3 stars"
        },
        {
            "comment": "The phone was delivered within 24 hours in Delhi. Moto G is really comfortable to hold as it has a curved back. Beats all other 5\" screen phones in this regard. Stock Android is clutter free and works very smooth even on 1 GB RAM. No lags whatsoever. I have two email accounts syncing and battery back is decent so far. Thanks to flipkart for bringing this product to India.",
            "date": "01 Nov 2014",
            "name": "Abhishek Jain",
            "stars": "5 stars"
        },
        {
            "comment": "I am basic user with just basic internet surfing, FB, Chat & emails. 1st time used Android phone & I rarely change my cell phone so use one phone for 6-7 years. Hence do a deep review before buying any phone. So here is my review eKart Delivery:- not so good would give them 2 out of 5; where 5 being highest. About Phone Awesome phone, great screen size, no crap apps, super fast, people use 2 view my phone & compliment tht its awesome fast & looks great, v easy 2 use for a new Android user like me, Looks awesome frm back & gives Nexus feel. People use 2 ask me is it Nexus. due 2 its dark black screen & thin size.just loved all the compliments I received & this handset made me feel special. Updates are fast frm google-Moto Pro:- Look & feel, light weight, slim, very fast, easy 2 use, screen display, high volume, lengthy charge, pre attached good screen guard, auto brightness does awesome task in sunlight or in dark. Cons:- No file explorer installed, so u need 2 have internet for sure 2 download it, Fm Radio can not be played on speakers :) no big deal. Battery saver only starts once battery reaches 15% 1st Handset was having huge network breaking issues, other person was not able 2 hear me, calls getting disconnected, but was getting Awesome internet surfing speed even when network was low, never heated even while watching 3 hours of Movie, Voice frm earpiece was coming frm left side i.e when you talk on phone u can feel voice is more loud when you are listening frm left ear & its low when you are listening frm right ear. Hence in huge noisy place I had 2 use phone 2 listen frm left ear or adjust it on right ear so as 2 get more sound. Hence assuming hardware issue with sounds & network I got it Replaced. 2nd Phone:- Screen guard not placed properly. frm the way it was stuck seems like it was placed just in hurry & sems like was not a factory stuck screen guard. Also there is no logo on screen guard frm Moto, the phone is not sealed packed in plastic. so no way 2 know if its original or refurbished phone. But thts how Moto has kept its strategy. so as 2 benefit by selling even refurbished handsets as new .... hence felt like I got a refurbished handset, Voice again was coming more frm left side of handset, so thought this is how the phone was designed so ignored this prob. But started facing heating prob.. the first half of phone frm Top specially the back side area where camera is located use 2 heat a lot while using internet for one hour or using internet along with phone charging & if you receive call at same time .. u cant even touch it 2 your ear.. so have 2 remove charging listen call for couple of mins frm distance & then it use 2 cool down fast..but after charging again starts heating.. but with no use only charging it become normal. This 2nd phone use 2 take approx 6-7 hours 2 charge tht too not reaching 100%. Called customer care of Flipkart for replacement.. thy suggested refund. I loved this phone so didn't wanted refund for sure. .still opted for refund due 2 pressure frm pears. NOW Most Important .. while the refund was in progress just 2 days before pick up .. I removed the default screen guard of phone & the look of screen was just too AWESOME .. believe me its like a 3d .. super cool.. but then walking on sun light if you see the phone (non active mode in blank screen) u can see lots n lots of vertical & horizantal lines behind the glass .. looked like I can see the chips behind the screen. But thought since the screen quality is awesome hence Moto has purposely kept it like tht. Hence decided 2 cancell the refund but called Moto G customer care for 2nd opinion .. & 2 my shocker thy told me..tht the hearing prob tht the voice coming frm left side of phone is a hardware issue & needs 2 be fixed at service center & vertical lines are not normal hence the phone again needs 2 get replaced. Flipkart also confirmed tht the lines are not normal. Considering these 2 facts tht voice coming more frm left side of phone.. which i faced on both 2 handsets & vertical lines tht I explored only in 2nd handset .. I decided 2 go for refund. Heating prob is normal in all the phones even Samsung I have seen all my friends complaining about heating issue. Also battery is just for half day with basic use.. but thts due 2 HD & bigger screen. Conclusion:- still MotoG is the best phone 2 buy, as it has a big big brand name behind & support of Google, awesome performance & still the best comparing 2 samsung.xiomi,asus .. great after sales service, once you are done with one month support frm flipkart .. after sales service does makes a huge impact It seems tht either Flipkart is selling refurbished handsets or MotoG quality check department is messing up all the handsets .. as receiving 2defective handsets is not common .. most of my friends using this phone are not facing any issues except me .. so its bit depressing tht I have been left with such bad experience & can not buy this awesome phone",
            "date": "01 Nov 2014",
            "name": "Anand Jhunjhun...",
            "stars": "1 star"
        },
        {
            "comment": "Hi, I got defective phone, speaker of this phone is not working and that's why I am not able to hear the voice of caller.",
            "date": "01 Nov 2014",
            "name": "Ankit Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Good product from Motorola and amazing service from Flipkart. Always have trusted Motorola for its renowned technology now Lenovo and the first ever introducers of mobile technology. Overall a great experience.",
            "date": "01 Nov 2014",
            "name": "Vishal Trivedi",
            "stars": "5 stars"
        },
        {
            "comment": "Unable to hear voice after received calls.Already registered complaint for replacement in flipkart also no use.Very worst service by flipkart",
            "date": "01 Nov 2014",
            "name": "Santosh Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "its amazing smart mobile if you ask me i will diffidently recommend this mobile simply superb with moto z unbelievable experience to me",
            "date": "01 Nov 2014",
            "name": "kulakarni prav...",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from 10 days.For 2 days,its working properly.Then,camera started showing problems.When I opened the camera,its displaying \"Camera unable to start,if this continues restart your phone\".This has happened to me almost 5 times.One time when I opened the camera led automatically gets on and its not getting off even when I switched off the phone.Battery is draining really fast.If use continuously,then it drains out in 4-5 hrs max even you are doing only facebook,whatsapp.Then,I contacted customer care,they suggest me to reset the phone.I had done it.After reset,till now I have no problem with the camera but battery problem is still the same.Don't know whether this is really a battery fault in my device or it gives that much backup only.But,yes I have not found any laging problem.Games are working fine.Sound quality is too good.But,heating issues are there.",
            "date": "01 Nov 2014",
            "name": "Shubham Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Poor battery, head phone is not worth for it. Please don't go for it. Chee thuuuuu . I will never buy this phone again.",
            "date": "01 Nov 2014",
            "name": "Raj kumar",
            "stars": "1 star"
        },
        {
            "comment": "after one replacement also I found the piece faulty, there are multiple issues with phone...i purchased MOTO E and MOTO G and both were faulty.",
            "date": "01 Nov 2014",
            "name": "Madhumita Rai",
            "stars": "1 star"
        },
        {
            "comment": "I Suggested & bought this 2nd Gen for my friend. The king of budget smartphones returns with a larger screen and a new and improved camera. Much-improved camera Strong battery life Solid, well-built design Excellent value for money MOTO G CONCLUSION: The new Moto G isn't just an amazing bargain. It's a sub phone that gives a surprising number of plus in mid-range handsets a real run for its money, I didn't think it was possible to create a better phone than the original Moto G, but the latest version of Motorola's unstoppable handset rightly claims its crown.",
            "date": "01 Nov 2014",
            "name": "P.Sathyanarayanan",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered the product on Oct 17th as a diwali gift for a dear one and the product reached on October 30 (diwali was on Oct 23). The most frustrating experience was not being able to track the shipment. I was following up with Flipkart and the logistics company (Ecom Express) everyday and they kept giving me vague replies. Flipkart itself did not have a clue on where the shipment was and they kept telling me, ' we have escalated the issue'. God knows where they have escalated the issue. The logistics company was on a different level altogether. They told me that there was a huge backlog of orders and they cannot do anything about it. I highly recommend that you do not buy from Flipkart if you want to gift this or any other product.",
            "date": "01 Nov 2014",
            "name": "Karthik P",
            "stars": "1 star"
        },
        {
            "comment": "I bought this product on 31 oct. after using my phone for about 10-15 min it started heating up. and from heating i literally mean heating not warm. May be i got a faulty piece. I asked flipkart to return this product lets see what happens. Finger crossed..",
            "date": "01 Nov 2014",
            "name": "Deepak Awasthi",
            "stars": "1 star"
        },
        {
            "comment": "Bad Shipping by WS retail . Shipment is so bad, they gave wrong pincode for shipping.............................................",
            "date": "01 Nov 2014",
            "name": "Balakiran Redd...",
            "stars": "1 star"
        },
        {
            "comment": "Good Product but display ppi is lesser when compared to Moto G 1st Gen... Value for money Far better than Samsung phones...",
            "date": "01 Nov 2014",
            "name": "Amarnath Bella...",
            "stars": "3 stars"
        },
        {
            "comment": "Overall a good product in good price range. Performance and quality is good. Battery backup is average, camera quality is good but features missing",
            "date": "01 Nov 2014",
            "name": "Mridul Bhardwaj",
            "stars": "4 stars"
        },
        {
            "comment": "I'm having a very bad experience with Flipkart. Getting impression like we should be privilaged or lucky to buy any product from the site. Can't deliver on the promised date. Even though there is a mistake from your side for not delivering the product on time, not telling that they will deliver the product in one day or 2 days but whole 5 days. Why can't you deliver it in one day as you were delivering products in one day for your FlipkartFirst Subscribers because the mistake is on your side for not delivering me the product on the promised date ??",
            "date": "01 Nov 2014",
            "name": "Sharath Chandr...",
            "stars": "1 star"
        },
        {
            "comment": "I was using Samsung galaxy S3 before i purchase this mobile. Overall user experience with this mobile was good but when in comparison with S3 (I know i am not supposed compare because of it's price) display was with very low brightness and image resolution was also not good according to it's price end it's the best phone with specifications and build quality 1. Camera quality: Primary camera on the phone is way too much good for a Moto and secondary camera is good for video calling as it supposed to. Also works well low light condition. 2. Speakers: I found that these speakers are very good in sound production. 3. Build quality: Phone sits well in short hands also because of it's build quality 4. Touch response: This is the major term in every touch phone. Mobile's touch is good but when touching with nails, response is not well (S3 touch works well with wet fingers and nails). 5. Waterproof quality: Works well in rainy season and washroom usage. Thanks to the water repellent coating (S3 is not good in under water condition) Overall review: This is a good phone in mid price range with promised upgrade to Lollipop.",
            "date": "01 Nov 2014",
            "name": "Mohin",
            "stars": "5 stars"
        },
        {
            "comment": "camera quality is very good,overall features is also good...running well............processor is very fast..display quality is also good...overall i say 4.0/5",
            "date": "01 Nov 2014",
            "name": "Hirak Nandi",
            "stars": "4 stars"
        },
        {
            "comment": "Aaara waah... wat a mobile... delivery of flipkart is nice..... my moto works good.... there is nothing to worry about this phone... as compared to other phones in this range.. itz good.. display is good... no lag problem... camera is good..as far as i concerned , this phone is a very good phone... the mobile charger become hot quickly.. bt it doesn't matter.....",
            "date": "01 Nov 2014",
            "name": "BIBIN (bbn$)",
            "stars": "5 stars"
        },
        {
            "comment": "hey i have got my new phone today. But i didnt recieve the data cable along that. could you please dispatch that.",
            "date": "31 Oct 2014",
            "name": "Puneet",
            "stars": "3 stars"
        },
        {
            "comment": "i have used both phones right now i am holding moto g2 in my hand.going by a quick comparision display:zenfone is way ahead of moto sound quality: moto is more louder and clearer than zenfone design and built: a tie cause none of them look cheap and are great build rmoto is a bit compact but zenfone is more curvy. battery:moto wins over zenfone performance: many apps like fruit ninja,yu-gi-oh bam etc lags on moto but runs smoothly on zenfone also mutitasking of zenfone is a way ahead from moto may be due to higher ram. camera: a clear win by zenfone and a great photo editor as well in zenfone.",
            "date": "31 Oct 2014",
            "name": "Manish Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "The phone is no doubt a excellent masterpiece at price 13k it offers a complete satisfaction with the product Didn't even found any single flaw with phone design and performance over the past 30 days Just Go for it don't think",
            "date": "31 Oct 2014",
            "name": "SHAHRUKH ALEEM",
            "stars": "5 stars"
        },
        {
            "comment": "Really nice phone, having great display quality, great camera quality. Not only primary camera, secondary camera is also great. I have installed heavy games, and it's working fine, there is no hang issue with the phone. You can go for that...",
            "date": "31 Oct 2014",
            "name": "Mohan Gathala",
            "stars": "5 stars"
        },
        {
            "comment": "Wrongly delivered to another person, instead of me.Before delivery they not called & not confirmed very wrost logistics....................................",
            "date": "31 Oct 2014",
            "name": "Kalaivanan An...",
            "stars": "1 star"
        },
        {
            "comment": "Moto G (2nd Gen) ordered on 26/10/2014 and received on 29/10/2014 at 10.15 am, but i have shocked when open the box , show in side Moto G (2nd Gen) box - looks like a old and already open - No seal / brand packing. after open the box , mobile phone on screen guard dirty spot , accessories is also out of packaging / polythene bag. I think is not a new brand piece. it is second hand / used phones. I am already inform to flipkart by telephonic and writing both on immediately after receipt of the Moto G (2nd Gen). Still no action by flipkart. First time i have face this types of problem and also I am not happy with flipkart services. Please be care full..",
            "date": "31 Oct 2014",
            "name": "Harshad Dilipb...",
            "stars": "1 star"
        },
        {
            "comment": "I HAVE USED THIS PHONE... and yes , i am quite impressed :) with snapdragon.. and a quad-core processor.. it is amazing. the phone is also fast.. and trustable with its corning gorilla glass.. camera is quite nice, and its even better with the help of apps like retrica its recommended that one may buy this phone.. beacause its perfect for this price ! it shows that it is worth every penny!",
            "date": "31 Oct 2014",
            "name": "Aditya Guha",
            "stars": "5 stars"
        },
        {
            "comment": "Most of people got this complaints. I have also recieved defective piece which has problem with charging. Once charger connected its not able to boot up and no recovery options working... such a worst exp...",
            "date": "31 Oct 2014",
            "name": "Asifali Jamadar",
            "stars": "1 star"
        },
        {
            "comment": "moto g is good, but if motorola gives 2 gb ram with this device then its going to a benchmark of all the manufacturer..",
            "date": "31 Oct 2014",
            "name": "Ratnesh Maurya",
            "stars": "3 stars"
        },
        {
            "comment": "good . but the problem is i got whit head set and white charger i order black phone .and i want to buy data sync cable original one.how could i buy ?",
            "date": "31 Oct 2014",
            "name": "abid khan",
            "stars": "4 stars"
        },
        {
            "comment": "phone mic is not working the very first time,such a disappointment, i hope i get my money back! not a replacement.what alet down",
            "date": "31 Oct 2014",
            "name": "haresh",
            "stars": "1 star"
        },
        {
            "comment": "nice cool functioning and looking and working good all over loved it i was thinking the camara will be just ok but its aswsome but when i use to video col by thired party app its kinda dark not dat much good even day all over i love the fone good looking smooth working go for it guys and yah for the delivery it was really awsome got in 1 day one night haha :)",
            "date": "31 Oct 2014",
            "name": "Gurpreet singh",
            "stars": "5 stars"
        },
        {
            "comment": "I got this for 9999 Thanks for the big bang sale :) so for a price range below 10k i got a beast the design and performance Rock the camera is pretty decent for a phone priced in the 10-12 k range Only con I see is the battery that too in the 3G mode .. doesnt last a day if used extensively",
            "date": "31 Oct 2014",
            "name": "Raja Sekhar M A",
            "stars": "5 stars"
        },
        {
            "comment": "what the product specification .. cam, ram, battery ... sooo on all those are worst phone gets heated up , cam dont function well suddenly it becomes black , phone gets stuck or hang up easily multiple touch needed to take call or open unlock pattern .. notification bar sometimes dont work ,sound is not good .. i have applied for return request they said reebot it after rebooting also same no change dogs tail cant be straightened naa.. worst piece and worst phone of the year. i decided not to buy from flipkart and not to buy moto product.. waste of money and waste of time..",
            "date": "31 Oct 2014",
            "name": "vala ramgopal rao",
            "stars": "1 star"
        },
        {
            "comment": "Even after 8 days I still didn't receive the product and it reached my city 6 days before and not delivering to me, No contact details of any delivery centers available. Helpless",
            "date": "31 Oct 2014",
            "name": "Santosh Kiran G.V",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone....njoy using it. Phone happens to be much more interesting then it actually appears. Camera result simply superb. Everything abt the phone is superb. The only problem is..after trying hard i could not find a way to turn off t9 dic.",
            "date": "31 Oct 2014",
            "name": "Fazal Vayani",
            "stars": "4 stars"
        },
        {
            "comment": "i have moto g old version his finishing is very good but i buy new finishing moto g 2 but moto g 2 mobile some problem in finishing camera flas lite not in center and puls notification light is also not center and no any problem in this moto g 2",
            "date": "31 Oct 2014",
            "name": "chandra shekha...",
            "stars": "2 stars"
        },
        {
            "comment": "Flipkart has always been my first choice to buy stuffs. Though this time I was disappointed for delay in delivery. Moto G2 is one of the best smart phone I have used till date. In performance, it easily beats samsung high end games. The only thing I was not happy about is the earphone. Its not upto the mark. Audio quality is dull.",
            "date": "31 Oct 2014",
            "name": "Piyush",
            "stars": "4 stars"
        },
        {
            "comment": "I PURCHASED MOTO G 2ND GEN ON SEP, 2014. MY OPINION IS MOTO G BETTER THEN NOKIA XL, SAMSUNG CORE, AND SONY XEPREIA. GOOD CAMERA, GOOD LOUD SPEAKER, GOOD VOLUME, SENSORS WORKING AMASINGLY , ITS TOTALY WORKING GOOD ... THE ONLY DRAW BACK IS ITS BATTERY - MEDIUM BACK UP, STAND ONLY 9 HRS WHEN WIFI OR 3 G ON MODE. BATTERY SHOLUD BE UPGRADED....",
            "date": "31 Oct 2014",
            "name": "MUTHU RAJESHWA...",
            "stars": "4 stars"
        },
        {
            "comment": "Hello Moto, I did not got any problem with MOTO G 2nd Gen. Since I am using this phone from nearly one month. Not came across with any defects. I just loving the Product. Thank you Moto. Thank you flipkart. Thank you Google....",
            "date": "31 Oct 2014",
            "name": "Guruprasada Bhat",
            "stars": "5 stars"
        },
        {
            "comment": "i got Moto G (2nd Gen) 3 days back (27th oct 2014 evening) I like to inform you that I got a faulty Headphone. One side of the headphone is not working at all. Pl do the needful.",
            "date": "31 Oct 2014",
            "name": "Vinoth kanna",
            "stars": "1 star"
        },
        {
            "comment": "I happened to look out for mobile which is value for money.After many searches found this phone which is made for the needs!! Definitely Motorola is back!! Also,Flipkart service is too customer friendly!!",
            "date": "31 Oct 2014",
            "name": "Basavaraju Chi...",
            "stars": "5 stars"
        },
        {
            "comment": "first i bought moyo g2 ,but it has software problem i kept return request they understood my problem and exchanged my product in no time",
            "date": "31 Oct 2014",
            "name": "karthik",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is best in this price tag. The camera is very clear . The gaming is also very good I didn't seen any lag in games like injustice gods among us , need for speed most wanted ,Riptude GP2,temple run 2.........and many more. This phone is quite big but if your hand is pretty big you can operate this phone with one hand .............. the display is very bright.All the things in this phone is good but except front camera because when us click pics with front cam in low lighting then its looks like laggy but in decent lighting the camera doesn't lag. The battery backup is quite enough for one whole day work SO , I HIGHLY RECOMMEND YOU TO BUY THIS PHONE.. AND ALSO IT'S UPGRADABLE TO ANDROID 5.0 LOLLIPOP OR L..........!!!",
            "date": "31 Oct 2014",
            "name": "YOGENDER SHARMA",
            "stars": "5 stars"
        },
        {
            "comment": "Good Phone, Best features in price class. Only problem of heating when playing high graphics games and using flash lights (in video recording) continously",
            "date": "31 Oct 2014",
            "name": "Amit Pednekar",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delivered moto g (2nd generation) before 2 days of expected date. Front camera also good for selfies.very fast, not lagging . photos quality also good.",
            "date": "31 Oct 2014",
            "name": "Chandrakant Jagdhane",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased Moto G2, this was the worst packing from Flipkart. Got my Moto G2 in a plastic cover of Flipkart.",
            "date": "31 Oct 2014",
            "name": "SHIVA KUMAR SP",
            "stars": "5 stars"
        },
        {
            "comment": "camera not good though 8 mp battery drains within 12 hr with 3g browsing.. i hv nt recieved my returned item . other features are good like gaming ,processor speed,smooth touch",
            "date": "31 Oct 2014",
            "name": "ramakrishna dhal",
            "stars": "2 stars"
        },
        {
            "comment": "Great product from Moto. You can get nothing more stylish and high performance phone at this price point. Nothing cheap about this one in terms of what you get for your bucks. Its completely a bang for your bucks!",
            "date": "31 Oct 2014",
            "name": "ankush deshpande",
            "stars": "4 stars"
        },
        {
            "comment": "Worst camera quality i ever found in this branded phone. totally disappointed. Sound quality very bad. Automatic network selection not working video recording very poor quality. SMS sending always failed. If flipkart is selling this kind of products then i m sure they will surely loose their valuable customers.",
            "date": "31 Oct 2014",
            "name": "Pankaj K",
            "stars": "1 star"
        },
        {
            "comment": "Only one ward Superb!!!!!!........premium quality product ....I so much satisfied....really nice mobile from Moto !!!!",
            "date": "31 Oct 2014",
            "name": "Suresh Neharkar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G(2) is a good phone overall and price is pretty competitive too. But, there were some significant critical bugs/defects with either the phone handset or the android-motorola combo, and here they are: 1. USB cable is not included in package - this is a bummer!!!! 2. PC-USB connections do not work for Win XP (SP3) and Moto G. I have spent almost 3 entire days to do some R&D in techie sites, yet to implement the 9th or 10th resolution. Works fine with my other laptop with Win 8.1. Therefore, if you expand your mem slot 3. I have purchased 2 Moto G phones and 1 Moto G (2) phone in the span of 1 month from flipkart. For none of these purchases, the headphone works! This is crazy - and I have used my existing Philips, Nokia, Samsung, Micromax headphones and Moto G failed to detect the outlet and produces no sound at all. 4. For Moto G(2), a little stressed usage (4/5 apps opened together; remember - other than the usuals) just show some hiccups in the phone smoothness. 5. Motorola has kept the same display clarity as of M(1) into M(2), but the screen is 0.5'\" bigger; so if you compare the display in 1 & 2, you'd obviously find some shady pixelated display. 6. Sometimes, most weirdly, my home-screen app icons disappear, sometime I notice them sitting in another home-screen. I am pretty particular about my customized home-screens (5 years of touch-phone usage .. LOL) and this is really crazy. 7. If I recall more, I will note them down too. Overall: It's a good budget phone with lots of usable and few rubbish extended features. But the customization of android kitkat by Motorola has been proved to be really so useless. Note: Moto G (Gen1) was perfect in terms of these strange creepy problems.",
            "date": "31 Oct 2014",
            "name": "Somak Bhattach...",
            "stars": "3 stars"
        },
        {
            "comment": "I had bought Moto G phone in February 2014 and as expected it worked very well for me. I used this phone to fulfill all my requirements such as accessing my corporate, private emails, whatsapp, social media, taking long video conferencing calls, accessing my office network and receiving calls on my cellphone etc. I was very happy about the performance. Post office hours it was owned by my daughter who is very fond of watching youtube videos. it gave me very good uninterrupted video quality. In the morning I played songs directly from Gaana.com and no issues. Till September month, I was very happy with this phone. Due to my mistake I carried this phone on the beach and one wave changed my life. In a second, I was phoneless. The water has damaged my phone and for sometime until battery was alive, phone was alive but I was not able to use touch screen so was not able to receive any call. I was out of station so I did not have access to my old phone and I was also not have access to the service center. When I came back and went to the PC support which is the only service center in Pune. There is a huge rush with the Moto G related complains and somehow I managed to attract one of the customer executives and he accepted my phone in warranty and I was expecting from them what has happened to the phone and how much I have to pay if there is anything needs to be raplaced. They said I will receive a callback within 3 days. I kept waiting for the call for the whole week but did not get any call so I started calling them back. I kept them calling but they did not receive the call. Finally someone answered the call but he kept saying Hello Hello but he did not reply my query. Finally when I kept trying for one week then someone received call and asked my details and asked to pickup my repaired phone after 2 days. I was happy that my phone got repaired then I received another call after 2 days that my phone's motherboard got damaged so it needs to be replaced and it will cost me 7500. During this time there were Diwali offere going on and I lost all the offeres because I was optimistic for my phone. Motorola should improve the overall service experience. Finally I bought Moto G gen 2 because I liked phone but service experience was very bad.",
            "date": "31 Oct 2014",
            "name": "Prashant",
            "stars": "3 stars"
        },
        {
            "comment": "Bigger and good than Moto G (except battery performance)... Best in Class ... Plus Android L in coming ... Go for this Mobile for sure...",
            "date": "31 Oct 2014",
            "name": "Mayur Gaikwad",
            "stars": "4 stars"
        },
        {
            "comment": "Just go for it Blindly... Advantages: Good looking. 5'' smartphone. Front camera also good.awesome taken Pics 8 Mp. Video plays Hd 720p. Dis Adv: When playing FM loudspeaker cant work. 3G Video calling not supported but by Using Hangouts,Line,etc video calling is Possible. First phone gets low backup battery, After Updated Phone gets best backup. No data cable flip kart provided.",
            "date": "31 Oct 2014",
            "name": "Naseeruddin Shaik",
            "stars": "5 stars"
        },
        {
            "comment": "Dont Deserve Rating. Guys. My reviews are true & real. Moto G2 is very bad phone. Calling function is very poor. I ask for replacement as per the flipkart policy but no one from there side to support me. Yet my phone not replaced. Flipkart never understands customer satisfaction.",
            "date": "31 Oct 2014",
            "name": "Honey Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Fast, Good Battery Backup, Great Camera, Secondary Camera (Front Facing) Kitkat O.s. and at a great price compared to other \"so Called\" Brands. Worth Buying",
            "date": "31 Oct 2014",
            "name": "Yash Patel",
            "stars": "5 stars"
        },
        {
            "comment": "I'm using the White moto g 2gen 16gb version.. Its light as a feather and Super smooth n super fast to work with. I've been using it for 2days and I'm revelling in the pure Google experience on 4.4.4 KitKat! The design is understated and classy. I'm not using any case for it and so far the white back didn't take any stains. The Matt finish of the White back masks fingerprints and looks clean. Easy to manage. There is a slight tendency for dust to accumulate at the edges of the front where the screen meets the panel. The only limiting thing is the battery. Gives me a maximum of 16hrs with moderate use and a maximum screen on time of 4 and a half hrs. Motorola Plugin earphones of the very basic variety come within the box. The camera is good (not the best one out there) and keeps the pictures looking natural. If u r a gamer, u'll just fall in love with the performance of this phone! Gives the most amazing gaming experience! Overall, its a great buy",
            "date": "31 Oct 2014",
            "name": "Chintan Chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "Best smartphone you can get for this price!! Loving the camera quality,big screen and dual channel front audio speakers!!",
            "date": "31 Oct 2014",
            "name": "Avaneesh D",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome product at a reasonable price, great service as usual by Flipkart. Would definitely recommend the product",
            "date": "31 Oct 2014",
            "name": "Apurva Dixit",
            "stars": "5 stars"
        },
        {
            "comment": "Guys..All Reviews posted on flipkart are fake...I have purchased 2 mobiles simultaneously Micromax canvas 2 A120 and Moto g 2 nd gen..Both have same specification... But Micromax is far far better than Moto g 2...Micromax is fast in processing, Screen is big everything is gud....But in Moto g .....Motorola has copied all the features of Micromax....but it is slow in processing,,,screen 5' inch is false as 1 inch completely wasted because left , centre and right key is on screen only wasting the size of screen..................I felt cheated by Motorola......................Guys don't go for Moto g......instaed of that Go For Micromax u will get more features in less price............. Very Disappointed by Motorola...........",
            "date": "30 Oct 2014",
            "name": "Garima",
            "stars": "1 star"
        },
        {
            "comment": "first time i ordered on flipkart,i ordered moto g 2nd ang a memory card along with it. received in 2 days, im happy with there service and also the phones is working well. overall im happy with there service",
            "date": "30 Oct 2014",
            "name": "sahijpal sidhu",
            "stars": "5 stars"
        },
        {
            "comment": "I was in dilemma to go for it or not But there's a clear yes ,once I had an hands on experience with it First thing is , it's a true value for money It looks gorgeous And fits for all your needs You'll love it And recommend it all over ,like did it !",
            "date": "30 Oct 2014",
            "name": "Nishant Kankaria",
            "stars": "5 stars"
        },
        {
            "comment": "This the best mobile ever i have seen in mid range, very cheap phone with the best quality of screen and other features. Just one problem in the mobile is average battery life, need power bank for long use...",
            "date": "30 Oct 2014",
            "name": "Ashish Chauhan",
            "stars": "4 stars"
        },
        {
            "comment": "I bought the Moto G on the Billion day offer by exchanging an old mobile phone where I got 2000 discount. Was delivered as indicated by flipkart after a week. I have been using it with dual SIM - Vodafone and BSNL for the past 10 days. Since yesterday the phone has started giving problems. The phone app is not responding and I am unable to dial out. I tried removing cache, restarting, rebooting with SIMS swapped - with no use. I have to take to the service center after I get back to Chennai.",
            "date": "30 Oct 2014",
            "name": "Subramaniam B",
            "stars": "3 stars"
        },
        {
            "comment": "It is very nice mobile.... it is value for the cost.... camera quality is good.... flash light is also so bright.... but internal memory is 12.79 gb except inbuild apps.... In 12.79 gb consists inbuild memory apps MB.....",
            "date": "30 Oct 2014",
            "name": "Palavesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The product n the delivery service is good ... but ... i got the delivery of the moto g 2nd gen which after opening the package was not working at all i tried even charging it n charged it for over 4 hours .. still ... not even a single light as its working was showing up..... ! hope i will be getting the replacement soon !",
            "date": "30 Oct 2014",
            "name": "Joshua Fernandes",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G 2nd GEN .I found that phone was not charging at all. I informed over customer care to flipkart persons who advised to create Return and also advised to try it with another charger.Before I could tell them that the phone started charging with another charger, and without knowing the facts they disapproved my return request. The next day I over phone informed them the fact and requested them to replace the charger with new one because the original /branded charger is the integral part of the mobile. I then made request to them to replace the defective charger. with new one. But contacting them several times at their customer care, they are not replacing. This is my bad experience. I would rather suggest that purchaser should insist for open delivery of items purchased so that they can verify the item before making payment to them. My rating may be treated as zero..",
            "date": "30 Oct 2014",
            "name": "Fateh Chand Madan",
            "stars": "1 star"
        },
        {
            "comment": "I would say that it is the best phone in between 10k and 13k. Features that needs special mention : * Super cool and sleek design. [gave a wow feeling when i opened the box] * Crisp 5' HD display(720p). * Camera - 8MP takes pics with good clarity; 2MP - great selfie. * Speakers - Simply superb - Literally blown away by the Stereo speakers - Awesome !! * 16 GB internal memory + Micro SD card slot. * Android 4.4.4 with sure upgrade to \"Android L\". * Quad core speed - tried few games like Real racing, Riptide - ran smoothly.",
            "date": "30 Oct 2014",
            "name": "Fathima Nasreen",
            "stars": "5 stars"
        },
        {
            "comment": "I just got this Moto G 2nd Gen phone from Flipkart and after opening the package with great excitement I switched on the phone. To my surprise the Screen of the phone does not respond to any kind of touch. I waited for almost 4 days for this product just to get the feel of online shopping and sad to say that no matter what, purchase via ecom will take lot more doing to ensure customer satisfction from the retailer side before they can make a big game changer preposition. Saddened and all the excitement of buying a new phone is transformed into a sad experience.",
            "date": "30 Oct 2014",
            "name": "AMOL TYAGI",
            "stars": "1 star"
        },
        {
            "comment": "This phone is awesome, plus the price makes it even better! Go for it! The only thing bad about this phone is the old fashioned headphone which come bundled with it. Anyways you can change them. It has external memory which was missing in the 1st gen phone.",
            "date": "30 Oct 2014",
            "name": "Kushagra Soni",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2 - as a product is best in this category of phone. It has all - Looks, Quality, Hardware, Software and top of it \"pricing\". Pricing got brilliant when I got Best Deal on Flipkart's Billion Day Offer......Exchanged my Old Sony phone + Cash Back on CC.....Thanks Flipkart.........Only issue remaining is Over Priced Flip Cover of this phone.",
            "date": "30 Oct 2014",
            "name": "Nitin Verma",
            "stars": "5 stars"
        },
        {
            "comment": "very good... very good performance.. nice design.. camera clarity is excellent... this is worth the money you pay.",
            "date": "30 Oct 2014",
            "name": "Midhun Mathew",
            "stars": "4 stars"
        },
        {
            "comment": "it is having nexus look cheap ,best and fast phone but one problem is that on full volume its sound quality becomes bad",
            "date": "30 Oct 2014",
            "name": "DEVANSHU rohila",
            "stars": "5 stars"
        },
        {
            "comment": "1 Good Battery Backup . 2 .no lag while play heavy games 3. Best part not got hot even while playing for long time or while calling . 4 .camera is also impressive ,videos quality is also good . 5.one negative thing headphone that come along with this is not good (Sound quality is not so impressive ) but you can buy different one . But charger is very effective . 6 .In Last Flipkart service is fast and every thing like courier tracker is well integrate with courier site you can find current status of your shipment from flipkart.com",
            "date": "30 Oct 2014",
            "name": "Alok Khatri",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered approx on 12 Oct 2014 for diwali gift..... Deleivery date I got 23 Oct ....... Again I got 28 Oct .... and again they said 29 Oct 2014..... Bullshit flipkart..... Don't believe them...... And further they have not stopped , they sent mail to me and asking for feedback..... They doesn't have proper feedback team.... Shown their quality of fuckall service... ... Than really..... I will never going to get stuff from them",
            "date": "30 Oct 2014",
            "name": "Rupesh sagvekar",
            "stars": "1 star"
        },
        {
            "comment": "I have worst ever seen this type of delivery system by some one. After 23 days of booking of Moto G 2 Gen, there is no intimation when to deliver. They have give the date of 17 October. Please improve your service if you want to be in a market and compete with the international online shopping giant...",
            "date": "30 Oct 2014",
            "name": "Vipul Rastogi",
            "stars": "1 star"
        },
        {
            "comment": "I had ordered the phone on Flipkart before Diwali. Although, Flipkart ruined my Diwali and messed up the timelines quoting their logistics partner as the culprit, the phone by itself is flawless. I was upgrading from a Samsung galaxy Star and was used to android. However, the experience is beyond wonderful with the new Moto G. my friend who owns a 1st gen phone had recommended Moto and I had zeroed in only after carefully considering the Zenfone5, the Samsung Mega and also a few other phones like Sony Experia Z and Lenovo and Alcatel-Lucent. The Display is bright enough for regular use but dim enough to conserve battery when need be. The touch Screen is very responsive and so is the camera. having Motorola migrate, moving my contacts from the old phone was a breeze. The UI with the Google now launcher is integrated on Android 4.4.2 Kitkat. The specs may not seem as high as the zenfone,but Moto have a way of optimizing the performance so they perform way better compared to other phones with slightly higher specs. Summarizing, I would definitely recommend this phone although i would add that it takes ages for the phone to charge with the Moto provided charger and that the earphones seem too cheap but perform as expected from Moto. I would expect a more flashy/customizable pair of earphones though.",
            "date": "30 Oct 2014",
            "name": "Theophilus Daniel",
            "stars": "5 stars"
        },
        {
            "comment": "1. Speaker Sound 5 out of 5 2. Hands free Sound 5 out of 5 3. Display 4 out of 5 4. Look 5 out of 5 5.Touch 5 out of 5 6. Camera 4 out of 5 Need to Improve User Interferance as pure android given. Screen resolution i.e PPI sould more. Camera quality should improve it could took low light clear pictures.",
            "date": "30 Oct 2014",
            "name": "Yagnik Raval",
            "stars": "4 stars"
        },
        {
            "comment": "Hello all !!!!! Flipkart delivered the Moto G 2nd Gen with Battery drainage fault and faulty piece which get heat up like anything.........first experiences and was the worst experiences ......Please do check the mobile before use...as i have not even used it for 1 hour after delivery......Also the good part is they have accept the facts and got ready to resend the new mobile. Order is placed waiting for the new surprise...",
            "date": "30 Oct 2014",
            "name": "Guru",
            "stars": "3 stars"
        },
        {
            "comment": "I am not happy with Moto G(2nd Gen). Facing many problems 1. Phone hanging atleast twice a day , 2). Captured photo taking time in saving (almost 15-20 mins). 3). Volume (Sound) of phone is very low.",
            "date": "30 Oct 2014",
            "name": "Vaishali Lilaramani",
            "stars": "1 star"
        },
        {
            "comment": "problems: 1.poor battery capacity 2.network issue:even after installing the network settings,cannot connect to internet from my vodafone sim. 3.3G signal drops in the middle. 4.overheating even after just 5 min of use.",
            "date": "30 Oct 2014",
            "name": "Ashrith B",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered this phone that too on one day delivery paying extra 100 bucks and they send me a music CD. Now i make a complaint and they tell me they would get back next day. No one calls back. I make a request for return they would take another 2 days to deliver. Haven't heard from them yet.",
            "date": "30 Oct 2014",
            "name": "Pushkar",
            "stars": "1 star"
        },
        {
            "comment": "Product is really worth for the money. Nice design, battery is reasonable. Delivery was before the mentioned date.",
            "date": "30 Oct 2014",
            "name": "Vasanth",
            "stars": "5 stars"
        },
        {
            "comment": "GOT EARLIER THAN EXPECTED. The phone is really awesome.The touch is very good.There is no overheating is found.The front cam is also good.The phone is very handy to use.The front speakers work properly .Even with the dual sim and WiFi I get enough battery back up.The voice quality is good.The Motorola emblem looks good",
            "date": "30 Oct 2014",
            "name": "PRANAV PREM",
            "stars": "5 stars"
        }
    ]
}
