{
    "filpkart": [
        {
            "comment": "Its the best I have ever seen in such a price range. Buy it!!! :D!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "16 Dec 2014",
            "name": "Jatin Basia",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile is very good speed, battery back up and awesome speaker sound. Camera quality is also super. I bought Moto g 1st generation for rupees 14000/- and Moto g 2nd generation I bought for 11749/-. But specification are better for Moto g2 compare with Moto g1. So we are getting more features with less prices. Even flipkart delivery also awesome less than one day I got the product with any extra money... I love flipkart shopping. Thank flipkat and Motorola for your better and quality services.",
            "date": "16 Dec 2014",
            "name": "Shiva Kumar Mu...",
            "stars": "5 stars"
        },
        {
            "comment": "Dear Flipkart Team, I have purchased this set around 10 days back. Device's looks, response, Internet, music etc are all very good. But there is a noise sound sometimes during the calls which is very annoying. Please suggest how to resolve the issue otherwise I would be compelled to go for refund. Also confirm if we can make video calls directly through this handset or not? Regards, Amrish",
            "date": "16 Dec 2014",
            "name": "Amrish Tiwari",
            "stars": "3 stars"
        },
        {
            "comment": "Defective product received by flipkart as Sim slot 1 is not working in my cell. Flipkart executive told me to format my phone which i dis. Thereafter phone worked for 4 days and same problem persisted again. Also lag in screen movement observed. Still waiting for thier executive for any positive response.",
            "date": "16 Dec 2014",
            "name": "Jatin Bajaj",
            "stars": "2 stars"
        },
        {
            "comment": "This good phone in low budget...smooth functioning ....play games without hanging and heating.....camera quality is good ...battery is performance is poor....5 to 6 hours max...and sound quality for music is worst.... u cannot listen for more than half n hour...",
            "date": "16 Dec 2014",
            "name": "akki",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 is a atom bomb in just 13000/- that an average man can afford! pros- 1) good sound quality 2) awesome cameras 3)screen is bright and good quality 4)strong built cons- 1)every 5th guy in the crowd will have a moto phone but still the phone is worth keeping.",
            "date": "16 Dec 2014",
            "name": "rutu93",
            "stars": "5 stars"
        },
        {
            "comment": "just got the mobile yesterdAy.... unable to download games not receiving calls... called motorola customer service couple times, they r unable to do anything !!!!!!!!!!!!!!called flipkart ... now, waiting for flipkart to help me with! mobile is taking 3-4 hrs for full charging !!!! is this charging normal with moto G ????????????",
            "date": "16 Dec 2014",
            "name": "DARSHINI G",
            "stars": "1 star"
        },
        {
            "comment": "There are a lot of competitors on this price range ! Depends upon what the user wants.I would definitely not give it a 5 star but its not bad either.",
            "date": "16 Dec 2014",
            "name": "shameelur rahman",
            "stars": "4 stars"
        },
        {
            "comment": "I'm using this phone from one month and i'm very happy with the product. Pros. 1. Good camera (picture and video quality in night is also very good) 2. Fast operating system (No Hang problem) 3. battery backup : 1 day with Internet and 2 days with normal use. 4. good display resolution 5. stunning in look and very handy. Cons. 1. Charging time is high (4 Hrs.) All over very nice deal. Also Flipkart done the nice job. I'hv used it 3 times for purchasing different items and got satisfactory service and result.",
            "date": "16 Dec 2014",
            "name": "Hardik Patel",
            "stars": "5 stars"
        },
        {
            "comment": "one week back i have purchased this mobile. battery life is not come for 4 hr. i couldn't use this mobile because of this issue.",
            "date": "16 Dec 2014",
            "name": "Muthuvel Rajamani",
            "stars": "2 stars"
        },
        {
            "comment": "Thank god I made the right choice.. Perfect phone in this price range ; specially if you want to gift someone ;-) Just one feedback though : It will only work with Company Provided MicroSIM and not the CUT ones.. Hence don't get too disappointed if your SIM shows disabled if you are using a CUT microsim.. Change the SIM with a company ( Service Provider ) certified MicroSim and It will work fine..",
            "date": "16 Dec 2014",
            "name": "Ravi Bhushan",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered Moto G2 on 17 November, 2014 and the product got delivered on 18 November, 2014 The product which i received have more defectes. I found that my mobile having these issues after 7days. [Not only this mobile all the MOTO G2 have the same issues. Recently my friend also bought the mobile and suffering with these issues. Guys be careful dont go for MOTO G2.] 1. Echo Problem [If someone call to you they will hear their voice to them. You wont get the echo] 2. Battery Drain [Within 4Hrs battery getting drained and mobile got switched off] 3. Automatically call disconnected continuously. So i requested for refund but Flipkart refused to give refund and they told we ill give a replacement for the mobile on 27 November 2014. The newly arrived product also have the same issues and again i called flipkart and requested for refund. They instructed me to go to the MOTO service center and get the \"JOB SHEET\" & \"DOA\" for refund. I visited the MOTO service center as usual they very not responsible with big fight with them got \"JOB SHEET\" & \"DOA\" then scanned those and send it to flipkart then only they refunded my money on 11 December 2014. This is a very bad experience i had.",
            "date": "16 Dec 2014",
            "name": "Karthikeyan Bh...",
            "stars": "1 star"
        },
        {
            "comment": "I ordered for this phone on thursday and got a message that it will be delivered to me by next friday, eventually I gave my office's address for the delivery. On Saturday morning I get a call form the number 9643303932 that whether I am available at the address for the delivery, since Saturday was an off I requested the delivery man to deliver it to me on Monday even inquired if the same can be delivered in the alternate address but he agreed for delivering it on Monday at my office address only. On monday I waited the whole day and tried to call at the given number to confirm if the delivery will be done, but there was no response and neither the courier boy contacted, I left office late expecting for a call back but all in vein. To my shock I receive a message at night that the since the delivery was attempted twice and couldnt be completed hence the order stands cancelled. when was the 2nd attempt made, can I get an explanation of it????? I wanted this to gift to someone and I am a regular shopper from Flipkart, and after this incident I will have to think before making any purchase from this site. Thankfully I opted for COD otherwise my money would have unnecessarily blocked as they would have given the credit to my wallet which means I have to use the money for shopping at this site only.",
            "date": "16 Dec 2014",
            "name": "Shama",
            "stars": "1 star"
        },
        {
            "comment": "I ordered from fast delivery and dam it was fast than i expected.The packaging was good. WS retailer is the best seller on Flipkart by far. The Moto G2 is the probably the best the best smart phone in this price range. It function good and its very smooth in use. Also the lolipop update are rolling out soon for Moto G2. 16 GB inbuilt and expandable memory upto 32 GB is the best feature all the phone should have. The 8 mp camera does the job very well and also you can download Google Camera for more features (if you are into photography and stuff). the front firing speakers are awesome and are very loud and clear (you will enjoy watching movies). The 5 inch HD display works good in broad day light (sunlight). The company claim that the phone is water resistant though I have not tested it (never will). Other features such as Motorola Migrate, Motorola Alert, Motorola Assist just make your contacts, photo,video...etc transfer easily and fast (once you figure out its easy). I would recommend you to go for it.",
            "date": "16 Dec 2014",
            "name": "Keval Thakar",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks flipkart for u service.my order reached before 5 days.. Product is also very satisfactory.. thank you so much.",
            "date": "16 Dec 2014",
            "name": "Arun V Nair",
            "stars": "5 stars"
        },
        {
            "comment": "PLEASE NEVER PURCHASE THIS PHONE. 1. MY PHONE BEING SWITCHED OFF AUTOMATICALLY AND POWER BOTTOM SWITCH NOT WORKING TO SWITCHED ON THE DEVICE. I AM REQUESTING TO RETURN MY PHONE. 2. SIM PORTS ARE NOT WORKING TO CATCH THE SIGNAL PROPERLY. MOST OF THE TIME SHOWN EMERGENCY CALL ONLY, WHERE OTHER PHONES WITH SAME SIM ARE WORKING.",
            "date": "16 Dec 2014",
            "name": "Susanta Swarnakar",
            "stars": "1 star"
        },
        {
            "comment": "The Moto G2 is well worthe the 13k paid. It gives good performance for a normal user. I am not sure how will it react with heavy applications. But I am happy with my purchase. Cons ------- Camera is a bit let down on low light photography (but its part and parcel with a low budget smart phone the plastic cover on the back side is too flimsy and each time I opened it I felt like its going to break :-) Flipkart logistics is awesome!",
            "date": "16 Dec 2014",
            "name": "Manu Vijayan",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola brand sells best Android with best price,best features...Design of equipment is so good to see and very delicate piece..I glad to suggest to all my friends purchase this phone with best price,& best features.....",
            "date": "16 Dec 2014",
            "name": "Nirav Rana",
            "stars": "5 stars"
        },
        {
            "comment": "well , i since i always check comments before buying anything online , i thought it as my moral responsibilty to write a review . phone itself is AWESOME . crystal clear display .. rock solid .. no lags in games . with a awesome 8MP camera..its camera is wayyyyy better than SONY or samsung 8mp camera . the only issue is battery , and crappy headphones tht comes in the box. i had to buy good headphones of panasonic worth Rs 849 seperatly .if u rout , working .. and u r not using the phone much except music and stuff , at the end of the day u have approx 30% battery left. but u are gaming and downloading , and using it heavily , it wont last more than 9-10 hours. final word- go for it.its still the best in the price range.. dont belive on crappy 8mp camera of spice and other brands which costs just 8000 bucks . they dont last a day, literally !",
            "date": "16 Dec 2014",
            "name": "Arnab Bhattach...",
            "stars": "4 stars"
        },
        {
            "comment": "One of the worst phones ever. A few key problems that I have been facing are: - dual sim issue wherein the second sim doesn't get detected so many times - phone hangs especially a call ends - touch screen issue My recommendation - don't buy at all, especially if you are thinking on dual sim lines",
            "date": "15 Dec 2014",
            "name": "Vijayant Yadav",
            "stars": "1 star"
        },
        {
            "comment": "I purchased a Moto G 2nd generation on 19-10-2014. Today the 1st button to on or off the mobile / wake it from the sleep mode is not working. I was directed by flipkart to one of the third party service agency for repair . I am not sure about the authenticity of the service provider. Flipkart is not providing the Motorola email id / phone number. Beware before you purchase any motorola mobile I submitted the device for motherboard change on 24-12-2014 to the authorised service provider as per their advise. The service provider said that that it will take a week to get the mother board, I am speaking to Motorola and the service person for the past 20 days and nothing is happening. There are conflicting versions from Motorola and the service provider regarding the service. I received a message from Motorola that the device has been repaired. But to my surprise, the service provider is saying that the mother board is yet to be received by them and it will take more time. When I spoke to motorola, they are not at all helpful. As on date i,e. 13-01-2015, I am yet to get the mobile back from the service provider. As such I request all the potential purchasers to think before placing any order on motorola mobile as the Motorola products are substandard and useless.",
            "date": "15 Dec 2014",
            "name": "N Mohan Chandran",
            "stars": "1 star"
        },
        {
            "comment": "Worth buying....But onething i am not happy is charger/headset provided is opposite to handset i received.",
            "date": "15 Dec 2014",
            "name": "audi7777",
            "stars": "4 stars"
        },
        {
            "comment": "Extremely good product. Performance is super awesome.Camera is much improved than first generation.Look for frequent orders.",
            "date": "15 Dec 2014",
            "name": "Chetan B",
            "stars": "5 stars"
        },
        {
            "comment": "Just go through the amazing features, enough said. Everything is good about this phone. Best under 15000 for sure.",
            "date": "15 Dec 2014",
            "name": "Abhishek Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Wow! This phone compares to the likes of Nexus and many other high priced phones in terms of features. It provides fabulous user experience with great memory capacity enhance-able with SD memory and offers dual-sim feature which is a reason to be delighted. The front facing camera is great for selfies and video chats. It is also quite fast. Too delighted that I purchased this phone!",
            "date": "15 Dec 2014",
            "name": "Jai Dev Rajak",
            "stars": "5 stars"
        },
        {
            "comment": "this is best phone in the same price range. except memory slot there is not any single drawback. screen resolution is crispy & clear. one of the biggest advantage is that its software is upgraded to latest Android version i.e. 4.4.4. Outcome of camera is so-so (but we cant expect to much from the phone of this price range). heating & hanging like issues are also not with this phone.",
            "date": "15 Dec 2014",
            "name": "Vaishnavi dixit",
            "stars": "4 stars"
        },
        {
            "comment": "this phone has outstanding performance the only problem with this phone is its battery backup.battary backup is really poor in this model",
            "date": "15 Dec 2014",
            "name": "RAMANAH",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this product from flipkart on 3rd december and got in hand on 11th december. I was eagerly waiting as it was out of stock and i received the product and switched ON, i was surprized as the display bliks continuously for 10-15 seconds. i also requested a return but the process has not been successful yet. Purchased so many items (Books, ear phone, mobiles... etc...) for the first time FLIPKART has disappointed me. :-( There is no way of giving Zero rating...",
            "date": "15 Dec 2014",
            "name": "Rajat Kumar Mi...",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g at very initial days of its release & felt gem of its kind piece.Now I wanted to get another mobile.So with the past experience with moto g, blindly I booked its 2nd gen as the old one is not available.Now things are not same as the time I had moto g 1st gen. I don't know the reason why i am not comfortable with the 2nd gen, is that reason the screen with less PPI, Is that the reason the call quality seems to be echoic, is that the reason the font and app logos seems larger than the usual moto g 1st gen, is that the reason battery which is poor in comparison with its old friend.I don't know..I am missing my old moto g now which i have given to my sister.I wish Flipkart & Moto bring the old one back into place.",
            "date": "15 Dec 2014",
            "name": "Sujith potu",
            "stars": "3 stars"
        },
        {
            "comment": "when i am taking video more than 5 mints then it was strucking and not restarting i have taken to the nearest Motorola service center it will take 5 days to know the problem , i am now thinking this is the waste of my money and time",
            "date": "15 Dec 2014",
            "name": "KiranReddy Sama",
            "stars": "1 star"
        },
        {
            "comment": "Im sure you are buying this phone as you think that its an affordable Android with amazing features. Please read this review before you take the plunge I have received two Moto G (Second Gen) from Flipkart. BOTH WERE DEFECTIVE. First piece delivered on 5th December . Started switching off automatically and then restarting from 7th December. Tried Factory Reset but it was of no use. Placed a replace order. Got a new piece on 15 December. I must say Flipkart is very efficient and prompt in customer care. I checked the box as soon as I got the package and it was not tampered. Tried to insert the SIM card and it was not popping in (SIM card is fine. Tried it on other phones). So remember when you are buying this phone there is a very very good chance that you may receive not one but two faulty phones in a row. Still want to purchase this Phone ? Good Luck to you!! Highly Disappointed, Moto !! Get your act together.",
            "date": "15 Dec 2014",
            "name": "Olinda Sequeira",
            "stars": "1 star"
        },
        {
            "comment": "Camera flash light doesn't off when you use. it always automatically off when your battery finishes. Battery is also not good . after full charge you have to charge again in 10 hours.",
            "date": "15 Dec 2014",
            "name": "suresh",
            "stars": "2 stars"
        },
        {
            "comment": "HI, I hoped the best form the flipkart, but they have delivered me a Moto G with a screen dispay problem. I tried reaching their customer care and did not get good response. No value for customer from online seller flipkart. Its better that Moto sells the products outside in mobile shops",
            "date": "15 Dec 2014",
            "name": "Krishnam Raju P",
            "stars": "1 star"
        },
        {
            "comment": "Everything in this price range is better than the competitors. But, the \"Headset\" is horrible, it doesn't fit in the ears and sound quality also is ok-ok.",
            "date": "15 Dec 2014",
            "name": "Anishwar Singh",
            "stars": "3 stars"
        },
        {
            "comment": "Within 2 month of use, phone become completely dead. Service center says whole chip card is to be replaced. I lost all my important data. Don't buy if u want a reliable device. Very disappointed after buying it. I already have Asus and redmi, they are working fine. Buying a moto is total waste of money.",
            "date": "15 Dec 2014",
            "name": "GAGAN GUPTA",
            "stars": "1 star"
        },
        {
            "comment": "There was a memory card on offer for free if order placed from an app. I placed the order and got the delivery today and there was no memory card When i called the customer support they decline there was any such offer. There was an offer if paid by sbi debit card 10% off with a cap on maximum. The page for sbi payment was just not working so could not avail that offer as well. Last i placed the order for a cover as well, the seller for the cover was different. I am being charged delivery charges for the cover. I had both the items in cart and cart value close to 13.5 K still 50 rs for delivery does not sound right. Seller is different or same is not customers order, if order value is high there should not be delivery charge. This is my second bad experience with flipkart. By the day the quality etc. is going down.",
            "date": "15 Dec 2014",
            "name": "Dilip",
            "stars": "1 star"
        },
        {
            "comment": "Battery is draining lot if u play games,using 3G/2G internet. very poor battery performance.... 2070 mAH battery for 5 inch HD display....very bad U cannot sort the apps icons in menu screen Even inbuilt apps of moto requires updates always in google play keyboard is very bad cant set different ringtones for dual sims No one touch icon on status bar for Data enable/disable camera,display,performance,speakers are good and worth If you use ur phone very often dont go for it....",
            "date": "15 Dec 2014",
            "name": "Vignesh K",
            "stars": "3 stars"
        },
        {
            "comment": "Google now works so seamlessly. Loving it by the day. The phone is not perfect and does have lags and gets stuck once in a while . The call quality is also not that great. The phone is big and serves the purpose well.",
            "date": "15 Dec 2014",
            "name": "Deepthi Ramana",
            "stars": "3 stars"
        },
        {
            "comment": "The performance and the design is good! But am having problem in availing the airtel 3G offer which flipkart & airtel promised to give during my purchase.",
            "date": "15 Dec 2014",
            "name": "P Bharat KUMAR",
            "stars": "3 stars"
        },
        {
            "comment": "the moto g 2 caption realy mean it good service by flipkart they replace me with new one when i face a sim slot issue in the first week good battery life good performance good sound stereo handy average camera average call quality high SAR value",
            "date": "15 Dec 2014",
            "name": "pratheek",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G just two months back and its battery is almost dead.. Fed up of the backup.. and its not like its baatery is dead now from the day 1 its not giving the backup as expected, beside this camera quality is also not good. Its 8 MP camera is performing very less than that of samsung Grand 8 MP camera. rest build and design is good. but i suggest if u r looking for good batery and camera then do not go for it. I am giving 4 stars just for its looks and design.",
            "date": "15 Dec 2014",
            "name": "Sonia",
            "stars": "4 stars"
        },
        {
            "comment": "Good Quality of Product at competitive price , Overall a good range mobile at this price . finally good experience to use Moto G 2",
            "date": "15 Dec 2014",
            "name": "Yogesh Sapkal",
            "stars": "5 stars"
        },
        {
            "comment": "Best Quality Phone at competitive price , good features , High Definition Camera adds more advantage in product",
            "date": "15 Dec 2014",
            "name": "Yogesh Sapkal",
            "stars": "5 stars"
        },
        {
            "comment": "its superb product frm Motorola. very nice.dont go with xiomi etc they look cheap infront of this no issues",
            "date": "15 Dec 2014",
            "name": "sravan kumar M...",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is very fast in than any other mobile in its price group. Camera quality is awesome especially its pictures with flash. I didnt expect the camera to be so good before buying. Display and everything is fine",
            "date": "14 Dec 2014",
            "name": "Sandeep%20krishna",
            "stars": "5 stars"
        },
        {
            "comment": "I've ordered this product for my won. But flipkart delivered a defective product. Which sim 1 slot is not working at all.",
            "date": "14 Dec 2014",
            "name": "Kalyan Biswas",
            "stars": "1 star"
        },
        {
            "comment": "When i first received the handset, there was a bright permanent spot on the screen. Then i requested flipkart for exchange. When i received the second handset, it used to get heated up to high temperature while using internet and during calls. And even the charger gets heated up during charging. Then I requested for refund after a bad experience at Motorola service centre. Flipkart promptly responded to my concern and approved my refund. After sales service is very important whenever we invest on a smart phone. And my experience says samsung is the best in this regard.",
            "date": "14 Dec 2014",
            "name": "Sandeep Kumar",
            "stars": "1 star"
        },
        {
            "comment": "all most three months completed and its working superb, Cool and as per expectation as on date. Thanks",
            "date": "14 Dec 2014",
            "name": "Jack Bhojak",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is perfect and the best you can get in this price. Performance is very good(even with only 1gb of ram) as this runs stock android(snapdragon 400 just makes things even better). The gorilla glass 3 protection makes it look premium and also provides protection against scratches(i.e. you don't need a screen protector). Also the screen contrast and color production is just great, it beats many of the 20k+ phones in this aspect. Overall this phone is just perfect for someone looking for a good display and a powerful performance phone in this price range.",
            "date": "14 Dec 2014",
            "name": "PRANAV CHAVHAN",
            "stars": "5 stars"
        },
        {
            "comment": "I'm fully satisfied from this product. No problem at all and i would like to say that flipkart service is also fantastic. It delivered my smartphone in 3 days in kolkata.",
            "date": "14 Dec 2014",
            "name": "Sunny Shah",
            "stars": "5 stars"
        },
        {
            "comment": "PURCHASED MOGO G RECEIVED WITHOUT EARPHONES, CHARGER.. NEARLY 100 TIMES CONTACTED WITH FLIPKART... THEY ARE SAYING EVERY ONE TIME ONE STORY.... WASTE OF TIME AND MONEY... SOME OF NEWS READ IN PAPERS AND WATCHED IN YOUTUBE... FLIPKART CHEETING PEOPLE ... SOME OF ITEMS MISSING... SENDIN EMPLTY PARCESLS.. DONG GO WITH FLIPKART.. DONT PURCHASED THROUGH FLIPKART THERE IS NO RATING \"0\" OR \"-0\" THATSWHY GIVING 1",
            "date": "14 Dec 2014",
            "name": "PANDURANGARAO TSV",
            "stars": "1 star"
        },
        {
            "comment": "FIRST AND FOREMOST: I GOT THE BOX ON WHICH THE \"FCC ID\" AND \"TYPE\" LABEL NAILED, BUT I DO NOT KNOW WHY IT IS? I have been using the phone for 20 days with almost 9 GB filled memory and 25 apps installed. Now the advantages: good screen clarity,smooth browsing experience of apps(but RAM uses around 500 MB without any running app),personalised care from motorola,lag free multitasking (though not equivalent to a 2gb r.a.m phone),upgradation to the lollipop 5.0,slim body-not edgy. Disadvantages: Battery backup is poor,speakers and earpiece not so good as the company claims- sound is hollow and shattered on high volume,earphones are of cheap quality(plastic make) but deliver good sound,no data cable in package. If the company increases it's talktime backup by upto 2 hours(it will increase internet browsing approx. upto 4 hours) in the next android update then it is a good product.",
            "date": "14 Dec 2014",
            "name": "Vivek",
            "stars": "3 stars"
        },
        {
            "comment": "Hii all, I m using Moto G 2 frm few days and my bro is using Asus Zenfone 5, I compared both mobiles and i find that asus is far better than moto. 2 gb ram in asus leads the phone. Next on you. Happy Shoping.......",
            "date": "14 Dec 2014",
            "name": "Gaurav",
            "stars": "3 stars"
        },
        {
            "comment": "I bought Moto G 2 in the second week of October,14. Working really good till middle of November. But for last 3 weeks I find that battery gets discharged so fast even if it is not used. I fully charged the battery before sleeping and find next day morning that more than 50 per cent battery gets discharged without using it even if wifi and blutooth is off. This has happened within few weeks of purchase. I shall go to the nearest service center and see what they will do.",
            "date": "13 Dec 2014",
            "name": "B R Minocha",
            "stars": "3 stars"
        },
        {
            "comment": "using it for one month... a good smart phone... great primary camera.... a higher mAh battery must needed.... cannot able to download image from MMS. there is only move option from sd card to ph memory. getting hot after recording video for only 2 mins.",
            "date": "13 Dec 2014",
            "name": "Shubhankar Das",
            "stars": "4 stars"
        },
        {
            "comment": "1. It takes more than 4 Hrs for 100% charging.. 2. When mobile data is kept on without restricting background data usage, battery gets drained in about 20 hrs. I am happy with the phone features and performance but for the above exceptions...",
            "date": "13 Dec 2014",
            "name": "Srinivasan",
            "stars": "4 stars"
        },
        {
            "comment": "Got the phone on flipkart with SBI cashback for 11,700. Delivery and packaging were great as usual. Unboxing I loved the sharp,bright and big display.Touch sensitivity is great and absolutely love the dispaly. 16gb internal with 8gb sd card is sufficient for my use and decent processing speed for my medium usage. Keyboard is great for texting and no issues even with the camera. It takes more than decent photos. However there a few issues. Battery is good with 20hrs backup with my medium to low usage. Drawbacks 1. Definitely a bit heavy 2. A full charge takes 4 hours which is slow 3. Earphones sound quality is terrible 4. With heavy use (with even multi apps left open) there is a lag and it definetly needs 2gb Ram.",
            "date": "13 Dec 2014",
            "name": "Abhinav",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is value for money. The only problem i faced with this device is that its is not a good multitasker. I think it is due to 1GB of RAM. Apart from that this phone is awesome.",
            "date": "13 Dec 2014",
            "name": "Gajendra Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "good-5 inch screen,build quality,kitkat os,camera primary and secondary both good,no lags bad-battery",
            "date": "13 Dec 2014",
            "name": "Nobin Abraham",
            "stars": "4 stars"
        },
        {
            "comment": "Delivery was good from Flipkart. The packing was superb, mindblowing. Unboxing the phone was a great experience. Moto G 2 is an example set by Motorola to other companies like Samsung. Build quality is awesome. Plastic back is durable and smudge proof. Phone doesn't lag in heavy games.Battery is average for a gamer but Decent for normal users. Motorola could have given 2GB Ram instead. Its an incremental update to Moto G not those revolutionary changes. Processor is the same. Could have improved. But though its my first Android, lucky to get this one.",
            "date": "13 Dec 2014",
            "name": "Bharat",
            "stars": "5 stars"
        },
        {
            "comment": "first of allread this review carefully if you are going to buy this phone this your decision is correct ...only fault is that camera is of 8 MP when you are going to capture some (15-20) photos in sunlight mobile gets hang and it heates toooo much so mobile takes 5 mins to come in normal condition and and second problem when you are going to charge the phone with power bank it heats slightly than charging with motorola charger except above faults the phone is excellent as it is open source android and can get latest updates from google at last my option is \"buy this phone if you are interested\"",
            "date": "13 Dec 2014",
            "name": "sohan patil",
            "stars": "4 stars"
        },
        {
            "comment": "No doubt it's a great and killer phone which gives very good performance but since I have used it for a more than month now it is started getting problems. First the battery is lasting me as it was lasting when the phone was new. Second sometimes the speakers of the phone don't stop playing the track or audio even if I paused or stopped the audio then I have to cruelly shutdown the phone while it is playing the audio to stop the speakers. Third sometimes the earpiece speaker don't let me to hear my callers' voice as it doesn't provide any sound while on the call sometimes. Then also I have to shutdown the phone and restart it to make a call again. How irritating is that, Moto? The person on some forum suggested me to order for replacement. So you tell me Flipkart what should I do now?",
            "date": "13 Dec 2014",
            "name": "Råhool Mågdúm",
            "stars": "5 stars"
        },
        {
            "comment": "hi guys i purchased moto g 2nd generation.it is very nice and good looking.cam quality is very good front and back.battery life is max 14 hours if use internet and play games and listening music.if use only for calls it comes one day...so guys my experience its nice product..... Thanks flipkart for solving my problem.nice response also and immediate exchange of my product..nice services....",
            "date": "13 Dec 2014",
            "name": "Nagarjuna Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "got 2 tymes damaged product ws retail dint expect such poor service but finally got a good one try to avoid such things.",
            "date": "13 Dec 2014",
            "name": "giridhar",
            "stars": "1 star"
        },
        {
            "comment": "A NICE PHONE... 1.GOOD BATTERY BACKUP 2.PREMIUM LOOK(ESPECIALLY OF WHITE) 3.SMOOTH N QUICK TOUCH RESPONSE 4.ENOUGH INBUILT MEMORY...16 GB 5. EXTRA BENEFIT-- GOOGLE PHONE...SO QUICK UPDATES OF ANDROID VERSIONS IF U ARE BUYING A PHONE UPTO 17-18K RANGE...PLS CHECKOUT MOTO G 2 ONCE....",
            "date": "13 Dec 2014",
            "name": "Mohit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Used it for more than 2 months now. Satisfactory. For the price it comes with it definitely packs a punch. I have faced 2 major issues though: 1.) Battery: Pathetic. Pathetic Pathetic. I need to recharge at least thrice a day for continuous use. Forget continuous use, even when I dont use it gets drained as hell. I am a college student. I just keep it in my bag when I go to college at around 50-60pc charge. No mobile data, no wifi, I just check my phone is the breaks for about 10-15 seconds. When I come back from college(7 and half hours) I have 10-15 percent charge remaining ! Atrocious ! To top it all up, it need more than 3 hours to charge a hundred percent! Every 5 minutes of charge hardly increases battery by 2 percent. 2.) Camera Quality of pictures is superb. Hats off. Problem is the time it takes to focus! Almost 15-20 seconds. So if you want to take a really fast snap, you just cant do !",
            "date": "13 Dec 2014",
            "name": "Nirmit Shetty",
            "stars": "4 stars"
        },
        {
            "comment": "All is good but I can't set mp3 as ringtone.Atleast I couldn't figure out how to do that.Couldn't find any option to set ringtones rather than the pre-installed ones.Also not quite happy with the sound. Other that that all is working fine. Camera is good !!",
            "date": "13 Dec 2014",
            "name": "NS",
            "stars": "3 stars"
        },
        {
            "comment": "Mobile is awesome! Quite happy with its performance but not happy with the offer of free internet on airtel because on airtel site the message is displayed that your device doesnt contain any offer..... so there is problem in availing the offer",
            "date": "13 Dec 2014",
            "name": "Vikram Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone for this price range. Has lot of features that I am still exploring. One of the things I don't like though is that even if you have dialled a number, upon disconnecting from a long call, the screen gets locked and I have to unlock to make another call. But that is just my requirement. Else it is a great phone.",
            "date": "13 Dec 2014",
            "name": "Deepa",
            "stars": "4 stars"
        },
        {
            "comment": "first of all got delivery in just 3 days, thanks to flipkart. This is an awesome piece,camera is good with 8MP. Overall the best product in this range. Thanks FLIPKART and MOTO",
            "date": "13 Dec 2014",
            "name": "saad topiwala",
            "stars": "5 stars"
        },
        {
            "comment": "Hd display no lag at all latest version speakers are good overalll go for moto cons battery getting drain fast",
            "date": "13 Dec 2014",
            "name": "Ganesh Sakpal",
            "stars": "4 stars"
        },
        {
            "comment": "The Phone is performing very well but one peculiar thing is being experienced that is during charging of mobile from normal charger supplied by the motrola the phone is opening the camera, called list, dailing some numbers,opening the weather report on it's own and unless the charging is stopped it is not coming back to normalcy. This problem seems to be a rare happening and I dont find any remedy for this.I am not getting the hyderabad service centre details to visit.",
            "date": "13 Dec 2014",
            "name": "T.SURESH",
            "stars": "4 stars"
        },
        {
            "comment": "Good phone at this price. Nice display. Moto is not providing USB cable with this phone, u need to buy it separately. Like any other phone, charger is not with the standard detachable USB cable, its old nokia types.. :P",
            "date": "13 Dec 2014",
            "name": "Manav",
            "stars": "3 stars"
        },
        {
            "comment": "\"Background\" I ordered the set on (6th sept 2014) and got it delivered on (17th sept) after certain delays in shipping it. \"The brighter side\" No doubt the product has marvellous features- a good cam, display-sound quality,touch andall that at a price of 13k. Its your perfect buddy for running apps and being updated....TILL IT STOPS TO FUNCTION !! THE DARKER TRUTH.. AND CONTINUING FRUSTRATION I AM STILL FACING: My set stopped working on 5th dec (IN JUST 3MONTHS!!)it was not even switching on only motorola android was getting displayed with a lot of anger and frustration and still with a hope to get it right at moto service centrei wentther next day itself, i explained them the problem and they asked to submit my set after having the invoice to replace a part which was a manufacturing defect. Its been like 8-10 days and they still havent got the parts(thats what they say) and have given me only a receipt of their shop with no signatures and asked to wait for another couple of weeks .They have not even given another set for use for the time being.This case has happened with many more and i think if in a city like Mumbai they are not able to transport the parts for their valued customer (as they say while selling) then may god help those buying moto products from smaller cities. *No criticism for product features but durability and customer satisfaction ke mamle me its not a company to rely on\" #personal experience",
            "date": "13 Dec 2014",
            "name": "Aishvarye Agarwal",
            "stars": "1 star"
        },
        {
            "comment": "GOOD MOBILE BUT TOUCH IS THE PROBLEM OF THE MOBILE CAMERA IS GOOD.. BATTERY IS GOOD . SOFTWARE IS GOOD",
            "date": "13 Dec 2014",
            "name": "kp online",
            "stars": "3 stars"
        },
        {
            "comment": "very very good product from motorola .. 1-speed awesome 2-look awesome 3-screen is awesome 4-runnig all application",
            "date": "13 Dec 2014",
            "name": "subash pradhan",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile worth for money....flipkhart.........safe.....and very fast..........customercare was very helpful....",
            "date": "13 Dec 2014",
            "name": "SHONIC REEGAN",
            "stars": "5 stars"
        },
        {
            "comment": "excellent mobile,worth the price.at this price no other phone with this hardware and software quality.till now no issues.satisfied with the performance.",
            "date": "13 Dec 2014",
            "name": "vinayak r nath",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is best at 13000 rupees..its touch is very fast. its camera is very good. corning gorilla glass is superb.no call drop at all.internal is 16 gb nd expandable is 32 gb.its processors is 1.2ghz quad core which is very great.its battery is good.android is 4.4.4 kitkat...",
            "date": "13 Dec 2014",
            "name": "Nilesh Maurya",
            "stars": "5 stars"
        },
        {
            "comment": "POWERFUL PHONE IN THIS SEGMENT... EXCELLENT ONLINE SERVICE BY FLIPKART.... EXCELENT DELIVERY SYSTEM...",
            "date": "13 Dec 2014",
            "name": "JAYKRISHNAN T",
            "stars": "4 stars"
        },
        {
            "comment": "Im using this phone from 4th Dec. 2014.....Phone is good......Camera is also good.....stereo speakers r excellent.....good 5\"display.... only problem is of its battery....whenever my mobile is on standby battery remains steady as soon as I start using it, battery drains very rapidly....specially when I start using camera and whatsapp....for clicking 4-5 photos by camera battery drains 4-6%....same for whatsapp, for 5 mins chatting battery drains 5-6%.....Not expected from Moto.... Moto U should give good battery backup.....Expecting some improvement from u for our mobile....",
            "date": "13 Dec 2014",
            "name": "Avinash Swami",
            "stars": "2 stars"
        },
        {
            "comment": "Hii i purchased this smartphone on 11 oct 2014 after using it for 1month the phone started automatically restarting and all of a sudden micro sd card slot not supporting the memory cards and i took the mobile to service centre 2weeks before still i didnt get my phones back those people are saying its a motherboard problem and parts are not avialable with them they have to receive it from bangalore after that they will intimate us... so please dont go for this mobile it will ruin you",
            "date": "13 Dec 2014",
            "name": "mohammed shafee",
            "stars": "1 star"
        },
        {
            "comment": "I Order Moto G 2nd gen On 6/10/14 they delivered me on 9/1014.so according to this their delivery timing is very nice,every time i called to their customer care they responded me well and replied with good answers what i asked them. *Phone is good screen having cornilla glass makes it more different from other phone . *Battery back up is nice.depends on what we do with our phones. *Display and resolution is very good. *Supports OTG(On the Go) USB Cable.as moto g don,t have its own file manager so we can download from play store and then we can attach pendrive and play the movies,or any file. #Sometime Movies Do not play with sound in VLC media player. *Camera Quality Is Very Good(Including Front) *Waterproof is its one of the good qualities. *Supports Upto 32 gb of memory and Pendrive by OTG Cable. *Till Now I have install 52 apps from playstore and the phone working good. provides some more features than moto g 1st Gen. motorola ids helps finding lost phones.",
            "date": "12 Dec 2014",
            "name": "Amit Jha",
            "stars": "5 stars"
        },
        {
            "comment": "Phone's sim slot does not work THE MOMENT I TOOK IT OUT OF THE BOX. Flipkart told me it is a manufacturer's defect so i need to contact them, no help from flipkart. Motorola service center is asking me to pay 3000 for a slim slot, i am pretty sure that this is a huge amount for a sim slot repair. i am highly disappointed from Flipkart's and Motorola's service. I googled and found out that slim slot issue is a common problem with MotoG2, I will not recommend this phone.",
            "date": "12 Dec 2014",
            "name": "Ankit Jain",
            "stars": "1 star"
        },
        {
            "comment": "Before I start with my review I must state a fact that I was using Galaxy Grand Duos prior to buying Moto G2 & I had no intention to dump Grand before it got bricked due to an accidental short circuiting of the motherboard but that is an altogether different story…let me continue with Moto G2. I ordered for a Moto G2 Black 16Gb on 7th Dec & the phone was delivered on 9th Dec. First of all the pros (Easy to point out as they are few) 1. Really smooth body finish…phone looks are good & sleek 2. Good camera both front and back 3. Battery is not that bad as pointed in other reviews, I am getting almost 36-40 hours backup with pretty good usage of whatsapp, internet, gaming, music and other apps. Now the harsh truths about the phone: This phone looks so much half baked that it wonders me whether the developers had any thoughts about the people using it or they just rolled this phone out to take advantage of the Moto-Flipkart combo hype… 1. The touch of this phone is hopeless…the phone suddenly freezes in between and stops responding to any amount of touch, then suddenly starts. Doesn’t respond to touch of fingers almost every time but responds to touch of thumb. Compared to this, Samsung touch is butter smooth & without any hiccup. 2. I have tried possibly everything to shut off touch pad noise…disabling it from sound settings, updating phone..application permissions but nothing at all has worked…seems like a fault in my piece & hence I am planning to return this phone. 3. You need to install an app to permanently stay on a 3G network which is not the case with Samsung where u just need to select WCDMA mode, in this phone there is an option to set your preference to be on 3G mode but it doesn’t work. 4. There is no widget for torch flashlight…u need to install an app for it. 5. Can’t add speed dials….need to install an app for it. 6. No file manager….again need to install an app for it. 7. Notification panel is really crappy…for person like me who switches on/off data network, it’s a huuuuuuge PIA to go through settings and all just to turn on/off data…seriously developers what were you smoking??? ;)  …. again need to install an app for it. 8. Can’t add any song directly as your ringtone….. Overall I feel, if you really wanna go for a 10k+ phone, there are many many more options available in the market..explore everything before zeroing on this one.",
            "date": "12 Dec 2014",
            "name": "Lakshay Soni",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone from Flipkart within first 10 minutes of it's sale. I was happy about my purchase with whatever limitations the phone has. But my happiness was short lived, as the screen had a crack after a drop from hardly 2 feet height under gravity. Before this I was using an iphone, Samsung Omnia, Nokia Lumia and each phone was dropped from considerable heights but nothing happened. This proves that the MOTO G 2nd Gen is outstandingly and extremely fragile. More than the fragility of the phone I got pissed off with the phone because of the after sales service offered by MOTOROLA at Kanpur. The authorized service center person has told that it would cost me some where about 7000/- and he offered a magnanimous discount of 300/-. The new phone costs 12999/- where as the screen costs you 7000/-. Either the Motorola is fooling the customer or the authorized service center is fooling. Just because of the service center the phone will get a single star rating. Come on Motorola, please control your authorized service centers, they are bringing bad reputation to your brand. If it continues this way very soon your brand will undo all the good work of recent times.",
            "date": "12 Dec 2014",
            "name": "Ltcol",
            "stars": "1 star"
        },
        {
            "comment": "I had it for my friend and I would say he took it over Xioami MI3 and he is satisfied with it. Its good upgrade over its previous Model MOTO G. Got it nicely packed from Flipkart as usual. Thank You..",
            "date": "12 Dec 2014",
            "name": "Suman Saurabh",
            "stars": "4 stars"
        },
        {
            "comment": "well to start of the 5\" screen and the resolution are quite impressive along with the overall design the moto g2 is superior to any other phone which comes in the same price range, but what the problem was is that it heats up while using internet or playing games and drains battery considerably. But it compensates this by its high speed interface and memory . Overall its a good buy and value for money is guaranteed. in my previous orders flipkart's delivery sucked but this time it was really fast, i got the phone in just 4 days that was awesome.",
            "date": "12 Dec 2014",
            "name": "Vinod V K, Tri...",
            "stars": "4 stars"
        },
        {
            "comment": "i bought moto g white today . its really a amazing product its camera , flash , display , ----------------- ver very good sound -------------very good thnxx flipkart",
            "date": "12 Dec 2014",
            "name": "Minku Karjee",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after using this phone for one week. This is my first smart phone. Pros: Good Speed for browsing, Multi Tasking is excellent, Main Camera is good, Front camera is not bad, it has good speakers. I haven't played any games with the device so i can't comment on that subject. Life and durability is yet to be determined. Cons: Battery is charging slowly and it drains quickly. I am not surprised by this, as this is the case with most of the smart phones. Data Cable is not available with the mobile, even though plenty of micro usb cables are available in the market, Moto should have provided the data cable. After Installing Battery saving apps (Battery Doctor) now the Battery life is good. Overall its a good phone at this price. If you want a good smart phone under 15k this is the one.",
            "date": "12 Dec 2014",
            "name": ".VENKAT",
            "stars": "4 stars"
        },
        {
            "comment": "i bought moto g2 on 2 months before,now i am facing more problem in it.please don't buy this waste phone.for this i like to give -5 stars but i am giving 1 stars",
            "date": "12 Dec 2014",
            "name": "dinesh",
            "stars": "1 star"
        },
        {
            "comment": "i have ordered as 2 month moto g2 mobile before in the flipkart which has the worst camera clarity compared to the same mobile brought by friend after a month and the picels of is breaking up to the core and the charge storage capacity and i am ordinary man belonging to poor family and i have wasted my money on trusting this website...and i am totally disappointed of its services and i am totally hurted up to the coreee",
            "date": "12 Dec 2014",
            "name": "gokula kannan .b",
            "stars": "1 star"
        },
        {
            "comment": "Product is excellent but the delivery using DELHIVERY delivery partner is pathetic. The product started on Oct. 14, 2014, 4:53 p.m. from Bangaluru and reached to my city on Oct. 16, 2014, 10:19 a.m. (within 41 hours) and it was laying eggs in the office of DELIVERY till Oct. 17, 2014, 7:11 p.m. when it was handed over to me and that too without eggs. This lasy delivery partner took 33 hours to deliver it withing the city. My address may be just 2-3 km from the office of DELHIVERY in my city. What is the use of making haste in sending the product from its origin city? Or this is another scheme to extract money from your esteemed buyers? Make delay in delivery and ultimately all will become Flipkart First member. Good scheme to collect Rs. 500 from each one.",
            "date": "12 Dec 2014",
            "name": "Dr SK Verma",
            "stars": "1 star"
        },
        {
            "comment": "i got defect in (speaker not woriking). so i went for replacement ,i got replacement product ,thatt product also defect in camera( blinking and its captured images all are fade only, i have tried in all settings). please dont buy this mobile in flipkart",
            "date": "12 Dec 2014",
            "name": "suresh",
            "stars": "1 star"
        },
        {
            "comment": "pro's gud battery life very gud camera con's phone get heated if more than two three function is running in parallel (like wifi, games, and running phone call) Available displayed RAM is 858 MB, however moto is claiming 1 GB RAM no in built file manager . no in built profile manager. Overall Phone is ok",
            "date": "12 Dec 2014",
            "name": "Pradeep Kumar...",
            "stars": "3 stars"
        },
        {
            "comment": "Received a fautly phone. Its not even turning on. Customer service helpline not satisfactory. Please replace/ refund !!",
            "date": "12 Dec 2014",
            "name": "Samrath Singh",
            "stars": "1 star"
        },
        {
            "comment": "Overall its an Awesome Phone but the main draw back is battery backup. except this Moto G2 is rocking",
            "date": "12 Dec 2014",
            "name": "Manohar Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "Product is value for money...............................................................................................................................",
            "date": "12 Dec 2014",
            "name": "Nitin Kotian",
            "stars": "4 stars"
        },
        {
            "comment": "Its been 6 days that I am using Moto G-2 and I am just loving this phone.If you are looking for a mid range budget phone you should definitely go for this phone. I am quite in close touch of iphones but I am finding some best features in this phone which are not even present in iphones. So guys don't think too much...just order Moto G-2. No problem with the phone so far...",
            "date": "12 Dec 2014",
            "name": "Ami Bansal",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this mobile in last week from flipkart. And I am fully satisfied with all the features of Moto G and with flipkart also. The performance of handset is soooooo........good!",
            "date": "12 Dec 2014",
            "name": "Anil Patil",
            "stars": "5 stars"
        },
        {
            "comment": "I am getting a yellow line on the scree for the same issue i call to the filpkart executive rgarding the issue for more than 5 times with in 2 days,but they are not taking requist.i don't know how for the flipkart customer care is helping the buyers.",
            "date": "12 Dec 2014",
            "name": "mallikarjuna",
            "stars": "2 stars"
        },
        {
            "comment": "Nice phone with good spec in this price range. If RAM size would have increased to two GB then it is better then any high end smart phone.",
            "date": "12 Dec 2014",
            "name": "Vikas Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "moto g 2ng mobile have the major issue is Battery backup problem .................................................................................................................................................................................................................",
            "date": "12 Dec 2014",
            "name": "pavan",
            "stars": "2 stars"
        },
        {
            "comment": "i am using moto g2.Its battery backup very weak and other features are very good.Camera quality ropchik.",
            "date": "12 Dec 2014",
            "name": "Narendra Kushwaha",
            "stars": "4 stars"
        },
        {
            "comment": "Fantastic phone in terms of Performance, Clarity of display, style and features...smooth to operate...only battery back up is not highly effective but it's still ok I would say... Automatic software update is a good features of Moto-G including OS. Finally, my Android Kitkat 4.4.4 has been upgraded to Android Lollipop 5.0.2.(On dated 29th Jan 2015) It's really a great news for this phone and also for me ..... Nice user interface....Thanks Google...",
            "date": "12 Dec 2014",
            "name": "Sudip Kr",
            "stars": "5 stars"
        },
        {
            "comment": "Regarding delivery, Got the phone with-in one day without paying any extra money. Regarding phone, Its an awesome model with brilliant features. Most important, its within the range of normal costumer.",
            "date": "12 Dec 2014",
            "name": "IPS Makkar",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using Moto G 2nd Gen since 1 week now, and I am pretty happy with the performance of the phone. The only major drawback that I can identify right now is that, for some reason, Motorola does not have its logo printed on the front of the phone. The logo is there on the back, but if I use a protective cover, the logo gets hidden. Basically, apart from myself, no one else gets to know that it is a Moto G 2nd Gen!",
            "date": "12 Dec 2014",
            "name": "Mit Chowdhury",
            "stars": "4 stars"
        },
        {
            "comment": "fabulous Product wuth High end Quality and delivery from Flipkart. Hats-off Moto for a well comeback.",
            "date": "12 Dec 2014",
            "name": "AB",
            "stars": "4 stars"
        },
        {
            "comment": "One of best android device from moto family. I am really happy with this material design and decent camera much more. But only issue is i have faced some bugs which took me to replace this product and i dont understand whats wrong with flipkart. Replacement of this product was done thrice as i was getting always a defective item. Finally after my fourth replacement its working fine. May be flipkart giving one's replaced item with other.",
            "date": "12 Dec 2014",
            "name": "Bhargav Ram Koduru",
            "stars": "5 stars"
        },
        {
            "comment": "After 1 month use the phone become complaint. And the service is very poor in Kerala. Now phone in service centre, last 2 week. My friends has also same problem.",
            "date": "12 Dec 2014",
            "name": "Vishnu Kumar A V",
            "stars": "1 star"
        },
        {
            "comment": "This is my 2nd purchased from Flipkart.... Flipkart's Delivery system is awesome & great, thanks to Flipkart. But it's service is poor & pathetic, becz i have order Moto G (2nd Gen) Black colour i found following cons in flipkart's services: 1. The inside of Box is not properly packed. 2. NO Invoice copy/bill copy/order copy was found inside the box. 3. My Moto G (2nd Gen) set is a black colour, but i received white colour of charger & head phone, I am surprised & didn't expect these type of service from Flipkart... I will review the Moto G (2nd Gen) later on...",
            "date": "12 Dec 2014",
            "name": "Durga Ballav Dey",
            "stars": "3 stars"
        },
        {
            "comment": "i bought moto g2 last month, its working nicely, and the camera is super clarity and the phone function is very good",
            "date": "11 Dec 2014",
            "name": "raja ramalingom",
            "stars": "5 stars"
        },
        {
            "comment": "i bought moto g2....its good looking cam is good in day light....but there is lag...wifi see is not soo good...when volume is ketp max.. sound is not good..there is a burning smell in audio jack and usb port....flipkart delivery is very good...i got the phone in a day...head phone is very nice....phone is not so fast...",
            "date": "11 Dec 2014",
            "name": "vijay babu",
            "stars": "3 stars"
        },
        {
            "comment": "Thanks Very nice product. Good Packing. Delivery is very faster. Thanks",
            "date": "11 Dec 2014",
            "name": "Steve",
            "stars": "5 stars"
        },
        {
            "comment": "I recently purchased Moto G V2 from flipkart and I am amazed by the quality of the product Pros 1) Excellent speakers compared to other brands like Samsung or Nokia. 2) Display very good 3) No hang-up problems 4) Excellent picture quality 5) Last but not the least.....very good battery back up...unlike other reviews my battery back-up is excellent......up to 72 hrs for nominal call usage. Cons 1) Headphone quality sucks. 2) Charger is very bad....has to purchase new one I could not find a single fault in phone....only accessories were bad. By the way...very fast delivery by flipkart",
            "date": "11 Dec 2014",
            "name": "Harish",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile display is big and processing speed is very good at this cost. Overall a good mobile to have. Pros: BIg Display Good Sound Excellent Screen resolution Cons: Battery will drain out in 6 hours if used with wifi.",
            "date": "11 Dec 2014",
            "name": "Shaik Fareed",
            "stars": "5 stars"
        },
        {
            "comment": "you wont regret after taking this phone.every think great in this phone. minimum price maximum benifit.",
            "date": "11 Dec 2014",
            "name": "Nikhil",
            "stars": "5 stars"
        },
        {
            "comment": "it's very slow in performance wise , getting struck while playing games. Multi tasking is very poor.",
            "date": "11 Dec 2014",
            "name": "Sunil M",
            "stars": "2 stars"
        },
        {
            "comment": "ORDERED THE PRODUCT ON SUNDAY 7/12/2014 AND GOT DELIVERED BY 9TH EVENING .FULLY CHARGED THE PHONE ON 9TH EVENING AND STARTED USING ON 10TH MORNING .THE PHONE IS GETTING HEATED CONSIDERABLY AFTER ONLY 10 MINUTES OF CALLING AND MY EAR STARTED FEELING SEVEREHEAT.THE BATTERY POWER REDUCED TO 20PERCENTAGE BY 12.30 P M.SATSFIED ABOUT THE DELIVERY BY FLIPKART BUT WORRIED ABOUT THE PRODUCT ON THE INITIAL USE.",
            "date": "11 Dec 2014",
            "name": "SREEKUMAR K A",
            "stars": "1 star"
        },
        {
            "comment": "I purchased MOTO G 2nd gen from flipkart. the delivery was within reasonable time but the product itself was not as expected. the hardware quality is very poor, the touchscreen was problematic from day one. It stops functioning within one and half months of purchase and currently lying at the service center for repair. The RAM was not adequate, the processor sometimes lags and if used continuously for few minutes it heats so much that it was not comfortable to hold in the hand. Overall very poor quality product keeping in consideration its low price also .",
            "date": "11 Dec 2014",
            "name": "Angshuman Sarkar",
            "stars": "2 stars"
        },
        {
            "comment": "This phone is great, but there are too many add ons from motorola that decrease battery life. There is also a model with basic android and nothing else. I'd suggest people buy that instead.",
            "date": "11 Dec 2014",
            "name": "Rohan Kapadia",
            "stars": "4 stars"
        },
        {
            "comment": "Handset has good features but I feel some points to be improved... 1. Secondary camera is good but primary camera not as good as it to be for 8 MP. Asus Zen 5 has better than this. 2. Camera has less settings/Features. 3. FM radio not have option to play in loud speaker. 4. No one application for Call recording work to record both side. otherwise all other features are good. You can think for Zenfon 5 for better camera.",
            "date": "11 Dec 2014",
            "name": "amol chavan",
            "stars": "3 stars"
        },
        {
            "comment": "I had bought MOTO G 2nd generation from flipcart i had like it a fantastic mobile for the budget it had somany functions",
            "date": "11 Dec 2014",
            "name": "GOKUL KRISHNA",
            "stars": "5 stars"
        },
        {
            "comment": "simply awesome product value for money no doubt just go for it guys perfomrance ids best for gaming also that i expect. its really nice display is full HD .. wow that's great for to watch movies any other stuff.",
            "date": "11 Dec 2014",
            "name": "Ashwin Hulawale",
            "stars": "5 stars"
        },
        {
            "comment": "I received my product in two days and guess what it was totally worth it. I got a free SD card and was ready to go. It has amazing looks and perfect hardware for an android app developer like me. The cameras are excellent. However the airtel offer didnt really work for me as yet. The earphones do not match the quality of the phone and the 5.0 update isnt exactly up and running but it should come soon. The screen is nice and Motorola outdid themselves. The phone is a powerhouse rather than a black candy bar. Mind you, you don't get a USB cable with this piece. I love my phone. I call it the 'Black Pearl'!!",
            "date": "11 Dec 2014",
            "name": "Joey Pinto",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is great it works really well but after sometime it stops working well . The Motorola service centers are located very far away also",
            "date": "11 Dec 2014",
            "name": "Nakul Sahgal",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing this review after using this Moto G (2nd gen) for a week.I am very happy with its performance and I dont see any lags while gaming. The slow-mo camera is also good. I am still waiting for the official android lollipop OTA update. So far the only issue I found is its battery life, it only lasts for a day, otherwise everything is perfect.",
            "date": "11 Dec 2014",
            "name": "Sriram",
            "stars": "5 stars"
        },
        {
            "comment": "Some comments not mentioned in the earlier reviews. Phone is fantastic, butter smooth and pleasing to use. 1. Thought that google contacts will automatically sync after signing in and using Migrate but did not happen. Had to transfer the vcf file from my Samsung to get all my contacts. SIM card contacts of course did sync. 2. Cannot force the phone to use 3G. I use a DOCOMO connection and it changes from E to H and H+ randomly. Could be a problem of Docomo. 3. Started the day with full battery at 6:30 AM and by 8:15 , of constant listening to music and using 2G + 3G the battery reached 76%. So I am not sure if the battery will last the day. Charged the phone for 8 hours by the way. 4. Using Samsung earphones , the audio seems good. The provided headphones don't look or feel good. 5. Migrate transferred most of my apps , settings etc. A really good feature to have. Only if it had transferred my contacts too, I would have been giving this a 5 rating. 6. Feels good in the hands , easy for reading",
            "date": "11 Dec 2014",
            "name": "Prakash P",
            "stars": "4 stars"
        },
        {
            "comment": "it is a nice product working smothlly.having little bit heating during gaming and surfing.otherwise i am hoping the next update lolipope ASAP..buy it wid correct budget i bought it with special offer at only 11749,...!!!",
            "date": "11 Dec 2014",
            "name": "darshan thakkar",
            "stars": "5 stars"
        },
        {
            "comment": "It has been 20 days since i got this device from Flipkart. To start with, I had my own concerns after going through the reviews. But then finally made up my mind to go for it. And I don't regret it one bit. Below are the pros and cons i observed in these 20 days of usage. PROS: 1. Both front and back camera are just fine. Pics come out pretty decent. Obviously u can't expect DSLR quality in this price range. 2. 1 GB RAM is more than enough to run all the apps and games smoothly on this device and the quad core processor is pretty good with no lags so far. 3. Front speakers are great. Sound cracks a little at high volume but that''s not a major issue at all. 4. Smooth touch and awesome looks. CONS: So far, the only issue i have faced is the battery back up. Its not really good, but then you can always carry a power bank along with you. In the end, I would just say, it's a good product from MOTO and definitely a great value for money.",
            "date": "11 Dec 2014",
            "name": "KANISHK DHADWAL",
            "stars": "5 stars"
        },
        {
            "comment": "Overall the product is good.I am satisfied with the product.The battery backup is good enough.The display and sound quality is good enough.The small issue is with the moto camera.A small time lag is occurring while auto focusing,which is negotiable.The touch to focus is little difficult to get focused on a particular thing from some more number of things.Through a long use of camera,battery is getting heat. I think moto can over come these issues through the updates.",
            "date": "10 Dec 2014",
            "name": "VaruN",
            "stars": "4 stars"
        },
        {
            "comment": "Best in Class, Truely Amazing, Worth & Value for Money, Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Camera: Does a decent job in indoor and outdoor. Voice quality is very good",
            "date": "10 Dec 2014",
            "name": "Bhimarao Shindhe",
            "stars": "5 stars"
        },
        {
            "comment": "i ordered this phone on monday. by 2 days it reached my adress, hatsoff to flipkart service. Abt phone feeling great",
            "date": "10 Dec 2014",
            "name": "sooraj suresh",
            "stars": "5 stars"
        },
        {
            "comment": "I founf MotoG2 a good buy at this price. pros - nice built, good looks, android is smooth, camera is good cons - battery takes longer to get charged, battery is in built Over all satisfied.",
            "date": "10 Dec 2014",
            "name": "Annie bhrdawaj",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing phone everything is good about it. previously i had been using a moto deft xt 535 and i am truly satisfied with motorola. just go for it",
            "date": "10 Dec 2014",
            "name": "apurv singh",
            "stars": "4 stars"
        },
        {
            "comment": "Got this mobile recently through flipkart. Great performance. Cons: Doesn't come with screen guard. Motorola battery could have been better No USB detachable charger. Limited ring tone optionsoptions Speakers are prominent. Camera quality poor in low light settings. SAR value is high at head. Pros: Nice display quality Process speed is good. Speaker quality good but not outstanding. Camera quality excellent in day light setting. Good body design. Gorilla glass supplement HD display. While shooting videos, photos can also be taken. Good brand value. Overall, great phone. And great value of money.",
            "date": "10 Dec 2014",
            "name": "N Shaji",
            "stars": "5 stars"
        },
        {
            "comment": "A GREAT HANDSET CONSIDERING PRICE AND PERFORMANCE. NO LAG EVEN WITH HD GAMNG. HAVENT NOTICED ANY HEATING PROBLEMS. STEREO EFFECT IS GR8. [-1] STAR FOR SLOW CHARGING BY ITS DEFAULT CHARGER. WOULD RECOMMEND SAMSUNG CHARGERS . SLIGHT HEAVY WHEN ADDED FLIP COVER OF MOTO. DEFAULT HEADPHONES ARE SATISFACTORY.[BUY SKULLCANDY...ETC...ETC]. IMAGE QUALITY AND VIDEOS COME OUT TO BE GREAT EVEN IN LOW LIGHTING CONDITION. FLIPKART SERVICE WAS GREAT.WOULD RECOMMENDED TO A FRIEND. THANKSS :-)",
            "date": "10 Dec 2014",
            "name": "tejas vagal",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is good phone at such a decent price, but i one i got has some manufacturing defect, it's color reproduction is not good, its white color is yellowish and dull, while the phone display remains off, it doesn't look full black, it has a violet tint, behind the gorrilla glass. I personally have two moto G2 but the second phone that i ordered is not up to the mark. I told the same to flipkart, still waiting for a positive reply..",
            "date": "10 Dec 2014",
            "name": "sunil rajput",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G2 an awesome phone and VFM, it has all latest features and moreover, Moto will upgrade it with Android loliipop soon :)",
            "date": "10 Dec 2014",
            "name": "Prabhakar Mali",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought moto g in depavali time from flipkart they nice & short time to deliver the product but I am not satisfied for this product after one month due to issues for not hear ringing sound & receive calls not hear voice in some times every time faced this situation switch off & on the device I have been irritated now I can't get replacement & not get exact service in my nearest service provider ( Coimbatore ). They contact no is not working then why to give customers. Finally I have to advice don't fool them customers",
            "date": "10 Dec 2014",
            "name": "Prabakaran Rengaraj",
            "stars": "1 star"
        },
        {
            "comment": "I am using this products and working fine, Only Issue I Found dual sim if travelling one state to another state then catching signal is difficult",
            "date": "10 Dec 2014",
            "name": "Sukumar D",
            "stars": "5 stars"
        },
        {
            "comment": "Hello Guys, This phone is awesome and excellent. Without any problem buy it. Still not issue. The Best Ever Phone in the budget of 15k.",
            "date": "10 Dec 2014",
            "name": "Deepak Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "well i ordered my moto g 2nd gen and when i opened the box it looks so pretty and when i hold it in my hand i feel it so compatible in my hands bcz i thought that 5 inch displays phone ll b bulky but it was not.. it was so compatible in my hand and gives me a decent look... now come to the product which i got. pros. 1- awesome look 2- kitkat 4.4. as u all know.. upgradable up to next os. L. which is the best part of this. 3- awesome camera capture with rear as well as by front cam. 4- gud battery life.. gives me 1 day of backup.. which is good for my personal use. cons- got faulty product as i said 1- plastic back panel.. but it was mentioned that the panel is made of polycorbonic matt finish .. which gives u rubburised feel. 3- it was lagging even in small graphics games. like subway surf.. where my frnds same product not lags at all in any game.. weather it is of higher graphic or smaller graphic games conclusion- the cons which i have mentioned was of the faulty product. well i made a return request for my product and flipkart has accepted my request and promised me to deliver the new product at 20th of dec. so i will wrote my original review on original product... but i must say, flipkart return policy is best thats why i always came to flipkart for shopping.. two stars for the faulty product... but i will increase stars when i get satisfied with my replaced product... till date enjoy with two stars...",
            "date": "10 Dec 2014",
            "name": "Hemant Yadav",
            "stars": "2 stars"
        },
        {
            "comment": "best mobile for low budget",
            "date": "10 Dec 2014",
            "name": "Prabhu ponnusamy",
            "stars": "4 stars"
        },
        {
            "comment": "Very good product and value for money. It never hangs and speed is superb in this segment. Buyer should prefer this phone.......",
            "date": "10 Dec 2014",
            "name": "Rajnikumar Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Used it for a while now... Got the product on Oct, 18.... Awesome timing by Flipkart. Moto G 2nd Gen filled in the space between Mata G 1st Gen and Moto X quite well. I found it to be good enough for using as compared to some high end phones by Samsung and other brands. Preety good build... Very Durable. Performance wise.... there's no lag when using it for gaming or other applications. Battery wise.... it has a satisfactory performance like any other Android Handset in the market. Over all.... it's a winner.",
            "date": "10 Dec 2014",
            "name": "Khushal Bhalerao",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome Phone against money spent. - Greate camera - Sound Quality is good ( headeset is poor quality, but if you get new one from market or use existing good one, will get good quality of sound ) - Touch is great. - Phone Speed and processing is awesome, I played lots of games and downloaded ashplat and many big 3d games, played many times, no hang or no heating issue. - Battery life is decent, over wifi works full day (24 Hrs) and in 2g - 3g works works around 14 - 15 hrs - One of the major thing which is not written or i didn't get in specification is it supports OTG. Which is quite surprise for me after buying :-), I tested with my micromax tab keyboard, kingston and sandisk pendrive - data trasfer is greate and supports major items. - Its also come with latest android. Go for moro g second gen if you have this budget, don't go behind any other brand like samsung, lg or panasonic. I also have Nokia 620, it also good on same price if you like windows. Many user doen't like this but if you want stable product and better battery, go for windows. My bettery live upto 2 days with wifi and more than a day in 3G with skype calling and watsapp messaging :-)",
            "date": "10 Dec 2014",
            "name": "Rishi Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Friends, I am having problem with my Network. The connection goes all of a sudden and then you will be able to see the Emergency call popping up. Its too disturbing. Regarding the Gaming, as mentioned by others, Moto G 2nd is not good for high end games, while playing it will exit from the game. Battery life is good. 4 start- due to connectivity issue.",
            "date": "10 Dec 2014",
            "name": "Sujith",
            "stars": "4 stars"
        },
        {
            "comment": "if ur budget is around 15k, then you have to choose this cell_phone. i bet, you wont regret buying it! more over, a guaranteed lollipop update!",
            "date": "10 Dec 2014",
            "name": "Sahil Shinde",
            "stars": "5 stars"
        },
        {
            "comment": "First of all quick delivery by flipkart. Got it on second day of order at Kerala. Delivery man came to my office, he called me 5 times as i was not there, i was unable to attend, he left me a message. When i called him back, he came again to my office to deliver it. Usually courier people call us on phone and ask us to collect shipment from their office. About Phone: My budget was 20k . Searched on internet for months and finally decided about Moto g2. Phone looks stunning. It is easy to handle as it is curve shaped. Display and Camera are good for the budget. Stereo speakers are awesome. Battery was the biggest issue for which i didnt buy it earlier.. But after using 3 days, i m satisfied with it. Battary lasted upto 11pm since mornig for last 2 days for moderate using. And USB OTG function is working fine, we could transfer data @ 15mbps from a usb pendrive. Who should go for it? If your budget is near 15 (20 if u want OTG on phone), u want a 5 inch phone that is easy to handle and looks good, go for it. But if u want to use net throughout day, go for any other phone, or buy one power bank also with moto g.",
            "date": "09 Dec 2014",
            "name": "Bibin Thonippa...",
            "stars": "5 stars"
        },
        {
            "comment": "I completely satisfied with the phone, but, the charger & hand free does not Carrie quality. If you expend 13000 on this phone then you will get only phone not other accessories. very cheap mentality Moto.",
            "date": "09 Dec 2014",
            "name": "Piyush Tariyal",
            "stars": "3 stars"
        },
        {
            "comment": "battery life can be only problem but one can always buy power banks for that, also charger supplied is only 550 mA output so very slow charging.",
            "date": "09 Dec 2014",
            "name": "Rajan",
            "stars": "4 stars"
        },
        {
            "comment": "offer is not working and nobdy will help you. i m not satisfy with service. geting irritate with the service",
            "date": "09 Dec 2014",
            "name": "sandeep",
            "stars": "2 stars"
        },
        {
            "comment": "I got this phone yesterday and was very much impressed with specs on Flipkart. But as soon as I switched it on and tried to connect my home wi-fi , nothing was happening on the screen. I tried restarting the phone but that didn't help either. Thats was not expected from Brand like Moto.",
            "date": "09 Dec 2014",
            "name": "satyam kishore",
            "stars": "2 stars"
        },
        {
            "comment": "i am purchased two mobiles from flipkart on 08/12/2014 one is Huawei honor holly and moto g 2nd .the first one (honor holly) works very well.And the moto g terrible pathetic,.....>the main problem of this device is it losing network i am not able to connect with 3g and the wifi is also not connecting .After i got the product 8/12 itself i registered the complaint to flipkart and they said a technical assistant will call me on this 09/12 3pm technical assistant call me (i was in office) give some tip that i dont have the phone with me he said he will call me 8 pm and surprisingly he didnt.Got a messege that technical assistant will call tomorrow 10/12 1. 30 pm .Again and again i calling to customer care they saying tomorrow tomorrow tomorrow..",
            "date": "09 Dec 2014",
            "name": "Biju Joseph",
            "stars": "1 star"
        },
        {
            "comment": "Great phone... one can't ask for more. This phone can be classified as an \"Extreme value for money product\". I'm one of those who don't believe in spending a lot on mobile phones, because of the kind of rough usage I often put it through.",
            "date": "09 Dec 2014",
            "name": "Arun Seshan",
            "stars": "5 stars"
        },
        {
            "comment": "i recieved the replacement of my moto g 2nd gen mobile promptly by flipkart .. but this mobile also has the same problem ..the person who calls me hears his own voice and echos .. now i dont know what to do.. flipkart please help me.. its my months pay down the drain.. please help me get a good mobile",
            "date": "09 Dec 2014",
            "name": "SRINIVAS",
            "stars": "4 stars"
        },
        {
            "comment": "i love the phone, every thing was working fine but i was despondent by seeing head set, no doubt u can bye this mobile if Ur budget is under 15k",
            "date": "09 Dec 2014",
            "name": "gowtham pranav...",
            "stars": "5 stars"
        },
        {
            "comment": "Ordered the phone yeaterday, got it within 24 hours. Hats Off to Flipkart's Delivery system with commendable packing of the phone. For MOTO G 2, all looks damm fine. Just in case UI is somewhat makes it look ordinary. still Great Work both Flipkart and Motorola.",
            "date": "09 Dec 2014",
            "name": "Shashank Dwivedi",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered the product on the launch day and also got launch day offers. VFM phone as it has water proof screen along with Gorilla glass 3.Definitely a one to consider though there are other brands that give tough competition. Advantage : 1) Waterproof screen 2) Since a Google product latest Android updates would be available. So go for it if you really are considering the above features as beneficial.In case you can handle phone better and not much bothered about Android update there are definitely other brand phone that can be considered.",
            "date": "09 Dec 2014",
            "name": "Karthikeya",
            "stars": "4 stars"
        },
        {
            "comment": "The product is not tested at all, my products lcd is damaged from day one, not ready to replace, instead told a application to fix., the charger is over heated, and you even dont know whether the product is charging or not. better product is available with better price and with local shopkeeper next door to home.",
            "date": "09 Dec 2014",
            "name": "Puneet Jain",
            "stars": "1 star"
        },
        {
            "comment": "Actually i liked it when it was with my friends and they recommended me. I even saw its performence when it was with them and battery backup was also fine. But when i bought this, then my problem started. It over heats a lot for a 5 mins call,just call & can feel it through the back cover. I'm talking about back case covering over back panel. It fells like burning inside can't keep in pocket. When using internet or searching map by using internet, it heats like hell & battery drain, my god . Battery comes down to 55% from hundred for just one hour of Whatsapp and facebook. just the 2 app. i installed some high performance games cant play because either the device gets heated or a battery gets drained. But when in my friends case , for them the device works smoothly. i've ordered a refund or a replacement lets see. If i get a perfect normal piece i'll write the review for that also.",
            "date": "09 Dec 2014",
            "name": "Susmith S",
            "stars": "1 star"
        },
        {
            "comment": "This phone was good. But ear phones was not fit for ears. It was always fall down. you need to have better one.",
            "date": "09 Dec 2014",
            "name": "Kishore Kumar Yepuri",
            "stars": "3 stars"
        },
        {
            "comment": "ex lumia user here. was irritated of the slow speed, wanted a quick phone, in my budget. went for this one. what a buy great display really really fast, snappy, GUI transferring music, pics etc from my pc to the phone is simple plus mem card slot put a samsung 16gb evo class 10 card, works absolutely fine with the phone did i already mention the great display? 5 inch screen, makes the iphone 5s look like a toyphone(no seriously, use the moto for some time, and then use a 5s, the apple will look like a dwarf compared to this beast).",
            "date": "09 Dec 2014",
            "name": "Ahaan Daur",
            "stars": "5 stars"
        },
        {
            "comment": "not a bad deal because of it is not expensive as compare to samsung and sony and given the worthfull functions but flip kart delivery is so bad . i ll never trust before on delivery",
            "date": "09 Dec 2014",
            "name": "Aayush Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "the mobile is best phone within this budget... icing on the cake is the Android lolipop update which is soon going to be released very soon... the phone is well built n sturdy and overal performance is superb... thanks to the flipkart team and ekart logistics fpr promt delivery n nice packageing... flipkart you are the best.. i m a regular customer of this website and i am never disappointed or dissatisfied with the quality and service you provide.. love you flipkart.. a must buy hone for all the friends",
            "date": "09 Dec 2014",
            "name": "DEBOJYOTI naskar",
            "stars": "5 stars"
        },
        {
            "comment": "a highly recommended budget smart phone , it never hands thats the best part about it.! Battery backup is good and updates are coming for this model thats a plus point.,",
            "date": "09 Dec 2014",
            "name": "Moazam Iqbal",
            "stars": "5 stars"
        },
        {
            "comment": "HI I have ordered a Moto g2 mob and it will delivered next day only , i really appreciate in the product devilry. with in short time . and even the features are good and by 2nd and 3rd day started noticing the battery unsually was taking more time to get charged fully,around 5-6 hours.and also draining of the battery was faster within 6-8 hours. the product as the Spekar issue , when i receive a call or dial a call the glass break sound appears where is it gives the disturbance in the voice . hence i have raised the complainant and replaced the device with the other moto g2 , where in this mob also there is a minor in voice glass break and disturbance in the Spekar call. and also there is a problem with charger / battery where it wont get charge continuously when it is in changing with minor shake disconnect the process and get incomplete in the charging, Flipkart need to check the product once Quality product then process to the service So again i have raised the complaint to get the issue resolve and waiting for the resolution",
            "date": "09 Dec 2014",
            "name": "Arun Kumar Mu...",
            "stars": "1 star"
        },
        {
            "comment": "I had ordered 2 mobile phones on the 5th of November and i was happy when i saw that they arrived a day early that was the last ting i was happy bout with this mobile. Day 3 started my struggle with the phone getting constantly getting hung up and getting over heated. called the customer service exe who told me that its normal for the phone to get heated up and that i should not complain about it. i was very much upset about the product and now the customer service was even more hurtful. eventually i requested for a replacement reaching the limit of my patience and i get a call back saying that hanging is a natural thing and that i should restore my phone to factory setting and that it would solve my problem. and that said we will call u back to check if the trouble shoot has worked or not which they never did. and went ahead and closed my request saying that we cant take a return request as we solved your problem. how does this even sound logical? than a few days later i call up again to place a replacement request this time they say that they are replacing the phone as they accept its faulty. and said that the phone will reach me on 8th. i was keeping a track of it on their website and i was waiting for my phone the last i checked it said that the product was dispatched from bangalore. and is expected in Hyderabad. and the very next day it said return request is canceled. i was shocked and called up the customer care and they said it was canceled due to logistical problems. and they said they were placing a request immediately and that the product will be delivered today. i called in specifically to ask if it can be deliver on today as i was out of station but i got a call yesterday saying i need to come collect the product some 4-5 kms away from my delivery point. i told him that i am not in the city and asked him to come today for which he responded very rudely I quote\" Main thumara Naukar nahu huun agar chaheyae to aa ke lena nahito return kardunga\" i was shocked and requested him to deliver it today. he finally agreed after repeated calling and said he will be delivering it by 11 am today. i haven't got call till now so i called up the customer care and expressed my disappointed she just disconnected my call and i was put through to the survey. I can understand that u guys don't have the intent to help but this is retarded. lost hope on e-commerce. thanks to one company. Motorolla you have done a big mistake by selecting flipkart as your only retailer. don't know about you but i am a customer am completely disappointed.",
            "date": "09 Dec 2014",
            "name": "Raam Gottimukkala",
            "stars": "1 star"
        },
        {
            "comment": "Moto again has proved no one can manufacture mobile phones better than them and flipkart has delivered it. From display to battery wifi to mobile data every thing is perfect only regret is better quality headphones and absence of data cable from manufacturer..",
            "date": "09 Dec 2014",
            "name": "M KAILASH SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "In the case of Moto G 2nd Generation; whenever auto connected with Edge connectivity in the dual sim mode, a warning notification arrives \" Restricted Access changed, Emergency service is blocked\" frequently. It is so irritating that it blocks phone calls. other features are nice.",
            "date": "09 Dec 2014",
            "name": "SHYAM KISHOR P...",
            "stars": "1 star"
        },
        {
            "comment": "I would say i have got the best phone in the market for amazing price. Thanks to Flipkart. I have ordered this phone by observing the high class features with Brand name of Motorola. Its 5-inch HD display and fast processing i really enjoyed a lot !!! Thanks to WS retailer also as i got this phone in offer of 10 % Cash back. I would say it is totally in the budget and with the brand name this phone is really best. I would like to suggest my friend to go for it !!!",
            "date": "09 Dec 2014",
            "name": "Sridhar Pisapati",
            "stars": "5 stars"
        },
        {
            "comment": "Every aspect of this phone including display , camera, sound quality is good, no lags, processor is also good (when compared with smart phones at Rs.12999 price range)....EXCEPT the below issue : ( :( POOR BATTERY..!!!! Its take around 4.5 hours to get 100% charged. Battery does not last even 5 hours when 3g is ON.(Random usuage) Most shocking : No data cable in the box !! As charger provided in box is a NON - USB PLUG IN type charger, which charges the battery at a dead slow rate of 20% for 1 hour !!",
            "date": "09 Dec 2014",
            "name": "Aravinth",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone a month ago everything feels good except the battery backup battery will not come for a whole day as mentioned in the add its completely fake it drains so quickly if u use 3g it ll cum for 2 to 3 hrs only , with the normal use it willcum upto 5 to 6 hrs except that everything is good",
            "date": "09 Dec 2014",
            "name": "Balamurugan M",
            "stars": "3 stars"
        },
        {
            "comment": "I am extremely disappointed with very slow service of flipkart. I had purchased moto g 2nd generation phone, which had to replace in the very first month of its purchase. After it got replaced, within a month I am again facing touch screen issues. I reported the issue on 1 dec 2014 and after so many reminders too I have still NOT received any technical call !! Please do something on urgent basis, I CAN'T USE A TOUCH SCREEN PHONE IF THE TOUCH OF THE PHONE SCREEN IS NOT WORKING. Looking forward to your urgent support. Regards,",
            "date": "09 Dec 2014",
            "name": "Rashi Guppta",
            "stars": "1 star"
        },
        {
            "comment": "A good phone that is reasonable. But some applications such as sound recorder do not come with it and hence you have to install the app.",
            "date": "09 Dec 2014",
            "name": "Ramya",
            "stars": "5 stars"
        },
        {
            "comment": "special thanks to flipkart express delivery service. overall this phone working fine no issue and upgraded to aneroid 5 budget phone for every one",
            "date": "09 Dec 2014",
            "name": "PRAKASH ATWAL",
            "stars": "5 stars"
        },
        {
            "comment": "Got mine yesterday. I was surprised at the great build quality. I have been using a Samsung Galaxy GT S5830i for the past two years so this phone is a great upgrade for me. Software - Moto G2 is known for running near stock android and is going to get the latest android version Lollipop soon and the next year's android version or Android M release falls in the phone's 18 month upgrade window too, which means this phone will run the latest softwares upto 2016 or till Android N releases. All in all we are up for a great software experience. Hardware/Specs - I personally have a list of minimum specs that I need on my phone and Moto G 2014 fits most of them. Min 8 MP Rear Cam ✓ Min 720p Screen ✓ Min 1 GB Ram ✓ Min 16 GB Internal Storage ✓ SD Card Slot ✓ 4.5 - 5 Inch Screen ✓ Removable Battery ✗ Buying Moto G 2014 was an amazing deal for me. I'm pretty sure I am going to have this phone till 2016 when Android N releases and hopefully there will be a Moto G 2016 with far better specs (Read 1080p screen, more RAM,better Cam,etc) to which I'll upgrade. Until then I'll have fun with my Moto G 2014. 5/5 for this one. EDIT- One thing I noticed is how fast the battery charges. It might be fast just for me though since my previous phone was a 2010 Samsung Galaxy Ace and Moto G 2014 is this year's model and technology has surely improved tremendously in 4 years. So me feeling it charges fast might mean nothing to someone who uses latest phones.",
            "date": "09 Dec 2014",
            "name": "Sanjay R Bhavsar",
            "stars": "5 stars"
        },
        {
            "comment": "Within just 1 and a half months of purchase, my phone's audio quality has become very bad. the speakers have blown up, I can't hear anything when connected through earphones. The earphones are working fine when connected to other devices.",
            "date": "09 Dec 2014",
            "name": "Sakshi Singh",
            "stars": "1 star"
        },
        {
            "comment": "I am repenting my decision to select this product. First time I got this product there were issues of heating and no auto rotation of screen. Contacted flipkart and I got my phone replaced . Again in replaced phone I am facing issues of touch not responding and no auto rotation. This time flipkart refused to replace my product even if it comes under so claimed \"30 DAY REPLACEMENT\" warranty. Worst service by flipkart and waste product from motorola. So don't buy any motorola product.",
            "date": "09 Dec 2014",
            "name": "Pramit Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "Which i like the best is sound quality with stereo sound system. Performance of the phone is great. only two things will be dis appoint to you that battery back up is very poor you can use only 12-15hrs with one full charge. and 2nd one is display is not brighter like moto g 1st gen. Other wise over all build quality n mobile good. And worst delivery by ws retail and courier service. I book it on 21st Oct and i receive my parcel on 2nd Nov.",
            "date": "09 Dec 2014",
            "name": "Gaurav Pakale",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone from flipkart . I ordered it on 5th december and got it within 12hrs. Tat's the service of FLIPKART. No doubt the phone has got everything with this price tag. But, I found two major cons on this phone. The first one is sometimes the latch up of network is poor for which i am disapponted. The second thing is that it has poor battery life for which I have to charge the battery twice a day.Even if I don't play games, still the battery lasts only upto 4-6hrs. Also, it takes lots of time to charge the battery(around 4hrs). Otherwise,the phone is good. worth buying it.",
            "date": "09 Dec 2014",
            "name": "Shubhajit Sahoo",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, I have ordered this phone by observing the high class features with Brand name of Motorola. Its 5-inch HD display and fast processing i really enjoyed a lot !!! Thanks to WS retailer also as i got this phone in offer of 10 % Cash back. @Bottom Line- Within this budget with brand name this phone is really best.In fact it is better than the best !!! I would like to suggest my friend to go for it !!!",
            "date": "09 Dec 2014",
            "name": "kumar%20gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "Obviously better than the other phones in this range. But still if they would have given full HD 1080p display, it would have been an icing on the cake.. Other than that, the device is flawless!!",
            "date": "09 Dec 2014",
            "name": "Ravi Ronald Dayal",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased MOTO G (2nd Gen) on 12/04, it is really awesome. Before placed the order I read so many review even 1 start also, but finally I decided and taken. I can suggest MOTO to my friends and family numbers",
            "date": "09 Dec 2014",
            "name": "Parandham Jaddu",
            "stars": "5 stars"
        },
        {
            "comment": "GO FOR IT ! WITHOUT ANY SECOND THOUGHT the best phone u can get ! with all the features loaded, even if u go fr slightly higher range phones u won't be able to get this much bundle of features packed in a single device. Great work from Motorola",
            "date": "08 Dec 2014",
            "name": "Siddharth Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, I am the only person out of those huge group of people to be lucky. I purchased this phone when It was not available 24th November 2014. It was not available on Flipkart for almost 3 weeks. So lets get started: Everything on the phone is good apart from 2 things.1. It takes a lot of time to charge 2. the charger aint detachable. Thats it. Its a proper gaming phone. not installed much so dont know.So far so good. FLIPKART IF YOUR SEEING THIS COMMENT. PLEASE CONSIDER ME AS THE LUCKY ONE FOR YOUR OFFER WHICH IS TO BE ANNOUNCED ON 28TH DECEMBER 2014. LOVE U",
            "date": "08 Dec 2014",
            "name": "Naveen Suresh",
            "stars": "4 stars"
        },
        {
            "comment": "this phone is perfect for me , i get 5 inches display for more comfortable browsing , well built body for my rough usage and good camera for selfies , the best part is the its price.",
            "date": "08 Dec 2014",
            "name": "Navneet",
            "stars": "5 stars"
        },
        {
            "comment": "mic is not working properly sometimes , some burn smell comes out while playing games with in 5 min ,wifi is so good for browsing but if download is too low in 3G",
            "date": "08 Dec 2014",
            "name": "praveen",
            "stars": "2 stars"
        },
        {
            "comment": "I received the mobile one week after i placed my order since the product was out of stock. but the product was not worth the wait. M satisfied with the design and the performance of my mobile. The only problem is that the charge drains within very few hrs(2-3hrs) even if the phone is just idle. Waiting for the replacement nw!!",
            "date": "08 Dec 2014",
            "name": "Jananee Ravilla",
            "stars": "2 stars"
        },
        {
            "comment": "i had order this phone on 5th on got next morng.i think it a good service by flip kart guys dont go on con that if u want this phone today or tomorrow u have to pay 100 or some money.dont worry guys they will delivery u on time. display 9/10 camera 7/10 processor 9/10 battery 8/10 i had not tried the gaming things.so im sure about gaming things. overallthe best budget smart phone",
            "date": "08 Dec 2014",
            "name": "praveen",
            "stars": "4 stars"
        },
        {
            "comment": "I may say this product has it's value ....with good performance & great appear 1 GB RAM,Dual Micro Sim ,1.2 Ghz Qualcomm Quad Core Processor 5-inch HD Screen,Expandable Upto 32GB Android v4.4.4 (KitKat) OS 8 MP Primary Camera and 2 MP Secondary Camera... I don't think we need to compare with all others ...try to use it then you will understand ty flipkart",
            "date": "08 Dec 2014",
            "name": "Sreedhar Tharoor",
            "stars": "5 stars"
        },
        {
            "comment": "The complaint was firsrt of all i have disable viber mode even though if i type a message in whattsup and viber and normal mess it is in vibrate mode",
            "date": "08 Dec 2014",
            "name": "Rakesh Reddy",
            "stars": "1 star"
        },
        {
            "comment": "hi i hav brought moto 2g i don't knw hw to increase the hearing volum in my smartphone can any1 help",
            "date": "08 Dec 2014",
            "name": "udayakumar",
            "stars": "4 stars"
        },
        {
            "comment": "I had bought this device during the Big Billion Day and to be honest, it's totally worth the cash and wait! In my opinion , this is one of the best Android Phone! With its 8MP back camera and KitKat OS ( which is getting update to Lollipop) , it's totally better than the other smartphones.. One Drawback: The battery life is quite poor when connected to the WiFi , but it's so the case in many other Android Phones too.. So it's not a Major Drawback",
            "date": "08 Dec 2014",
            "name": "Navin Shetty",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Generation) - overall good phone. Slightly becoming slow while using both the sims. Batter performance is too bad on 3G. I have to recharge my phone twice a day and every time i have to carry my power bank with me.",
            "date": "08 Dec 2014",
            "name": "Chintan Desai",
            "stars": "3 stars"
        },
        {
            "comment": "speaker quality is very poor and when we received call phone speaker is vibrating...we can not hear voice clear....don't buy.................... 000000 rating",
            "date": "08 Dec 2014",
            "name": "shailesh",
            "stars": "1 star"
        },
        {
            "comment": "I have received a Defective piece of Moto G (2nd Gen) from Flipkart. While charging the battery, phone gets very warm making it impossible to talk putting on ear. Also though its brand new battery drains very fast. Need to charge twice a day. and speaker also not working dear all friends don't buy Moto G2 Very Poor quality & Wrought less product .",
            "date": "08 Dec 2014",
            "name": "BALAJI ANGAMUTHU",
            "stars": "1 star"
        },
        {
            "comment": "product delivery was done within 24 hrs.Awesome Service Would like to recommend to all for an affordable price",
            "date": "08 Dec 2014",
            "name": "Mohith",
            "stars": "5 stars"
        },
        {
            "comment": "ITS CALL DROP DONT KNOW WHY? COMPANY NEEDS WORK ON IT ,CAMERA GOOD, DISPLAY AND TOUCH SENSITIVITY TO GOOD, CANT LISTEN MUSIC THROUGH SONY HEADPHONE, ONLY PHILIPS AND HP AND SAMSUNG HEADPHONE CAN SUPPORT . BATTERY GOOD",
            "date": "08 Dec 2014",
            "name": "MUKUND S.BALLAL.",
            "stars": "3 stars"
        },
        {
            "comment": "i got this product with in 2 days.an outstanding service by flipkart. no comaparison of this with other in india.",
            "date": "08 Dec 2014",
            "name": "NAVIN KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "Battery drains fast because of increased screen size.. but other features are cool and worth for money. Good one to buy.",
            "date": "08 Dec 2014",
            "name": "Ravishankar Ba...",
            "stars": "4 stars"
        },
        {
            "comment": "Budget under 15k ? Buy it................................................ ........................................ ................................................................................",
            "date": "08 Dec 2014",
            "name": "Rahul Bhat",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this barely 3 months ago and already the camera has started acting up. The camera software crashes for no reason and even after re-booting the phone it wont come back on. Quality has taken a big hit.",
            "date": "08 Dec 2014",
            "name": "Rupesh",
            "stars": "2 stars"
        },
        {
            "comment": "The most important thing that any smartphone buyer wants to know that whether it delivers what it promises; Moto G (2nd Gen) does exactly that. I have used this phone for more than a week now and here's what I found: Pros: - Screen clarity and resolution - Camera quality (both front and rear) - Unadulterated android experience - It is fast and is great for multi-tasking - Good shopping experience with Flipkart Cons: - Average battery life. It lasts little less than a day with moderate use - The headset quality looks cheap and fragile.",
            "date": "08 Dec 2014",
            "name": "Karthik V",
            "stars": "4 stars"
        },
        {
            "comment": "I was already a proud user of Moto G (US piece single sim) Then ordered a one for my wife from Flipkart. As soon as this got launched, I ordered immediately. Happy with the improved camera & sound system. A proud Moto G user. Though waiting for Android lollypop update",
            "date": "08 Dec 2014",
            "name": "Kuldip Nair",
            "stars": "5 stars"
        },
        {
            "comment": "i wish i would had rated 0 or in minus..i ordered for moto g 2nd generation..i recieved used phone 2nd hand..it was not working good at all faced lots of hang camera slowerr os problems..when the time came to exchange it i courierd it within a day.than the worst thing happened was they were not replacing back a new phone giving shit reasons of out of stock..for refund it took a month..never buy gadgets online they are frowd..never trust this site its not worth..it dont even deliver on time products .please dont order",
            "date": "08 Dec 2014",
            "name": "Ankit Mhatre",
            "stars": "1 star"
        },
        {
            "comment": "IT IS A GOOD PRODUCT BUT SOME PROBLEMS IN LOCK SYSTEMS FLIP KART IS DOING EXLENT JOB THROUGH OUT INDIA",
            "date": "08 Dec 2014",
            "name": "kiran kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Dont buy this moblie service is unavailable my mobile is giving prb within 3 weeks n last 18 days it is in service center",
            "date": "08 Dec 2014",
            "name": "Sumit Jagdale",
            "stars": "1 star"
        },
        {
            "comment": "if your going for budget phones this is the best one. Very good build quality, and does what its supposed to do very smooth integration with the OS.",
            "date": "08 Dec 2014",
            "name": "Dev Fonia",
            "stars": "5 stars"
        },
        {
            "comment": "After reading all reviews about flipkart and Moto g2. I ordered Motog2 on 4 Dec 2014 with urgent delivery. They delivered me the piece on 5 dec 2014. After receiving the hand set when I tried with my Micro sim, handset is not recognising the sim. I tried with 10 micro sims in both the slots but it is not recognising the sim. When I called to customer care on the same day they said support team will reach me in 24 hrs but support people reach me on sunday. They given some trouble shooting steps. but it not worked out. I am totally disappointed with the support team and technical team. I am running behind the people for atleast exchange of the handset but they are not properly responding. Really very pathetic for me from the last 4 days. No option to give zero rating I request all the people make sure that you should not receive a defect piece.",
            "date": "08 Dec 2014",
            "name": "Suresh Babu M",
            "stars": "1 star"
        },
        {
            "comment": "Its a decent phone and there is no problem like some say about charging or heating up...its superb...:)",
            "date": "08 Dec 2014",
            "name": "Arunika Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "Some time hang in mobile. Camera resolution is nice but also hang if you use long time.Mobile overall is good.",
            "date": "08 Dec 2014",
            "name": "patel mayank",
            "stars": "2 stars"
        },
        {
            "comment": "using for last 2 months... Flipkart replaced it when I got a defect piece delivered. No issues till now.",
            "date": "08 Dec 2014",
            "name": "bhaskar",
            "stars": "4 stars"
        },
        {
            "comment": "One of the best thing which i have got from flipkart.Excellent delivery with lovely response. Mobile-very good feature.Good price.Worth buying it",
            "date": "08 Dec 2014",
            "name": "RAJ KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "Packing is good, delivered before the due date. Amazing Flipkart... :). Very easy access for everyone.",
            "date": "08 Dec 2014",
            "name": "Kannapiran",
            "stars": "4 stars"
        },
        {
            "comment": "EVERYTHING IS PERFECT IN THIS DEAL EXCEPT THE EARPHONES AS BASS RICHNESS IS NOT SO GOOD AND SOUND IS TOO LOUD WHEN YOU INCREASE THE VOLUME ONE MORE THING PLEASE INCLUDE DATA CABLE IN IT OVERALL GREAT PHONE ALTHOUGH DISAPPOINTED DUE TO EARPHONES ONLY.....",
            "date": "08 Dec 2014",
            "name": "SHIVBAHADURSIN...",
            "stars": "4 stars"
        },
        {
            "comment": "Every thing is same as Moto G 1st Generation except for the screen size and camera resolution, Only drawback observed on my mobile is touch sensitivity is little jerky at some times.",
            "date": "08 Dec 2014",
            "name": "Kishore Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "I took this phone 2 months back, I haven't come across any serious issues. Sometimes phone will get little extra heat but not a big issue. Sometimes I feel network problem because of dual sim. Worth for the money...",
            "date": "08 Dec 2014",
            "name": "Vishwanatha Jois",
            "stars": "4 stars"
        },
        {
            "comment": "I've been using this phone and I just cant help from falling in love with it. Everything about my MOTO G 2nd Gen is jus AWESOME... Every aspect about the phone is phenomenal. Thank You Flipkart.",
            "date": "08 Dec 2014",
            "name": "MANASI PANCHAL",
            "stars": "5 stars"
        },
        {
            "comment": "got my phone toggeled through it and i was not able to find any issue but am not able to use google hotword please revert flipkart",
            "date": "08 Dec 2014",
            "name": "Lovedeep Bakshi",
            "stars": "4 stars"
        },
        {
            "comment": "I am very glad to have Moto G (2nd Gen) smart phone through Flipkart. Flipkart a really good job by delivering my order with in the next day of the order. and also the package was well packed and safely delivered. I really appreciate Motorola for a decent designed phone like this. A real Minimalism, neat and clean design with max features for the price. I would recommend this product who are all looking for a better smartphone for a better price. Thank you all...........",
            "date": "08 Dec 2014",
            "name": "ARJUN J",
            "stars": "5 stars"
        },
        {
            "comment": "Pro's:Good performance Good camera Great battery life Excellent value for money Cons:Average looks and material quality Android 5.0 Lollipop Could Be Headed to Moto G (Gen 2) Soon Moto G (Gen 2) Software Update Rolling Out, Makes Google Now Launcher Default",
            "date": "08 Dec 2014",
            "name": "Kannan C",
            "stars": "5 stars"
        },
        {
            "comment": "Just bought it yesterday...and believe me its superb. This is my first Android phone so i m still exploring it. 5inch display (crystal clear, crisp and handy enough) Lag free so far Decent camera for both indoor and outdoor pictures, Low light pictures are really good Good sound quality Android version : 4.4.4 micro SD slot (Moto G1 was not having it) Fast browsing Multitasking and Smooth Gaming, thanks to Qualcomm Snapdragon processor Best phone under Rs 15000. It provides Moto Assist which is pre-loaded in the phone. Some people wrote about heating issues but I did not find any issues regarding that. The only con I found is that it requires too much time for charging and average battery life. Flipkart Service is superb. Took only 2 days to deliver it. 4stars for the phone and 1star for fast delivery by Flipkart. Those who are planning to buy it, please go for it! :)",
            "date": "08 Dec 2014",
            "name": "Shreya Roy",
            "stars": "5 stars"
        },
        {
            "comment": "I got a message saying that there is 10% off on Moto G if I use SBI card. When I tried to check the offer at 10:30PM it's showing that the offer is closed. But in the message it was showing that the offer is valid till 11:59 PM.",
            "date": "07 Dec 2014",
            "name": "Ram Prasad Maa...",
            "stars": "1 star"
        },
        {
            "comment": "In love with the since the day one, using it since oct 14 and haven't faced a single problem yet.nice camera both back and front, could have improved the focus of front camera,",
            "date": "07 Dec 2014",
            "name": "Mayank Rawat",
            "stars": "5 stars"
        },
        {
            "comment": "quick delivery- within 1.5 days delivery to ranchi- fantastic. phone- very good at this price. airtel offer not getting activated. anyone pl advice. overall very good",
            "date": "07 Dec 2014",
            "name": "Anand Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I would recommend this phone to evryone. Its a value for money investment. Order it now and get to know its value",
            "date": "07 Dec 2014",
            "name": "Mansi Kapuria",
            "stars": "4 stars"
        },
        {
            "comment": "Its been 1 month....Everything works fine ( Display, Kitkat, Sound, Bass)...But after converting into ART from dalvik, whenever I restart the device, all the apps. are getting optimised which consumes around 10 minutes....In stock keyboard, drag feature is nice, but cant turn CAPS always button on...Real Racing works excellent....Stock Camera is just okay...But Google Camera compensates it...Also Stock Music player doesnt detect many files...But Rocket Player Does....Battery goes well if display is off.( I get 2 days without display on and any handoffs(travelling)...But while browsing or gaming the stats. is like 1% for 3 minutes........Anyways grt buy for 13k",
            "date": "07 Dec 2014",
            "name": "anees",
            "stars": "4 stars"
        },
        {
            "comment": "SO i purchased this phone about two months ago. This is indeed an excellent phone for the price. Can't think of any cons yet, except for one. The screen cover broke rather easily. The drop was rather small (from table to ground). The lcd screen is intact but the glass on top of it broke quite easily and the repair costs about 7k. I'd suggest buyers opt in for a screen guard and a good casing to protect the phone from these kind of unexpected disasters. Battery life is ok, it lasts about 8 hours with internet etc working and lollipop upgrade should improve upon that. For the remaining part, the phone is excellent for its price. Hardly any noticeable bugs, and the touch is very smooth. This phone has given me the best experience so far, minus the crack that happened to come up rather easily. A sturdier build from motorola would have taken this a lot far certainly.",
            "date": "07 Dec 2014",
            "name": "Ankit Pruthi",
            "stars": "3 stars"
        },
        {
            "comment": "i want 2 ask a question that what is the use of a smartphone man without a good battery. battery is shit.",
            "date": "07 Dec 2014",
            "name": "sagar rana",
            "stars": "3 stars"
        },
        {
            "comment": "Nice handset still I have not face any problem while using it and also the handset price is in everyones budget",
            "date": "07 Dec 2014",
            "name": "Sachin Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "thoroughly tested and used the product for 3 days and seriously its a great phone in this budget !! games work well at medium setting Cons: battery lasts less than expected Headphones are REALLY not good, don't mind purchasing one if you're a music lover -1 start for battery",
            "date": "07 Dec 2014",
            "name": "Rajiv Kapoor",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g 2nd gen a great collection of all experiences which a user wants but got beaten by Xiomi Redmi note by leaps & Bounds good job moto guys but its time to get updated ................... as Redmi showed that even at 8999 a user can have an awesome device",
            "date": "07 Dec 2014",
            "name": "KAUSHIK KOIRI",
            "stars": "3 stars"
        },
        {
            "comment": "Nice mobile.with 16 gb internal memory. I am using these phone from last 2 months. Latest android. Quick delivery from flipkart.",
            "date": "07 Dec 2014",
            "name": "Arjun Trimukhe",
            "stars": "5 stars"
        },
        {
            "comment": "It was a wonderful experience from ordering to delivery, Satisfied with the Flipkart delivery service they stuck with their timely delivery which much appreciated. I received the good in a full pack condition the product was in mint condition & ofcourse the value for money product. Overall i am satisfied with the product, nice product in the range of 13k. Suggesting everyone to go for it if looking for a medium-low range product, A real value for money. Thank You Flipkart & Thank you Moto",
            "date": "07 Dec 2014",
            "name": "Angesh Pandey",
            "stars": "4 stars"
        },
        {
            "comment": "Truly Friend a very nice phone using this since 1 month.Completely satisfied.Battery backup is normal 1 day as usual don't be afraid of its battery.I rate it 5 stars.Amazing Phone in comparison to other same budget phones.",
            "date": "07 Dec 2014",
            "name": "Neelaksh",
            "stars": "5 stars"
        },
        {
            "comment": "First of all, hats off to aswum delivery of flipkart .Ordered phone at 8 PM and it was in my hands next day at 12 noon (this is standard delivery). The white colour looks amazing .5' screen, good touch sensor,good voice quality, sometimes touch was not effective and had to prese it 3-4 times, camera is ok. Still exploring it.",
            "date": "07 Dec 2014",
            "name": "Arpit",
            "stars": "4 stars"
        },
        {
            "comment": "amazing phone. nothing beats it in terms Value preposition. smooth performance. also you can wait for 64 bit support phones to launch in 2015 and not waste your money this year`s overpriced phones.",
            "date": "07 Dec 2014",
            "name": "Sonni",
            "stars": "5 stars"
        },
        {
            "comment": "Hi guys, Recently i bought Moto G through flipkart. When i inserted SIM and tried to call i found that Microphone is not working. Everyday iam sending mails to them,but simply they are extending the days without any reply. Upto now there is no reply from them. Maybe after 30days replacement policy completed they will send mail to me and tell that ''your 30days is finished so go to service centre and do it''. So please don't buy through flipkart. Very worst experience for me.",
            "date": "07 Dec 2014",
            "name": "Ram",
            "stars": "1 star"
        },
        {
            "comment": "Its my first product from flipkart and flipkart makes me happy because I got my phone on 2nd morning after ordering at night on 10th nov. Nice service by flipkart. I am writing the review about moto g 2nd gen after using the phone about 1 month. Pros: 1. 8 mp primary and 2 mp secondary camera. Both the camera is capturing nice picture. Also, primary camera works good at night also because of flash light. 2. Front speakers are stereo which will make you feel good while playing games or listening song. Audio quality is very good even at full volume. 3. I can play heavy games like asphalt 8, call of duty, etc without any lagging. 4. Phone connectivity(Network, wifi, bluetooth) is also good. I never saw my network fluctuation as other user was mentioning that this phone has some network connectivity problem. 5. Battery runs for more than or approx 24 hours if you use normally. I always use my phone in this way: About 3 hours for listening song without headphone, playing game asphalt 8, contract killer for 1 and half hour, 2 hours of calling on 3g network, 1 hour whats app, 2 hours internet browsing (chrome). My phone is 24 hours connected to wifi. Using both sim, one is 3g and one is 2g. Facebook, whats app, gmail app, linked in services run for 24 hours in background. Using my phone in this way runs for 24 hours which is pretty good for smartphone. 6. Gorilla glass is tough.So many time, I carried key with my smartphone (by mistake) but didn't got any scratch. 7. The design of phone is very good. Its good in hand and it will not slip from your hand because of the bacpanel design. Cons: 1. Basically, i don't have any point. So, i can write only one thing that camera app can be improved more.",
            "date": "07 Dec 2014",
            "name": "Zishan Mohsin",
            "stars": "5 stars"
        },
        {
            "comment": "About Flip cart: I order this mobile by Thursday noon and i got it on Saturday morning. When ordering the product i face some issues like Amount debited from account but order not placed. Then after one hour only, the order got placed. Nice offer (Cash back 10%) Quick deliver of the product and safe. About mobile: Easy to handle weight less smooth display touch performance lot of new features camera is worth forr 8mp rear and 2mp front video 720 px and slow motion capture make feels good.",
            "date": "07 Dec 2014",
            "name": "Saravana kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart.com have a grate e-shopper plateform which provides the product of the customer easy available and easy returns without any claimed.........................and the payment are must be secured by the flipkart finacial ltd.........................flipkart.com is amezing e-shopper in the world in my eye sight................",
            "date": "07 Dec 2014",
            "name": "sunder singh...",
            "stars": "5 stars"
        },
        {
            "comment": "Based on a day of use of moto g 2nd gen, everything works smoothly. The touch is fantastic, colors are crisp, no lag in playing mid level games, camera pictures has some noise in low light photography and battery drain will be fast hor hardcore user. Considering its price, it is must buy budget phone.",
            "date": "06 Dec 2014",
            "name": "Mohit Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is working fine and features also good. But if I use continuesly 15mnts (when video calling and gaming), the screen of the Moto g(2nd Gen) is getting over heated. Is it common or do I need to replace the phone?? Pls any suggestions?",
            "date": "06 Dec 2014",
            "name": "Sathya",
            "stars": "4 stars"
        },
        {
            "comment": "Very fast shipping as well as great product. Packaging was excellent. I would love to recommend to my friend.",
            "date": "06 Dec 2014",
            "name": "Arijit Bhattac...",
            "stars": "5 stars"
        },
        {
            "comment": "I received this phone yesterday and the moment I got it, I started using it. However, it does not detect the SIM card. I had to wait really long and somehow it detected the SIM once. But then it again lost its communication with the SIM. I checked on the internet and discovered that its a common problem faced by most other users of Moto G and also Moto X. There is no patch or debug yet available for this problem. Everything else is amazing. The phone is fast, bright and fun to use. But whats a phone if it doesn't recognise the SIM?",
            "date": "06 Dec 2014",
            "name": "Amit B",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered it for my father and now for me too it is just amazing with ui ease of handling just battery is slight a problem but overall product is worth to bye",
            "date": "06 Dec 2014",
            "name": "Saurabh Rautmare",
            "stars": "5 stars"
        },
        {
            "comment": "You can't get a better phone for the money on it's price range. Build quality is great (solid) and Motorola keeps android pretty much vanilla and stock which is more simple design and easy to use. The phone it's really responsive : stock android makes it fast and fluid, and it's upgradeable to the latest android version (5.0 Lollipop) already. No LTE (4G) which I dont expect for this price range phone. Display : 9/10 Battery life : 8 Camera : 8 Ease of use : 9 Durability : 9 Design and form factor : 9 Portability : 8 Only reason I didn't give it a five is I don't rate much of anything at the very top.",
            "date": "06 Dec 2014",
            "name": "Swapnil Chopade",
            "stars": "4 stars"
        },
        {
            "comment": "I have ordered moto g 2 gen on the launch day itself. I got the mobile with defect in sim card slot and got replacement.The next one which i got had big defect which i never expect from moto brand....i.e MOTHERBOARD itself dead.Finally i contacted service center in chennai. They have blasted a sensational news that they have 10 mobiles in queue for mother board change.They said that it will take 2 days for repair. Let's assume how bad it is within 2 days 10 mobiles need mother board replacement.If hardware is not good then whats the point in using the latest Android software.I have used this mobile only 2 months. Even though there is warranty how can customers rotate around service centers upto 1 year. I'll never buy mobile from motorola brand. May be google sold motorola to lenovo because of bad hardare production.",
            "date": "06 Dec 2014",
            "name": "Sri",
            "stars": "1 star"
        },
        {
            "comment": "Really it worths the price. Awesome looks !! does not look like 13k phone. Good battery backup. great design . Only worrying about the 1.52 SAR value that means high radiation and sometimes call quality is not good enough , Getting hot if you use camera or call for more than 15 mints. Overall great product !!",
            "date": "06 Dec 2014",
            "name": "sebin tony",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G, Plagued with connectivity issues I bought this phone after my HTC One S was infected with the Helicoptering Bug. This phone was equal in spec to my previous phone and I could not find anything better in the 10-14k other than this MOTO G 2nd gen. After a use of few days, I found out that the performance of this phone is below expectations.’ Asphalt 8 does not run in medium graphics, it has be in low or the game crashes. Other high graphics games fare the same way. Only low graphics games like puzzles and temple run, run properly. The HTC one S played the games in mid and high settings without any issues, both the phones are equipped with 1 GB ram. Secondly there are some connectivity issues with the Wi-Fi in this phone. The hotspot signal drops repeatedly, causing other devices to disconnect. I got this phone replaced 2 twice for this issue but still the issue remains with the 3rd set. So asked for a refund for the same. I was told that the problem was due to Market cut micro sim card. So checked my phone with 5-6 different sims with no solution of the problem. There are some issues with the touch also... a lot of times I could not type the letters on the side of the screen.... Overall the phone is good for moderate gaming, display also good, battery life is decent but if you use wifi tethering then you are going to face connectivity issues. i decided to go for a redmi 1s for now will upgrade later. ( the old sims creating problems with MOTO G 2nd are working fine with the 1S) But Kudos to Flipkart for its service , really top notch. I cannot expect this kind of service from local shops also. i got 2 replacement sets and finally a refund. 5 Star rating to flipkart.",
            "date": "06 Dec 2014",
            "name": "Prasun Mondal",
            "stars": "2 stars"
        },
        {
            "comment": "A worthy one and better than some costlier smartphones. Just a point to note that it takes a long time to charge up to 100% (around 2-3 hrs) at my home but charges up quickly at my office(1-2 hrs). But would surely recommend it considering all its performance and price tag.",
            "date": "06 Dec 2014",
            "name": "Mrunal Gangurde",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart delivered the product in less than 24hrs without paying for In-A-Day Delivery. As of now I dint find any glitches in the phone and battery is coming for approx a day with normal use.",
            "date": "06 Dec 2014",
            "name": "Sai Karthik Burra",
            "stars": "4 stars"
        },
        {
            "comment": "this is a very good product.. loved it.......................................................................................................................................................................................................................................................",
            "date": "06 Dec 2014",
            "name": "vijay reddy",
            "stars": "5 stars"
        },
        {
            "comment": "it has two stero speaker @ front.....high volume than any other...hav gooood spec....but drawback is it takes 5 hours to charge completely....",
            "date": "06 Dec 2014",
            "name": "Jayram Racer",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased moto G 2nd gen last week it has quiet good features. BUT BATTERY LIFE is NOT GOOD.Very soon it is discharging battery & OVERHEATING problem is there. 100% BATERY if you are using continiously then withing 3-4 hr max battery will dead. Hmm. another thing in the market its assesory is not quietly available.such as back cover,screen cover etc. Excluding this all are good...",
            "date": "06 Dec 2014",
            "name": "SURAJ TARAI",
            "stars": "4 stars"
        },
        {
            "comment": "This is first time I find myself dejected while purchasing from flipkart. I have ordered for two Moro g black model. One for me and one for my sister. First I have received the black model with white accessories. When I have enquirer about the same great flipkart executive done the blunder and cancel. The order which iv placed for my sister. When iv called second time then they understood the problem and then reinstate the order. After that they said they can not replace my product as it is from Mototral shipped it and as May be black accessories have been existed they might have sent white one. I wondered is it the quality expected from flipkart and Motorola or they have taken it for granted as we r purchasing from website. That is why regulating these e- shop is required. I",
            "date": "06 Dec 2014",
            "name": "Prabal Basu",
            "stars": "1 star"
        },
        {
            "comment": "I purchased MOTO G2 mobile last month but within a month there is a issue of network problem. i given on service center for repair 4 days before, but there is worst response of motorola service center. i did not received back my mobile till now and received a response for 1 week more to repair. There is no replace mobile available for my mobile till repairing period.",
            "date": "06 Dec 2014",
            "name": "HIMANSHU AGARWAL",
            "stars": "1 star"
        },
        {
            "comment": "I'm satisfied with the phone, but the only thing is that there is no option in the camera to shift to rear camera. So only the front facing camera is functional. Does anybody know how to fix it?",
            "date": "05 Dec 2014",
            "name": "Ren",
            "stars": "3 stars"
        },
        {
            "comment": "i got this mobile and same day mobile microfone not working properly.but replacement service is very slow.",
            "date": "05 Dec 2014",
            "name": "shripad",
            "stars": "1 star"
        },
        {
            "comment": "on 3rd december i purchased a moto g2 through sbi debit card but no 10% off on payment , when i contact the flipkart customer care they registered my complain. now when today i call flipkart care they say me ...there is no any kind of offer like that... they have no idea about the offer . then i called sbi customer care..they hve also no idea about this offer....now i am shocked. flipkart customer care told me to cancel the order becouse thery have no idea about it.... i cancel the order thinking what i have done.....now i just pray the god.... they please return my money to my account.",
            "date": "05 Dec 2014",
            "name": "DEEPAK KACHHAP",
            "stars": "1 star"
        },
        {
            "comment": "ITS AWESOME. The phone has some issues with 3 g connection. I am still not able to resolve the issues. I am still not able to get the 3 g connnection",
            "date": "05 Dec 2014",
            "name": "Rony",
            "stars": "5 stars"
        },
        {
            "comment": "I HAD BOUGHT THIS PHONE FROM FLIPKART, PHONE IS GOOD IN EVERY ASPECT BUT NETWORK CONNECTION IS POOR. AND THE MAJOR PROBLEM STARTS HEATING WITHIN 10MINS OF GAMING, WATCHING VIDEOS THAT TOO A UNDER 50Mb GAME. GOT IT REPLACED BUT THE PROBLEM STILL THERE. I GOT A REFUND AGAIN NOT TO GO WITH MOTO G. BUT FLIPKART SERVICE IS NICE. REFUND ACCEPTED AND MOBILE COLLECTED THE OTHER DAY AND WITHIN 2 DAYS REFUND REACHED MY ACCOUNT.",
            "date": "05 Dec 2014",
            "name": "Dhiraj Shettykind",
            "stars": "2 stars"
        },
        {
            "comment": "After 15 days using this mobile i feel android one mobile is better than this mobile, lag is there, sometimes apps are getting stuck & crashing and that to i am not installed any games. i am installed upto 20 Apps only. even it is getting stuck and lag in the mobile. battery performance is also not good need to plug in to laptop in office. if your using 3G on in you mobile 24 *7 means need to recharge two times daily, it only get 12 H or 15 H only very poor battery performance. for full charge more than two hours it need. another bad thing is,when your in one call if you received any other call then if you pressed hold and talk new call then old call is dropped it is not continuous. sim signal strenght is also not good, i have another mobile android mobile in both the mobile same nw sims are there, in moto g2 i am not receiving any calls i am able to receive call in android one mobile. Available RAM also not good. after installed few apps it is showing 180 MB available. performance is not good that time. coming to camera, 8 MP, but performance is not that much good, it looks more than 5MP only not before 8 MP. i think flip kart only is giving hip to this mobile only but really it is not a good mobile. Guys please think one more time to buy this mobile, and up to you my opening this is not best deal.",
            "date": "05 Dec 2014",
            "name": "RajasekhaR",
            "stars": "1 star"
        },
        {
            "comment": "Delivered the product before the mentioned delivery date. Product is good. Thank you flipkart for timely delivery.",
            "date": "05 Dec 2014",
            "name": "Sreejith S",
            "stars": "4 stars"
        },
        {
            "comment": "i bought this phone and got the delivery in time so cheers to flip for this. About phone as comparing to battery back up is quite disappointing but all over the main features are awsm .... over all recommendation goes for this!!!!!! Happy with MOTO G :)",
            "date": "05 Dec 2014",
            "name": "Apeksha Srivastava",
            "stars": "4 stars"
        },
        {
            "comment": "This is the best phone that you can buy in the money offered, thou it is not a great camera phone but I would still rate it 7/10 in that field. But it excel in the performance field as it comes with 0 bloatware and this makes the phone work effortlessly smooth and non sluggish. Dont expect a flagship killer in this price but sure it is the best mobile in the market considering its price and frequent updates.The build quality is also good but the design is too old and you may not like it. Quality of charger is super, no USB cable in the box and headphone is too cheap. Buy it if you want a non sluggish and non pre-installed application phone with pure google experience. Nothing more.",
            "date": "05 Dec 2014",
            "name": "Puneet Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Couldn' find the zero rating The product is good, there is no doubt about that. The customer service is the worst. Screen stopped working properly with no crack or anything outside. The service center defined the problem as physical damage. There was no physical damage on the screen. Anything happened was internal. They charged me Rs 7000. They took 2 weeks as of today. They still did not give me the product. I tried contacting motorola care. They responded after a week with no proper answers. I contacted the service center today and they said no electricity today, so cannot respond to my queries(I'm not kidding). PS: Credit for moto care as they said \"They could understand my feelings\".",
            "date": "05 Dec 2014",
            "name": "Bosco Frank Paul",
            "stars": "1 star"
        },
        {
            "comment": "This is my first smartphone.....................! So I'm very much satisfied with it....................!! This mobile has extra ordinary features within 13K range......................!!!",
            "date": "05 Dec 2014",
            "name": "Karthi Keyan",
            "stars": "5 stars"
        },
        {
            "comment": "Initially got a faulty one(automatically launches the apps without touching the screen and then hangs after some time) which i reported to the customer care, then they replaced it but it took a week to do so. Other than that its a good mobile with reasonable price.",
            "date": "05 Dec 2014",
            "name": "parthiban v",
            "stars": "4 stars"
        },
        {
            "comment": "hi, i have got this phone last week and found built quality is simply good ,light weight but after using for 5 days and found the battery is draining very fast even in stand bye mode and its heating up after and down loads which i had not expected from this product i have asked for a replacement today and they say they will call by today evening hope to get a new replacement other wise great product and as usual flip kart delivery was on time",
            "date": "05 Dec 2014",
            "name": "shailendra g n",
            "stars": "3 stars"
        },
        {
            "comment": "I had booked the order and i was waiting for the delivery.i got a message as shipment cancelled.i spoke to customer care care they said we have cancelled the order as per your request,which i have never done.they said me to book a fresh order.i just lost my 12k and that money will be refunded after 5-6 business days.stop fooling people flip kart. never going to buy anything from flip kart.",
            "date": "05 Dec 2014",
            "name": "Nanda S",
            "stars": "1 star"
        },
        {
            "comment": "6 hrs charging means , then using phone is waste only, motorola from beginning battery backup problem only.... no improvement at all.........There is no choice for \"0 star\" in rating, So, I had to put \"1 star\"..",
            "date": "05 Dec 2014",
            "name": "Sachin Kaushik",
            "stars": "1 star"
        },
        {
            "comment": "I just got the phone and it is really cool. Screen is good, when you hold it , it feels like heaven. I will update the review after one week.",
            "date": "05 Dec 2014",
            "name": "Gaurav Bhadauria",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased and using for week , still unable to resolve battery draining issue. Battery drains 10 % per Hour with 2G data , SMS,whatapp and call.",
            "date": "05 Dec 2014",
            "name": "manikant kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Please note the product (Moto G - 2nd Gen) is worth every penny. My beef is with the product sent out. The white color Moto G back panel had clear dust and dirt making me feel it was an open piece or refurbished (returned after purchase). As a Flipkart First customer I expected to be treated better. The negative points are only for the seller/flipkart and not for the product",
            "date": "05 Dec 2014",
            "name": "Mohammed Noman",
            "stars": "3 stars"
        },
        {
            "comment": "awesome mobile, gr8 battery bak up,ealily last for 2 days.....games works fine.....using for almost 2 months......",
            "date": "04 Dec 2014",
            "name": "manish",
            "stars": "5 stars"
        },
        {
            "comment": "The product is fantastic as always, I wish they had a moto g size phone with same features. I feel the size is little big for small hands.",
            "date": "04 Dec 2014",
            "name": "Hormazd Irani",
            "stars": "4 stars"
        },
        {
            "comment": "This is my first Android phone after my iphone, so im still exploring the device. Coming to the delivery, flipkart does a very decent job they delivered the phone on the next day. Camera: Does a decent job in indoor and outdoor. Voice quality is very good. But i'm worried about only the signal catching. my Samsung and iphone is showing up good signal strength. Found one issue after the factory default reset. the keyboard is not working as expected. but after a reboot everything works perfect.",
            "date": "04 Dec 2014",
            "name": "Anson Davis",
            "stars": "5 stars"
        },
        {
            "comment": "Its the best phone that i can get with all features..front loudspeakers are awesome.thank u flipkart for ur deleviery before the expected date.....",
            "date": "04 Dec 2014",
            "name": "Dr. ADISH CHA...",
            "stars": "4 stars"
        },
        {
            "comment": "The phone looks smart and has a premium feel to hold in your hand. It performs great, even under high performance games and apps. You can use the camera even when the phone is locked!! I really love this feature as i often lend my phone to my friends. I have been using the phone for a month, I do not use any screen guard or cover. Even after rough use like keeping it in my pocket with my keys and in my bag, it does not have even a scratch on it, front or back! All in all, go for it.",
            "date": "04 Dec 2014",
            "name": "Akash Nath",
            "stars": "4 stars"
        },
        {
            "comment": "have 3 in my family now. what more should i write man.... Love this phone.. may order one more in coming week as wanted by one of my friends.",
            "date": "04 Dec 2014",
            "name": "bharani b kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Am using Moto G2 since from one month. This set cery nice in comparison with other brands like samsung, Lumia ect. But only one problem in this one is this mobile is won't support for direct 3G calling from sim and this is the only drawback of this mobile. if you want to make 3G video calling you need to make through Apps. Accept this every thing is fine. Battery backup is about 24h without using of 3G chats, light weight, looking smart in hands and technically it is good with 12, 999 price.",
            "date": "04 Dec 2014",
            "name": "Dr. Anjaneya O...",
            "stars": "4 stars"
        },
        {
            "comment": "Go for it Pros : Its price ( Value for money ) Pure Android Lollipop update 16 GB inbuilt memory SD Card good Battery Cons : Camera",
            "date": "04 Dec 2014",
            "name": "Jatin Vora",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO PRODUCT IS A BEST AND CHEAPEST SMART PHONE ALL FEATURES IS MORE THAN SATISFIED , SELLER SERVICE ALSO GOOD",
            "date": "04 Dec 2014",
            "name": "NELLAI KARTHIK",
            "stars": "5 stars"
        },
        {
            "comment": "It's a great phone for its price, just got mine today morning. So have not used it yet thoroughly. Its a not a high-end device so I don't have that kind of expectation from it either. :) Got a great service from flipkart. \\m/",
            "date": "04 Dec 2014",
            "name": "Rohan Deshchou...",
            "stars": "4 stars"
        },
        {
            "comment": "moto g is the best phone under 15k wating for lollipop update pros build quality vanilla android price cons nothing found out till now",
            "date": "04 Dec 2014",
            "name": "AJAY JOSEPH",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered this phone and it had some issue like excessive heating up, so Flipkart has changed it, but with now the replacement piece game has started. 1) People are saying most of the times, they are not reachable on my number.(Heard the similar issue from other moto G 2nd gen users). so when you feel like some thing wrong, the remedy is restart restart restart... then only people can reach you. 2)Its 2GB ram with good processor but hangs alot !!! Dont understand whats RAM and processor upto? 3)And the funny moto support : when ever you reach them, simple response, do the cache clean up blah blah reset.... Thats it. Final Word : Unhappy with market hyped phone.",
            "date": "04 Dec 2014",
            "name": "Prasad Konda",
            "stars": "3 stars"
        },
        {
            "comment": "Its average phone, nothing is outstanding but in this price range its good phone. Some issues like sound is not very clear, while talking or listening music. Headphone quality is not good. Heating problem, playing game after 10-15 min. * RAM should be more.",
            "date": "04 Dec 2014",
            "name": "Shashi Shekhar",
            "stars": "3 stars"
        },
        {
            "comment": "I am experiencing a worst customer service from Motorola. From past 1 month I have not got my phone from service centre and everyday they are giving me a new date to collect my phone.",
            "date": "04 Dec 2014",
            "name": "Mohammed Arbaz",
            "stars": "1 star"
        },
        {
            "comment": "battery is getting drain early. sim sometimes not detected all other things good. camera in night not good. features are excellent.",
            "date": "04 Dec 2014",
            "name": "sachin tupe",
            "stars": "4 stars"
        },
        {
            "comment": ".....The above text tells more about the Moto G.gggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg",
            "date": "04 Dec 2014",
            "name": "Kishore Marram...",
            "stars": "5 stars"
        },
        {
            "comment": "Hello, i have registered a problem request to flipkart also i get sms from flipkart but still i m not get and response from flipkart that sms is . 1. Your return request for Moto G ... in the order OD300852727915938100 on Flipkart.com is under process. We are processing your return request and will revert shortly with final approval status. Please check your email for more details or click here: http://fkrt.it/LLyF4uuuuN . Sincere apologies for inconvenience caused. 2. Hi, As requested, we'll call you back by 29 Nov, 8:00 PM to help you with your concern.",
            "date": "04 Dec 2014",
            "name": "MOHAN RAO",
            "stars": "5 stars"
        },
        {
            "comment": "This is an awesome cell phone and has no issues. I think this is worth for money paid. I am hoping the service is good whenever reuired in the future",
            "date": "04 Dec 2014",
            "name": "Sandeep",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is simply awesome.. Flipkart rocks.... Good service and you guys maintain the quality of service.. Simply Amazing... Very happy with the price and discounts I received with my Standard Chartered CC. Thanks",
            "date": "04 Dec 2014",
            "name": "Bhagyesh Pedamkar",
            "stars": "5 stars"
        },
        {
            "comment": "black spot in the screen ..when i told flipcart regarding this i didnt get any feedback regarding this erroneousness.",
            "date": "03 Dec 2014",
            "name": "Aman Vikash",
            "stars": "1 star"
        },
        {
            "comment": "Its is the worst phone ever. I have replaced the same product for 3 times. Now i requested for cash back.",
            "date": "03 Dec 2014",
            "name": "Jeyamaran",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone for 2 days and one day I kept the phone and it dropped from 12cm height on back. What happened was the phone display like died it got coloured non uniformly. I just placed a replacement order now let's see what happens. But have to say that the Phone is performens is good and the design I think the phone is not durable ad it doesn't have any drop test on YouTube or it will be defective I am really confused.",
            "date": "03 Dec 2014",
            "name": "shubham prakash",
            "stars": "2 stars"
        },
        {
            "comment": "I ordered this mobile. Within few days I observed that mobile is getting heat up even it is in my pocket only. I was not doing anything onto it. I raise a request to replace it. I got the replacement with new one but it is also giving the same problem. And on top of that whichever simcard I insert into 2nd slot, range is fluctuating pathetically sometimes it does not show the range at all, it does not catch 3G range. I called customer care, every time they are arranging call back from from technical team but there is no facility to talk directly with Technical Team. It is wasting my time. Flipkart please resolve this issue.",
            "date": "03 Dec 2014",
            "name": "ashvin pinjarkar",
            "stars": "2 stars"
        },
        {
            "comment": "this phone is supeerrbbbb..... if u are a true phone lover .............but if u are a specs lover then go for xiaomi phone..............xd",
            "date": "03 Dec 2014",
            "name": "Milan Kaushik",
            "stars": "5 stars"
        },
        {
            "comment": "Its good device to use, in this price range and specification. only seller is not providing data cable along with device, which is wrong. sometime key board hang.",
            "date": "03 Dec 2014",
            "name": "Sanjay Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Good Product and with Android updates the phone will never feel boring. This phone has decent camera, holds good in hand, good specification and stock android experience and there will never be storage issues with external micro sd card slot in 2nd gen which is missing in 1st Gen. The only problems is poor battery for heavy usage and RAM of 1GB sometimes lags. Considering the price factor, this phone is definitely considered.",
            "date": "01 Dec 2014",
            "name": "SARVESH JHUNJHUNWALA",
            "stars": "4 stars"
        },
        {
            "comment": "Totally I Bought 6 Moto G 2Gen Mobiles, One After Another. Now all my family members are using Moto G. Hope people can understand this review ! Moto G (Worth and Superb) And I'm Expecting \"Gift Voucher or 100% Cashback Offer from WS Retail (Seller) or Flipkart\"",
            "date": "01 Dec 2014",
            "name": "Ambaresh.KS",
            "stars": "5 stars"
        },
        {
            "comment": "over all phone is good, average battery life............................................sometimes heating problems....................................................... takes too much time to recharge and less time to discharge....................................... Not detachable charging-data cable................................................. No file browser in default............................................................................................",
            "date": "01 Dec 2014",
            "name": "pradeesh kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased a MOTO G 2ND GEN on this website. The product was delivered on 20 NOV 2014. Within few days I experienced problem and requested for replacement on 28 NOV 2014 but flipkart refused to replace without any ground and reason. I feel that the fraud and cheating is being done with customers. I advice all buyers not to purchase any item from flipkart website. I am also escalating this issue before the court of law.",
            "date": "01 Dec 2014",
            "name": "Suresh Kumar R...",
            "stars": "1 star"
        },
        {
            "comment": "The touch pad of the phone i received through flipkart is not working properly. I called the flipkart costumer care thrice and they don't have any response from the other side. I want flipkart to back to me and replace the product.",
            "date": "01 Dec 2014",
            "name": "Jorfi Jose",
            "stars": "2 stars"
        },
        {
            "comment": "Simply brilliant service and marvelous job done by Flipkart and WS Retail. This is my second Moto G (2nd gen) order from Flipkart and as usual it came within 2 days, way before actual delivery date. Brilliant handset and the best in the price bracket. No lag, no hanging issues, a very practical option considering day to day use. Add on features such as dual sim, SD support and water resistance makes it pick of the lot. Just amazing.",
            "date": "01 Dec 2014",
            "name": "Sujit Banik",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone from last one week. Performance and features are good.but it takes hell lot of time to recharge..Battery performance is normal. 8 mega pixel camera should have come with twin led instead of one. Over all good product form Motorola.",
            "date": "01 Dec 2014",
            "name": "Rajarshi Sengupta",
            "stars": "5 stars"
        },
        {
            "comment": "don't buy any item from flipkart . most of the sellers are fraud",
            "date": "01 Dec 2014",
            "name": "rashed",
            "stars": "1 star"
        },
        {
            "comment": "we'd faced same problem after troubleshooting pls followup.. pls review this as possible as............",
            "date": "01 Dec 2014",
            "name": "RAJU NALLAM",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using this phone for last few months and its awsm. Moto phones are best in its price range, no other brand can stand in any comparison. Hardware is best, looks are slim and stunning, latest andriod updates guaranteed, no extra bloatwares, in built softwares are very useful and of fine qualities, battery backup is great, camera is way too stunning, front stereo speakers are the best in class and performance, never hangs, best optimization of memory and processor, screen and touch are mind blowing, you have the option of different colors replaceable back-covers (original moto brand) that suits ur style. The only con I found is the charger is of low power but u can have high power charger frm market and get rapid charging. So the bottom line .. its the best phone among the ones i used within 15k price bracket. I'm loving it.. js go fr it without thinking twice!",
            "date": "01 Dec 2014",
            "name": "Kumar Anubhav",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart sent me a used device. It's quite clear from the packaging and condition of the device. Someone spends his hard earned money to buy a brand new phone and guess what, flipkart sends a used device which was returned by someone else. The charger doesn't fit into any indian wall socket, seems to be bent, probably the guy who used it before me damaged it. I am done with flipkart. Last time they sent me a used watch and now this. Off to amazon and ebay. Bye Flipkart.",
            "date": "01 Dec 2014",
            "name": "Tejas Jain",
            "stars": "1 star"
        },
        {
            "comment": "head set is not working....one side i am not able hear in the head set.............................................................",
            "date": "30 Nov 2014",
            "name": "Muppalasiva",
            "stars": "1 star"
        },
        {
            "comment": "This is my first android phone. I m using this phone for last 3 weeks till now i didnt see any problem. Camera quality is average, rest everything is superb. This display is superb. Battery comes for one day with partial usage of 3G. This is the best phone under 15K.",
            "date": "30 Nov 2014",
            "name": "gokul",
            "stars": "5 stars"
        },
        {
            "comment": "I was not confident to buy phones online and always went to a store to purchase phones fearing warranty and service issues. On facing multiple issues with my previous Lumia phone under 1 year and being denied warranty, really bad service from one of the well known retail outlet of Thane. I felt taking the risk of buying online was worth a try. Research and Booking : Windows phone was a sure \"NO\" with my past Microsoft & dealer experience. I had vast choice when i stepped into deciding on which Andriod phone. Decided on a budget of 15 K and started searching. ASUS Zenphone 5 was cheaper and an option i was willing to try. Due to the larger size and lower sound quality zeroed into booking Moto G 2nd Gen. Delivery and Packaging: Must admit Flipkart delivery much before ETA (5 days), delivered in 2 days. The Packaging was good and it was a fresh piece. Phone Usage Review : Initial few days faced a bit of trouble due to switching from Windows to Android. In 2 days was able to adjust and the Android experience is very good, though graphically you may miss the windows interface. Very Good sound and call quality. Camera is decent. The phone build feels strong and solid, buttons are sturdy the rubber back also gives better grip. Battery life is also very good with approx of 4 hrs of con calls + whats app + 10 - 15 mins gaming + reading some stuff online the battery still had 40 % remaining. Would recommend this phone to any user looking for Android phone under 15 K.",
            "date": "30 Nov 2014",
            "name": "Naveen",
            "stars": "4 stars"
        },
        {
            "comment": "The phone has lost its display. I can hear it ring but can not see any display. This happened with in 30 days of purchase. I took the phone to Moto service center for checkup. They suggested to get it replaced as there will be repairs involved and the phone is still in 30 day replacement period. I requested for replacement on 26th Nov 2014 with Flipkart. Flipkart notified that i will be receiving a call from their executive with in 2 days and then further process will be initiated. Its been 5 days since then and there is no contact being made by Flipkart. I called the Flipkart customer care multiple times. They have been asking me to wait for he call; \"If not today, you will receive it tomorrow. We are prioritizing the issue. This is the best we can do\". It is very frustrating to keep waiting for a call to get the product replaced. Flipkart has a market image of customer friendly approach but such actions will tarnish your image.",
            "date": "30 Nov 2014",
            "name": "Devesh Manglik",
            "stars": "1 star"
        },
        {
            "comment": "The Phone is Simply Superb. I have got it yesterday. Although i have not used it much this is my first review. I will review it again after few days. The Finishing of the phone,especially rear and front looks is amazing. Worth to go with this phone. Good phone at this price range.(less than 15k range).",
            "date": "30 Nov 2014",
            "name": "Srinivas Maanyam",
            "stars": "4 stars"
        },
        {
            "comment": "As a former iPhone user I am very pleased with how my first android phone has functioned. The battery is extremely longer than my old iPhone 4s and the screen is very big. The phone is very light compared to other phones with the same screen size and the speakers are very good. I like the dual sim feature although I do not use it. Overall this phone is an amazing product made by motorola and I have found that the only down side to this phone is that sometimes it will hang so I would advise you not to get too many large applications.",
            "date": "30 Nov 2014",
            "name": "Anish Patankar",
            "stars": "4 stars"
        },
        {
            "comment": "Good phone but not upto the mark Pros: big screen, speakers, fast processing, fit in Hand & Latest OS Cons: Heat factor, battery draining, taking to long for charging",
            "date": "30 Nov 2014",
            "name": "Tamilarasan Va...",
            "stars": "3 stars"
        },
        {
            "comment": "This is my 1st review. I've been using this phone since 12th September. after 2 and half months of usage,I can tell you everything about this phone First of all,I would like to thank WS retail for this product. Now I wont talk here about specs(because you can read it in the product description).I WILL TELL YOU ABOUT THE ACTUAL PERFORMANCE. Best things: 1.HD screen is classic.Delivers sharp image and texts 2.Stereo speakers are very nice. 3.Due to round edge,it is very easy to handle 4.Rear Camera is also nice.Some details get missed in photos ,but overall it's a nice camera. 5.Battery life is good(except while playing heavy games) 6.The Phone looks really smart :) 7.SD card support is appreciable. Average things: 1.Front Camera is bad.(looks live 1.3 Mega pixels) Worst things:1.Due to 1 GB of RAM,,the phone lags often while multi-tasking(1.2 GHz quad core is nice,but RAM should have been at-least 1.5 GB).I am a phone-lover( I have used Galaxy S4,my father's iPhone 5c, Nexus 5)and therefore, I can surely say that IT WILL BE A MAJOR ISSUE.,because RAM matters the most while multi-tasking. Verdict:Overall it is a good phone,but at the same price,asus zenfone 5 (16 GB) is available,which has 2 GB RAM(and all the things exactly the same) will be a better buy.Don't think that I am saying this only looking at the specs.My room-mate has Zenphone 5,which has nearly EVERYTHING better than this(except Battery life). So,if you want to buy this phone and will upgrade it next year,then there's no problem.But if you are planning to buy a phone that will last for atleast 2 years,then Believe me,go for Zenphone 5.",
            "date": "30 Nov 2014",
            "name": "Yash Vardhan...",
            "stars": "4 stars"
        },
        {
            "comment": "No match to flipkart service.................................................................................................................................................................",
            "date": "30 Nov 2014",
            "name": "himanshu dixit",
            "stars": "5 stars"
        },
        {
            "comment": "Voice clarity of the handset is extremely poor. After receiving call in this handset I start behaving like a deaf person. The voice of the caller is not at all audible.",
            "date": "30 Nov 2014",
            "name": "Adarsh Chaudhary",
            "stars": "1 star"
        },
        {
            "comment": "Guys it ma request to you that if you are buying any product from flipkart make sure that corier company should not be DELHIVERY its a third class corier company very bad service i have given order on 14 nov still i havent recived it and flipkart and delhivery both are only giving time to wait.........useless",
            "date": "29 Nov 2014",
            "name": "ravi sher",
            "stars": "1 star"
        },
        {
            "comment": "I purchased MOTO G2 & thanks to flipkart, it got delivered in 2 days... guess wat.. POWER BUTTON not working. I got replacement & got the new unit in 2 days.. the replaced product too had manufacturing defect- 1 WHITE SPOT on the screen (as if the screen is damaged on lower side of screen) I returned the product & now waiting 4 refund. Got ordered LG L90. i am surprised to see, how can W.S Retail gets defective products imported from MOTO or there is some black thing going on- as if they have box and they put defective product in it and seal pack it, thinking that 1 or 2 customer might not anticipate it and start using it.",
            "date": "29 Nov 2014",
            "name": "VIVEK PANWAR-s...",
            "stars": "1 star"
        },
        {
            "comment": "within two month my mobiles got dead than after i submitted my mobile in service they took almost 2 week for replacement but ,they did not replaced it they simply change mother board in my mobile and given me and again after one week i got another issue with speaker during listening the voice of other side .So do not go for this worst product,and they don't have good service they are taking too much i have seen in service center lots of people are suffering because of bad service provide by motorola service center. so don't go for this worst product i am suggesting you.",
            "date": "29 Nov 2014",
            "name": "Alok",
            "stars": "1 star"
        },
        {
            "comment": "Five Star For:- Performance, Design, Software, Sound, Awesome Camera & The advantage is this phone update on Android Lolipop Five Star For :- Flipkart, WS Retail And Please ignore Negative Reviews",
            "date": "29 Nov 2014",
            "name": "Tarandeep Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone very good features fast courier service very good communication,picture quality vaey good , camera good , design good, processing speed good.",
            "date": "29 Nov 2014",
            "name": "Jissmon Thomas",
            "stars": "4 stars"
        },
        {
            "comment": "i buy this phone on flipkart..all features are very good but having some problem like whenever we use wifi or 3g network for watching videos on youtube .its taking long time for buffering comare to other phones having same specification. In other phones,online videos play smoother without buffering on wifi / 3g network. 2nd main issue is phone is getting hang on some games like subway suffer,this is very disappointing from Motorola.because this phone having best specification but its still getting hang. 3rd main issue is battery life: its take 4hrs for full charging, but battery discharging very fast (Disappointing battery life)",
            "date": "29 Nov 2014",
            "name": "pratik vengurl...",
            "stars": "2 stars"
        },
        {
            "comment": "MOTO G 2ND GEN IS VERY GOOD MOBILE. But After purchase my MOTO G 2nd GEN, first time they was give me crack display. 2nd time they have given me defective product. I cannot hear sound dialed and incoming calls without earphone and also sim1 signal is very weak and worst data connectivity. very bad experience and very bad service by flipkart and ws retailer. please back my money. i can never purchase any goods by your side.",
            "date": "29 Nov 2014",
            "name": "Manoj Kumar",
            "stars": "1 star"
        },
        {
            "comment": "nive product.... big screeen/... value for money... screen is not as good as moto g 1st gen... but still ****",
            "date": "29 Nov 2014",
            "name": "Anand",
            "stars": "4 stars"
        },
        {
            "comment": "Five star for performance, design, software. Four star for battery. Four and half for hardware. over all it is worth price for money and It is a good pick at price of 13,000.",
            "date": "29 Nov 2014",
            "name": "Sahil Gulati",
            "stars": "4 stars"
        },
        {
            "comment": "camera not nice.worst pics can be taken.i tell u not to buy.worse.better than this samsung.nothing is there.no resolution.no foces",
            "date": "29 Nov 2014",
            "name": "siddalinga pr...",
            "stars": "2 stars"
        },
        {
            "comment": "I just dont know if am I the only person who got buggy products even replacing the product for 2 times!!! Not satisfied with the product screen heats up I have replaced the products for 2 times but still the problems like heating and low speaker quality The phone hangs up for a while when getting back to home screen phone also gets slow with closing and opening the apps the phone has a pure version of android but still, it lags!!! Camera Quality is Awesome, slo-mo is superb but performance in speed and utilization of the OS is not that good motorolla should improve a lot... coming to the speakers of the phone, when i keep it on the full volume it gets shattering... when its new it works fine but after 2 days it ll begin... very disapointed with the phone. so ** but Flipkart you're awesome!!! Delivery in time, replacement with that grantee... so for you * * * * * Motorola please improve the quality and one more thing, the back cover get lose after removing for about 4-5 times.... it might sound stupid to mention but for a college guy like me, it is annoying that my phone's cover has a gap or not perfect fit!!!",
            "date": "29 Nov 2014",
            "name": "Akshay B.",
            "stars": "2 stars"
        },
        {
            "comment": "Everything works well with this phone except one thing. That is when the battery drops to below 20% the top portion of the phone gets heat up and I can feel my ear gets heat up while talking at such a low battery power. Also I have read reviews of many people complaining about the charger that heats up while charging. Mine is fine and works well.",
            "date": "29 Nov 2014",
            "name": "Ankush P",
            "stars": "4 stars"
        },
        {
            "comment": "Why to waste money when you will scrap/resell phones after 2 years???? Buy Moto G 2nd Generation.I am satisfied.And flipkart is awesome for it's delivery and quality.I feel assured after placing any offer from flipkart.And I do not panic if any mistakes happens by flipkart because I know there is a team to take care of your problems proffesionaly and effectively.",
            "date": "28 Nov 2014",
            "name": "Abhishek Pal",
            "stars": "5 stars"
        },
        {
            "comment": "i installed Subway surfers game on my new device it is hanging while playing this game and when using H+(Airtel) internet and speaking with some one outside person unable here my voice every two to three minutes.when i am using 2G it is working fine.",
            "date": "28 Nov 2014",
            "name": "Sai",
            "stars": "1 star"
        },
        {
            "comment": "Got the moto... one of my dream fonss.. I would suggest it to any one.. Even to my enemy.. (coz evrybody should enjoy the BEST) Wit 1 day usage, I find it to be THE BEST IN CLASS fon.. But while charging, charger gets heated up.. I dono if that is a common prob.. Not much of a heating to be feared of... 1.2 GHZ processor is really fast for almost anything out there .. Atlast... I'm a MOTOMAN... :D",
            "date": "28 Nov 2014",
            "name": "Reny Varghese",
            "stars": "5 stars"
        },
        {
            "comment": "I placed order for moto g 2nd gen in the month of october and i didnt received any product i somewhat ordered it on 14th of ctober i think so.the delivery was going to be on 30th of october but i didnt receive any delivery on 30 th of october i cancelled it on 4th of november via customer care cse i didnt find any option of cancelling on page of flipkart website the customer care then requested me to place order again so i just placed an order again on 11 th of november i got that product which was going to be delivered on 30th of october i just didnt take that product and the next day i got my product which i ordered on 4th of november i opened the box i turned on the phone and what i found is the phone defective there was no voice outgoing command so this time i ordered for replacement and there was going to be a pick up on22nd of november but no pick up took place and then they promised me that pick up will be within 27th of november but noone come to my home for pick up and the customer care told that it will be pick up in within 3 days.im very upset with flipkarts delivery couriers does it really take more than one month for a product to be delivered in working state? And the flipkart scammers they ithemselves cancelled my replacement now.i will not buy any product from flipkart",
            "date": "28 Nov 2014",
            "name": "Horizon gadge",
            "stars": "1 star"
        },
        {
            "comment": "Much satisified with all features and functionality especially camera. Only one issue with wifi: When you are using wifi, at the top of the front camera you will feel bit of heat.At that perticular time if you need to attend call it is difficult. Apart from this the mobile is awesome.",
            "date": "28 Nov 2014",
            "name": "Vijay Krishna",
            "stars": "5 stars"
        },
        {
            "comment": "What Moto G 2nd gen really have snapdragon processor?? Huh really?? Flipkart really?? Moto really?? Dont make us fool i know it have Cortex A7 processor will most of the peoples realted to tech must be knowing this but i havent seen any review about it yet… Why you made everyone fool ?? I googled alot about it there is not even a word of Cortex A7 processor on motorola website and flipkart in specs of Moto G 2nd Gen. Everywhere its written snapdragon 400 You can also check it just install CPU-Z app from playstore it will give info about its CPU and GPU Well no doubt its a good mobile but why making custmers fool??? One star for good mobile -4 for making everyone fool -_-",
            "date": "28 Nov 2014",
            "name": "Tushar Bansal",
            "stars": "1 star"
        },
        {
            "comment": "I like this smartphone very much it is really impressive Moto G is amazing phone. camera quality is good in low light and front facing Camera also good no black clear view. audio quality is wonderful support iron man 3 and fifa 2014 many more games excellent to play in this mobile. but there are some cons: 1. Headphones supplied are of low quality. 2. Charger does not come with detachable USB cable 3. USB cable not provided in the kit. 4.Phone starts heating up after continuous use 5: Phone take long time to charge completely. Ultimately a good deal for this price.",
            "date": "28 Nov 2014",
            "name": "Vishvajit",
            "stars": "4 stars"
        },
        {
            "comment": "Moto Rocks again .... No lag on application , battery backup was gud, camera was gud *(improve came much better than this)",
            "date": "28 Nov 2014",
            "name": "RAJ 007",
            "stars": "4 stars"
        },
        {
            "comment": "The phone needs no introduction but its a upgraded version with bigger screen and sd card slot. A good option for low budget users who are not willing to get Nexus",
            "date": "28 Nov 2014",
            "name": "Biks",
            "stars": "5 stars"
        },
        {
            "comment": "very disappointing ,that my Corning Gorilla Glass 3 has a scratch on it now , of my moto g (2nd Gen )",
            "date": "28 Nov 2014",
            "name": "shacheendra",
            "stars": "1 star"
        },
        {
            "comment": "The features offered in this phone meets the expectation considering its price tag. There are few cons for the phone but the overall performance is good. Pros : 1. good camera. 2. stylish design. it feels good when i hold it in my hand. 3. the front stereo speakers are an asset to this phone 4. there is no lag when i play games. I did not try high end games. But Asphalt 8 airborne stopped working after playing first level. Things that can be improved: 1. The battery is not so great. It lasts for 1 day with very minimal usage. 2. I have trouble with the dual sim settings. Sometimes the signal for secondary sim goes down. It can only be restored by restarting the phone. 3. Some of the high end games like Asphalt 8 Airborne wont run. They will crash after sometime. If not for the dual sim problem, I would have rated this 5 stars.",
            "date": "28 Nov 2014",
            "name": "Nagendra Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "Love this phone, You cannot get this features at this price :) Nice processor , nice video quality, Extraordinary front speaker, camera is also good, runs all apps smoothly",
            "date": "28 Nov 2014",
            "name": "Pratik Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is very sleek and fast enough to run any app or game. I have been using this mobile for 2 months and haven't faced any problem with it. Got android updated as soon as i connected to wifi. It accepts micro sims only so I had to cut my 2 sim cards before starting using them. Camera and sound is not so good. I get 6 MP instead of 8 MP while using picture ratio of 16:9. Display screen is sharp but in sunlight it is not very bright. That maybe because I use auto brightness. Battery life is average. Once fully charged, it lasts at least for a day while using internet and games. It takes at least 3 hours to get fully charged from fully discharged state. But overall battery life is better than most other mobiles I have seen. The mobile speed got little slower when I installed many apps, but it got smoother again after removing unnecessary apps.",
            "date": "28 Nov 2014",
            "name": "Archan Pagedar",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is Very Good and Best Value of money . Well, I somehow managed to order the 16gig in the after noon as soon as i saw it available on launch day, 6th feb and it was an awesome feeling..Fools are those who are scolding Flip and rating the product 1, coz they were thinking whether to order it or not while others grabbed it in first look. Now, about the phone this phone is really superb as much as I know I researched a lot about it coz i want value for my money. I will be writing a full review after using it (delivery date is 10th feb) I was looking for the phone that will suit my needed specifications. for more than 2 months I was looking and wasn't satisfied with any of the phone in the market. good phones are too costly and I was unable to decide which phone to choose",
            "date": "28 Nov 2014",
            "name": "Amit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased it from Flipkart in September. Awesome phone quality and usability. Hate the default inbuilt Moto applications which are useless to me. My screen didn't work properly so contacted Flipkart and they replaced my phone easily. Thanks Flipkart :)",
            "date": "28 Nov 2014",
            "name": "Krishna Patni",
            "stars": "4 stars"
        },
        {
            "comment": "very good phone in budget .First Thanks to Flipkart asweome service, very good customer care relationship. Flipcart rocks....",
            "date": "28 Nov 2014",
            "name": "Dharmendra Moh...",
            "stars": "5 stars"
        },
        {
            "comment": "there is some sort of burnt wire smell from the back of my phone i have checked with the other phones... there is no network at times till u restart it and there are rapid battery Draining at times .... the flash is not working properly the phone gets stuck ..... i thought that it was s good phone but every other moto phone is showing problems... not a good idea to buy.. and the costumer service is very bad i have not got proper response from flipkart yet.",
            "date": "28 Nov 2014",
            "name": "Syed Khundmir",
            "stars": "1 star"
        },
        {
            "comment": "awesome mobile.... i loved it...front side double stereo speakers sound gives us a home theatre feel..really very nice and looking marvelous shape..",
            "date": "28 Nov 2014",
            "name": "sudarsan reddi...",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is very bad for me ye bahut heeting karta he jab me charge karta hu or data use karta hu ya fir me game khelta hu tab.... very bad phone......",
            "date": "28 Nov 2014",
            "name": "prakash",
            "stars": "1 star"
        },
        {
            "comment": "Value for money. battery will be discharged in 1 day, if used internet it will discharge more fast. remaining features are very good.",
            "date": "28 Nov 2014",
            "name": "Sreenu",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome Mobile!!! .. It worth for money .. Sound quality is superb. Super Display.. Super Design..",
            "date": "28 Nov 2014",
            "name": "BRINDHA",
            "stars": "5 stars"
        },
        {
            "comment": "worst phone got dead after 2 months of purchase. bad motorola sevice even after 1 week they didnt repair my phone.",
            "date": "28 Nov 2014",
            "name": "Rajesh Bansal",
            "stars": "5 stars"
        },
        {
            "comment": "my screen damaged in a small drop from just 3 feet... very poor gorilla 3... I am highly disappointed with MOTO G2",
            "date": "28 Nov 2014",
            "name": "BIJU THOMAS",
            "stars": "1 star"
        },
        {
            "comment": "This is just shit !!! The phone is all awesome but flipkart service is too crappy . They replaced my product with a used one !!!! where they promised to replace with a new one . I again Called today for replacement , this time I hope they provide the original and brand new one . Coming to the mobile It is great for its price , only few minor cons though like battery back up is not satisfactory and front camera quality is not that good .",
            "date": "28 Nov 2014",
            "name": "Krishnendu Sarkar",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2nd Gen looks good on the papers as well as in the Real World. Its Camera is absolutely awesome. Gaming Experience is also good. No Lags and very fluent in its operations. Ingenious design and made up from ok Material.",
            "date": "28 Nov 2014",
            "name": "Karanbir Singh",
            "stars": "5 stars"
        },
        {
            "comment": "FLIPKART SUCKS... REVIEW ISN'T FOR THE PRODUCT, ITS FOR FLIPKART. I KNOW, FLIPKART WILL CLOSE ITS BUSINESS",
            "date": "28 Nov 2014",
            "name": "Ravi Pabbinedi",
            "stars": "1 star"
        },
        {
            "comment": "This is the best available mobile in this range. Don't think too much and enjoy.This is reliable and smooth functioning.",
            "date": "28 Nov 2014",
            "name": "avaneesh kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Please re-stock Moto G (2nd Gen) already flipkart!!! its been too long since it has been out of stock!!",
            "date": "28 Nov 2014",
            "name": "rose",
            "stars": "5 stars"
        },
        {
            "comment": "Please stock in Moto G (2nd Gen) already flipkart...seems like forever since this product has been out of stock!!",
            "date": "28 Nov 2014",
            "name": "rose",
            "stars": "4 stars"
        },
        {
            "comment": "No need to say anything for this Masterpiece. Moto G, Moto G2 has set new standards for the economic budge phones. Excelent comeback by Motorola. Just buy it blindly if your budget is below 17 K. Thanks Apurve",
            "date": "28 Nov 2014",
            "name": "Apurve Chaudhary",
            "stars": "5 stars"
        },
        {
            "comment": "u will disappoint about camera even it is 8MP but no clarity. menu loading is also taking some time. less voice when u hear the call by left ear. no data cable. charger getting so heat. 13000rs it is really worthless. I didnt excepted these from motorola. ============== disadvantages ============= no task manager no clarity of back camera non removable battery no datacable provided network problems large icons battery backup not good",
            "date": "27 Nov 2014",
            "name": "Narayana",
            "stars": "2 stars"
        },
        {
            "comment": "I got 4 replacement phones & finally got fed-up with the product & decided no more. Experience illustrated below to the prospective buyers of Moto G2. - The first ph had burning smell from the charging socket area of the ph. Submitted complaint & replacement ph was shipped in a week. - The second ph charger got kaput after 3 weeks, when i requested for a replacement charger FK said they will not be able to provide original Moto charger. They gave me an option to buy a compatible charger, but why should i compromise - what if the ph performance gets effected? FK made me wait & tested my patience for long. They took close to 3 weeks to call and speak – and the rep who called, was very rude & said he will process the refund – keep the phone & all other accessories intact for pickup without being polite and having patience to listen to me. Now I had to be firm – said you are not the decision maker – I have paid for it & so will it reside on me to decide what I want! Informed him to make arrangement for replacement ph. Ph, was delivered in 4days from the date of request. PS: This ph, also had burning smell from the ph charging socket. As one of my friend ph also had the same kind of experience – we kept quite & started living with it. - The Third ph. This one was working fine thankfully no issues, but after 2 weeks the ph started showing its infrequent tantrums. When i receive a call from the contacts in my ph. i don't get their name on the display when i get a call, sometime display screen use to be white in color - when i get incoming call. Got the ph. reset to factory mode, but didn't help. Submitted a request for return - FK advised to reset the ph, to factory mode. Again it didn't help, they agreed to replace. I was shocked when they agreed for a replacement so easy? Why no dram like the last time to delay in agreeing to provide a replacement ph.? Felt something fishy, but i was happy & ignored - assuming it was may be one of the odd customer service rep experience the last time. -The fourth ph, It was delivered in two days. The day when it arrived – my brother for whom I had bought this ph – was very upset with the first FK product that he had bought & the awful experience. He use to always be against buying products from online… He kept fussing with me, I told you……..? He spoke to the delivery guy & tried to make communication with him while he was verifying the return product & the box. Brother – “Has FK been receiving quite a lot complaints for MOTO G2 ph? & until now I have returned 3 ph., what do you guys do with the returned ph.,?” Delivery Guy “Yes sir – there are quite a lot complaints about this ph model. Sir - When the customer returns the defective product, FK seller will fix those problems and resell them to customers again – if they don’t resell then they will be in loss sir. They have to close the shop & sit at home” My brother was shocked to hear that from the FK delivery person. What about the notice FK puts at the bottom of the page of every product? Please Note: All products sold on Flipkart are brand new and 100% genuine 1.With all fear & fingers crossed – my brother opened the pack, switched on the ph. 2. He experienced white light lines on the either sides of the screen 3. Display quality & color was dull 4. Took a picture from camera lot of grains on the picture even without zooming. 5. You will notice rainbow colors on the display for few seconds when you get an incoming call. 6. Drop in calls when you are out on the street, inspite of having full network. 7. Hearing speaker would fumble. The above experience & reasons in the last three months were enough to decide for taking a refund instead of a replacement ph. A very sick experience & FK using such blackjack tactics to make business. SHAME ON YOU FK & WS RETAIL",
            "date": "27 Nov 2014",
            "name": "Deepak R",
            "stars": "1 star"
        },
        {
            "comment": "nice phone and the delivery was within 2 days and very very very very very awesome online shopping",
            "date": "27 Nov 2014",
            "name": "Jagadish",
            "stars": "5 stars"
        },
        {
            "comment": "dont buy this phone in flipkart because seconds. damaged product dont buy this phone in flipkart because seconds. .dont buy this phone in flipkart because seconds. .dont buy this phone in flipkart because seconds ..dont buy this phone in flipkart because seconds ..dont buy this phone in flipkart because seconds.. dont buy this phone in flipkart because seconds..",
            "date": "27 Nov 2014",
            "name": "sharath kumar",
            "stars": "1 star"
        },
        {
            "comment": "SAR value of this device is more and the phone looks bulky. Cant argue with the people defining it as sturdy device though. Apart from that the phone performance is impressive and im still waiting for lolipop update. Good battery backup will last you for a day with moderate to heavy usage. Also camera pics look crisp and deep. Lumia 730 is a good comprtitor.",
            "date": "27 Nov 2014",
            "name": "Krishna",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart Service - I just received the product today and the product has been working fine till now, but looking the mobile box, the pen marks on it, 3 different product tape tags refering to the number of times it has been used and returned by customers, I have to say that though the phone is working great till now, I am hugely disappointed with Flipkart. Dont really know when it might need a replacement. 1 star for Flipkart. Earphones - The earphones are of really poor quality and the left earpiece has already started giving issues, but really looking at its quality its meant to last for a few days only. No stars for Earphones",
            "date": "27 Nov 2014",
            "name": "Anuj Katiyal",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this (Black one) phone for better internet connectivity but just after two days of use, Wi-Fi connection starts giving trouble. it is not able to connect and even Data connection is also not working sometimes.",
            "date": "27 Nov 2014",
            "name": "Puneet",
            "stars": "3 stars"
        },
        {
            "comment": "phone performance is very good and price is also affordable but battery backup is very bad............",
            "date": "27 Nov 2014",
            "name": "Saurabh Uttarwar",
            "stars": "3 stars"
        },
        {
            "comment": "White classy phone.....people have discussed many pros. Let me throw some light on Cons part after 4 months of usage: 1. Pathetic Battery: Drains after 7 hrs usage if wi-fi is ON 2. Cannot handle even a single drop on floor: sure shot scratches here & there or tearing of some part from the corners because handset body is not at all strong. 3. No call recording facility 4. Lengthy & sucking process of saving new contact. 5. Uncomfortable headphones 6. Touch response: On the scale of 5...i'l give 2 7. While playing subway surfer...It hangs many time If above problems doesn't bother you.....hurray you qualified to buy this beauty :p",
            "date": "27 Nov 2014",
            "name": "Er Ruhi Saxena",
            "stars": "2 stars"
        },
        {
            "comment": "Best mobile at best price The sound quality is good but we will get pain for our ears after some time and no service centre in banglore & finally i ll not suggest this product to buy",
            "date": "27 Nov 2014",
            "name": "Somu Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I got this product within 4 days , nice packaging (5 star for WS retail) , this phone is much better than micromax , samsung , nokia lumia or any other brand this price. smooth touch , nice interface , ram and rom are sufficient, always use another SD card saves your ROM , even while transitioning from one app to another we don't have to see \"resuming \" as we see in lumia's.No heating problem as well. 5 star for phone",
            "date": "27 Nov 2014",
            "name": "Harshad Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the way Flikpkart have done Shipping and track of the Product through phone....loved the service",
            "date": "27 Nov 2014",
            "name": "Abhishek",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone. Value for money. It looks awesome with Black flip cover. Prompt delivery by Flipkart.",
            "date": "27 Nov 2014",
            "name": "Sivakumar Ponnath",
            "stars": "4 stars"
        },
        {
            "comment": "The Moto G 2nd Gen is the best phone in class, Mp3 quality is good, camera is also good. Battery backup is full day... Front camera is not too good & worst headphone quality.. And Thanks to Flipkart for fastest delivery process.",
            "date": "27 Nov 2014",
            "name": "Pankaj Randhe",
            "stars": "4 stars"
        },
        {
            "comment": "Finishing not good............................................................................................................................................................",
            "date": "27 Nov 2014",
            "name": "Manoj Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "This is a good product from motorola. It has a very rich look and have a normal weight... Have good performence when using internet and good with video call... the problem one i found is same as every android phone has, very much heating when using internet and especially video call.... otherwise it is a good phone",
            "date": "27 Nov 2014",
            "name": "subin xavier",
            "stars": "5 stars"
        },
        {
            "comment": "not good, its having good feature but not workin well hangs an al d things, go for some other mob, many problem arrive",
            "date": "27 Nov 2014",
            "name": "aman attar",
            "stars": "1 star"
        },
        {
            "comment": "flipkart have the best service in online stores , htts off to flipkart best in this industries. flipkart have the best service in online stores , htts off to flipkart best in this industries",
            "date": "27 Nov 2014",
            "name": "Hansraj Tanwar",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this for my sister and she loves it! It's a fantastic little phone for the price point, and definitely worth the money. If you're looking for an Android phone but don't want to shell out upwards of 25k for an ultra-powerful smartphone, this one's for you.",
            "date": "27 Nov 2014",
            "name": "firstscript",
            "stars": "5 stars"
        },
        {
            "comment": "No regrets, Fully satisfied with the device performance. but battery backup might have been little better.",
            "date": "27 Nov 2014",
            "name": "Dilip Varma",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought tis phone a month ago, & i lost my display now. My friend had purchased Motto X & facing the same problem. Thr r some manufacturing errors 4 tis phone. My opinion is 2 go 4 some other smartphones than this.. No stars..!!",
            "date": "27 Nov 2014",
            "name": "Manoj V M",
            "stars": "1 star"
        },
        {
            "comment": "Good product by motorola..........But battery backup is only annoying.... anyway good product for 13k range......",
            "date": "27 Nov 2014",
            "name": "GIRISH SHET",
            "stars": "4 stars"
        },
        {
            "comment": "Its a fully loaded phone in this price. And on the top of it you'll get the android update as soon as google launches.",
            "date": "27 Nov 2014",
            "name": "abhishek",
            "stars": "5 stars"
        },
        {
            "comment": "initially battery back is only 6-7hrs when fully charged. but now its coming for enough time. but i opted for return, the seller didn't approved so think before purchasing the product when you get really defective product",
            "date": "27 Nov 2014",
            "name": "ramesh",
            "stars": "1 star"
        },
        {
            "comment": "Battery sucks and it gets heated so quickly when charging.I do not know if Flipkart delivered to me a defected product.",
            "date": "27 Nov 2014",
            "name": "Pradeep Chandra",
            "stars": "1 star"
        },
        {
            "comment": "Been using this phone for 3 months now.. Its a great phone especially at this price.. Positives: Speed is great Camera is good too (better than the likes of S4 etc) - pictures are clear, colours are good Dropped it a lot of times(accidently obv :p), body is strong dint break or get damaged in any way Negatives: Battery - will last not more than a day with average usage and takes a lot of time to get charged (Approx 2-3 hours to get fully charged) Cant set songs as ringtones!! there are some jugaads available online but i tried dint work for me atleast :(",
            "date": "27 Nov 2014",
            "name": "Jagriti",
            "stars": "4 stars"
        },
        {
            "comment": "Giving 4 stars due to poor battery, otherwise it would have been five. Nice phone, value for money, feature packed. Only issue is with battery back up. Even with minimum usage battery doesnt last for long. Camera sometimes hangs, but there are ways to overcome it.. Zoom in/out is a bit difficult. Other important features like speed, memory etc are very good. Worth the money",
            "date": "27 Nov 2014",
            "name": "santhosh thomas",
            "stars": "4 stars"
        },
        {
            "comment": "good quality & and expecting it will long last. very nice built and competes to any other. no issues after 4 months use",
            "date": "27 Nov 2014",
            "name": "Deepak R",
            "stars": "5 stars"
        },
        {
            "comment": "I brought new Moto G 2nd Gen,its overall a good phone, but i met a complaint with its speaker while making or receiving a call, i cant hear anything, then i restart my phone the complaint not shown for first few minutes after that its sees the same problem,",
            "date": "27 Nov 2014",
            "name": "Riswan Basheer",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is worth the price. You get KitKat out of box and a good earphone. Hardware is responsive and doesn't lag.",
            "date": "27 Nov 2014",
            "name": "Gaurav Deep",
            "stars": "5 stars"
        },
        {
            "comment": "Battery backup proper not OK very fast down but other features very good i like it .camera awesam quality are very good i am suggest other friends",
            "date": "27 Nov 2014",
            "name": "Amit srivastava",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this moto g2 over a month now and not totally satisfied with the product.I am not sure it’s a defective one which I have received. Few Pros and cons – from my perspective (I am not heavy user with gaming and graphics requirement but mainly use for internet and for calls with longer duartions) Pros • Good Display and build, Light weight • Decent Camera Quality • Good battery back up • Have not observed lags yet. • Received software update from moto after week 21.11.23 Cons • Speaker quality is not so good, With headphones on – can hear continuous little hissing, buzzing noise – Also tried with all headphones this is really annoying. • After receiving calls speakers gives little shredding, crackling noise in between. • Big No for listening music with ordinary headphones comes along with pack. • Not sure its latest software version or what - internet browsing became very slow with latest Gmail 5.0 and Chrome installation (I have tried with multiple network providers) • Flipkart Delivery Service was good but response from customer service was not up to the mark, received different information every time called for shipping status. ‘Customer helpdesk Service!’ – long way to go from here.",
            "date": "26 Nov 2014",
            "name": "Santosh Mujgond",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome phone in low budget with higher confrontation....But charger supplied is not working and i am unable to charge my phone plz help flipkart ..how can i get a replacement...",
            "date": "26 Nov 2014",
            "name": "Vijay kumar Kotum",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the combination of price and features of this cell phone. It was also easy to order and receive over some minimum clicks :)",
            "date": "26 Nov 2014",
            "name": "ROHAN DAHIBHATE",
            "stars": "5 stars"
        },
        {
            "comment": "PERFECT QUALITY PRODUCT EXCELLENT DELIVERY TIME snapdragon chipset quad core processor well-known branded its worth for money.",
            "date": "26 Nov 2014",
            "name": "Harsh Bhinder",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola has done a great job on this phone. Premium design, fabulous build quality, great specs for the price point, Brilliant display quality. I must say it is a Premium looking budget smartphone. Pros: 1. Awesome build quality. 2. Cristal clear display. 3. Sound quality is good. 4. Hardware under d hood is powerful. 5. No lags. 6. Quite responsive. 7. Expandable memory card slot. 8. Good camera quality. 9. Latest Software updates. 10.Personally like that moto dimple at the back. Cons: 1. Slow charging capacity. 2. Poor Headphone quality (should not expect much for this price point) That's all in my review. Don't think much just go for it.",
            "date": "26 Nov 2014",
            "name": "Ankit Sonetta",
            "stars": "5 stars"
        },
        {
            "comment": "In this price range, I guess no one give this much excellent phone.. its time to say bye bye to Samsung, HTC... No issue in battery screen resolution hanging while playing games.. Go for it without any issue",
            "date": "26 Nov 2014",
            "name": "CPP",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone since last one month ,i did not noticed any issues,smoothly running,only the thing battery drains fast and takes time to recharge. Before i was used Samsung S3 i fed up with that,after so many exercises i choose this.My observation is more better than Samsung,regarding price,processing speed,camera,OS...apps also open quickly,no lagging.i feel very happy and i would strongly recommend to buy without any doubts.",
            "date": "26 Nov 2014",
            "name": "aswani kumar a...",
            "stars": "5 stars"
        },
        {
            "comment": "good",
            "date": "26 Nov 2014",
            "name": "rajagopal reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Hello Everyone.....I bought moto g 2nd gen 2 months ago. I found so meny issue in this phone. 1.You cant save a number with special character like(*141#) if u go by call log. 2.All message information will not show in a userfriendly way. 3.No default File Manager. 4.Battery draining so fast. 5.Call quality is not that good. 6.Camera quality poor in low light conditions. 7.No theme option available. 8. While on call if you press a number by mistake, no way to delete that. 9. For a 13k phone, no data cable. :- I value Flipkart a lot, and I have been an existing cx to it from a long time, I really would like to make a point that Flipkart should see the product quality before making it available on it. It just brings a bad name to it. its nt worth for money.",
            "date": "26 Nov 2014",
            "name": "Sambit Sahoo",
            "stars": "1 star"
        },
        {
            "comment": "Nice product I m satisfied but there is bit issue with Motorola Earphone..Its Quality of sound is not Loud and Clarity as Samsung Ear phone ...This is Issue i Have Detected..Motorola Should work on it to improve the Clarity and make the Quality of sound Better then Other are providing....",
            "date": "26 Nov 2014",
            "name": "Suraj Maharana",
            "stars": "4 stars"
        },
        {
            "comment": "The phone gets heated up for no reason. Even if it is not being used, it gets heated up slightly. I thought it was an issue with the launcher and I was using Aviate. Even after switching back to Google Now launcher, the issue persists. While attending calls, the top portion of the phone gets heated up so bad and pretty quickly. Also the battery gets drained quickly. It doesn't last a day on moderate use. A friend of mine is also having these issues. Otherwise, it is a good phone at this price tag.",
            "date": "26 Nov 2014",
            "name": "Nidhin Balakri...",
            "stars": "3 stars"
        },
        {
            "comment": "Recently i have purchased Moto G 2nd Generation from Flipkart. every thing is good but Conference call is not connecting.Any body please suggest me. one of my friend using Moto G 1st generation in that mobile conference call working.",
            "date": "26 Nov 2014",
            "name": "SRINATH MORAMPUDI",
            "stars": "4 stars"
        },
        {
            "comment": "The latest version of Motorola's unstoppable handset rightly claims its crown as the new king of budget smartphones. It wins a Best Buy award...!",
            "date": "26 Nov 2014",
            "name": "Kinjal Chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone with the price tag of 12999, I booked on 4th of Nov 14 with expected delivery of 18th Nov-14 but i received the product 10th Nov 14 itself. Few Cons of the phone is : Battary Backup is very less, I use this phone with minimum feature like Whatsapp and Gmail, & recieve daily avg 15 call Incoming and out going with this battary last for 12 Hour with fully dryout.",
            "date": "26 Nov 2014",
            "name": "Suraj Kumar B...",
            "stars": "3 stars"
        },
        {
            "comment": "I was excited to buy moto G 2nd gen when it got released to market. An there come big billion day,then without a thought i ordered from flipkart. Excellent service got the product in 2days,after using it for 1 week i found there is some problem with the software and battery charging ....i went for replacement. Got the replacement as usual with in 2 days,but this time i figured that the colour brightness was not up to the expected, i can feel the difference in color since the mobile i used first time is crystal clear in terms of color,but the replaced one is worst, Immediately after the product got delivered with in 30 minutes i went for another replacement. Flipkart as usual good response and good service but the 3rd piece i got was also having the same problem of color deficient. I checked with my colleague mobiles of same model, i can see my mobile color brightness is dull......It is like same as 2nd piece .....now i got compromised with the product...because of bored trying for one more replacement and no guarantee that i will get the best product......I'm tiered of exchanging one more time even though i had a chance for replacement........! I am not against flipkart because i love their services and customer repsonse as well as they give 100% for their customers.......but i just want to share my reviews on the product so that people of my kind will think before they buy this product.....I even don't blame WS retail as well...because i got many products from the same seller...they did a fantastic job in replacing every time i ask for.......whom to blame then.....is it MOTOROLA company who manufactured these kind of products...! But a big loss for me is that i brought this product for an exchange of my samsung mobile (for 2k-----many people in my office told you sold it for very cheap price, they are ready to pay 3 to 4 k for my old mobile) this makes me really embarrassed...... !",
            "date": "26 Nov 2014",
            "name": "Anilkumar",
            "stars": "1 star"
        },
        {
            "comment": "Display - 5/5 Processor - 5/5 RAM - 4/5 Camera - 4/5 Sound - 5/5 Battery - 4/5 Look & Feel - 5/5 Robustness - 5/5 Overall Good Mobile & Good Value For Money",
            "date": "26 Nov 2014",
            "name": "Fariyas Hotel",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone currently available in the 10-15k range. And an excellent service bye Flipkart. Got this item delivered in 1 and half days.",
            "date": "26 Nov 2014",
            "name": "Pankaj Mahato",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is very fast, light weight, Display is good, Camera is not upto the mark, clicks so many blured images, FLASH is not working properly. If we put flsh on auto mode sometimes it work and sometimes even in DARK places it wont work.",
            "date": "26 Nov 2014",
            "name": "Rahul Shingade",
            "stars": "3 stars"
        },
        {
            "comment": "Moto (G 2nd Gen) is very nice mobile. this is google product. moto price good according to other mobile.",
            "date": "26 Nov 2014",
            "name": "Vikash Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "Lot of Good features, but Battery is where it disappoints , could have been better. Looks like all Mobile manufacturers have decided to leave 1 or two glitches in their fantastic products for customers to go through some pain. I still like it in terms of Audio,Video,Camera, Call features for the price, it is good.",
            "date": "26 Nov 2014",
            "name": "Seshu Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Very bad experience with my new phone and flip kart, Below are the problem that I am facing:- 1. Charger gets headed. 2. Its take around 5 hours to get 100% charged. 3. Battery does not last even 6 hours. It's Poorest battery i very seen in android 4. Phone gets hanged up some time and it takes more time restart again. 5. Home Screen Icons display is too large for me. 6. While playing Games processor has lag. 7. Not Very Good Audio output. 8.There are also few GUI and Software issue. Regards Rahul",
            "date": "26 Nov 2014",
            "name": "Rahulkumar Gouta",
            "stars": "1 star"
        },
        {
            "comment": "Using this since last one month or so.. had a terrific experience.!! Smart phone at a smart price...",
            "date": "26 Nov 2014",
            "name": "Ashish Mitra",
            "stars": "4 stars"
        },
        {
            "comment": "Bought this phone 2 months back. It has fell down slightly and the display got broken like anything(dunno whether i bought a phone or glass).Tried contacting multiple motorolo service center. Got bad experience and response from them. They are asking 7K for a display though my touch is working. I could say for that amount we can buy a new phone.please think and buy phones.",
            "date": "26 Nov 2014",
            "name": "prathesh",
            "stars": "1 star"
        },
        {
            "comment": "Good phone and has most of the features similar to Nexus 5. But the cost is bit high for this configuration as we could get other brands on higher configuration at this price.",
            "date": "26 Nov 2014",
            "name": "Senthil Ramesh T",
            "stars": "4 stars"
        },
        {
            "comment": "The white charger given is not at all friendly with the device. It is too tight for the device's charger port.",
            "date": "26 Nov 2014",
            "name": "Sandeep Kempuh...",
            "stars": "1 star"
        },
        {
            "comment": "satisfied for what i afford for this product process 8MP camera 1GB ram 5inc Display on overall i'm happy with the mobile",
            "date": "26 Nov 2014",
            "name": "kesava govardhan ch",
            "stars": "5 stars"
        },
        {
            "comment": "Booked Moto G 2 nd gen 2 days back and today i recieve a email stating the order has been cancelled. When i called up the customer care , they are saying i cancelled the order and will have to re-order it again . When i went to re-order its showing out of stock. Not sure but flipkart credibility and service is going bad day by day .",
            "date": "26 Nov 2014",
            "name": "Johny",
            "stars": "1 star"
        },
        {
            "comment": "First of all hats off to Flipkart for such a fast delivery......I have received the cell on time but der was some problem with SIM 1 Slot......But Flipkart team assured me and delivered a new cell as a replacement in a day only.......Thanks a lot....... I will recommend flipkart for online shopping. Best Of Luck Regards",
            "date": "26 Nov 2014",
            "name": "Vinod Rai",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this product near about 1 month ago but now it is creating a problem for switch on so i want to return this product, as per functioning, product is good but as compare to durability product is weak so please let me know how can i return this product.",
            "date": "26 Nov 2014",
            "name": "manish singh",
            "stars": "2 stars"
        },
        {
            "comment": "I have exchanged this phone 2 times, each and every time I was facing some problems : 1-- Phone was getting heat up (first phone) 2-- Apps were getting closed instantly 3-- Touch sometimes doesn't work Prons: The camera is good, speakers are fine. Overall i would rate it as 3.9 .I didn't liked the battery backup. Yeah If you don't bother about battery then you should go ahead and buy this phone. Once it'll get updated to Andriod 5 (Lolipop) will be able to know how this phone survives in current Market :)",
            "date": "26 Nov 2014",
            "name": "Mukesh",
            "stars": "4 stars"
        },
        {
            "comment": "Don't get deceived by the configuration number's , Phone build is poor . If the Price Justifies that , the support service afterwards will make you realise that you are handling a low class phone . My phone started to get an issue with the receiver / head piece just after 4th week . And have been asked to visit the service centre for the 2nd time within 2 months . And don't be surprised if the service centre in your locality is overcrowded and ask you to submit the phone for 2 weeks and not even to call to enquire before 12 days , and then fails to fix your issue. If you are looking a secondary phone or a phone to gift to some one who doesn't have much dependency on it and has plenty of time to worry about it , This is the one for you.",
            "date": "26 Nov 2014",
            "name": "RJ",
            "stars": "1 star"
        },
        {
            "comment": "its awesome. except for its 1 gb ram which may slow down the phone at a later date, its perfect as of now.",
            "date": "26 Nov 2014",
            "name": "Aniroudha Boni...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased the Moto G2 after hearing good reviews. Its been 9 days since ive been using it and not too happy with the product. Videos on my 32 GB SD card stutter and the phone has twice suddenly blanked out while on a call (the incoming sound gets cuts off) and I need to restart the phone. If this happens again, I am gonna return it.",
            "date": "26 Nov 2014",
            "name": "Paul Thomas",
            "stars": "2 stars"
        },
        {
            "comment": "Nice phone, smooth transitions even though during extreme gaming and multitasking... No problem still found... worst headset,no data cable available... Tested my phone under the water on the 1st day itself.. Works fine... but my heart jumped out while i immersed it in the water...",
            "date": "26 Nov 2014",
            "name": "Joshua",
            "stars": "4 stars"
        },
        {
            "comment": "The overall cell phone is very good. Look and feel is very good. Camera is absolutely wonderful and clicks great snaps. The flash is good. The screen display is very good and perfect. The battery is poor. You need to charge it everyday and if you saw a lot of videos then u would have to charge it in 7 to 8 hours. The overall performance is very good. The camera is excellent.",
            "date": "25 Nov 2014",
            "name": "Harsh Pathak",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is very good in all issues i will give 5 out of 4 for this phone,but in this mobile stand by time is less its need a powerbank,but all of the camera quality and display all things are good,",
            "date": "25 Nov 2014",
            "name": "mahesh chowdar...",
            "stars": "4 stars"
        },
        {
            "comment": "issues with the music player everything else is good.............................................................",
            "date": "25 Nov 2014",
            "name": "PARSHVA SHAH",
            "stars": "5 stars"
        },
        {
            "comment": "this is one of the best phone i have used ever, it has just a 8MP camera but its better than so called 10-13MP of inndian-china.",
            "date": "25 Nov 2014",
            "name": "Amit Kumar Behera",
            "stars": "4 stars"
        },
        {
            "comment": "after using it for 2month... found it as the best in it's price range...... and much better than sony and samsung's compiteters....really it has the right value of money...",
            "date": "25 Nov 2014",
            "name": "sourav kumar",
            "stars": "4 stars"
        },
        {
            "comment": "This is worst product I am complaining head speaker off from day one they are not replying complian launched from many days , hope I get the same resolved soon. 13 days are gone since we made the complain Thanks",
            "date": "25 Nov 2014",
            "name": "Sujata = Agrawal",
            "stars": "1 star"
        },
        {
            "comment": "I have placed the order yesterday for this handset, and got it delivered by this afternoon.However, the product seems to be severely defective. Touch screen does not respond at all. Apart from the start and volume buttons, nothing seems to be working in this handset. When contacted the customer care, they say the technical team would call me within 28th of November, i.e., within 3 days from now. Trusting flipkart, I bought this handset. I have replaced the regular sim to micro sim also. And I have to be disconnected from the world till their technical team calls up. BTW, This is the 2nd consecutive dissatisfaction with the flipkart service.",
            "date": "25 Nov 2014",
            "name": "king kobra",
            "stars": "1 star"
        },
        {
            "comment": "Writing this review after using phone for 1 Month. Camera: Does a decent job in indoor and outdoor. Voice quality is very good. Good and Fast Processor. But the Charger provided with phone is not good. Its get heated.",
            "date": "25 Nov 2014",
            "name": "SATISH YADAV",
            "stars": "5 stars"
        },
        {
            "comment": "this is good mobile bt in ram this is disappointed. camera is good game section is too good sound is also osm",
            "date": "25 Nov 2014",
            "name": "Javed Khan",
            "stars": "5 stars"
        },
        {
            "comment": "There is a spot on the display since I received this product. As per Flipkart Return Policy, I requested for return of the item and a new piece to be delivered but unfortunately the request was rejected citing that few troubleshooting steps that would solve the problem but to no avail while nothing worked. Flipkart is so far just extending the date for solving the issue rather than actually solving it on ground. This is not fair extending the TAT thrice intending to complete the 30 days so that the customer can't \"Request Return\" again, is it? I have been a valued customer for Flipkart so far. Would request to check my Order history. I have ordered about half a dozen Moto G phone. I have got one more Moto G order to place but kept it on hold till this problem is fixed.",
            "date": "25 Nov 2014",
            "name": "Ashadul Haque",
            "stars": "3 stars"
        },
        {
            "comment": "There are already so many things been said about this device and I have nothing new to add to it. I actually bought it for a friend and he really liked it to the core. The only drawback being lack of moto service centres. Moto should really work on having their own service stations and it will encourage more people to buy their phones. Overall, it is a genuine product with high end hardware and specs. Full value for money.",
            "date": "25 Nov 2014",
            "name": "Sachin Kamble",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone when it has been launched. so far performance is good as compare than other brands. Camera - good Battery - good Display - good there is no issues.",
            "date": "25 Nov 2014",
            "name": "Subhash Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered 2 moto g2 device one for myself and one for my friend, currently the best phone in market after motox2. !!",
            "date": "25 Nov 2014",
            "name": "anish sinha",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola rule the market with this product. I have a Moto E and Moto G 2nd Gen. but both are above expectation. The things i missed in Moto E is availabe in Moto G. More storage Bigger Screen Better Sound Amazing Camera Quality (With Auto Focus) It's best mobile in this price range. My suggestion is to you folks don't miss this mobile.",
            "date": "25 Nov 2014",
            "name": "Gaurav Soni",
            "stars": "5 stars"
        },
        {
            "comment": "power buton is louse and not working proprly some time phone is swich off. I want replace this item. thank",
            "date": "25 Nov 2014",
            "name": "rajesh",
            "stars": "4 stars"
        },
        {
            "comment": "this product is really good for Rs.13,000.... excellent gaming perfomace , awesome ;-)",
            "date": "25 Nov 2014",
            "name": "Brabect Rajan",
            "stars": "5 stars"
        },
        {
            "comment": "OVER ALL NICE The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is not that much good",
            "date": "25 Nov 2014",
            "name": "TUSHAR DIVKAR",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone with features and good looks. Product delivered ahead of time, really like the tracking information provided on the website. A good & fast delivery always thrills the customer!! Great going Flipkart!! Keep it up!",
            "date": "25 Nov 2014",
            "name": "Chris G M",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased it on the day it was launched 2 months back nd now it's irritating me like hell. The touch doesn't responds ......seems this phone is using it's own brain nd opening whatever window it likes irrespective of our command. I talked to customer care but they just said i.... it crossed its 1 month now we can do nothing ,nd go to ur nearest service centre.",
            "date": "25 Nov 2014",
            "name": "Kajal keswani",
            "stars": "1 star"
        },
        {
            "comment": "I got the Moto G (2nd gen) phone on 10 October for my wife and barely 45 days of usage the touch screen of phone stopped working. I even tried hard reset but that went vain. Will be taking the phone to Jayanagar service center for service, since the return option is no longer active on my order list. Hope they would be able to give a fast resolution to this problem.",
            "date": "25 Nov 2014",
            "name": "Arun Udayar",
            "stars": "1 star"
        },
        {
            "comment": "It's an excellent phone no doubt. Have been using it for 2 months and found it very good. To summarize it has an excellent display. Camera is excellent but in built camera software sucks. Battery is a letdown but still it lasts enough for say 1 day in moderate use. Overall the phone is excellent. commendable job done by MOTO",
            "date": "25 Nov 2014",
            "name": "Gaurav Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered the phone on Fri i.e. 21/11 and recv it on 24/11. I have not used much to write the review.. but according to me this cell phone is AWSM.. I order micromax Nitro from Amazon it was also good. 1 issue happened in NITRO was when battery reached 50% within 2 hours the cell phone switches off. Rest everything was ok. It happened 2 times with me so i returned the phone and received the refund. Then i booked MOTO G. The touch is simply amazing, Built is also good.. It is not too heavy light then Nitro. i use cell phone for Whatsapp, FB, Call n sometimes SMS. I don't play games.. So i can use the phone for more than 24 hours in a single go without charging. My recommendations would be go for it.. :)",
            "date": "25 Nov 2014",
            "name": "Dhaval Shah",
            "stars": "5 stars"
        },
        {
            "comment": "Now while buying this phone...I had to choose b/w this and the zenphone 5.Ultimately I chose this. here's the hands on pros and cons Pros; 1.Nice, Big display 2.LIght.Like, real light.I used the moto e be4 and compared to that, this feels like a leaf 3.Pretty smooth.Good enough for regular use. 4.Cool matte finish screen guard came free Cons; 1.Battery Life-getting around 6 hrs 2.Camera....doeant work wonders....but good enough for ur average selfies and photos 3.the front speakers.I hate this new design.The old Moto g looked more solid due to their absence. result:if u are looking for a phone that u can upgrade to lollipop, that has got a decent camera and looks nice, then go for it.",
            "date": "24 Nov 2014",
            "name": "Kunal Chakrabarty",
            "stars": "4 stars"
        },
        {
            "comment": "while placing the order there was some offer that 1 gb 3g and 2g data for 2 months after that i have not got any offer like that . i called stammer care they are telling send the screen shot of your order like that. why they are cheating like that.",
            "date": "24 Nov 2014",
            "name": "RAJASEKAR",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased mobile last week. and since then I have not observed any issue with mobile. Display and speaker quality is good. Only 1 thing I noticed. My moto g 2nd gen is not working with 2G data connection of TATA Docomo. I am following up with docomo customer care and motorola customer care but no success yet. Please let me know if any one is having idea how to connect to 2G.",
            "date": "24 Nov 2014",
            "name": "Makarand Bhokare",
            "stars": "4 stars"
        },
        {
            "comment": "The battery is the lifeline of any phone especially if it were to be a smartphone. The battery on the G2 really needs to be recalled and motorola should be replacing them. Key observations #1 Takes around 4 hours to get 100% charged. #2 Battery life poor and lasts for 5-6 hours #3 Turn on bluetooth & wifi and the battery drains even faster",
            "date": "24 Nov 2014",
            "name": "Siddhartha Roy",
            "stars": "2 stars"
        },
        {
            "comment": "i purchased this phone from flipkart.it's delivered in 1 day.cheap price,cheap service,cheap phone,u need to install many applications in order to do anything.One VERY VERY IMPORTANT THING..i would like to tell u is no conference call facility which is available in a phone which cost u 2,000.Can anybody explain why it's available only on flipkart ?i will explain..it's all marketing strategy of motorola..if they will sell in market..all rumors will be spread soon and then no body will buy this phone.In some phone call waiting is not working bt not in my case.I called Motorola customer care...they have no knowledge at all...Motorola care is open from morning 9 to evening 9 bt if u go with any phone of samsung...service is excellent...product is excellent...customer care executives are very excellent and they keep tracking ur problem till ur prblm gets resolved..if u face any prblm with samsung what u need to do is just call once and raise a complain...they will resolve instantly or they will get back to u with proper solution.In motorola phone..it is very difficult to move contacts and all data from old phone but If u go with samsung...they have proper software to do it but moto have no software at all.i would like to suggest u guys that if u want good product and good service then don't look just for attractive features ....Go with samsung which has best product with best service which i ever has experienced.",
            "date": "24 Nov 2014",
            "name": "SANDIP SINGH",
            "stars": "1 star"
        },
        {
            "comment": "Gr8 product. No lagging. Nice speaker sounds. Only thing is it have 1 GB RAM only. If it is available with 2 GB like asus ...it will Rock..",
            "date": "24 Nov 2014",
            "name": "Bibin Mariyil",
            "stars": "5 stars"
        },
        {
            "comment": "first of all thank u for flipkart...because good service for customer to all times and also buying produts...this is the best online shopping forever about me and also hope to buy all products in the flipkart...thank u so much flipkart",
            "date": "24 Nov 2014",
            "name": "Mahend ren",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart delivered Moto G on time as promised. The problem is with mobile WiFi Connectivity, its getting disconnected for every 20 to 30 sec and connecting after 20 sec. There is no continuity at all, causing lot of inconvenience.",
            "date": "24 Nov 2014",
            "name": "Vamsi kgu",
            "stars": "2 stars"
        },
        {
            "comment": "Truely awesome buy with decent delivery by flipkart....perfect in all sorts though i could not find how to change notification sound from one from external memory and thecustom ringtones and notification are bit odd.. Rest it's a great product..!",
            "date": "24 Nov 2014",
            "name": "Anurag Singhal",
            "stars": "5 stars"
        },
        {
            "comment": "The mentioned SAR Value in Phone is totally different... Its maximum SAR value... Dont go with this if you are concern about SAR... Otherwise its rocking...",
            "date": "24 Nov 2014",
            "name": "Shyam",
            "stars": "4 stars"
        },
        {
            "comment": "I am giving this review after using the Moto G 2nd Gen for 2 monhs. The phone is excellent. The only down side of this phone is the battery. I am charging this phone every 14 hrs. I am using it moderately. If this gets improved with the Lolli pop update this it will be a big thumsup for this phone. Due to battery I am 3 star rating Experiance with Flipkart was excellent. They did what they told. Hatsoff to Flipkart.",
            "date": "24 Nov 2014",
            "name": "Prashanth",
            "stars": "3 stars"
        },
        {
            "comment": "I bought Moto G (2nd) form flipkart website on 9 September, 2014. It started showing some touch related problems within 35 days from purchase and its touch stopped working completely on 25 Oct, 2014 without any external damage. I submitted my phone to Motorola Authorized Service Center in Dehradun, after keeping my phone for 3 weeks they told me that touch of my phone was working fine and it had some motherboard issue. After confronting them why it too so long to discover the problem they started making lame excuses and started blaming one another. Also, Service Center was located in very dingy and dark place and employees handling the customers were very unprofessional. As i had lost trust in the Engineers who were handling the phone I contacted the senior officials to provide some proper solution to my problem. They assured me to ship a new phone, but it has been week and a half and haven't heard from them regarding how and when it will be shipped. So please before buying this phone kindly remember their service center support is really bad (specially in Dehradun). PS: I have to give 1 star rating in order to submit my review, but from my side its negative.",
            "date": "24 Nov 2014",
            "name": "Poonam Koundal",
            "stars": "1 star"
        },
        {
            "comment": "1) Performance is good for it's configuration, compared to nexus 5 there will be little delay on response. But its ok for this config. 2) No problem with connectivity 3g/wi-fi. 3) Still not received lollypop update. 4) Yes, charge takes very longer compared to my nexus 5. 5) Dual sim is over kill feature. 6) Doesn't comes with USB data cable. 7) Speakers are good, better than nexus 5. 8) headphone are normal one not in ear type. Better get your own. 9) Bigger phone than nexus 5. Both HxWxB 10) Flipkart delivery was excellent 3 day before delivery date. Nice job team.",
            "date": "24 Nov 2014",
            "name": "Deepan Rajkumar R",
            "stars": "5 stars"
        },
        {
            "comment": "when handset will update the android version 5.0 lolipop let me know as early as possible i want the moto g 2nd gen with updated android version 5.0 lolipop",
            "date": "24 Nov 2014",
            "name": "Ranvir Rotwal",
            "stars": "5 stars"
        },
        {
            "comment": "Got a product on which there is issue with phone mic. Receiver cannot hear my voice, nor I use any feature related to voice. Logged a complaint hope flipkart replaces my phone soon.",
            "date": "24 Nov 2014",
            "name": "Snowil Foss",
            "stars": "1 star"
        },
        {
            "comment": "Seems to be heating problem with Moto G 2nd Generation. Not very sure if this is with my only handset or with all. But i have to raise my concern with Motorola",
            "date": "24 Nov 2014",
            "name": "Prateek Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G 2nd Gen I Purchage via flipkart ..above one month... i m happy with good and speedy mobile...but one very major problem i had in mobile is VERY POOR BATTERY LIFE..",
            "date": "24 Nov 2014",
            "name": "DILIP DHOLAKIYA",
            "stars": "3 stars"
        },
        {
            "comment": "This is a good product in this price range, the only con which i found was its support to gaming. I noticed slight lag which i started playing games like subway surfer, temple run 2 etc.",
            "date": "24 Nov 2014",
            "name": "Arun Modi",
            "stars": "4 stars"
        },
        {
            "comment": "Friends, if you are looking for phone having good features yes this phone will meet at your expectation. Good specification as you can see. Speed of this phone is good. Only worst thing is bad battery Backup. This is the reason I'm rating only 2.",
            "date": "24 Nov 2014",
            "name": "Abhishek Reddy",
            "stars": "2 stars"
        },
        {
            "comment": "I must say awesome phone at this prize.... instead of 1st Gen X buy this (if you don't want touch-less features). don't forget to buy silicon case its necessary (other sights have more options than flipkart for covers). And please Google where are lollipop updates Nexus already got it.",
            "date": "24 Nov 2014",
            "name": "Abhijeet Shind...",
            "stars": "5 stars"
        },
        {
            "comment": "killer mobile at this price range I have used more than 5 phones and if the RAM is 2 gb i would have jumped to it. nothing is lagging than this",
            "date": "24 Nov 2014",
            "name": "Goutham Chinta...",
            "stars": "5 stars"
        },
        {
            "comment": "i used this phone this is very nice phone better camera quality sound is good nice display quality....",
            "date": "24 Nov 2014",
            "name": "Aasheesh Bareja",
            "stars": "5 stars"
        },
        {
            "comment": "i am not recieve charger and haed phone and back panel completelty damaged ....20 days ho gaye abhi tak koi solution nahi hua",
            "date": "24 Nov 2014",
            "name": "DEEPAK GARG",
            "stars": "1 star"
        },
        {
            "comment": "an excellent phone with everything that i wished for. battery life for heavy users is 24 hrs. but otherwise its the best phone till date! cheers to motorolla..!!",
            "date": "24 Nov 2014",
            "name": "Dr. Apoorva De...",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone to buy at this price range, all features are working fine, nice experience till now. You can go to buy this phone at your eyes closed.",
            "date": "24 Nov 2014",
            "name": "Sachin",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone since one month. The phone is smooth in performance. But it often gets heats up when playing heavy games and heavy browsing. But I heard its normal in every smart phone. thus I'm happy with my phone. You can go for it:)",
            "date": "24 Nov 2014",
            "name": "Ahmed Fawaz",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is Good But Not Best Hi I am using this mobile for three months, after that i am writing My review pro's: 1.Voice clarity 2.Speaker 3.decent internal memory (16GB) 4.good camera(only outdoor) 5.good specifications under 13k 6.first priority to android os updates.(android L) Con's: 1.heating up (using camera ,games,wifi) 2. sometimes lagging in playing high end games (asphalt 8,nfs most wanted,dead trigger) 3.no data cable in the box. 4.poor quality head phones in the box. 5.Battery draining very fast ( using games,wifi,bluetooth in min.) 6.battery talk time will be from 8am to 6pm (regular usage with out internet and games) But overall at this price point this branded mobile is good to use . I recommend to people before buying this mobile order one earphone and datacable.(power bank optional).",
            "date": "24 Nov 2014",
            "name": "s.v.v.naveen",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart did a magic by delivering the phone within 11 hours that too when we booked it around 11:30 pm for next day delivery. i ordered this mobile for my brother, he is happy with the cheap and best features of the mobile but the only issue is battery backup. I wish they offered good battery backup.",
            "date": "24 Nov 2014",
            "name": "Pooja Bajaj",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G 2 is internal storage is only13Gb. Not a 16 GB. Its fake details of mobile. and battery back up is only 6 hours",
            "date": "24 Nov 2014",
            "name": "Malli",
            "stars": "1 star"
        },
        {
            "comment": "Cool mobile at best price. Received the mobile in a day. Thank you Flipkart for such a fast shipping :)",
            "date": "24 Nov 2014",
            "name": "Madhavan M",
            "stars": "4 stars"
        },
        {
            "comment": "Using Phone Since 7 Days. Good Things Running Very Fast. Looking - Very Nice. Camera Clearity - Ecxellent. Video - VeryNice & Slow Motoin Mode Is Best. Water Resistant & Scratch Resistant. Bad Things.. Battery Drain so fast. light Heat while playing game. Gujarati Font Not Supported. I Request For Pls Allow Gujarati Font in Next update its must needed. i think in this range its best phone.",
            "date": "24 Nov 2014",
            "name": "Nirmal Patel",
            "stars": "5 stars"
        },
        {
            "comment": "This is my second moto g 2nd gen mobile , ordered on saturday 7.00pm delivered monday 7.00 am, great",
            "date": "24 Nov 2014",
            "name": "Justin Jose Raj",
            "stars": "5 stars"
        },
        {
            "comment": "telling the truth, I was about to cancel this order 2 hours before the delivery of my moto g 2. The reason is I was not able to decide between Moto G 2 and Asus Zenfone 5(16gb). Both phones are priced at exactly same amount that is 12999. Talking about the facts, zenfone 5 packed with 1.6 GHz intel's dual core processor which actually can perform like 4 virtual cores when needed plus its 2 gb RAM, this combo performs better as compared to Moto G 2nd gen. But that doesn't mean Moto G 2 is way behind the performance of zenfone. Reason is Moto runs stock android which saves lot of memory providing you the best android experience. Moto can run almost all games zonfone can. Here are they key points which made me choose moto g 2nd gen over zenfone and I am 100% happy with my choice! 1. Battery backup way better than zenfone. Have been using it since some days and it lasts all day long thats what I needed. compered to zenfone it gives backup of hardly 6-7 hrs 2. Stock android means the best android experience 3. Once of the first phone to receive android L update 4. Splash resistant screen 5. It is all round in true sense!",
            "date": "24 Nov 2014",
            "name": "Parag Vade",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is awesome with nice smooth touch and works fast as compared to Samsung prime Battery is is too good. Picture quality is mast Good phone to buy gyss go for it Thanks Flipkart for fast shipping and service provided by you",
            "date": "24 Nov 2014",
            "name": "Pooja",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G 2nd Generation is bigger & better at the affordable pricing. It ha a decent design & looks, which doesn't give you a sucking plastic feel like others. Display is nice with decent viewing angle but could had been perfect with a full HD display. It's also a good performance wise because its a stock android device. It plays high graphic games like Asphalt 8 , Modern Combat 5 & Dead Trigger 2 smoothly courtesy its 1.2 GHz Qulacomm processor supported by 1 GB of RAM . It comes with 16 GB inbuilt for storage. This time u can expand the storage with external memory card up to 32 GB. It has a 8 MP rear camera which does a decent job & doesn't disappoint in low light with led flash light, front facing camera is of 2MP which will be sufficient for selfie lovers. Best about Moto devices is that it receive Android updates easily before other smartphones. Recommended for all those looking for a looking for a smartphone under 15k & who want a pure android performance",
            "date": "24 Nov 2014",
            "name": "Akshay Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "the phone is satisfactory.. but the earpiece volume is too loud. You can never keep it on maximum or else it will act as a loudspeaker ie everyone can hear your calls. The screen also leaks light. Which is very annoying to see.",
            "date": "24 Nov 2014",
            "name": "Ashish Sharma",
            "stars": "2 stars"
        },
        {
            "comment": "Hi folks, Recently, i have purchase moto g2 but Still hang on after kitkat android os so please check another item campare to it and choose best one for you",
            "date": "24 Nov 2014",
            "name": "Rahul Jodhani",
            "stars": "3 stars"
        },
        {
            "comment": "The product is good, but dnt look in to the offer given by flipkart. u ll not get it. I had even tried the customer care of both network and flip kart. No response. I need it to be resolved.",
            "date": "24 Nov 2014",
            "name": "Om Prakash",
            "stars": "1 star"
        },
        {
            "comment": "I am facing network drop issues and battery performance. The Battery Back Up is very poor its draining quickly.",
            "date": "24 Nov 2014",
            "name": "Rajendra",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G is one of the best quality phones at the price point, I'm really happy with the build quality and features. Flipkart gave me the best price I could find anywhere and the product was delivered in 2 days !! Great service over all",
            "date": "24 Nov 2014",
            "name": "Pranav H",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola G is a very good phone. Its fast, does not lag at all, has an awesome camera which clicks very fine pictures. The battery backup is good too however it will require charging each day. Loved the product. Its the best in its range. Thank you flipkart for launching Motorola. You Guys rocks!!!",
            "date": "23 Nov 2014",
            "name": "Rakshit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "First of all, Flipkart, awesome job. Ordered the product on Saturday night and it got delivered by Sunday noon, can't get any faster than that!!! Secondly, about the phone itself, I am not so good with writing long reviews, all I'll say is, this phone delivers an excellent performance at a price point which justifies it!!! Go for it if you're probably a first time Android buyer or even a user who doesn't care too much about all the bling features which you may never end up using. You will surely not be disappointed both with performance or the hardware quality.",
            "date": "23 Nov 2014",
            "name": "Trivikram Baindur",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile at reasonable cost. Thanks to flipkart for on time delivery. Moto G is providing awesome product to the market.",
            "date": "23 Nov 2014",
            "name": "srikanth buyanni",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered the moto g 2nd gen last week and I have been cheated with the offer. Flipkart didn't keep up with their promise, I haven't been provide with the offer as promised. I find customer service is really worst at flipkart when compared to other online shopping portals.",
            "date": "23 Nov 2014",
            "name": "santhanakrishnan V",
            "stars": "1 star"
        },
        {
            "comment": "I am a complete Motorola fan right from the time it was a sole company to it becoming a Google brand and now Lenovo... I personally own the Moto G, Moto E and now the Moto G2 I own this pc of great update since almost 4 months now and I have already got it replaced 2 times with the third request already under process. There is genuinely no concern with this model, in fact it is an answer to lot of concerns faced by competing brand phones. The only reason I have had to keep getting replacement for it is the display screen. On all three occasions, the display screen has had the same issue. And the issue is: the display screen, on the volume rocker side, is a bit raised above the main phone body due to which there is a thin gap which emits the illumination form the display from the side of the phone. This seems to be the concern with all the three pcs that I have had my hands on, making it look more like product batch issue. Having all this said, Flipkart guys have been super understanding and of great technical assistance over this issue every-time. Really kudos to you guys. Not easy keeping up the standard to the \"T\", consistently. Final verdict: Go for this product even if you have a super humongous budget and can go fancy buying an expensive phone. Because you cannot beat the futuristic approach, that Motorola had before it sold itself to Google, with any other brand. Just a word of caution, as soon as you receive this product check for the screen. If any concern, contact Flipkart immediately. I am sure they would be more than glad to assist you on the same. Those 3 stars, they belong to you guys @ flipkart!!",
            "date": "23 Nov 2014",
            "name": "Dilip Pancholi",
            "stars": "3 stars"
        },
        {
            "comment": "I got this after 1 day of ordering ,thanks to flipkart.I have been using this phone for almost two months and uptill now my experience with it was good but not excellent. I played some heavy games on it ashplat 8 and it hanged on me couple of times.dont know what the problem was.In other aspects the phone is outstanding. The inferface is almost same as nexus mobiles ,thanks to stock android.Google tie with motorola is working good as the experience is the the same you can get on some 30k phones. Camera-good but in low light it gets a little shaggy. Speaker-dual front speaker do their jog perfectly. Screen-big and nice Standby-not that good works only for half day. Interface-awesome cant be better Ram-didnt got hanged uptill now.but lags a little big softwares and games. Overall-no doubt a must buy phone at 13k.great at this price range.so buy it if you cant go for an 30k phone.",
            "date": "23 Nov 2014",
            "name": "Nikhil Awachat",
            "stars": "5 stars"
        },
        {
            "comment": "good thing about this phone is its camera quality.and big problem about phone is its sound quality when i play music in full volume sound is not clear and second problem is google chrome when i open it mostly it say{ unfortunately google chrome stoped} and automatically closed again and again . so i return it...thanku flipkart for refund my money...good job.........keep it up....",
            "date": "23 Nov 2014",
            "name": "Ankit Singh",
            "stars": "1 star"
        },
        {
            "comment": "ordered and got it within a day....display problem is there it gets blurred.....asked for return bt till got no call from flipkart",
            "date": "23 Nov 2014",
            "name": "kamal chouhan",
            "stars": "2 stars"
        },
        {
            "comment": "I am a big moto fan since Motoroal SLVR L7 phone . Since then I have used so many motorola phones and Never had a problem with any of them. I will recommmed this to everyone. I have used Moto G 1st Generation also and found its performance the best.",
            "date": "23 Nov 2014",
            "name": "Rushikesh Tade",
            "stars": "5 stars"
        }
    ]
}
