{
    "filpkart": [
        {
            "comment": "I am using this product. They are giving defective products. If we ask to return they will say bull shit reasons to us . Very very dissapointed.",
            "date": "20 Feb 2015",
            "name": "Amarnadh Alapati",
            "stars": "1 star"
        },
        {
            "comment": "Good phone, stat, screen, colors pixel are good but slow on performance (only flaw). You can;t get everything in this price",
            "date": "20 Feb 2015",
            "name": "Rishi",
            "stars": "3 stars"
        },
        {
            "comment": "Best Product in mid range .But don't upgrade it to lollipop version,its very slow and if u call someone ur internet disconnects automatically and stays disconnected for a long time.",
            "date": "20 Feb 2015",
            "name": "Kalyani Sethy",
            "stars": "4 stars"
        },
        {
            "comment": "the moto g has all normal smart features and good- to- grip utilitarian design. the design could however be more appealing with rich black looks , had the twin speaker bars on both sides (top / bottom) could be concealed to improve aesthetic value of the gadgat.... Overall good , if offered with better battery life....",
            "date": "20 Feb 2015",
            "name": "siva kumar n",
            "stars": "1 star"
        },
        {
            "comment": "What you want in a phone of value 12999/- , a Camera, HD Screen, Good RAM, Better Processor, Speakers? So my answer you'll get these all in one, your answer is MOTO G2 , You are getting Snapdragon processors (Quad Core), with great GPU, 1 GB RAM, 16 GB Internal memory. my first hand experience, as i opened the box and switch on the phone, i was asked to update my phone in Android 5.0.2, so first experience to me was awesome, it has great screen with great color production, gorilla glass 3 so no scratches, then great stereo speakers, awesome quality! Games running smoothly! even Asphalt and NOVA 3, memory is 16 gb so no issues in storage also, you can install upto 64 GB card as well. Call quality is better than any other phone, its really loud. So overall I can say I am totally satisfied with the Product Motorola has made, and finally thanks to flipkart as well to providing this great service!",
            "date": "20 Feb 2015",
            "name": "Aaditya Vasu",
            "stars": "5 stars"
        },
        {
            "comment": "battery does not last longer. poor capacity of the battery. I have to charge twice a day. phone is OK but cost is too much other company selling phone with similar feature at very low price.",
            "date": "20 Feb 2015",
            "name": "Hitesh Patel",
            "stars": "1 star"
        },
        {
            "comment": "Worth Buying this phone. As i am using this phone from last 2 months and it is working smoothly. You can go for this phone as it the best phone in this price range.",
            "date": "20 Feb 2015",
            "name": "Shivam Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "got in jus two days... nice service.... upgraded to android L.. it runs smoothly and \"OK GOOGLE\" is lovely....",
            "date": "20 Feb 2015",
            "name": "Rohit Ingle",
            "stars": "5 stars"
        },
        {
            "comment": "The 2nd gen is a lot more better than the first. Camera quality is good, interface and user experience is also nice and much better than the other similar phones. As I got in a deal, the price also came out to be very good.",
            "date": "20 Feb 2015",
            "name": "Shalvika Sood",
            "stars": "4 stars"
        },
        {
            "comment": "Very reasonable price for great features. Strongly Recommended for anyone looking for a budget smart phone.",
            "date": "20 Feb 2015",
            "name": "Divya Bhatia",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this since last one month and feeling it reach. Only one factor which is a concern is a time to charge the phone. Takes little longer. Otherwise overall a wonderful product",
            "date": "20 Feb 2015",
            "name": "Dharmesh Vyas",
            "stars": "5 stars"
        },
        {
            "comment": "bought the phone on January 22nd and it is 20th feb and i am onto my second replacement model. the first time, the power button stopped working within a week and a half and flipkart was nice enough to replace the phone within a day. Now it is two weeks since i used the replacement phone and the phone has stopped charging altogether! While flipkart has provided me with a replacement instantly and I should get the replacement tomorrow, i am having serious doubts over motorola's product quality. Understand that this is not a very expensive phone, but having two failures within a month of the original purchase makes me wonder. Buyer beware",
            "date": "20 Feb 2015",
            "name": "Anant",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G 2 is a great phone and its worth the money..Had a great experience with it... Loved the sound ..display better than last Moto.. The only fault is that touch became unresponsive after the lollopop upgrade...",
            "date": "20 Feb 2015",
            "name": "Shivendra Anand",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G2 recently, there is no issue in hardware and software side. But I dropped my phone 2 feet height and my Corning Gorilla Glass 3 broken into pieces.",
            "date": "20 Feb 2015",
            "name": "Ravi Varman",
            "stars": "1 star"
        },
        {
            "comment": "Awsome cell phone ! Shop it with closed eyes. hard to get branded cell phone of this quality in this price range and duel sim card too. I would buy this product again and again.",
            "date": "20 Feb 2015",
            "name": "Sagar Amble",
            "stars": "5 stars"
        },
        {
            "comment": "It is a very nice phone at a very good price. Camera is good Doesn't Hangs which is a very important thing nowadays Interface is great Touch is very good At very reasonable price",
            "date": "20 Feb 2015",
            "name": "Avi Aggarwal",
            "stars": "4 stars"
        },
        {
            "comment": "I have baught 3 cell phones so far for me, my friends and family. And thinking of purchasing another one. Because I don't find any other better product in this price range. Simply Awsome cell phone !",
            "date": "20 Feb 2015",
            "name": "Sagar Amble",
            "stars": "5 stars"
        },
        {
            "comment": "Got this mobile last sunday updated lollipop working file. disappointed battery back up and 1GB Ram.... for this mid segment hand phone feel this things to be update at lest 2700 battery and 1.5 or 2 GB ram....",
            "date": "20 Feb 2015",
            "name": "Pradeep P N",
            "stars": "4 stars"
        },
        {
            "comment": "Initially There was a big buzz for this phone. People told MOTO G is Superb... But i had a different experience. It started after updating to lollipop.. It hangs a lot even having a average apps. We can answer the call and give text reply when the phone is in locked. But it entirely different. We cant see who is calling.. we have press the power button put password then only we can attend the call. 2.The GPS is worst. It will show \"my location\" in some where else. Now \"get directions\" will be always \"wrong direction\".. one notification remains in display for more than 10 seconds even i tried to swipe off it is not working. Apps stuck like anything.... Sometimes answer option will not work.. The screen stuck when I swipe the apps pages. ZERO STAR......",
            "date": "20 Feb 2015",
            "name": "Ben Chinnasamy R",
            "stars": "1 star"
        },
        {
            "comment": "Thnx to flipkart for providing such a nice and wonderful phone in India, motorola provides every things in this phone with a competitive price which is not possible in other phones. camera quality,built quality , processor, etc etc every thing in this phone is awesome. I recommend all the buyers to purchase this awesome phone.",
            "date": "20 Feb 2015",
            "name": "SHIVAM SRIVAS...",
            "stars": "5 stars"
        },
        {
            "comment": "new moto g 2nd gen. now in 2015 is comming with lollipop 5.0 and the phone great quality but the earphones provided are low quality....otherwise the phone is awesome",
            "date": "20 Feb 2015",
            "name": "shubh khanna",
            "stars": "5 stars"
        },
        {
            "comment": "The best phone for this price. I got the phone with Android Lollipop pre installed. Used it for about a month now. No issues so far. As I do not use many gaming applications, 1GB of RAM seems sufficient. Having downgraded from a Nexus 4 to a Moto G (2nd Gen), I am extremely satisfied with this phone.",
            "date": "20 Feb 2015",
            "name": "Maahir Mehaboob",
            "stars": "5 stars"
        },
        {
            "comment": "super mob.",
            "date": "20 Feb 2015",
            "name": "APS",
            "stars": "5 stars"
        },
        {
            "comment": "In every aspect the phone is decent....even in the weaker zone it scores 3.5/5....best phone at this price. the 5'' screen is good, not very big, easy to handle....very light and slim feels good in your hand. The battery back up not as good as the previous moto g 1....as battery back up reduces with increase screen size...but over all decent. very fast. 16 GB storage is an added advantage. The lollipop update is already available...if u dnt want to wait till may 2015 and desperate to use android lollipop and Nexus is beyond your budget ...go for it!!",
            "date": "20 Feb 2015",
            "name": "Kaushik Bhatta...",
            "stars": "5 stars"
        },
        {
            "comment": "Its superb...no lag , using for last 1 month...after Lollipop update the all over UI feel is nice...fully satisfied with Moto G2...Paisa wasul Product..:) Battery Life Avarage 8 Hrs with harsh use of internet, game, WiFi...so can't complain about it... Running N.O.V.A , Asphalt 8 with no lag..I dont want anything more :)",
            "date": "20 Feb 2015",
            "name": "kntl",
            "stars": "5 stars"
        },
        {
            "comment": "very nice mobile but manufacturing defect phone my mobile not correctly response from flip kart services",
            "date": "20 Feb 2015",
            "name": "nat rayan",
            "stars": "1 star"
        },
        {
            "comment": "Heyy guys, i had purchased this mobile in October, its simply awesome phone. Flipkart service is also good, i received the phone in 3 days with nice packing. Only thing is when you play games and if continuously the internet is ON, the battery drains within 1 day. Otherwise features wise its best. Now i had successfully upgraded to lollipop 5.0. Its a best phone in best price. Thank you",
            "date": "20 Feb 2015",
            "name": "Shrikant Agam",
            "stars": "5 stars"
        },
        {
            "comment": "its awesome android phone. in manner of price ,and specification but only ear phone quality is poor.but over all best in that price.but flipkert done dual standard in offer .i got only phone in that price in 2nd january but my friend got phone +flip cover worth 1300.",
            "date": "20 Feb 2015",
            "name": "Hasibur Rahman",
            "stars": "4 stars"
        },
        {
            "comment": "Quite good in price range. Problematic feature is about the sim card slot lock problem. It is very very sensitive. My phone both slot locks are broken. Moto have to look over this problem seriously. My friends who bought this mobile, everyone is having the same problem.",
            "date": "20 Feb 2015",
            "name": "Zuhaib Ahmed",
            "stars": "4 stars"
        },
        {
            "comment": "I am always a fan of MOTOROLA for the last 10 years...This Moto G is very impressive on look, performance and price. The gorilla screen is superb, you don't have to use screen guard. The battery life is good. The most important thing I love about all MOTO phones is the sound clarity, its brilliant. Love it, use it to feel the punch...!!!",
            "date": "20 Feb 2015",
            "name": "Abhijit Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after 15 days of use. I purchased from FlipKart and as usual the delivery was great. Moto G has all the features one can think off at this prize range. 1 GB RAM works fine along with a pretty good processor speed. Android Lollipop update did not find any lag as mentioned by few of the reviewers. Battery could have been better. It comes only for a day and surprisingly charging is too slow with the charger available with the phone. You may need to get a power bank for quick charge. It has a great look but slightly bulkier with the MOTO cover (pretty expensive only the light magnetic sensor is the advantage) you can do away with the cover. Just the next day of my purchase the cover prize was reduced from 1700 to 1179 for royal blue. Screen is real with a scratch resistant LCD glass. I did not find any difference with AMOLED and this staff after using it. Sunlight readability is very good. Two sim slots are nicely planned along with the dual speakers at the front. But be careful about the dust accumulation inside the speakers. Repeatedly you have to swipe it off. All the inbuilt applications and playstore makes it easier to download the application. Vocie clarity and other stuffs are good. Signal response is very good here even being a dual SIM Mobile. This has been the basic problem with most of the dual SIM mobiles. So ensure two SIMS are used actively in these mobiles. I had a serious problem with signal reponse in my earlier purchased Nokia 730 which I had returned to flipkart after 20 days of use. Flipkart kindly aceepted the fact and obliged the return. Money was refunded to my wallet. Then I came to know that Nokia 730 has serious problem of call drop due to poor signal response. This is happening for Nokia 535 also which my collegues have purchased. I am not comparing here the Nokia 730 with Moto G2, but there is some problem in the former. However battery of 730 way better than Moto G2. To conclude there are more porns and less cons in Moto G which is the best bet to go in the present changing scenario of the mobile and keeping the overall budget in mind. If the budget is within 15000 its a best bet. My rating would be 4 out of 5. It looses one star because of the battery.",
            "date": "19 Feb 2015",
            "name": "Santoshkumar D...",
            "stars": "4 stars"
        },
        {
            "comment": "this is a very good phone in the range 10-15 sound and display screen are the awesome features of this phone. A very technical phone considering it will get updates for android versions",
            "date": "19 Feb 2015",
            "name": "Santosh Yadav",
            "stars": "4 stars"
        },
        {
            "comment": "I am very satisfied by this phone, All features are good. Especially the speed and display. its missing some features though. Things like u cannot use phone speakers while using radio, it does not have in built file manager, and sound recorder. obviously they can be downloaded and installed. Overall its a best product in this price range, and even better than some of the samsung phones like samsung galaxy quattro which are expensive than moto G.",
            "date": "19 Feb 2015",
            "name": "Deepak",
            "stars": "4 stars"
        },
        {
            "comment": "after update it is more awesome phone is smooth never lag after the lolipop update it was bit hard to use bt after it was awesome i prefer tooo all people too buy dis cellll in such a lesss price [MAIN THING DAT DIS CELL IS #WATERPROOF",
            "date": "19 Feb 2015",
            "name": "kapil ghadi",
            "stars": "5 stars"
        },
        {
            "comment": "no questions asked, just buy it. dont go on the negative reviews. using since more than an week and totally satisfied.",
            "date": "19 Feb 2015",
            "name": "fahd patel",
            "stars": "5 stars"
        },
        {
            "comment": "Overall very good smartphone for all purpose use.Good technical setting for up to date android versions. Camera is also good.",
            "date": "19 Feb 2015",
            "name": "Abhijeet Mandal",
            "stars": "5 stars"
        },
        {
            "comment": "didnt realise the importance it played in my life untill i lost it ,.,. i really miss my phone now ,., great phone ,. amazing freatures ,., always reliable ,., daily driver",
            "date": "19 Feb 2015",
            "name": "Aravind Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "I am simply ecstatic about the phone. I have had HTC Explorer, Samsung Galaxy S3, Moto E but none can be compared to this. Getting lolipop is an dded benefit for the phone. Plus the sound quality, camera quality is also good rather great!! Really amazed to use this phone.... superb touch sensor, and an awesome experience in all....I recommend to buy this one for all!!! Happy being motorola user again....:D",
            "date": "19 Feb 2015",
            "name": "Payel Roy",
            "stars": "5 stars"
        },
        {
            "comment": "IT'S STRONGLY BUILT, ATTRACTIVE LOOKING MOBILE WITH ALL ROUND PERFORMANCE TICKING ALL THE RIGHT BOXES IN FAIR PRICE ENSURING PLEASANT AND DURABLE USER EXPERIENCE. A MUST VALUE BUY FOR PRICE CONSENSUS QUATILY BUYER !!!",
            "date": "19 Feb 2015",
            "name": "DHANESH YADAV",
            "stars": "5 stars"
        },
        {
            "comment": "I had got my moto g 2nd gen on end of October 14. I had exchange with my old Samsung phone and got 2000/- discount and got additional 10% discount using my credit card offer. It was less than 10 K. Please find my feedback after using 4 months: Pros ======= 1) Looks good & build quality is quite good. 2) Battery life is satisfactory compare to my old phone - works 1-2 days with Wify/3G with full charge. Although I am using single SIM. 3) Display is good Cons ====== 1) Camera is not good. Flush light lighten the central area only and left the edges dark. 2) After upgrading to Android 5.0 the multitasking experience is not good",
            "date": "19 Feb 2015",
            "name": "Tirtha Chattop...",
            "stars": "4 stars"
        },
        {
            "comment": "Best handset for the price, runs latest android, however dont let it fool you. There are better option out there if you got extra cash. Con's:- 1. Always defective handsets sent first. After you order, I guess there is procedure Flipkart follows, Firstly, send a defective or returned product to the customer, If customer realises the defect then avoid return (tech support i guess is trained to avoid returns as much as possible), Dont accept for a return until customer pushes this matter to the consumer court, Send the proper phone. 2. Never ever Directly Gift this phone to anyone, make sure u check it and proceed. 3. The earphones which comes with this handset are meant for conversations NOT music. 4. Currently, Lollipop has stability Issue's.",
            "date": "19 Feb 2015",
            "name": "Ahmed",
            "stars": "3 stars"
        },
        {
            "comment": "All features are really awesome except battery life but it still last 7-8 hours of heavy internet upload ,download & surfing. Overall a very good purchase. Value of money with Android Lollipop upgrade. Thanks Moto, Flipkart & WS Retailers",
            "date": "19 Feb 2015",
            "name": "Surya Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "Pros.. very handy, easy to use, very soft touch and HD display. Cons..battery backup is its most imp problem in phone",
            "date": "19 Feb 2015",
            "name": "Sagar Singh",
            "stars": "3 stars"
        },
        {
            "comment": "almost a month completed i am using this device no issues whatsoever be confident to buy good shipment too as expected .the battery and other accessories completely original and working fine lollipop android update is available you will reciev it within a day and its doubles the enjoyment must buy acceptable price but awsome product....",
            "date": "19 Feb 2015",
            "name": "sanat shetye",
            "stars": "5 stars"
        },
        {
            "comment": "Best in class camera, guaranteed upgrade to lollipop and yes full day battery . . . Fall in love with moto g",
            "date": "19 Feb 2015",
            "name": "vivek parmar",
            "stars": "5 stars"
        },
        {
            "comment": "This cellphone comes with all you need or I can say more than what you need.Awesome user experience with smooth speed, great camera quality, enough storage capacity. All this in affordable price which does not cost your pocket more. 8 MP Rear Camera 2 MP Front Camera 16 Gb Internal Storage with Expandable capacity 1.2 Ghz Quad core processor pretty good for multi tasking and heavy gaming Dual Speakers and most important upgradable to Android Lolipop 5.0 which gives you very smooth interface of latest android OS.",
            "date": "19 Feb 2015",
            "name": "Karan Mantry",
            "stars": "4 stars"
        },
        {
            "comment": "The handset is excellent. Tremendous display, terrific sound quality, overwhelming response of the touch caliberation, splendid camera quality and resolution, superb front camera. Internal memory of 16 GB gives a righteous usage of the phone in all spheres. Battery back up is one of the issues that one can find in many of the Multimedia Smart phones now a days. Overall experience is just AMAZING !! Really Value for money. The best smart phone in the price range of 13k.",
            "date": "19 Feb 2015",
            "name": "SATISH CHANDRA",
            "stars": "4 stars"
        },
        {
            "comment": "I use Moto G and have recommended it to eveyone. Infact I bought 5 of them now through Flipkart. The Iteration of Moto G is is also phenomenal . Its has the same awesome battery. The camera which was lagging in the 1st Gen has been taken care of .I wont say its perfect but yes its better. The Lollypop has been updated in all of the Moto G's which is before any other brand except Google itself. I don't have any cons for this particular product. Motorola had nailed it and everyone knows it.",
            "date": "19 Feb 2015",
            "name": "Anirudh Pratap...",
            "stars": "5 stars"
        },
        {
            "comment": "U CAN RATE IT OR HATE,BUT JUST CAN'T IGNORE IT... ORIGINAL ANDROID EXPERIENCE.... ANDROID LOLLIPOP UPDATES AVAILABLE....",
            "date": "19 Feb 2015",
            "name": "Jobandeep Sing...",
            "stars": "5 stars"
        },
        {
            "comment": "amazing phone at this price. only one word awesome... there is only one con :- Ram is 1 GB, it should have 2 GB.. flipkart byuing experience was amazing. normal delivery in 2 days...",
            "date": "19 Feb 2015",
            "name": "Ajay Newatia",
            "stars": "5 stars"
        },
        {
            "comment": "I am reviewing this after two month of my usage.I ordered the phone on 5th Dec around 7PM and it is delivered on 7th Dec at 2 PM.Thanks to flipkart. Now coming to the specifications:- Camera/video recording - Excellent,recording is @720p . Speakers - moderate sound. Battery - Good but if U surf or play games too much battery consumption is very high.. Apart from all the functionality i got the Lollipop update at the end of January.. Totally worth it..I suggest others to buy this... :)",
            "date": "19 Feb 2015",
            "name": "Abhishek Sriva...",
            "stars": "4 stars"
        },
        {
            "comment": "every thing is good about this phone except for battery life. If your are a heavy gamer. you gonna charge it 3 times a day. but on normal usage it lasts for about 20 hrs. Its video recording seems to have a problem. It bumps suddenly from bright to dard video recording and this continues if lighting conditions vary very rapidly. like if you move your camera very much then it will surely happen. Good thing is the moment you are connected to internet, it receives android lollipop OTA update. Try to switch off adaptive brightness and manually increase the brightness a bit so that its visibly clearer. try to buy a good IN EAR earphones because the earphone that comes with it is old fashioned. Also buy OTG and USB cable because its not provided here. After upgrading to lollipop if you see exclamation mark (!) inside a triangle in the notification panel saying \"restricted access\" then remember that you will still be using your sim perfectly, but this usually happens if you cut out normal sim into micro sim instead of purchasing a brand new micro sim. Also it happens if you use nano sim with adapter. So try to buy a new micro sim and donot cut old sim/ normal sim to micro sim Also remember that both the sim when inserted will click and then lock into position. Donot just insert sim and leave it without hearing a click sound. And USB OTG is fully supported. IF its a video or image or music then just go to gallery and you will find it. For all other file types just install \"FILE COMMANDER\" from google play store. Donot increase sound to full volume on front speakers as it will produce a chattering noise at that high level. HTC phones front stereo speakers are way ahead and advanced in this catagory so donot compare it with that. but overall build quality is smooth and sems branded. its value for money. and you can play all high end games like modern combat 5, asphalt 8, real racing 3 etc. But remember that its buffer memory is pretty low so donot expect to resume game if you are multi tasking. Once you are out of game in pause mode then when you return you will see the game has restarted. Good thing is that it doesnot get heated up no matter what game you play/ how much time you play. Just try not to play game during charging. As this will increase your overall battery life. And remember that battery is fixed as phone is water proof. if any thing happens to you battery then just go to motorola service center and they will change it for you. Donot open your phone and remove any of internal components or even battery as there is a nano coating. If you expose any of terminal then your phone will not be water proof. And believe me Its totally water proof. I have dropped my phone in a bucket full of water, it drowned but still it is working like a charm. i suggest it to every one. one last thing, if you see exclamation mark (!) beside wifi or network symbol on top after upgrading to lollipop then dont be afraid its just because of signal strength. you can still be able to use it normally",
            "date": "19 Feb 2015",
            "name": "Prem Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "Pros : 1. Good screen resolution 2. Was first to get Lollipop update 3. Size is just right and feels sturdy in hand ( Splurged on a costly flip cover) 4. battery gets you through the day and charges quickly 5. Dual sim 6. SD card flexibility Cons 1. Camera sucks ( OK in outdoors, poor in indoors). Complicated zoom procedure. 2. Not full HD 3. Screen shot procedure of holding two button works sometimes and fails sometime Overall a good budget phone with which you can spend a year ( if you like to change mobiles often) - 2 to 3 years if you are not finicky.",
            "date": "19 Feb 2015",
            "name": "Vishal Agrawal",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased it for two friends. Awesome performance and up to date updates. Stylish Awesome screen Good UI Google Updates Go for it",
            "date": "19 Feb 2015",
            "name": "Pradeep P",
            "stars": "5 stars"
        },
        {
            "comment": "I got the phone delivered within a week, The phone is amazing with the Lollipop update, the UI is much smoother, camera quality is OK, speaker sound is good, In-box earphones are not great but will suffice , build quality is excellent and feels premium to hold",
            "date": "19 Feb 2015",
            "name": "Bernard Fernandes",
            "stars": "5 stars"
        },
        {
            "comment": "For the price range it is good... They should add a 1gb ram in the next version or the model. Till then its a decent buy.",
            "date": "19 Feb 2015",
            "name": "Pankaj",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this after exchanging my old phone. I loved it from the day one. Good build quality. Lollipop update came in no time. But the phone heats up quickly when 3G is ON. Its like you can feel the heat in your hands when you are holding it. Since its shares the same configuration as the same old Moto-G 1st Gen phone, except for the bigger display, battery backup goes for a toss here. Every night I have to charge it for sure. Apart from these, I love the phone. Worth the money.",
            "date": "19 Feb 2015",
            "name": "nanda kishore",
            "stars": "4 stars"
        },
        {
            "comment": "Great experience with MOTO G. Phone has now been upgraded to LolliPop, awesome UI and Very good performance. very good camera quality both front and back. quality of videos are really good. Suggest you to buy this phone.. worth of your money.",
            "date": "19 Feb 2015",
            "name": "Nitin Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "This is not a product review. This is the review of worst Motorola service! I have bought Moto E on the day of launch. After 2 months, it started showing issues with speaker. Gave it to authorized service center in Kochi, ADR Technologies. They took 1.5 months to repair it. But after 1 hour of usage it started showing the same issue. Again I gave it to the service center. Till now I have visited the service center 12 times (it is 45 Kms away from my home). But still they could not repair it. Service center people said, they have done everything possible. When I asked for the replacement they said they are not getting approval from Motorola and asked me to contact Manikandan, regional manager of Motorola. For the last 3 months, I have been calling so called regional manager, Manikandan for the replacement. All these days he was telling me stories like no stock, not getting approval etc. (At least he used to pick my calls, but did nothing). Now he stopped picking my calls. It looks like I have to go to consumer court to get it replaced. This is my experience with Motorola. SO BUY AT YOUR RISK !!! I have bought 3 Motorola handsets through Flipkart, Moto E, Moto G 2 & Moto X. I have put the same rating and review for all these as I am reviewing after sales service of Motorola not the product.",
            "date": "19 Feb 2015",
            "name": "Riyas Yacoob",
            "stars": "1 star"
        },
        {
            "comment": "I happened to have the phone in my front jeans pocket all the time. I had a small skid from my bike and am damn sure that didnt impact my phone in anyway. But after the fall, my phone's left side touch started to work glitchy and i have a very small lcd crack on my lower left screen which begins to lengthen using day to day. Service center says you shouldnt keep the phone in Jeans and all. Not covered in warranty due to external damage. Pretty lame reason for a reputed company. And for a new screen, they are charging pretty much the cost of the phone. Not to mention the battery backup. Why is that the after sales ONLY IN INDIA sucks?",
            "date": "19 Feb 2015",
            "name": "Matthew J S Raj",
            "stars": "1 star"
        },
        {
            "comment": "Its The Best Phone Better Than Anything 13k What You In That Great Phone Grab It Dont Think Much Buy in Now",
            "date": "19 Feb 2015",
            "name": "Karan Khare",
            "stars": "5 stars"
        },
        {
            "comment": "camera is awesome. sound quality is some noisy in earbud in moto headset. it is a smarty phone it may be a good phone",
            "date": "19 Feb 2015",
            "name": "SACHIN CHOURSIYA",
            "stars": "5 stars"
        },
        {
            "comment": "Battery drains a little faster. Other features are good. Became a but slow after lollipop upgrade :(. I love the product for the price. It was delivered promptly within time",
            "date": "19 Feb 2015",
            "name": "Ashish Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "moto g is now known to everyone so its goods and bad are also known. so nothing new to tell.. would like moto to reduce weight and thickness and about flipkart ... best service... great great great... ordered on 13th estimated on 19th but got by 16th.. great service. and courier coordination with flipkart also supper .. informs you every thing with you order , no need to track... moto g 4stars additional 1 for flipkart",
            "date": "18 Feb 2015",
            "name": "RAJ RAGUL",
            "stars": "5 stars"
        },
        {
            "comment": "Motorolla phones are quite good in function and battery life compared to Samsung galaxys.. Only issues with this phone is like Samsung phones it doesn't have hardware navigation keys at the bottom (only software keys)... which becomes an issue with the overall size of the display, as the phone uses a lot of space in the bottom for the software keys (specially in a web browser app) you screen scrolling size goes small. You can install Autohide softkeys app for this... Overall phone battery comes for almost a day and half of regular using (mine was rooted though with lots of apps and running widgets) so for the normal user it should last 2 days... Flash is like samsung (bright led) No good fixed battery (should sell the phone in a year after warranty) else battery cost will be high for replacement as it is fixed...",
            "date": "18 Feb 2015",
            "name": "Reuben Pereira",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone very recently after a long search. the moment i opened it, it showed me update for android L, that was a bang on!! Before android L update phone battery was awesome but after its up-gradation it gets discharge very easily, but the good point is also that it get charged very fast. over all phone performance from its UI, camera, sound quality to features like moto assist and all attracts a lot, but you have to compromise its battery life, once it gets upgraded to android L. otherwise this phone is awesome , a big thumbs up :)",
            "date": "18 Feb 2015",
            "name": "TARUNA SHARMA",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is good in this price bracket, but have started lagging after a couple of months use. Also the battery back is not too great.",
            "date": "18 Feb 2015",
            "name": "Vinay Bansal",
            "stars": "4 stars"
        },
        {
            "comment": "phone and design is awesome ,but the problem is with battery...once you starts to use 3G.its done....i am using it for 2 weeks ,bt sometimes it got stuck..:( camera is awesome,..display awesome..",
            "date": "18 Feb 2015",
            "name": "vysakh raveendran",
            "stars": "3 stars"
        },
        {
            "comment": "Motorola Moto G2 in a best mobile phone in the range of 15k.I am using this phone since 4 month no problem",
            "date": "18 Feb 2015",
            "name": "Anand Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart and Airtel has NOT given me the 1GB 3G data each month for 2 months. Airtel is asking to wait for 72 hours again after every 72 hours are over and giving illogical reason like - I put SIM after removing from Moto G mobile to Samsung Galaxy Y (which I exchanged on flipkart) So I can NOT have Moto G mobile and Samsung Galaxy Y together. then how can I put SIM in Samsung Galaxy Y after removing from Moto G!!!. Flipkart on other side is simply asking to wait again and again. It is now almost ONE MONTH over waiting. But no result. So DO NOT BELIEVE FLIPKART FOR OFFER IT MENTIONED ON ITS WEBSITE.",
            "date": "18 Feb 2015",
            "name": "Varun Gupta",
            "stars": "1 star"
        },
        {
            "comment": "This is best buy in range with Brand and Quality of Moto ....................... Overall A Very nice Phone",
            "date": "18 Feb 2015",
            "name": "psr",
            "stars": "4 stars"
        },
        {
            "comment": "I got the mobile where first sim slot is not detecting the sim. from last 3 days I have been getting told by flipkart contact centre agent that I will get call tomorrow which never happened so far. there is no escalation system in flipkart and agent keeps repeating the same story that we don't have authority for replacement and you would get call from them ... it really frustrating. don't buy products from flipkart else you may also have to run around to get the right product or service from them.",
            "date": "18 Feb 2015",
            "name": "Pradeep Sharma",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone very fast , good display . there are some problems with volume and earphones are are very poor quality . I got replacement twice for earphones . vedios can not be watched in landscape mode unless you turn on Auto rotation Contacts app has stopped working",
            "date": "18 Feb 2015",
            "name": "Santosh",
            "stars": "4 stars"
        },
        {
            "comment": "2 Star Because of Good Quality hardware, Best in class, But Regional Language does not support I.e. Gujarati",
            "date": "18 Feb 2015",
            "name": "RAJU DHADHAL",
            "stars": "2 stars"
        },
        {
            "comment": "Very good camera. Some drawbacks after updating to lollipop but found alternate options for the same.",
            "date": "18 Feb 2015",
            "name": "Deepak Mandiratta",
            "stars": "4 stars"
        },
        {
            "comment": "I took this phone 2 months back still working fine, not got any problem, camera ok, little bit problem in volume but manageable.",
            "date": "18 Feb 2015",
            "name": "Shashikant",
            "stars": "4 stars"
        },
        {
            "comment": "The product can reach the satisfaction levels. Compare to other brands,the ear-phones quality is not all good.You need to come with the best quality. Battery is Ok.but it needs improvement (backup wise) USB cable should be provided.Other wise we have to depend on other sources again which is not good for your product. Make it complete :-)",
            "date": "18 Feb 2015",
            "name": "SANDEEP VARIKUNTA",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased the phone last month & am giving this update after one month usage. The phone offers above average features for average price.",
            "date": "18 Feb 2015",
            "name": "dipak Jain",
            "stars": "4 stars"
        },
        {
            "comment": "RECEIVED MY CONSIGNMENT ON NEXT DAY ITSELF. VERY AND SURPRISE DELIVERY I NEVER EXPECTED FROM FLIPKART..",
            "date": "18 Feb 2015",
            "name": "Suresh Kumar R",
            "stars": "5 stars"
        },
        {
            "comment": "very nice phone...look is awesome... battery back up is also good... i love this phone...i got it for just 11699................",
            "date": "18 Feb 2015",
            "name": "Tanmoy Debnath",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good phone with Lolipop upgrade but as you load it up with apps & data,it just cant handle & keeps hanging.Battery last for one day",
            "date": "18 Feb 2015",
            "name": "Vishal Patil",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is a great phone, especially with respect to its very competitive pricing. The phone is fast and responsive. My only issue with this phone is mainly with Android. Android is now tied very closely to Google and there is no escaping google on this phone. No way to \"not\" link your phone to google, and share all your information. The recent Lollypop update has made the slower, and the UI is not very good. There are several limitations in using this new design, for example the phone application, and finding contacts requires several more taps. I preferred the KitKat UI. I would recommend the users to wait for a little for updating their phones while until Lollypop achieves more maturity. Please note: There is no easy way to revert back to Kitkat once updated.",
            "date": "18 Feb 2015",
            "name": "Vikram Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "Touch is good and good battery backup. I have installed only less APPS and phone is not getting hanged. I am using this phone for 4 months. Gaming reduces battery performance a bit.",
            "date": "18 Feb 2015",
            "name": "Hari Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "this is one of the best cell phone i ever had, much better than any other phone which has snapdragon 400 process with 1G ram in best price (selling @ cheap price) and the best part is exchange offer.... Thanks",
            "date": "18 Feb 2015",
            "name": "Ramesh Desai",
            "stars": "5 stars"
        },
        {
            "comment": "Well, this is a an updated review after ... Firstly, phone is excellent and true to all the claims. Just an fyi for ppl out there....latest lollipop update is a massive battery drainer !!! Had bought this phone fr my dad who was very very happy with it until recently when i upgraded to lollipop !! earlier he would need charging after more than 24 hrs from full charge (avg like 30-36hrs with his limited usage but with mail & other background apps syncing). Now it wont even last properly for like 16 hrs from full charge. no changes at all as far as new apps installed or something, but the battery drain diff is substantiallly more !!!! Please note, am not saying the phone is faulty or something....just as a heads up for ppl who might not have upgraded to lollipop to take this into consideration !! And, have read up online that lollipop does have these issues irrespective of the phones...so, it explains a lot !! All in all, the phone is a value for money with nice features in my opinion !! Would def recommend buying...",
            "date": "18 Feb 2015",
            "name": "Sameet Manerker",
            "stars": "4 stars"
        },
        {
            "comment": "Nice set ..but now in flipkart bellow this price range with same and updated configuration competitive mobile phones are available so moto-g should consider this and its time to cut off their price.",
            "date": "18 Feb 2015",
            "name": "Afif Aslam",
            "stars": "4 stars"
        },
        {
            "comment": "Not as good as expected. First piece i got kept on beeping at frequent intervals. Got same replaced, second one now keeps hanging even though no apps downloaded and phone stormed with data. Not so happy with it, I guess ASUS would have been a better option. Rgds",
            "date": "18 Feb 2015",
            "name": "Amit Kabra",
            "stars": "2 stars"
        },
        {
            "comment": "Nice product ,good perfomance and the only draw back is RAM for moto e also 1GB RAM only Expect RAM remaining everything is good.",
            "date": "18 Feb 2015",
            "name": "samrat k",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent piece of performance by the smartphone reviewing the speed of operations throughout, the camera quality and the network signals for calling as well as the battery backup to run a day funtions with an ease.",
            "date": "18 Feb 2015",
            "name": "Tushar Patil",
            "stars": "5 stars"
        },
        {
            "comment": "I have used Moto X, X2, G & now G2 ( All are marvelous devices) ....I was very much satisfied with MotoG (2nd gen) & also recommended to few of my friends. They were also happy with the overall performance ( Barring Low performance of Battery ) .. But post system updates ie Android 5 , we all are facing problems like SLOW PROCESSING, PHONE HANGING etc...Hope the developers soon resolved such issues on Moto G2...",
            "date": "18 Feb 2015",
            "name": "Saket Jain",
            "stars": "3 stars"
        },
        {
            "comment": "most of the time the inbuilt apps fails to get open like People, music player and many more then it needs to be get restarted.",
            "date": "18 Feb 2015",
            "name": "Sandy",
            "stars": "3 stars"
        },
        {
            "comment": "Very Very Nice Phone In this rice Range I suggest Don't Wait Go For It Good Camera Quality Good Looking Phone",
            "date": "18 Feb 2015",
            "name": "Prashant Shirsat",
            "stars": "5 stars"
        },
        {
            "comment": "1.Good Product from Motorola................. 2.Fast delivery by Flip kart.................... 3.In the range of 14K the awesome mobile..........",
            "date": "18 Feb 2015",
            "name": "The Best Onlin...",
            "stars": "5 stars"
        },
        {
            "comment": "got the android 5.0.2 lollipop update last month and the phone runs nicely in the new lollipop version of android ....camera is awesome give clear pictures ,supports all the big games all runs smoothly ...but the battery drains very fast ..need to charge many times when connected to 2g network for browsing for long time or while playing games for long duration ...",
            "date": "18 Feb 2015",
            "name": "GOURAV KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "i love this phone totally satisfied me....i would give rating fo this phone 5 out of 5 camera is good n only has one disadvantage battery life is decent and it take too much time to charge.. this phone has a pure andriod feel this is awsm in this...",
            "date": "17 Feb 2015",
            "name": "Saheer khan",
            "stars": "5 stars"
        },
        {
            "comment": "Does the phone heats up? Please tell as i just purchased motog 2nd gen and phone got heat up when i was on a call. Thank you",
            "date": "17 Feb 2015",
            "name": "Garv Jain",
            "stars": "3 stars"
        },
        {
            "comment": "ya i got my replacement but in this mobile it is not showing the front camera option so what is the problem why is this happening to me",
            "date": "17 Feb 2015",
            "name": "Narsing Mudhiraj",
            "stars": "1 star"
        },
        {
            "comment": "I have used the product... Till now had a great experiance and with the lollipop update the experiance is amazing. Moto G (2nd Gen) checks all the opotions required for a good smart phone. With its 5inch ips display, 2.2GHz processor Gaming and Waching Movies is so smooth. And with its 16GB ROM apps run smoother. The new lollipop update gave a great new look an enhanced the performance of multi tasking. But the Games and Videos run smoother on Kitkat ie. Android 4.4.4. Thats why waiting for 5.1 update. In all u should buy this because at this amazing price till now any smart phone gave these many features.",
            "date": "17 Feb 2015",
            "name": "Bishal Das",
            "stars": "4 stars"
        },
        {
            "comment": "This is the very worst mobile that i have seen in the past 10 years. There was no proper battery back up. Restarts very often and suddenly shows the charging as 0%. If the mobile gets shut down by draining the battery then need to struggle for atleast two or three hours to get it started again. Not all happy with the mobile. Tried for replacement with in one month of purchase and the customer care people told to restart and reset the phone and rejected my replacement request. My dear friends please do not go for this mobile.",
            "date": "17 Feb 2015",
            "name": "Nagarjuna Redd...",
            "stars": "1 star"
        },
        {
            "comment": "Overall product is good. Only drawback is, battery is getting drained very fast. Don't expect more about camera clarity.",
            "date": "17 Feb 2015",
            "name": "goddy",
            "stars": "3 stars"
        },
        {
            "comment": "Big name, too much hype. and what you get is it a worth less piece of scum. Hangs a lot, cheap plastic look. Pathetic battery. Service is loaded with customers having motherboard issue \"including myself\". Waste of money.",
            "date": "17 Feb 2015",
            "name": "Ankit",
            "stars": "1 star"
        },
        {
            "comment": "Don't waste your hardly earn money on this phone, Phone getting restart again again and again after 2 month, even you are not using, will start restarting. I visit 2 time to moto service center but same issue, I lost my money :(",
            "date": "17 Feb 2015",
            "name": "Sukhwinder",
            "stars": "1 star"
        },
        {
            "comment": "I blindly ordered this product by hearing word of mouth from my friends. Ofcourse its really worth for money . Unfortunately i got defective product from flipkart first time. But they replaced with new one quickly manner.",
            "date": "17 Feb 2015",
            "name": "Arunkumar(arun...",
            "stars": "4 stars"
        },
        {
            "comment": "i bought Moto G 2nd gen on 16th feb 2015 from flipkart and got lollipop 5.0.2 with OTA upgrade the build quality and the screen was so great also looks stylish than the 1st gen .. Grab it now ..just go for it :) enjoy",
            "date": "17 Feb 2015",
            "name": "Shabin Shaji",
            "stars": "5 stars"
        },
        {
            "comment": "GooD PhonE.Nice Product From MotO .As compare to Samsung & Other Phone Moto Rocks. Go For It Blindly.",
            "date": "17 Feb 2015",
            "name": "Lingaraj Behura",
            "stars": "4 stars"
        },
        {
            "comment": "very good product and easy exchange....good service keep it up. i would like to suggested to bye this product it's worth.",
            "date": "17 Feb 2015",
            "name": "Sudarsan V",
            "stars": "5 stars"
        },
        {
            "comment": "Everything about this phone is great other than the battery life which is way to bad compared to moto g 1st gen.",
            "date": "17 Feb 2015",
            "name": "Narendra Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone from last 4 months it is running really flawless,no issues whatsoever,,it is really an awesome gaming device as well,I upgraded to lolipop couple of weeks back,the phone feels better after that",
            "date": "17 Feb 2015",
            "name": "Anupam Dey",
            "stars": "5 stars"
        },
        {
            "comment": "Highly satisfied with the performance of Moto G second gen phone. I am easily getting 3-4 days of charge without using internet/games. With games and internet, it is one day for me. Flipkart delivered the product well in time and no issues are observed till now. Overall I am very happy for this phone.",
            "date": "17 Feb 2015",
            "name": "Saeed C",
            "stars": "5 stars"
        },
        {
            "comment": "I own a Moto G 1st gen and based on my experience, bought this for my mom in November and she's been using it since then. That too with ease. Really Happy with this phone and Flipkart's In-A-Day Delivery.",
            "date": "17 Feb 2015",
            "name": "Megha",
            "stars": "5 stars"
        },
        {
            "comment": "No Comments on this Product.. Just perfect for the Price.. I did a lot of R&D to buy this one and gift it to my Mother.. I am not cheated and my Mother is so happy to have it.. :) Thanks Flipkart and Motorola. I had bought this on a sale where I got it at around 11 K which was super worth.. :)",
            "date": "17 Feb 2015",
            "name": "Sharath",
            "stars": "5 stars"
        },
        {
            "comment": "ENJOYING THE PURCHASE. REALLY VERY GOOD. BATTERY LIFE IS ALSO VERY GOOD. IN ALL IT IS A BEST PURCHASE ON COMPARISON AMOUNG THE EQUIVALENTS.",
            "date": "17 Feb 2015",
            "name": "A.SANTHANAM",
            "stars": "5 stars"
        },
        {
            "comment": "really flipkart is the best online shopping site in India.its have the lowest value and delivered too fast than any other online shopping site ...really awesome..its only need to improve cash on delivery ac cross all over India.",
            "date": "17 Feb 2015",
            "name": "KAMRUL HASSAN",
            "stars": "5 stars"
        },
        {
            "comment": "Mind blowing product. No complaints and flaws as of now. Using from past 5months...................................................................................................",
            "date": "17 Feb 2015",
            "name": "Abhimanyu Chevli",
            "stars": "5 stars"
        },
        {
            "comment": "this mobiles is not working in properly...its very slow and to much hitting...before i use moto g 2nd...but this mob not working so plz refund my all money...",
            "date": "17 Feb 2015",
            "name": "hitesh kotiya",
            "stars": "1 star"
        },
        {
            "comment": "moto g have a nice 8 mp camera ... compare to other brand with same 8 mp.. good display, crispier to see anything in this device.. good processor.. latest OS updates.. I think it is nice phone",
            "date": "17 Feb 2015",
            "name": "Naveen Rawat",
            "stars": "4 stars"
        },
        {
            "comment": "The phone was above my expectations when I bought it. Big screen, plus android lollipop OS makes this a super phone. If your budget is below 15k, then moto g is an unbelievable phone. Don't get distracted or confused by other phones, this phone is the ultimate solution.",
            "date": "17 Feb 2015",
            "name": "Mohammed Farman",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this for my mother some time back and it stopped working after some time, rather than reaching out to Flipkart we went to the service centre of Motorola which said we would need to replace the motherboard that would cost 7000 rupees. They refused to give this to us in writing. We tried reaching out to Motorola on email, Twitter and they havent responded till now. In all this the 30 day replacement duration passed. We're still stuck with this slab of rock. Buy this phone at your own risk, if it stops, its gone for good.",
            "date": "17 Feb 2015",
            "name": "Sumit Kumar",
            "stars": "1 star"
        },
        {
            "comment": "The phone is simply awesome & beats all the phones in this range. The best features are 1)The Screen is 5 inch & touch is super smooth 2)Back camera is very good Front camera isnt the greatest 3)Sound qaulity is good its loud & clear 4)Baterry Saver app is awesome 5)To transfer contacts,pics, messages from your old phone is a 5 mins job Overall I would recommend this is the best phone in this price Go for it !!!!",
            "date": "17 Feb 2015",
            "name": "Shirish",
            "stars": "5 stars"
        },
        {
            "comment": "all gud except for phone directory search. feels even better after upgrading to android 5. don't forget to buy a screen guard",
            "date": "17 Feb 2015",
            "name": "Gaurav Tripathi",
            "stars": "4 stars"
        },
        {
            "comment": "I bought 2 mobiles . Issues: 1).Too much time taking for charging. 2).Batter draining fastly 3).Some times struck/ lag the device",
            "date": "17 Feb 2015",
            "name": "Mahesh Siddali...",
            "stars": "4 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "17 Feb 2015",
            "name": "vivek sharma",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is very good in comparison to the price that you are paying for it. But there is an issues that has come into my notice. This might sound funny, but the screen display quality for the handset is different for the white set and the black. Well I noticed it after I updated my phone to the latest version of android (lollipop 5.0.2). Soon after the upgrade the screen brightness of my handset (black) visibly reduced. This was not the case for the white handsets although the hardware configuration for both the device is the same. There are many colleague of mine who are using moto g2 and most of them have white devices. When I compared my screen display quality to theirs it was quite dull. But when I compared it to a black handset it was the same. Sounds weird but true. I have asked for a replacement (a black set again), so let’s see if it has the same issue.",
            "date": "17 Feb 2015",
            "name": "Avishek Chakra...",
            "stars": "4 stars"
        },
        {
            "comment": "nice mobile never stucks. good on dispaly and updateble on lollipop.battery backup are good.nice on perfamence",
            "date": "17 Feb 2015",
            "name": "veereddy chinnam",
            "stars": "5 stars"
        },
        {
            "comment": "Good display and Lollipop update is also very nice and smooth very happy with over all performance battery backup is also fine camera quality also fine of both primary and secondary Overall all performance is very good..!!",
            "date": "17 Feb 2015",
            "name": "Akshay",
            "stars": "4 stars"
        },
        {
            "comment": "i used many phones but 1 that impressed me alot is moto g i loved it a lot vesy fast and very nice mobile thank u flipkart",
            "date": "17 Feb 2015",
            "name": "Anusha Deepthi",
            "stars": "5 stars"
        },
        {
            "comment": "But the charger is a defect one. Well it is over heating compared to my friends and I asked for exchange within 30days but flipkart told me to take to the motorola service center though it is an accessory. Then for what purpose we are buying costly mobiles, for roaming to service centers taking that new piece?",
            "date": "17 Feb 2015",
            "name": "Naveen Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Performance wise it is excellent but only problem is draining the battery... It drains battery very fast even with lollipop update.. there is no improvement in battery.. after update with lollipop..its became slow please don't update to lollipop wait for 5.1 version... they are try to fix those bugs in 5.1... rating 5 for kitkat version rating 3 for lollipop version",
            "date": "17 Feb 2015",
            "name": "Bhargav Thota",
            "stars": "5 stars"
        },
        {
            "comment": "Third class company with third class return policy. Never ever buy any product from these frauds and cheats.",
            "date": "17 Feb 2015",
            "name": "Rahul Bhangale",
            "stars": "5 stars"
        },
        {
            "comment": "speedy delivery and super phone. thank u flipkart and motorola. just one suggestion. the lolipop is not preinstalled. I had to mannually doenload it and install which was a bit tedious to do.",
            "date": "17 Feb 2015",
            "name": "Athul Janardhanan",
            "stars": "5 stars"
        },
        {
            "comment": "I am not an android user before i bought this phone... it came to me built in lollypop and too fast delivery... all feature are very good and i liked this phone..",
            "date": "17 Feb 2015",
            "name": "sachin srinivasan",
            "stars": "5 stars"
        },
        {
            "comment": "i know there are so many smartphones are available now in the market for a much lesser price, better configurations, but look at those who are satisfied.. no comments about other flagships, but MOTO came back for sure..",
            "date": "17 Feb 2015",
            "name": "vaibhav gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this device on 21st February from Flipkart, and the day i got the device, the OTA for android lolipop was launched and i didn't even use stock kitkat on the device, and updated the phone. I was damn excited about the device. But disappointment that the device started hanging . I dont know if it was because of the update. But after about 2 weeks of use, i was fed up with the speed, and asked flipkart for the replacement. And I am so happy, that without asking any silly questions, flipkart sent me a replacement immediately :D, and guess what, the device i got works fine, and even after upgrade to android lolipop its fast :) So maybe a defect in the old device. It was a pleasure to shop on flipkart. My next purchase is the Moto 360 :D",
            "date": "16 Feb 2015",
            "name": "Bhupinder Jeet...",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone to buy at this price. Pros Awsome camera Nice Touch sensitivity Good Processor Cons Little heating problem Bad battery life Accessories are costly",
            "date": "16 Feb 2015",
            "name": "Manaswi Srivas...",
            "stars": "4 stars"
        },
        {
            "comment": "we have to buy one motog 2nd gen. one day its going switch off suddenly. i given to service center. they are telling mother problem. already 20 days over, my mobile not given still nw. this is worrest service center.",
            "date": "16 Feb 2015",
            "name": "somsekhar naidu",
            "stars": "1 star"
        },
        {
            "comment": "I had ordered Moto G (2nd Gen) last Friday. The product received was defective (touch screen not working). I called up customer care within 2 hours of receiving the product and asked for a replacement. I was surprised to hear that the delivery status has not yet been updated in their system and hence I need to wait. The wait never ended even after 4 days, 6-7 phone calls and 6-7 emails to the customer care. Even as I write this review I have not got my replacement phone !! How can Flipkart sell such poor quality products? And how can they take customers for granted after collecting the money, not even taking the request for replacement for 4 days after customer informing them about the defect !! I will think 100 times before deciding to purchase an electronic device from Flipkart in future.",
            "date": "16 Feb 2015",
            "name": "Krishnadass",
            "stars": "1 star"
        },
        {
            "comment": "A good phone for 13k. Motorola Has done a very good job. Pros: Very good built quality very minor lags actually no lags gaming performance is good good audio with dual speakers battery is average android l upgrade cons: not many touch sensitivity is not so good I think device is pricey compared to its specs But overall i am having great experience with this phone",
            "date": "16 Feb 2015",
            "name": "Sharon Raj",
            "stars": "4 stars"
        },
        {
            "comment": "dont even think to buy this product its a piece of shit! no proper response from the service center",
            "date": "16 Feb 2015",
            "name": "Shiva Giri",
            "stars": "1 star"
        },
        {
            "comment": "I had purchased this mobile on exchange offer. Camera photo quality is best. Best dual SIM mobile along with good processor. No other mobile was good at this price. i purchased around Rs 10,000 /- , it's original cost was Rs 12, 999 /-. Quick delivery.",
            "date": "16 Feb 2015",
            "name": "Dhiren Mistry",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for the past 2 weeks and it works fine like butter. Maybe some battery issue as it has a low battery backup. But overall it is an amazing piece. With the support of Google you get the latest updates faster than any one. The 1 GB RAM is sufficient for multi-tasking and there can be a lag of 0.1 sec but you need not worry about that. Sound quality is amazing and provides you true surround sound. Simple, smooth and efficient. I think you should go for it. Moto has been revolutionized! Peeps it's a good device with excellent features!",
            "date": "16 Feb 2015",
            "name": "Anikash Chakra...",
            "stars": "5 stars"
        },
        {
            "comment": "But one thing kitkat version-4.4.2 is good..don't try lollipop 5.0.2 version its worst OS for Moto G2.so can it possible to downgrade lollipop to kitkat again..pls suggest???",
            "date": "16 Feb 2015",
            "name": "Tarjan Kumar P...",
            "stars": "5 stars"
        },
        {
            "comment": "after the update to lollipop the mobile is getting slow.. we dont need a loud speaker during a cal because the voice on the other side is much louder like a china set. wat the hel..",
            "date": "16 Feb 2015",
            "name": "sid",
            "stars": "3 stars"
        },
        {
            "comment": "Very quick service provide Flipkark . I'm very much impress about the service as well as product fgsf",
            "date": "16 Feb 2015",
            "name": "Hoshang",
            "stars": "4 stars"
        },
        {
            "comment": "After using it for 2 months and getting Android 5.0.2 Lollipop updates, the phone response has become slow. Without the updates everything worked just fine.",
            "date": "16 Feb 2015",
            "name": "Akash Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I have moto G2 and my phone does not support gujarati language..it is the biggest problem from my side.pls give solution of this problem,and I lost my some contacts daily.",
            "date": "16 Feb 2015",
            "name": "shah",
            "stars": "4 stars"
        },
        {
            "comment": "Hi,Mobile was working fine in kitkat version but after lolipop update it got very slow. Good upgrade to Moto G first generation",
            "date": "16 Feb 2015",
            "name": "Thiyagarajan",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is good but I given my moto g (2nd gen) to service center for speaker problem. on 6 jan till today i did not get my phone back what a worst service.",
            "date": "16 Feb 2015",
            "name": "P Balu",
            "stars": "1 star"
        },
        {
            "comment": "IT IS EXCELLENT MOBILE. SO MANY USE FULL APPS INSTALLED....................... I FEEL TO PROUD PURCHASE THIS PRODUCT FROM FLIPCART............. NO.1 ONLINE SHOPING PORTAL",
            "date": "16 Feb 2015",
            "name": "SIVAJI KETHA",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G 2 mobile in Flipkart. They delivered me a defective mobile. Phone battery can not withstand charge, battery running out without using the mobile.",
            "date": "16 Feb 2015",
            "name": "Nijanthan",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2 is very good to handle it. Its very good sound system . Camera Clarity is 8 mega Pixcel is more clear than samsung and Macromax and Xiomai red mi. Flash is also more powerful than other competitor in the market. the moto G is smartest choice and its now lolipop version automatically updated in my phone. its a first which had updated Lolpop version of anroid.....",
            "date": "16 Feb 2015",
            "name": "PARESH KUDALE",
            "stars": "5 stars"
        },
        {
            "comment": "The product is as good as claimed by company. The charger problem begin as soon as 3rd month is completed. i have submitted the charger for change on friday and still waiting for replacement.",
            "date": "16 Feb 2015",
            "name": "Vasundhara",
            "stars": "5 stars"
        },
        {
            "comment": "For its specification, promised OTA lollipop update, Moto G2 is the best all-round android phone till date. Proud to say I own this. Though heating may be issue in general, it depends on the individual's usage.",
            "date": "16 Feb 2015",
            "name": "Prasanna Radhakri...",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart took more than a week to deliver this phone vs actually 2-3 days. I understand it was a peak time for flipkart. Happy with the purchase.",
            "date": "16 Feb 2015",
            "name": "Balaji Kesavan",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using this amazing device for a month now. The filpkart delivery was amazing got it in a day without opting the in a delivery option that too with a Rs.1200 flip cover absolutely free with it! Now coming on the phone's performance, its amazingly built with strong exterior design which is very stylish. The resolution and display is very vivid n sharp and strong hardware. Despite of its 1GB RAM its performance never lags as it does in most of the samsung handsets. Must say i was facing a few issues in my device's performance in some sectors because of the latest Android Lollypop update which on calling Moto India helpline was immediately resolved. Personally i liked the kitkat version because of the transparent black background in menu which turns white in lollypop update & its not changeble. The most important issue or should i say the major con of this device is its battery. The former 1st gen moto g had the same 2070 mah battery which the phonemaker should have increased but infortunately it did'nt. So the battery lasts for a closely fair 1 day upon your usage. But the worst part is its 3.5 hrs charging time which is damn disturbing. If someone does'nt have the patience of charging it for so long then he\\she should have to buy a reliable power bank with it. Otherwise if you are bored with your first time samsung's poor performance in this same price range then i would suggest you just go for it, it won't disappoint you like samsung did.",
            "date": "16 Feb 2015",
            "name": "Sudip Chatterjee",
            "stars": "4 stars"
        },
        {
            "comment": "got my Moto G2 thro exchange offer with Atrix 2. 1. Full HD display is clear under bright sunlight. 2. Touch screen is smooth otherwise all features are good as expected. Enhanced version of Moto G. So enjoying it.",
            "date": "16 Feb 2015",
            "name": "Ratheendiranaa...",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome Phone in 15K range, it will push Android Lollypop update as well. Its fast, sleek and awesome in performance. I'm suing it now for 2 months and am in love with MotoG2.",
            "date": "16 Feb 2015",
            "name": "soham basak",
            "stars": "5 stars"
        },
        {
            "comment": "Happy and fully satisfied with this purchase. Still i don't find any mobile phone in comparison with this.",
            "date": "16 Feb 2015",
            "name": "Rajesh Jaswal",
            "stars": "4 stars"
        },
        {
            "comment": "My mobile having touch problem while dialing the call and there was an issue with some application Highly disappointed with the way Flipkart.com has treated my replacement request. They are not give proper response from flipkart custom service. More than 3 times i call and raise the problem. I didn't resolve my problem still now .",
            "date": "16 Feb 2015",
            "name": "Jameerudin Moh...",
            "stars": "2 stars"
        },
        {
            "comment": "Swift Delivery on next day purchase, Awesome product. Camera Quality is bit ok ok . preloaded with Lollypop . Awesome crisp HD screen . Fluid interface. Recommended Buy.",
            "date": "16 Feb 2015",
            "name": "Bunny",
            "stars": "4 stars"
        },
        {
            "comment": "overall nice product!! but battery drains all after ~3 hrs of internet use!!! brand like motorola should give good battery!!!",
            "date": "16 Feb 2015",
            "name": "=SaNdiP=",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is very good except while playing movies it is slow and lagging. However it can support loads of apps without any issues. I have a micromax nitro and movies play smoother there. Covers. And cases are costly.",
            "date": "16 Feb 2015",
            "name": "Arun Viswanathan",
            "stars": "4 stars"
        },
        {
            "comment": "Just a lovely phone. Recently got lollipop update 5.0.2 through OTA. Dual stereospeakers,IPS screen ,latest android 5.0 lolipop. All features are awsome. Its a come back of Motorola.Really love this phone and the simplicity of the specifications of the phone makes its very easy .",
            "date": "16 Feb 2015",
            "name": "Prashant Soni",
            "stars": "5 stars"
        },
        {
            "comment": "Flawless prod from MOTOROLA, can't say more than this...Good performance, Nice resolution display, quicker swapping of apps.",
            "date": "15 Feb 2015",
            "name": "Girish Kumar V K",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G 2nd Gen phone one month ago with kitkat version. After that I have upgraded it to Lollipop. But after up-gradation, vibration of phone not worked with flip cover. I have also want to mention that It happens in Lollipop version of Android, not only in my phone, but in every phone of Moto G (1st Gen & 2nd Gen) which were purchased by my friends also.",
            "date": "15 Feb 2015",
            "name": "Sunil Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "One of the best phone but not satisfied with the box of the phone and accessories in it....!!!",
            "date": "15 Feb 2015",
            "name": "Sumair Ali",
            "stars": "5 stars"
        },
        {
            "comment": "This is a Must Phone For buyer who Personally Want Hear good Music and take Good Photos From their Phones In this price !!! Comparing this with Micromax and other chinese [local] Product has less feature But better quality and duration of life",
            "date": "15 Feb 2015",
            "name": "Arun",
            "stars": "5 stars"
        },
        {
            "comment": "Dual stereospeakers,IPS screen ,latest android 5.0 lolipop. All features are awsome but the only fault i notice is no brand name in front thats aall",
            "date": "15 Feb 2015",
            "name": "Jerin Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "Hello, After using this phone around 5months(still using), I am writing my experience. I always preferred 10-12k range phones for medium use like email, couple of apps, camera but no games. I was really a proud user, liking so much. The display, camera performance was very impressive. I did not have any issue fist two months. Even recommended so many friends. But slowly it started showing its actual characteristics. I started getting issues one by one. Making call: now it takes more time connecting any number. sometime have to make several tries. Contacts: It takes much time to open. Hung: if couple of apps are opened in background, it will hung. You can not do anything without restarting. Surprisingly, showing similar kind issues on other two mobiles at my office. ok, Updated to Lollipop hoping the issues may go, but frustrated, problems increased. So my love ka the end with Motorola. I am still using this since no option, I can not afford or buy another phone within 5months again. Also, wanted to inform the users who does not look at the SAR value, before buying. It has highest SAR value than any other reputed brand, just like the Chinese phones. Very SAD. Thanks/ Ibnul",
            "date": "15 Feb 2015",
            "name": "Ibnul",
            "stars": "1 star"
        },
        {
            "comment": "I bought this for my friend, this fone looks stylish and sleek design. easy to hold no heating issues, The main think that it comes out of LOLLIPOP 5.1 right out of the box, i was surprised for that. It is just like Nexus fones. Headset not so awesome, but loud speaker is loud and clear, The display is amazing, sharp & vivid, Battery backup is average (one day) It also support OTG, tats nice, Overall this phone is Good. Go for it......................",
            "date": "15 Feb 2015",
            "name": "Sreejith Ss",
            "stars": "4 stars"
        },
        {
            "comment": "Actuallu my mobile drying very fastly , some times my mobile is hanging and some times only one sim is working . in that time three to four times i call to FLIPKART customercare people. they spoke to me like its a small problem jus restart the mobile then it should be rectified. so i fallow their sugitions. but last two months on words regulary i faced that problem. in that time i call to flipkart customer care people they spoke to like flipkart is only responcible for first one month only . they sugested me to visit MOTOROLA service center.two weeks back i cal to motorola custmer care no 1800 102 2344. they are giving some steps for me . im unable to do that steps so they told to me like visit the customercare. so 10-02-2015 i visited your secundrabad branch. from thare on words other problem comes in to the picture. 10-02-2015 03.15 pm i visited your service senter nearly 30-45 mts i waited for the service people. they are not giving the responce proparly . they ae not giving the propar information to the customers. they shouting biggerly on us .they taken my mobile and spoke to me with in 24 hours we can inform you status and the problem of the mobile and how any days it can be taking to resolve the problem.but i dont have any update from them so again i call to customercare on 12-02-15 arround 5pm . they asking me about Work-order number . in my application they are not mention about Work-order number. they spoke to me like if you have Work-order number only i can halp you. in that time i call service center but theare are not responding . in that time i raise complaint on service senter people to the customer care people. Finally again i visited sevice center in13-02-15 evening arround 4 pm . i enquire them about status of my mobile and why dont they mention the Work-order number(4084) . but they dont give any information to me. they giving negligble answers. they shoughting on me. finally giving the Work-order number number and spoke to me it can be taking nearly 15 to 20 days time. i call to customercare in 14-1-02-15 they spoke to me like that Work-order number is allways alpha numarics only. they given fake number. so again i have to visit the service center ???? Actually service center is 10-15 km from my place. it can be taking nearly one hour time to visit the service center. my office timings are 9am-7pm. im fully busy with my work and office.i dont have the time to visit service center. if eaven i visit the service center they are not propaly responding to us. two days back i bought a new mobile for my self any way i dont wait up to 3 weeks for my mobile im fully passonate about moto g2. thats why i bought the mobile Actually i reseved defect-mobile i disappointed about that mobile i fully deppressed with your service center people its a very bad experience with MOTOROLA",
            "date": "15 Feb 2015",
            "name": "kalibabu konda...",
            "stars": "1 star"
        },
        {
            "comment": "i appreciate the quick and faster service while purchasing the first consignment and also appreciate that piece was defective which replaced immediately",
            "date": "15 Feb 2015",
            "name": "GOURI SANKAR C...",
            "stars": "4 stars"
        },
        {
            "comment": "y cant i refund it?? there is a problem in touch im offered a replacement but y cant i get refund..i dont wanna continue with this product,,not satisfied....i want refund back",
            "date": "15 Feb 2015",
            "name": "sarab",
            "stars": "2 stars"
        },
        {
            "comment": "Firstly I would like to thank you http://indiadesire.com/ from where I get the details of offers currently going on moto g2 like internet balance and exchange offer. Thanks to flipkart also for such a great service and bang bang smart phone.",
            "date": "15 Feb 2015",
            "name": "ashwani singh",
            "stars": "5 stars"
        },
        {
            "comment": "Am using this device from last 5-6 months and its awesome..sound quality, display everything is awesome..",
            "date": "15 Feb 2015",
            "name": "Mahendra Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Seal was open and damaged box. On that courier guy is saying, lelo sir, mobile accha hai andar se. Really very bad service",
            "date": "15 Feb 2015",
            "name": "Sachin Zambre",
            "stars": "1 star"
        },
        {
            "comment": "I personally had some issues with the display, but got it changed in the service center. Anyways its a good phone in the given price range!",
            "date": "15 Feb 2015",
            "name": "Abhishek Sinha",
            "stars": "4 stars"
        },
        {
            "comment": "after 3 monts of buying moto g 2nd gen the screen of my fone went partialy black.... motorola is denying me the warranty.. i'm going to consumer court.... don't buy motorola. Also the service center guys are very rude and irresponsible.",
            "date": "15 Feb 2015",
            "name": "nitin jain",
            "stars": "1 star"
        },
        {
            "comment": "Lives upto the specifications . great value for money. Reliable . Solid build - last long - even the looks last and do not fade Handles falls better than Samsung. Good speed and display . Excellent value for money.",
            "date": "14 Feb 2015",
            "name": "Mithun",
            "stars": "4 stars"
        },
        {
            "comment": "no hang issue.. lolipop is running well.. no heating issue as well after heavy use.battery is not up to the mark..",
            "date": "14 Feb 2015",
            "name": "Saikat",
            "stars": "4 stars"
        },
        {
            "comment": "Overall quality of phone is good, Camera quality about pictures is best but image/video stabilizer is not there & battery life is very low, also heats when playing games.",
            "date": "14 Feb 2015",
            "name": "swapnil pophale",
            "stars": "4 stars"
        },
        {
            "comment": "pros... nice and preety phone very light weight cons.... does not have a dedicated music player so use google music player voice of speakers are good but it starts to creak on full volume overall good phone recommended to buy",
            "date": "14 Feb 2015",
            "name": "Akshay Walia",
            "stars": "4 stars"
        },
        {
            "comment": "rocking phone friendly Operating system design for Business usage install bulk of application then use never hang or slow rocking phone for ever",
            "date": "14 Feb 2015",
            "name": "Dev Rajput",
            "stars": "5 stars"
        },
        {
            "comment": "Its a come back of Motorola. Really love this phone and the simplicity of the specifications of the phone makes its very easy even for the 1st time android user. You will never regret on buying this phone. The only bad thing is the headphones you cant wear them even for 5 minutes. i bought a apple earpod. But its worth it.",
            "date": "14 Feb 2015",
            "name": "Sajan chowdhury",
            "stars": "5 stars"
        },
        {
            "comment": "gud hardware in this price range, updated to 5.0.2 latest android,, but lack of some features due to pure android.. overall 4 star.",
            "date": "14 Feb 2015",
            "name": "Amit Suthar",
            "stars": "4 stars"
        },
        {
            "comment": "Thank you flipkart! I am using this phone for past 2 months. Till now there is no bugs and complaints about this phone. Also i have updated to lollipop 5.0. Smooth interface. Camera quality is awesome, even 2 mp front cam takes crystal clear quality images. Front cam is excellent with flash! Go for it! Worth for money!",
            "date": "14 Feb 2015",
            "name": "Saravanakumar",
            "stars": "5 stars"
        },
        {
            "comment": "another great phone from moto. purchased as a gift to my wife and probably one of my better gifts. excellent quality and smooth operation.",
            "date": "14 Feb 2015",
            "name": "R Srikanth",
            "stars": "5 stars"
        },
        {
            "comment": "Its good phone..We are getting many good features with lesser price in this phone. Initially, we feel hard to use but upgrading to new version of android made easier now.",
            "date": "14 Feb 2015",
            "name": "Mahesh",
            "stars": "4 stars"
        },
        {
            "comment": "I can only say WAOOO..... AMAZING EXCELLENT SUPERB PHONE Touch is excellent picture quality is superb download speed is maximum look is very very beautiful camera is also good friends go for it and also thanks to flipkart I had ordered this mobile on 10 February and it comes on 12 February in morning. What a fast service.",
            "date": "14 Feb 2015",
            "name": "Rohit Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the Moto G2 on 12th Feb night and i suprisingly i received thw delivery on 14th Feb. Thats a perfect gift for my wife on Valentine's day. Excellent phone and i received a genuine brand new phone. Invoice IMEI number is matching with the phone's actual IMEI. About performance i will put my review after one week. But i m confident the product wont disappoint me.",
            "date": "14 Feb 2015",
            "name": "Rupesh Ingle",
            "stars": "4 stars"
        },
        {
            "comment": "I was using Samsung S duos 2 before buying G2. So i feel the battery life is really good, As we all know its faster and can pay for the internal memory and forget to mention its gud for gaming. Mostly moto mobiles are one of the first to get the software updates - Camera is not upto the standards especially front cam is too blurry. - The clarity of the sound from the speaker is not good especially when it comes to music - Battery cannot be removed Consider A6000 before buying G2",
            "date": "14 Feb 2015",
            "name": "NvN",
            "stars": "3 stars"
        },
        {
            "comment": "I bought the phone about four months back. From the beginning, the audio was not very clear but I thought, I could live with this. One fine day, all of sudden, it just gave Motorola logo screen only - There was no falling down or any other external factor, I could attribute this to. First, I tried on line support but it was of no much help. I took this to their authorized service center. I was informed that the mother board has problem and it will need to be replaced and I will get the hand set back in 5-8 days. It is more than 12 days now and I still have no confirmation as to when will I get this!!!!! Neither the authorized service center nor Motorola has any definite status, Typical answer is that the case has been escalated and someone will call with in 24 -48 hours to give the update but no one calls. I strongly suggest that Motorola should have policy of replacing the handset rather than depending on supply of motherboard.",
            "date": "14 Feb 2015",
            "name": "Arun Goyal",
            "stars": "1 star"
        },
        {
            "comment": "I bought the phone about four months back. From the beginning, the audio was not very clear but I thought, I could live with this. One fine day, all of sudden, it just gave Motorola logo screen only - There was no falling down or any other external factor, I could attribute this to. First, I tried on line support but it was of no much help. I took this to their authorized service center. I was informed that the mother board has problem and it will need to be replaced and I will get the hand set back in 5-8 days. It is more than 12 days now and I still have no confirmation as to when will I get this!!!!! Neither the authorized service center nor Motorola has any definite status, Typical answer is that the case has been escalated and someone will call with in 24 -48 hours to give the update but no one calls. I strongly suggest that Motorola should have policy of replacing the handset rather than depending on supply of motherboard.",
            "date": "14 Feb 2015",
            "name": "Arun Goyal",
            "stars": "1 star"
        },
        {
            "comment": "Excellent handset in the price only Fifty giga byte drop box or cloud memory is little tricky. This product is working perfectly superb. I am using the same. GPRS and Mobile network data with net use would kill the battery fast, So be careful and use wisely.",
            "date": "14 Feb 2015",
            "name": "DEVANSHU",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile from Moto Specs are truely impressive with some cons like 1. RAM could have been more atleast 2gb 2. Full HD was possible although current resolution not bad 3. Battery Capacity logical for dual sim and big screen to be atleast 3500mah Feels very good to hold in hand the 5 inch moto. At the given price point one can blindly go for it.",
            "date": "14 Feb 2015",
            "name": "Bhimasen",
            "stars": "5 stars"
        },
        {
            "comment": "Had this gifted to my sis for her birthday.... \"\"BIG THANKS.... to FLIPKART... for delivering the product on time \"\" My sis loved the gift, Recently got lolipop update which had enhanced the beauty more...",
            "date": "14 Feb 2015",
            "name": "Rajiv Nair",
            "stars": "5 stars"
        },
        {
            "comment": "looking wise good phone but Batteri back up not good only 8 to 10 hour on 3G net. some aap not soppert in this phone.....",
            "date": "14 Feb 2015",
            "name": "deepak",
            "stars": "3 stars"
        },
        {
            "comment": "very happy with the mobile. no problem faced tiil today. lollipop upgrade available. super touch feel. the only negative is its battery. better if it is upgraded that also.",
            "date": "14 Feb 2015",
            "name": "Honey .",
            "stars": "5 stars"
        },
        {
            "comment": "i had purchased this phone one month ago and i am completely satisfied with the performance of the phone and thanks to flipkart for its faster delivery and good packaging. cheers!! :)",
            "date": "14 Feb 2015",
            "name": "sagar purswani",
            "stars": "5 stars"
        },
        {
            "comment": "It is probably the best fone at this price with such good hardware & specs. The one & only flaw as per my usage was the battery back up. With such a bright display & 5\" screen, U need to have atleast 2300 maH battery. But still, go for it if u r not a gamer",
            "date": "14 Feb 2015",
            "name": "Sadat Shaikh",
            "stars": "4 stars"
        },
        {
            "comment": "i feel better in performance and battery backup should be improved for it. but compared to its price its the best",
            "date": "14 Feb 2015",
            "name": "Mohan",
            "stars": "4 stars"
        },
        {
            "comment": "Battery backup is very poor and poor customer service. Suggest to improve the quality of battery and customer service. Otherwise the phone is good.",
            "date": "14 Feb 2015",
            "name": "Deepak Prabhu",
            "stars": "1 star"
        },
        {
            "comment": "I had a very bad experience with Moto-G 2nd Gen. Within less than 5 months, the battery ceased to work and had to take it to the service center. The biggest con is that the battery cannot be removed, it is inbuilt. Very disappointing. :( If the phone gets stuck, when all fails, the last resort is to unplug the battery and the device will restart, that is not possible with this device. Another big disappointing factor is - the phone has just 1 GB RAM. For a big phone,, 1GB is too less, and hence it lags. One thing I like about the phone is the Camera - camera is quite good. The lollypop update tried to compensate for the dislike I had, but can't seem to overcome the obvious latency. Overall, I will never buy nor will recommend anyone to buy it. On the contrary,, Moto E is far better.",
            "date": "14 Feb 2015",
            "name": "Bobby Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased Moto G 2nd Gen one month back, I am having following problems 1) Some time mobile hangs and I am not able to receive call...I can see call coming on my cell, however I cannot receive 2) Very Slow Charging 3) Photo quality not very great.....when you see the photo on Laptop....its very grainy.... I don't recommend this product",
            "date": "14 Feb 2015",
            "name": "Manish Mutha",
            "stars": "2 stars"
        },
        {
            "comment": "First of all a big thanks to Flipkart for their quick delivery. I got it within 3 days. This set is really mind blowing...I have already upgraded it to Android 5.0.2 Lolipop. In Lolipop it runs really smooth...great color resolution...no strain to eyes, Asphalt 8 is running quite smooth, so no tension with the 1Gb RAM...sound quality is superb for the dual speaker...",
            "date": "13 Feb 2015",
            "name": "Himanish Roy",
            "stars": "5 stars"
        },
        {
            "comment": "If the Battery is 2500mAh or more it would be nice. Sometimes double click operation works for a single click. After lollipop update moblie performance is much better.",
            "date": "13 Feb 2015",
            "name": "Dinesh V",
            "stars": "4 stars"
        },
        {
            "comment": "I have Ordered MotoG2 and got it, but i think it is used piece even in-built app's also not working properly.so i requested for return(This time i am expecting Seal piece)",
            "date": "13 Feb 2015",
            "name": "Sunil Amujuri",
            "stars": "2 stars"
        },
        {
            "comment": "i am using this product for a month and trust me it is an idle smartphone which has everything!!! Music very loud and clear coz of dual loudspeaker Resolution - 100% marks UI - Very nice user interface even my parents can also operate :) RAM - though 1 GB is ther but i havent face any lagging till now.. all n all i can say at 13k range this is the best smartphone!!",
            "date": "13 Feb 2015",
            "name": "Sachin",
            "stars": "5 stars"
        },
        {
            "comment": "nice product as per specification.. battery is not up to expectation but everage ... other specification is simply awsm... better product in 13k....... you may buy,,...",
            "date": "13 Feb 2015",
            "name": "Dev Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Well this has been the best phone that I have ever used. Build quality : 9/10. Performance: 9/10. Camera: Rear - 8/10 , Front - 7/10 (In well lit areas) Interface : 10/10 (It cant be better) Battery : 8/10.(It is good but not the best.). Storage : 9/10 (12 GB user space available is good for medium range usage). If you have a need of a phone which has to be fast with an awesome display quality with medium storage for your needs, well this is the one",
            "date": "13 Feb 2015",
            "name": "Keertiraj Kemb...",
            "stars": "5 stars"
        },
        {
            "comment": "Got it delivered in a day as promised. Very Good phone with best of the features. incomparable with any other phone in the same range.",
            "date": "13 Feb 2015",
            "name": "GAURAV",
            "stars": "5 stars"
        },
        {
            "comment": "Overall very good at this price with features like 1.2GHz quad-core processor, Added feature is upgradable to lollipop.",
            "date": "13 Feb 2015",
            "name": "Hitesh Patel",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone through flipkart, and it arrived on next day. The phone is amazing and it is perfectly infact much better than what can be seen in the website. However the sad part is that the accessories are really of bad design. The earphones are just like old nokia phones and moto could have been much better to gel with design and elegance of moto. The charger is of very less out put ~450 mA/550mA which charges this 2000mA phone very slow. But this is surely a value for money.",
            "date": "13 Feb 2015",
            "name": "Sachin Rosario",
            "stars": "4 stars"
        },
        {
            "comment": "13k is too much for this specs.. and battery life is also average (1day maximum in moderate use) Moto should cut this phone's price... And in Gen3 it should put at least 2500mah battery...",
            "date": "13 Feb 2015",
            "name": "Jagat Chowdhury",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome product at this price. Products like huawei honor holly is selling same configuration phone for 7k. But Moto g2 feels far better than it.",
            "date": "13 Feb 2015",
            "name": "Geo",
            "stars": "5 stars"
        },
        {
            "comment": "phone is good..but I was found some technical problem ..like while putting spkr on ..not able to hear caller voice..no sound notification receiving for mail..whatspu..facebook..like that..all setting properly check but still not working.. I am chasing their customer care for the same but their refund/exchanging process is pathetic... Please check all process before order..",
            "date": "13 Feb 2015",
            "name": "Satish Chandra",
            "stars": "1 star"
        },
        {
            "comment": "I bought the phone in Oct,2014 and now the display of the phone is not working for me. It goes of for hours and then visible for 5-10mins. I went to Service center in noida sec-18. There the people sitting are even worse. They don't even tell the issue with the phone and keep on saying that it will be tested and you will get it back after 15 days. Motorola should replace the phone in such cases.",
            "date": "13 Feb 2015",
            "name": "Gaurav Mehta",
            "stars": "1 star"
        },
        {
            "comment": "very nice branded budget smart phone..till now nice premium look...nice camera..with latest android 5.02.",
            "date": "13 Feb 2015",
            "name": "pav1",
            "stars": "4 stars"
        },
        {
            "comment": "MOTOROLA issue NO: [Incident: 150204-028386] I am writing this to contact you regarding the replacement of my MotoG2 handset. I have been given your contact information regarding the replacement of MotoG2 handset which I bought from Flipkart somewhere around September ( on 24-09-2014, see invoice attached) . Within 3 months, the phone stopped working and the service center guy told me that motherboard was damaged. After 3 weeks, when my phone started working, the camera stopped working and now again I have to contact the service center and God knows how much time it will take to repair. I tried factory reset, camera updates, and even installed other/Google camera software but even then it is not working. It seems to me that the hardware of my handset have some serious issues and even if I got my camera fixed, there is no guarantee that some other problem won't be coming in near future. So, its better if you can replace the set and provide me a new one since this is totally a hardware problem and I want a replacement of my phone. Hope to get a prompt response from you. Customer care shared two numbers with me Regional head details: Ashish Patil - ashish.patil@ensureservices.in Contact - 9324395043 Parvez Jawed - parvez.jawed@b2x.com Contact - 8826579279 Ashish's no is always busy and Parvez's no does not exist. Any kind of help appreciated. Thanks. Regards, Amit",
            "date": "13 Feb 2015",
            "name": "Amit Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Service of moto is too bad i submiited my phone 11 days ago for repair and even now they are saying 4-5 days more will take .",
            "date": "13 Feb 2015",
            "name": "Manisha Garg",
            "stars": "1 star"
        },
        {
            "comment": "good phone you can buy. android (kit kat) os is very v.... good. but the upgrade lollipop is hanging",
            "date": "13 Feb 2015",
            "name": "krishna",
            "stars": "5 stars"
        },
        {
            "comment": "this mobile phone got heated sense since i was bought, and The battery i was charged 100% at morning 9 oclock after 12:30PM it shows only 30% , The battery was fully drain, and the phone was showing white screen , and i need to switch on my mobile but i dint switch on it takes 25 min ..",
            "date": "13 Feb 2015",
            "name": "nawaz khan",
            "stars": "1 star"
        },
        {
            "comment": "i have the moto g 1st gen i have the moto e and i have the moto g 2 2nd gen nice set camera is good lolipop 5 updated so far no issues",
            "date": "13 Feb 2015",
            "name": "sunit khanna",
            "stars": "5 stars"
        },
        {
            "comment": "GOOD PHONE FOR RS/-13000 ..GOOD TOUCH AFFECTS.SOME SAY THEY HAVE BROKEN THEIR PH IN LESS DAYS .. THE FEATURES ARE GOOD AND RESONABLE FOR THAT RATE ...USE PH CAREFULLY INCASE U DROP UR PH THATS UR FAULT....",
            "date": "13 Feb 2015",
            "name": "PAVAN VENKAT",
            "stars": "5 stars"
        },
        {
            "comment": "Paisa Vasool in mumbai language. great performance. Performance enhanced after upgrading to android lollipop 5.0 version. Battery performance of my device has amproved after the upgradation",
            "date": "13 Feb 2015",
            "name": "Bhiwaji Rane",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks to flipkart on delivery the product very next day . Now when it comes to product I was surprised on the display which is awesome , but very disappointing except display all others are average . And the major problem is that it will not show the DATA (Internet) icon . when checked in moto forum it was come to know it is a bug in lollipop for MOTOG 2gen . Entire phone hangs often and very difficult to use the product :( Pls check in internet before you buy this product . Again I am saying MOTOg having issue only with Lolipop update .",
            "date": "13 Feb 2015",
            "name": "Nandagopalan G...",
            "stars": "1 star"
        },
        {
            "comment": "I am satisfied with this product. Good camera quality and voice is also good. All high ended games run on this phone smoothly. Only drawback is that Battery drains quickly when u play game.. otherwise a good phone in this range.",
            "date": "13 Feb 2015",
            "name": "Dilkaran sandhu",
            "stars": "4 stars"
        },
        {
            "comment": "Superb phone...big and good display...Fast enough but the batter - 2070mAh is not of quite big capacity.",
            "date": "13 Feb 2015",
            "name": "Jithendra Redd...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g 2nd gen....i really liked the stereo speakers. no doubt its better than htc boomsound, batttery backup is also gud. Camera is fine...",
            "date": "13 Feb 2015",
            "name": "IQBAL AFZAL",
            "stars": "5 stars"
        },
        {
            "comment": "Motorla your just pathetic. I have purchased moto g 2gen at 11-feb-2015... Next day 13-feb-2015 updated all apps through Wifi and charged from 4pm to 6 pm until battery got 100% and didn't used phone after 6 pm... and just guess, What should be battery percentage now?.... Ans: 85%..... So over a night a phone consume 15% of battery even if no one use it...... PATHETIC!!!!",
            "date": "13 Feb 2015",
            "name": "Sanjay",
            "stars": "2 stars"
        },
        {
            "comment": "ITS A GOOD BUY, A RIGHT PREPOSITION PRODUCT WITH ALMOST ALL FEATURES OF GOOD PHONE, CLARITY ON SCREEN, CAMERA IS GOOD. GOOD CLARITY OF VOICE AND OTHER APPLICATIONS ARE GOOD TO HANDLE.",
            "date": "13 Feb 2015",
            "name": "VISHAL",
            "stars": "5 stars"
        },
        {
            "comment": "Hello Everyone – I’m totally frustrated by FlipKart services and it is one of my worst experience till date. Thus it has resulted me to write below email and inform my other friends about the actual work done by them. I ordered a new Motog2 mobile phone from Flipkart. After 3 to 4 days it got dispatched at my home place – Within 3 months of purchase – One fine day my phone completely stopped working. So, I visited to nearby service center – I was really shocked to know that the problem in my phone was related with the Motherboard. When I checked Invoice, I found that Invoice copy was Incorrect. This was not at all expected from the FlipKart services. So, I called them and reported about the issue. Due to incorrect invoice I could not submit the phone at service centre. I had to called flipkart multiple times but response was same every time – “ Will soon change your Invoice”. Also they want snapshot of my mobile phone, so that they can update the invoice, that’s mean they do not have proper information regarding which mobile was sent to me. While followup, according to one of executive no need to provide snapshot and ignore that mail, but second executive says(after 2-3 days) need to send snapshot or either tell us the correct IMEI number. It was really a pain for me to do a follow-up on such bullshit scenario. How this would be possible – Within 3 months of purchase, Motherboard got dead. So, here I believe that they’re just making customers fool. I reported same issue to FlipKart but till today there is no proper response. I’m really helpless here – No one turned till today. I’ll soon update this all in social sites. Also, will recommend my other friends – Not to purchased any of the electronic devices from Flipkart. It is really bad, You guys are cheating us.",
            "date": "13 Feb 2015",
            "name": "Dipak Patil",
            "stars": "1 star"
        },
        {
            "comment": "This Phone is Truly Amazing... If you buy this You will get Lolipop Free.. :) And Flipkart service is Amazing as always.. Im glad that i bought this product from Flipkart :)",
            "date": "13 Feb 2015",
            "name": "A K",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone on performance, design, and specs. the only problem is with the speakers when played at full volume seems to be blown off. rest all is good especially camera is great .A good buy in this range.",
            "date": "13 Feb 2015",
            "name": "Bhavya Gautam",
            "stars": "4 stars"
        },
        {
            "comment": "A Big Mistake! Regret buyig this product,no internet access,poor voice quality,the same sim card's net pack works properly in other phones.A big no!",
            "date": "13 Feb 2015",
            "name": "Ridhima",
            "stars": "1 star"
        },
        {
            "comment": "Extremely good. Got Lollipop update. didnt put screen guard as it is having gorilla glass.Battery is perfect for a smart phone.Camera quality is very good. one thing which i didnt like is the headphone they gave with it.",
            "date": "12 Feb 2015",
            "name": "Sumit Kumar Shaw",
            "stars": "5 stars"
        },
        {
            "comment": "Its been 3 days now that i have been using this product after getting bored with my erstwhile Samsung Galaxy SIII. This phone is phenomenal in terms of processor & overall user experience. Got the latest \"Lolipop\" O/S upgraded as soon as i received this device. This upgrade really rocks. Would rate 5/5 for this product & thanks to WS retail in delivering the product in less than 48 hours time frame. Have recommended this phone to all.",
            "date": "12 Feb 2015",
            "name": "Mohit Malhotra",
            "stars": "5 stars"
        },
        {
            "comment": "They providing non-proper information in website. I have purchased this mobile one month ago. I just taken in packet the mobile in little bit rain. The phone was went off. This was not a water resistant. Even, the support not works for me until now. When we contact server center they are not taking service. Asking for 80% amount for service. My suggestion go with sony mobile for water resistant. This guys are putting fack news.",
            "date": "12 Feb 2015",
            "name": "Ganesh Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Phone is just superb... camera quality is just too good.. battery is also good.. if there is 2GB ram instead of 1 GB then it will be rockstar in this range of smartphone... Delivery time is just superb.. ordered on 16th jan 2015 6:45pm and received on 19th Jan 2015 11.30am.. in this section flipkart just rocks",
            "date": "12 Feb 2015",
            "name": "Viral Rathod",
            "stars": "4 stars"
        },
        {
            "comment": "I have used Moto G (1st Gen) and recently bought this Moto G (2nd Gen). With all the hype created around it, I was they'll retain the quality of 1st gen, if not improve some features. But I am really disappointed with the batter life. The batter is not running even for full 12 hours, with not so extensive usage. Most of the time my phone is deposited at reception and not used. Another thing is this misleading airtel offer. They have 3G network in very limited circles and for that you have to have some balance in your prepaid account. They flood you with automated messages where if you dont read and just tap OK, your balance drains faster than the water from your washbasin. Buy the phone only if you are genuinely impressed by it. Don't fall in trap of these misleading offers.",
            "date": "12 Feb 2015",
            "name": "Rohit Parmar",
            "stars": "3 stars"
        },
        {
            "comment": "good phone. camera speed : very good. otg support is big advantage. look wise : average look. more home screen not available over all : good. But today in this prise many phone available with 4g",
            "date": "12 Feb 2015",
            "name": "Kaushik Chauhan",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola has the worst after sale service. I've using this phone for last 3 months with single SIM. When I tried to place the SIM in sim slot2, the slot was not able to detect the SIM. I reached to service center and after examining the phone, they told me that slot is damaged, How could a slot be damaged when actually I never used it. They deposited my phone and told me that it will take 10 days to get repair. It has been 14 days and till now phone is not repaired. When ever I speak to the service center executive, they extend the date by another 10 Days. Called the customer support center and they provide and SR and assured than with 24 hours I'll be getting call back regarding update status. It has been 4 days and I have not received any call regarding my phone. This is very frustrating. So if you are planning to buy this phone, please do kept in mind that their is no after sale support from motorola. Moto is least concern about it's customer. In case anyone want's to known my case, My SR# 150209010831.",
            "date": "12 Feb 2015",
            "name": "Vasu Verma",
            "stars": "1 star"
        },
        {
            "comment": "Don't upgrade the OS to Lollipop. After upgrading the performance of the phone is not upto the expectation and the phone get slow.",
            "date": "12 Feb 2015",
            "name": "Sanket Barge",
            "stars": "3 stars"
        },
        {
            "comment": "Great phone.Thanks to pure-android which restrict the phone from hanging.Reading is ultra clear due to GPU-420. Battery backup is for max 24 hrs.It should be more. Software also updated automatically to android lollypop.",
            "date": "12 Feb 2015",
            "name": "Nisikanta",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on 4th Feb 2015. It was supposed to be delivered on 7th Jan by 7 pm. Though the status of tracking was shown as \"Out for delivery\" from 12.10 pm itself, I did not receive the product till the end of the day. When I contacted the customer care @ 7.30 pm for this, they just told me to wait and assured that it will be delivered by 9 pm. But it did not happen. Again when I contacted, they told me that it will be delivered by 8th, though it happens to be a Sunday. Again, @ 11.14 am the status was updated as \"Out for delivery\". I did not receive any single call form the Ekart the whole day. But @ 1.12 pm, it has been updated in their system as \"Undelivered As Customer Requested For Reschedule\". Without even trying to call the customer, they have updated this status. When I contacted Flipkart stating this issue, they were not even ready to check with Ekart about this. They only told me to wait till 10th Feb. Flipkart simply wants to hold the customers and make them wait by giving false promises. I have received the product now, but they have not yet responded to complaint that I have raised. I am totally dissatisfied and disappointed with Flipkart's service. Hopeless! They just think they have captured the market and the customers will not leave them even if they provide the worst service. They have mistaken. Just know it Flipkart! You are not the only one in this market. You will be extinct very soon if you continue your service at this level.",
            "date": "12 Feb 2015",
            "name": "Bairavi Mkswamy",
            "stars": "3 stars"
        },
        {
            "comment": "Its great phone with high quality build.. I didnt find any issues till now.. Upgraded to Lolipop...Not heating, no hanging ...",
            "date": "12 Feb 2015",
            "name": "Panneer Selvam",
            "stars": "4 stars"
        },
        {
            "comment": "we are so happy buying the phone. not even a single complaint i have faced. So leased buying this phone. not getting any other phone fr the same price and also the features.",
            "date": "12 Feb 2015",
            "name": "VIVEK BADDI",
            "stars": "5 stars"
        },
        {
            "comment": "It is worth purchasing. configuration is excellent with all the features and mind blowing speed. I have already referred my friends to go for this product as it gives immense and pleasant way to utilize. THANK YOU MOTO G2.",
            "date": "12 Feb 2015",
            "name": "FATHIMA REDDY...",
            "stars": "5 stars"
        },
        {
            "comment": "I already have moto g first gen and after it i buy 2nd gen good phone nice camera , good build quality but pls take care from water my first phone damage just bec of few drops of water",
            "date": "12 Feb 2015",
            "name": "sandeep dehariya",
            "stars": "4 stars"
        },
        {
            "comment": "It is probably the best phone within this price range. the best thing about the phone being its battery backup and no lag on heaving gaming. so if you are still in a dilemma about buying the product then please go for it. Moto G(2nd Gen) is AWESOME. And cheers to WS RETAIL(FLIPKART) got my product delivered just the nest day. :)",
            "date": "12 Feb 2015",
            "name": "Avik Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the Moto G (2nd Gen). I feel i made a mistake. There are much better phones. The biggest problem with this phone is that when you are on a call, the voice is so loud that everyone sitting beside you can hear them. Despite of reducing the volume to the minimal level people can still hear the voice outside. I asked flipkart to change the product the product for me but they denied it. Even the Motorola Customer service people are unaware of what they are doing. I asked them to help and they said you must have downloaded some wrong application.",
            "date": "12 Feb 2015",
            "name": "Pushpak Jain",
            "stars": "1 star"
        },
        {
            "comment": "simple no nonsense phone does what it says no pretenses..Got lollipop update works fine no hangups.. I am a light user and the battery gives me a day and a half consistently..",
            "date": "12 Feb 2015",
            "name": "Justin Jacob",
            "stars": "4 stars"
        },
        {
            "comment": "This is really worth buying. Good voice clarity, better display. Very decent battery back up. Looks much better.I recommend this phone.",
            "date": "12 Feb 2015",
            "name": "Madhu",
            "stars": "4 stars"
        },
        {
            "comment": "Its a nice phone but it could have been better because in same price range there are other phones available with higher configuration. Moto should have launched an upgraded version.",
            "date": "12 Feb 2015",
            "name": "Amit Srivastava",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2nd Gen is awesome.As mentioned it is a Exceptional Phone @ Exceptional Price.No words to explain ! just go on !",
            "date": "12 Feb 2015",
            "name": "Shanthakumar J...",
            "stars": "5 stars"
        },
        {
            "comment": "1. Upgraded with Lolipop u find problem in battery phone show 100% battery full time but suddenly phone get shut down. 2. One feature is good when we record our video both speakers record sounds but when we calling both speakers are working same time and a irritating sound you listen everytime when you on call. 3. When you doing low the brightness of the phone it dippering.",
            "date": "12 Feb 2015",
            "name": "Vii",
            "stars": "1 star"
        },
        {
            "comment": "I own both the 1st and the 2nd Gen. For starters, Moto G 2nd Gen is not at all a worthy upgrade to the 1st and it failed to create the same impact. The camera is good but not much of improvement really. It has two front facing speakers yet the fire at lower volume than the single rear speaker on the 1st Gen. The battery backup is very slightly lesser than the 1st although it is hardly noticeable. Now coming to performance. This phone performed good on Kitkat, although no comparison with the 1st Gen. It lagged a bit while switching between applications. Despite the same hardware, the 1st easily outperforms it and games run much smoother and load faster. After the Lollipop update, the difference in performance has widened even more. 1st Gen performs very well on Lollipop. Resource management is better than even that on Nexus 5. But on the 2nd Gen it has created a number of problems like unnecessary lags even when you switch the WiFi on. Games take even longer to load. Not at all satisfactory. Overall I would say that in this budget, Asus Zenfone 5 is the better than this phone both in terms of performance and camera. If you want to go with Samsung, the Neo 3 is also a good option. Moto G 2nd Gen is disappointing and drops the standard the 1st had raised.",
            "date": "12 Feb 2015",
            "name": "Ankish Raj Prajapati",
            "stars": "3 stars"
        },
        {
            "comment": "the best of the mobile phones i have used till now.The phone can be purchased by any one without any hesitation.The photo clarity is good",
            "date": "12 Feb 2015",
            "name": "k.chiranjeevi...",
            "stars": "5 stars"
        },
        {
            "comment": "received it within two days of ordering under standard order. very informative tracking and excellent service over all. the phone is great, ofcourse we all know that. flipkart highly recommend",
            "date": "12 Feb 2015",
            "name": "Darshan Rai",
            "stars": "5 stars"
        },
        {
            "comment": "As per the my review .I have purchased this mobile in October. But in with in 2 month there are defect in mother board, micro sim not support problem & torch is not working. I have already contact with the executive but there was no any solution.",
            "date": "12 Feb 2015",
            "name": "Nayan Solanki",
            "stars": "1 star"
        },
        {
            "comment": "I have been using the phone for last 5 days and i have upgraded the OS to lollipop the very same day i bought it. The phone is pretty good gng by the midrange standards. However the battery drain is a big issue. I guess it has gt to do more with the OS than the phone. The phone doesnt seem to last me for more than 8-10 hours after a full charge, and tht too with jst normal usage. No heavy games, no excessive downloads n surfing, jst usual chats n phone calls n still m shocked to see my battery entering the red zone by the 8th hour. I am really disappointed coz i havnt had such issues with my previous phone which was lumia 520. Only fr the battery drain i rgret buying this phone. I hope google fixes this issue soon with an update. N ya lollipop sucks really. Rest all is an excellent package. so if u dnt mind charging ur phone twice a day...thn go ahead buy it",
            "date": "12 Feb 2015",
            "name": "Jayesh Parab",
            "stars": "3 stars"
        },
        {
            "comment": "Everything is okay.. but it doesn't give good battery backup. What is the use of having Hero Karizma ZMR without fuel. Not a good comparison.. my intent is to say that you have all the best feature in this device but it will die soon when we start using them.",
            "date": "12 Feb 2015",
            "name": "Tharakarama Re...",
            "stars": "4 stars"
        },
        {
            "comment": "awesome phone (y) works smoothly , nice battery backup at its level, overall best 10 out of 10 if you are thinking to purchase this, don't think just purchase it :)",
            "date": "12 Feb 2015",
            "name": "barishth bandhu",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is great at this price.... Awesome smooth performance as compare to my Samsung galaxy S3 which i used before , but Accessories of this moto g2 is not that great headphones are not in-ear type no bass effect, charger is not USB charger and it is too slow. it takes lot of time to get charge. Charger really sucks..!!! But otherwise device is awesome.",
            "date": "12 Feb 2015",
            "name": "Bhushan",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent phone at an excellent price. I couldn't ask for more. I was basically looking for a smart phone at an affordable price and Moto G 2nd Gen delivered it with fantastic results. Thanks Flipkart for the excellent service as well.",
            "date": "12 Feb 2015",
            "name": "Fredy",
            "stars": "4 stars"
        },
        {
            "comment": "Moto has the worst service ever ,I had given my Motot g2 at the service centre 1.5 months back but I have still not got it back",
            "date": "12 Feb 2015",
            "name": "pavan",
            "stars": "1 star"
        },
        {
            "comment": "This is the phone which can be compared with nexus and samsung s5 The phone is very nice at this range. pros- You can get android version 5.0 in this, which cannot be achieved in samsung and sony phones, Nice screen Nice sound sleek body cons- Camera is not so good a big phone, not recommended for people with tiny hands",
            "date": "12 Feb 2015",
            "name": "Pranjal Jain",
            "stars": "5 stars"
        },
        {
            "comment": "That the battery is sealed is not a great feature. My front camera stopped working and I have to send it to the service center because I understand it is still under warranty. NOT RECOMMENDED",
            "date": "11 Feb 2015",
            "name": "C K Mitra",
            "stars": "3 stars"
        },
        {
            "comment": "The Mobile is Excellent..!! Everything is Working Awesome.. Till Now i didn't face any issue with this Mobile..!",
            "date": "11 Feb 2015",
            "name": "Thulasi Kumar...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased Moto E phone few months back and after few time its speakers stopped working but this was repaired free of cost from Motorola showroom. Now I purchased Moto G phone and again faced problem with product quality. This time problem was with battery, its battery drained within a day without any use. I raised this issue to Flipkart and they replaced it with new Moto G phone. But again surprised with new phone, now problem with speaker phone,, :( Now Flipkart is refunding my booking amount..! Bad experience with Product quality.. :( :( Flipkart is always focusing on Customer satisfaction but somewhere product quality is lagging behind.",
            "date": "11 Feb 2015",
            "name": "Abhishek Barve",
            "stars": "2 stars"
        },
        {
            "comment": "Camera superb along with good HD display, speakers sounds good, processing is little bit slow if memory is full , appearance of phone is nice, light weight , no scratch even in rough use.",
            "date": "11 Feb 2015",
            "name": "Gaurav Bajpai",
            "stars": "5 stars"
        },
        {
            "comment": "Was much confused between S3 Neo and Moto G2. Finally zeroed this one. The phone is really good for the stock android. Updated to V 5.0.2 Lollipop. Unlike samsung's boring Touchwiz this one seems to be good. Overall a good buy",
            "date": "11 Feb 2015",
            "name": "Karthik",
            "stars": "5 stars"
        },
        {
            "comment": "This product is good for looking wise , performance , they build quality but we compromise in some thing like they battery backup is worst , sensor are very slow to react ... i give 7/10",
            "date": "11 Feb 2015",
            "name": "Er. AAMIR KHAN",
            "stars": "5 stars"
        },
        {
            "comment": "1. After Updating the phone in Android Lolipop,After few days of Use, Phone start getting hang and Slow. 2. The background apps are aromatically getting refreshed. Its create problem while doing bank transactions or ticket booking. But one thing I want to mention that this issue is in every Moto G 2. Not Every Time but It does sometime. After updating, this issue is decreased but not corrected. 3. Except these things, Every thing is fine. Good Phone in this Price Rage. And obliviously best services from Flipkart.",
            "date": "11 Feb 2015",
            "name": "Sumit Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Nice camera quality & mobile design Updated with lollipop version ... Impressive ui Stereo sound double speakers",
            "date": "11 Feb 2015",
            "name": "KAPIL BISHNOI",
            "stars": "4 stars"
        },
        {
            "comment": "Good mobile, Have exchanged and bought it for 10 K , for 3 K they gave offer for exchange for my old Sony- Xperia - Miro. Good configuration- 1 GB RAM, 5 Inch HD display, 1.2 GHz processor, inbuilt 16 GB memory, external 32 GB support, Gorilla glass. Altogether worth for money.",
            "date": "11 Feb 2015",
            "name": "Mohanakrishnan Sh...",
            "stars": "5 stars"
        },
        {
            "comment": "Was delivered before committed date. Starting it was a smooth ride. No hitches. Looks great, very responsive touch screen. Updated to Lollypop automatically thro a prompt for upgrade. no glitches. Tough to get the flip cover or a case to fit this model in white color. Ordered a white flip cover recd but was small in size though the label was for the Moto 2G. Probably color puts a lot of limitation on availability.",
            "date": "11 Feb 2015",
            "name": "mehta",
            "stars": "5 stars"
        },
        {
            "comment": "hi sir i am already perches one moto g mobile but on that time their no any one offer please could u give me my mobile exchange my mobile micromax Bolt A-35 Is Their Any possible Please Exchange My mobile",
            "date": "11 Feb 2015",
            "name": "CHITYALA RAJAS...",
            "stars": "5 stars"
        },
        {
            "comment": "From present point of view best ever phone to met with you might think of to zenfone 5 it is also okay its price is also very less. but about the quality zenfone is no where but beat in term of ram. its okay as per brand",
            "date": "11 Feb 2015",
            "name": "Sachin Sinha",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the Moto G 2nd Gen with express delivery only to find that it was a defective piece. From day one there has been audio issues reported by my sister. It took a while for me to physically see the device and confirm that there were audio issues. By then, when I raised a return request, flipkart replied that the stipulated time for return by the seller has crossed. Big fail. I would rather visit a offline showroom and pick a better device. At least I can go anytime for replacement. Don't fall for the \"no questions asked\" return policy. Its only the website.",
            "date": "11 Feb 2015",
            "name": "Harish Rangana...",
            "stars": "1 star"
        },
        {
            "comment": "Hi...Im using Moto G2 for the past 4 months.....This is my second phone....it is an awesome phone......Exceptional phone for Exceptional price......average battery performance which can stay for more than a day.......updated my moto g2 to 5.0 lollipop version.....i love my phone.....",
            "date": "11 Feb 2015",
            "name": "Aakash Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i got the product with in one day...its also a good one. 1. GOOD AND FAST PROCESSOR - NO LAG 2. CALL QUALITY TOP NOTCH WITH NOISE CANCELLING 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY.",
            "date": "11 Feb 2015",
            "name": "sudheep M",
            "stars": "4 stars"
        },
        {
            "comment": "Unable to connect to the wifi al times, and after lollipup update the device become slow. Compared to other devices this device is not upto mark",
            "date": "11 Feb 2015",
            "name": "Parameshwar Reddy",
            "stars": "1 star"
        },
        {
            "comment": "I got a defective hand set delivered by Flipkart. The mobile works only on turning on the speaker., else the person on the other side of the phone is unable to hear me. The phone gets charged in just 15 mins of time to 100% and gets discharged in 1 hour. This was my day- 1 experience. Such a poor customer care service. I have given a return request and none of of the customer care executives are ready to take up my calls. Either their server is down to see my details or they are extremely busy to give me a cal back. Have already tried 5 times but to no response. Horrible experience!!!!!!",
            "date": "11 Feb 2015",
            "name": "Ruchira Panigrahy",
            "stars": "1 star"
        },
        {
            "comment": "This is probably the best phone at this price! Premium, Good performance, Excellent battery life. Post the Lollipop update the experience was something else.",
            "date": "11 Feb 2015",
            "name": "Siddharth Ananth",
            "stars": "5 stars"
        },
        {
            "comment": "Looks: 9/10 Camera: 8/10 Performance: 9/10 Weight: 8/10 Memory: 10/10 OS: 10/10 Cons: Only 1 Issue I found that Custom Ringtone can't set after upgrade Android Lolipop.",
            "date": "11 Feb 2015",
            "name": "Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone last month and I got lollipop update immediately but the phone some time hangs while opening camera and playing games also the battery backup is not so good. It lasts only for 12 hours...!",
            "date": "11 Feb 2015",
            "name": "Shankar",
            "stars": "3 stars"
        },
        {
            "comment": "THE PHONE KEEPS ON HANGING IN NORMAL ISSUE . AND AFTER THE UPDATE FOR LOLLIPOP OS THE PHONE STRUGGLES TO KEEP UP WITH NORMAL USAGE. KEPT PHONE IN BOX. WORST PHONE EVER.",
            "date": "11 Feb 2015",
            "name": "Ashish Aneja",
            "stars": "1 star"
        },
        {
            "comment": "i brought this phone 4 days back...very cool mobile...got updated to lolipop... its just mind blowing it never hangs...no issues with battery backup...great product from motorola",
            "date": "11 Feb 2015",
            "name": "Yeshwanth reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Brilliant phone for the price. The lollipop upgrade makes the phone look and feel pretty, also makes the user experience so much better! If you're looking for a sub 15K smart phone - you can't go wrong with the moto G P.s. Flipkart's service is pretty sweet! The initial phone I received had a problem with its speaker, they had it replaced in a day's time!",
            "date": "11 Feb 2015",
            "name": "Raghav",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using it from last 2 months............. This is a great phone in every aspect until you upgrade it to LOLIPOP............. DO NOT UPGRADE TO LOLIPOP IT BECOMES TERRIBLY SLOW...................................",
            "date": "11 Feb 2015",
            "name": "Sagar Sikdar",
            "stars": "5 stars"
        },
        {
            "comment": "thank you flip kart.....i wish to shop more and more at your website. i ordered dis and got delivered before the delivered date.. with nice protective packing.",
            "date": "11 Feb 2015",
            "name": "Dr.sharath kas...",
            "stars": "5 stars"
        },
        {
            "comment": "i have been using it for two month actually i bought two devices. while using them i faced some issues with touch screen,mic,speakers. So i visited nearest service center. What i saw there will shock you. There was a big line of MOTO users. Every one of them caring MOTO E MOTO G MOTO G2. And all of them looks very disappointed. Motorola service is very bad i mean very very bad. They kept my device for 1 month and after receiving it also i faced so many problems. So i strongly suggest you to not to buy this device",
            "date": "11 Feb 2015",
            "name": "Vishwam Billa",
            "stars": "1 star"
        },
        {
            "comment": "Really nice phone, Light. Fits in hand. Features are great. with update to Lollipop the phone gets great looks and feel.",
            "date": "11 Feb 2015",
            "name": "Pritesh Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "As far as Motorola is concerned it gives you a good built quality and good features for the price. It also guarantees you update so it's always better to go for a brand rather than local brands for more or less the same price.",
            "date": "11 Feb 2015",
            "name": "Yusuf Mansawala",
            "stars": "5 stars"
        },
        {
            "comment": "wonderful produt............................................................................................",
            "date": "11 Feb 2015",
            "name": "mangalamsanakran",
            "stars": "5 stars"
        },
        {
            "comment": "i found some draw backs like battery performance is average,high quality games processor has some lag",
            "date": "11 Feb 2015",
            "name": "Uppu Anwesh",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for a few months. Loved it. No complaints. With lollipop update, its even smoother and works good. Battery stays all day long with wifi almost 80% time on.",
            "date": "11 Feb 2015",
            "name": "Sendilraj P",
            "stars": "5 stars"
        },
        {
            "comment": "I am certified flipkart buyer since the beginning and have written all positive reviews till today. What makes me write a negative one? I had ordered a Moto G 2nd generation on 10th feb 2015. This was my 3rd Moto G and this time I was going to gift it to my brother on his birthday. The unit was dispatched by WS retail on time,but today morning when I checked the status of the item..I was shocked to see Cancelled! I called the customer care...they told me I cancelled the item. I tried to convince them that I did not but they didn't listen to me..so I requested to talk to their TL then Mr. Tarun Kumar came online and when I asked him why was my shipment cancelled..then I was shocked again to the reply he gave me..he said it was cancelled by the courier company as you did not receive their call. I told him why wud the courier company call me when the product has not even reached my city and no one actually called...then he flipped his answer and said no sir you cancelled it.This is the customer service of India biggest e-commerce website! Now I was told to order the product again...now when I am trying to order the product..I am shocked again to notice...it says not available with any seller at my pincode! Then how come flipkart delivered the same product 2 weeks back? Flipkart is losing it and has already lost my trust. My brother won't get the gift which I promised him.",
            "date": "11 Feb 2015",
            "name": "Pranav Awasthi",
            "stars": "1 star"
        },
        {
            "comment": "Moto G2 performance issue starts within 3 -4 months of purchase. They say it is gorilla glass, but phone screen gets Scratches even when phone and Car keys are kept in your jeans. Customer service centre takes 15 days to check what is issue and does not do anything more than mobile Flash. I would have given minus rating if there was option.",
            "date": "11 Feb 2015",
            "name": "Abhijit Patil",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone from past 5 months. Its an amazing phone and the price range is actually too good to be true. With some negatives like you cannot use wi-fi direct without an external app, little heavy in weight, headphones are not the kind you expect to come with good smartphones and charger does not have a detachable usb cord. But still when you compare all these things with the speed of the phone, battery back-up, overall user interface and amazing features, you forget about the cons of the product. Unlike other smartphones, it never hangs and even when multi-tasking, it responds very very fast. Overall, I'm simply in love with the phone. As far as Flipkart is concerned, it's the best online shopping website. Very quick and prompt delivery. I ordered this phone and got the delivery the day after. The products are always packed very nicely. I trust WS Retail and never got any wrong or damaged product ordered from this seller. Thanks to Flipkart Team for making online shopping so easy and trust worthy. :)",
            "date": "11 Feb 2015",
            "name": "Akanksha",
            "stars": "5 stars"
        },
        {
            "comment": "In short , a phone with a reasonable price installed with 5.0.2 os and with a good battery endurance capability is really worth buying.So,go for it.",
            "date": "11 Feb 2015",
            "name": "Shrijan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing phone for the price. Good specs, specially the touch screen. The camera could have been better. Also the quality of headphones needs improvement, Good delivery by flipkart. enjoy!!",
            "date": "11 Feb 2015",
            "name": "Divyank Kapoor",
            "stars": "5 stars"
        },
        {
            "comment": "All the features are almost OK. Call history system is not good. It is not showing the time of calling. Battery back up is very poor. For full charge it took minimum 4-5 hours. But the talk time merely 40-50 minutes. I am very much frusted about Battery back up. Can anybody help me how I can increase the Battery back up.",
            "date": "10 Feb 2015",
            "name": "DEBI DATTA",
            "stars": "3 stars"
        },
        {
            "comment": "The phone is just awesome. Everything runs smooth. But the problem after lolipop update is that i cannot use any music files as my ringtone i have to use the default ringtones.",
            "date": "10 Feb 2015",
            "name": "Tanvir Sarkar",
            "stars": "4 stars"
        },
        {
            "comment": "Best mobile ever to buy................................................................................................................. I have purchased it before 2-3 months and have found no problem in it till now................................... So i'd suggest you to buy this mobile only.......................................................................................",
            "date": "10 Feb 2015",
            "name": "Chinmay kulkarni",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile with lot of features and of course with stunning speed and cool looks.....I am sure this smartphone is capable to beat any mid-range smartphones.....Got this mobile from market giant flipkart and believe me guys flipkart has awesome service whether it is channel delivery or its customer service............Flipkart never compromise with quality....... :)",
            "date": "10 Feb 2015",
            "name": "Rohit Jamwal",
            "stars": "5 stars"
        },
        {
            "comment": "Camera Quality is Good Screen clarity is Awesome Mobile look is Very Good if audio/video playing for long time mobile is heating Very Poor battery draining with in 12 hrs",
            "date": "10 Feb 2015",
            "name": "Guna",
            "stars": "3 stars"
        },
        {
            "comment": "I have been using this phone from the past 4 months. Recently I have upgraded to Lollipop, after upgrading to this it is showing many issues like Battery drainage, heating problem, touch response and taking lot of time to full charging....",
            "date": "10 Feb 2015",
            "name": "Mahi",
            "stars": "2 stars"
        },
        {
            "comment": "using since 14 sep 14 good performer since LP update now some lagging appears why flipkart ur showing 20 days delivery time even after ur delivering in 5 days. why ur doing with Ranchi customer like this. please correct the things competion barh gaya hai sir g, beware,,,,,,,,,,",
            "date": "10 Feb 2015",
            "name": "Abhinav Abhijit",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this for my in-law. I have been using Moto-x so I was not having any doubt on Moto products. My in-law is so happy with this mobile.",
            "date": "10 Feb 2015",
            "name": "Bharath",
            "stars": "5 stars"
        },
        {
            "comment": "I Bought Moto G from Flipkart looking at its good reviews and good company profile. MOTO phones have been a monopoly of flipkart. It has really bad primary and secondary camera..Showing fake colors. I requested company that I am not satisfied with this product and i request you to kindly change it with some different company, which was turned down by their representative Mr Faizal. Flipkart can replace the product but cannot change the product coz it knows that it is a cheap quality product and its sale has going down coz of this. That is why they are offering exchange old phone scheme. My order id is OD201999471375807600, I have been buying a lot of products from flipkart, I can expect such a response from fipkart.",
            "date": "10 Feb 2015",
            "name": "ABHINAV AGARWAL",
            "stars": "1 star"
        },
        {
            "comment": "hi i'm using it since six months and it is superb lollipop update also i got for this phone. battery i'm getting almost 14 hours with 1 sim 3g always data on and another one in 2g.",
            "date": "10 Feb 2015",
            "name": "lakshmikanth kodali",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent, but not the best at this price. When first arrived, Moto G (1st Gen) was the best at that price... that's why I'm rating 1 star less for this.",
            "date": "10 Feb 2015",
            "name": "Swapnajyoti Sarma",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone for last 5 months and got recently updated to Lollipop as well. Excellent phone. Thanks to flipkart for decent delivery of product.",
            "date": "10 Feb 2015",
            "name": "Nanda",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone recently after discussing with few friends. Was deciding between HTC, Moto G, RedMi and One Plus One. But considering the feedback and cost I bought this one. And I'm not disappointed!! The day I fired my phone for the first time was the day I got the OS upgraded to Lollipop. So now I have a great phone with latest OS. The phone works perfectly fine and have been facing no issues yet.",
            "date": "10 Feb 2015",
            "name": "Rohan",
            "stars": "4 stars"
        },
        {
            "comment": "Wonderful to use, very user friendly and upgrades you with latest versions.. only minute drawback is its battery life but with newly introduced Zero launcher app this is sorted as well.. Would highly recommend it..",
            "date": "10 Feb 2015",
            "name": "P@@",
            "stars": "4 stars"
        },
        {
            "comment": "I know there's no need to write a review on performance and specs of Moto g. It is simply awesome, which is why I bought this device. However I doubt whether there is some defect in the 2nd gen Moto g devices. 1. One of my friend who bought Moto G 2nd gen, had to return the device after 3-4 months as it was not booting. Service center says motherboard problem. Luckily it was during the warranty period. 2. Few weeks later, ie today, the phone I bought is not charging. Motherboard problem - says service centre. When I enquired, found that many users are facing the same motherboard related complaints recently. So I suggest make your choices wisely.",
            "date": "10 Feb 2015",
            "name": "SHIBU K T",
            "stars": "3 stars"
        },
        {
            "comment": "Got this mobile last September, my first pure android since 2009. A lot better than the samsung junk that is being sold at exorbitant prices and fails to give consumers anything. I've used the device extensively, back when it was Ice cream sandwich, kitkat and now Lollipop. Its come a long way. Its still my favorite mobile. Only glitch is that using in at bangalore with any network, The network here is soo bad, that the battery drains by 10 in the morning. Using it elsewhere or in a single sim, it just lasts and lasts. One word of advice, if you are using the dual sim functionality, make sure that they are on the same operators. This helps save your battery. With more than one user mode on the device, am now able to configure multiple users, one for home and one for work. And keep both separate. If you are looking for a budget motorola mobile, close eyes, get this :)",
            "date": "10 Feb 2015",
            "name": "G. P",
            "stars": "5 stars"
        },
        {
            "comment": "Recently i have taken Moto g 2nd gen.. It was nicely delivered with good quality..",
            "date": "10 Feb 2015",
            "name": "kanakala sruthi",
            "stars": "4 stars"
        },
        {
            "comment": "Nothing works in it. Voice Call one way....no sound at reciever when calling. Internet intermittently works. SIM gets out of detection quite often, Battery Drains out all of sudden from 67% to 1% ( I have saved the Graph to prove this). No privacy as the receiver sound is clearly audible outside as like Loudspeaker. Moreover post sales care from Flipkart as well Technical support services by Motorola is Pathetic. In one word its a 'piece of crap'.",
            "date": "10 Feb 2015",
            "name": "Dev",
            "stars": "1 star"
        },
        {
            "comment": "Good product in a very reasonable price. I am very satisfied with this product, Thank you Keep up the good work!",
            "date": "10 Feb 2015",
            "name": "satyajit talreja",
            "stars": "5 stars"
        },
        {
            "comment": "The product is gud. Have nice display. Satifies all my craving for pic, internet and Value for money at this price",
            "date": "10 Feb 2015",
            "name": "Pinee Sahu",
            "stars": "5 stars"
        },
        {
            "comment": "got problem with the mobile for two times even after replacement. now i dunno who will replace pay back me. replacement rejected.",
            "date": "10 Feb 2015",
            "name": "john",
            "stars": "1 star"
        },
        {
            "comment": "Bought it for my nephew and its too good for the price.... Just go for it without much thinking... Best Android experience you can have at this price point....",
            "date": "10 Feb 2015",
            "name": "Pravin Lunagaria",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered MotoG 2Gen. Its great product. Best on value. Delivered on time. Bigger Screen. Little low on battery. Updated to Android Lolipop OS Expandable Memory and dual SIM With the support of Google never disappointed with the OS Thank you flipkart for delivering such a great product.",
            "date": "10 Feb 2015",
            "name": "Kevin Morrison...",
            "stars": "4 stars"
        },
        {
            "comment": "VERY GOOD PHONE AT THIS PRICE,JUST LOWER POINT IS BATTERY BACKUP. LOOKS WISE VERY GOOD AND HANDY PHONE.",
            "date": "10 Feb 2015",
            "name": "ASHISH KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "Overall performance is good, gona buy secone one for my betterhalf :) :). I am not playing any overloaded games so no coments on heatup issues. Its nearly 15days now phone never get hanged.",
            "date": "10 Feb 2015",
            "name": "GSNVV",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered mobile on 20th and received after 3 days. now abt mobile it is good over all but battery is draining very fast. Camera is average not so good in night. if you are hard android user who wants to be updated with every android update its good to buy.",
            "date": "10 Feb 2015",
            "name": "Sandeep Singh",
            "stars": "3 stars"
        },
        {
            "comment": "its not supported BSNL sim, issue in data / vice both problam on moto G 2nd Gen mobile. and very big issue in speaker.",
            "date": "10 Feb 2015",
            "name": "Akhilesh Yadav",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone after reading so many positive feedback.. and I am fully satisfied with this one. I really like the phone and flipkart service, specially packaging. even flipkart replaced my phone after I found an issue with my phone. thank you for that flipkart.",
            "date": "10 Feb 2015",
            "name": "Chetan Rajput",
            "stars": "5 stars"
        },
        {
            "comment": "This won't be a phone that you fall hard and fast for. It won't sweep you off your feet, nor will it dazzle you with a slew of whizbang features. That's just fine, though. Because none of that changes the fact that the Moto G is still the best budget smartphone you can buy today. Using the thing isn't as revelatory an experience as firing up the new Moto X was, but Motorola's long list of seemingly modest improvements collectively add up to a device that's worth your attention",
            "date": "10 Feb 2015",
            "name": "Viraj Torawane",
            "stars": "4 stars"
        },
        {
            "comment": "I am using moto g2 last 3 month and i am very happy with its performance. It performs as per its specification, so i am very satisfied with this.Camera quality is also too good.",
            "date": "10 Feb 2015",
            "name": "Matri Manish",
            "stars": "4 stars"
        },
        {
            "comment": "I have ordered it but they failed to delivered me the product within a day as per their commitment.",
            "date": "09 Feb 2015",
            "name": "Karan Sethi",
            "stars": "1 star"
        },
        {
            "comment": "The product Moto G had mild noise disturbance in the handset's earpiece, hence I asked for a replacement which was also given by Flipkart. The replaced new product also had the same issue of mild disturbance in the earpiece during calls, now I asked for a refund since the issue is repeating the 2nd time. Today the Flipkart Team approved my request after speaking to me, they asked me to go the service center which didn't want to hence they told me that they will pick up the defective piece by 11th Feb'14 and refund my amount by 8 days but everything was done by today itself. Pickup was done by 7pm refund was done by 9.30pm to my wallet, then I called and asked to credit it to my account which was done immediately. Excellent and Incredible customer service. I have never experienced such levels of customer service in any retail store anywhere. If you maintain this service level I'll buy everything from you.",
            "date": "09 Feb 2015",
            "name": "Ranjith Bakthv...",
            "stars": "1 star"
        },
        {
            "comment": "Really a worth buying... Camera and speed is really good. Delivered in time and in good condition. Kudos to flipkart.",
            "date": "09 Feb 2015",
            "name": "Thalapathi",
            "stars": "5 stars"
        },
        {
            "comment": "Was planning to purchase Xiome Note 4G,but the only thing that got my attention towards this awesome phone is that it's dual sim compared to Xiome Note and it's MOTO...the brand itself speaks for it's quality..so don't think and go for this phone..i bet you won't regret!!!",
            "date": "09 Feb 2015",
            "name": "Rishi",
            "stars": "5 stars"
        },
        {
            "comment": "all is excellent product, service, packaging , after sales service by Flipkart & after all you are buying the best brand - Flipkart.",
            "date": "09 Feb 2015",
            "name": "mandar",
            "stars": "5 stars"
        },
        {
            "comment": "its just awsm ! better than asus zenfone ! i am loving this product ! have been using this product since last 3 months !",
            "date": "09 Feb 2015",
            "name": "Tushar",
            "stars": "4 stars"
        },
        {
            "comment": "Once again thank you Team Flipkart for promt delivery. Most liked in this product is Slow motion Video,Lolipoop update,good camera. But battery back up is not so good(Am a heavy user).",
            "date": "09 Feb 2015",
            "name": "LOKESH MK",
            "stars": "4 stars"
        },
        {
            "comment": "Tanks to Flipkart for faster delivery on time. No more troubles got a fresh new piece with proper delivery. Using this for more than six month and no issues were spotted also nice to handle",
            "date": "09 Feb 2015",
            "name": "Gnanavel S",
            "stars": "5 stars"
        },
        {
            "comment": "This is what people look for when they think about small range budget but high end smart phone Always and highly recommended for Moto Products...",
            "date": "09 Feb 2015",
            "name": "Jimit Upadhyay",
            "stars": "4 stars"
        },
        {
            "comment": "Cool phone at a cool price... Absolutely nothing has gone wrong after I bought it.. Now upgraded to Android 5 ( Lollypop ) .. had to do a bit of tech adjustment with guidance from NET ... but then the phone has become even more amazing... though they could have added a better ear-phone.",
            "date": "09 Feb 2015",
            "name": "Ashis Kumar Kar",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on Feb 1st 2015 and got it promptly by the afternoon of Feb 2nd. The packaging and all the other stuff like specs have been spoken about already, so I'll just skip on that. Now, It's been a week since I got the phone up and running for me. From what I've gathered by looking at reviews for this phone before buying it, I must say that I am indeed lucky to get a good piece. As soon as I booted it up and signed in, it showed that the Lollipop update was waiting for me. I quickly upgraded my phone and started using it. So here's my experience with the phone: -> The interface super smooth and feels awesome to use. -> The battery is awesome even though my phone has WiFi enabled for about 15 hours a day, and also only when I start playing heavy games, the battery starts to drain a bit faster than usual. ->The earphones are okay. I'm not against the Moto earphones, but I'd have liked it with the buds. ->The camera quality is better than what I thought it would be. -> Also some people faced problems wit the lock button and the volume rockers, but i found them compact and firm. On the whole, holding the phone feels good, and using it feels way too good! :D",
            "date": "09 Feb 2015",
            "name": "Akshay Viswajith",
            "stars": "5 stars"
        },
        {
            "comment": "I wanted to replace my Samsung Galaxy S3 and Iphone with this dual SIM phone. My Samsung GS3 served me well for 2 years but off late had become very laggy and the battery life had become quite bad. I purchased a new 2250 Mah battery from RAW but that did not help much. It seems the phone needed more battery after all the upgrades. I was initially a 32 GB memory card on the phone and recently installed a 64 GB memory card. My iphone was a 16 GB model and was running out of memory. The Motorola Second Generation is a well designed easy to hold phone. The first time you start up the phone, the screen looks washed out on google play compared to the Samsung Galaxy S3 but this is not a screen problem. Samsung phones seem to have over-saturated vivid displays which will make most phones look pale. The screen on the Moto G is good and something you will quickly get used to. The pure android OS is also nice. It operates smoothly but is not fast. The points that I do not like about the phone are 1. Though I purchased the phone for the pure android experience, the pure android experience leaves you feeling short changed. The enhancements made by mobile manufactures, though not the best for performance, are really good for usage and I soon started missing these. 2. AC3 audio is not support on several video files. The same video files worked without issues on the Galaxy. H/W decoding also did not work on several videos. The H/W decode option works for all files on the S3 3. The camera firmware or camera is very poor, text can never be captured correctly. I used both the Iphone and Samsung for OCR from clicked photos. This cannot be done with the Moto G second gen since the text cannot be cleanly captured 4. File transfer rates from the file to a memory card are slower than the Galaxy. I regularly download files and move them to the memory card. While I get 9 MB/s on the 32 GB card in the Galaxy the same card gives me 6 MB/s on the Moto G. 5. For some reason the screen never feels bigger. On all text applications, the amount of text that fits on Galaxy and Moto G is the same. I believe this is because the phones are very close in screen size and the scaling probably happens at a slightly larger screen size. However the phone also has the following good points. 1. Good battery life, can last through the day 2. Non laggy performance 3. Good WIFI connection 4. Decently fast browser experience. 5. Quick syncing of photos and folders (even if you don't want them synced!!!) I purchased the Samsung Galaxy S3 almost 3 years ago for 22,400. The moto G second generation, priced at 12,999, doesn't make the S3 look long in the tooth after such a long time, which speaks a lot about the hardware on both phones. The Moto G has average hardware but a great implementation. Except for the AC3 audio everything works fine. The pure android does not give it the polish of a S3 but everything works well when needed. If you want a great phone for productivity, reminders, OCR, fantastic photos and videos, any iphone will be a seriously good phone. I am not replacing both my phones. If the Samsung Galaxy S3 had a dual SIM option and a better battery life, I would have made that my primary phone. For now I continue to use the iphone and the new Moto G, which is disappointing. For the price of a Moto G second gen there are lots of good phones available and they have much better camera interfaces, but If you want a slick well built lag free phone that wont go slow on you after many upgrades, I believe the Moto G second gen is good choice.",
            "date": "09 Feb 2015",
            "name": "Maanit Doshi",
            "stars": "3 stars"
        },
        {
            "comment": "I have received the product on sunday 8-02-2015.The FedEx courier person didn't deliver the product to me.I received via the 3rd party person.He asks me money for the product to be delivered.Unless i pay to him,he didn't want to give the product to me.After arguing for sometime,he gave the product and went away.for every order he wants me to pay some penny to him.This is very bad..",
            "date": "09 Feb 2015",
            "name": "Nikhil Vemula",
            "stars": "1 star"
        },
        {
            "comment": "Received the mobile in time...the packing was also good...this phone is awesome...important plus is that it has more internal memory.. the mobile is very light and touch sensitivity is good..sound is also quite good..Stand by time for battery is also good.. but i was not satisfied with the headphones its design was so outdated..Overall its a good phone for its price",
            "date": "09 Feb 2015",
            "name": "PON RAJESH",
            "stars": "4 stars"
        },
        {
            "comment": "Writing the review on my 4 months use. This is a good reputed mobile at good price and features, but not the best. I got a defected product (Proximity sensor didn't work) and got it replaced. Now its good. Poor battery, If you like to be online all day this is fine. But if you wish to roam online(surfing) throughout the day, battery would get dry in 6 hours. This applies to WiFi usage too. Please don't buy, if you use mobile more. That too data and WiFi. Otherwise, Camera is good and processing speed is great. Looks royal as Nexus.",
            "date": "09 Feb 2015",
            "name": "Gopinath",
            "stars": "4 stars"
        },
        {
            "comment": "I used the moto g first generation and it's good phone. I don't have any doubt on moto g till date.Now i gifted the same to my dad and i purchased the motoG2. But i found some problem in speaker with moto G2 at the time of voice calling. Every time i need to set the volume at the time of calling. I am not getting the proper reply form feedback. I would suggest please think before you buy the product from flipkart.",
            "date": "09 Feb 2015",
            "name": "Vishal Jagtap",
            "stars": "1 star"
        },
        {
            "comment": "It is so fluid on 1 GB RAM... superbly build.. It's a new experience every time with it.... But on camera you have to patients for the sharp shots.... Lollipop is just cherry on the cake...",
            "date": "09 Feb 2015",
            "name": "Kazim Marfatiya",
            "stars": "4 stars"
        },
        {
            "comment": "Motog2 is best phone till 15K price segment. After updating lollipop version, its battery backup also increase. I recommend whose want to purchase new phone in 15k Sugment.",
            "date": "09 Feb 2015",
            "name": "Janeshwar Pra...",
            "stars": "4 stars"
        },
        {
            "comment": "This Moto G Service was very very bad and they didnot no how to repair the complaint product. I have given my Moto G to service center which was got problem in under warranty they asked Rs.350/- to check after check they told me the mother board was complaint it costs Rs.5500/- i have take the phone from the service center after one day the phone was working but when switch off and on the same booting error was coming and after half an hour it is working. Kindly replace my Moto G to new pc in the place not working properly my Moto G. BAD BAD VERY BAD EXPERIANCE WITH MOTOG AND THE SERVICE CENTER. I WILL HALF STAR FOR THIS MOTO G BECAUSE OF SERVICE CENTER.",
            "date": "09 Feb 2015",
            "name": "Srinivas M",
            "stars": "1 star"
        },
        {
            "comment": "Bought this product for 9000, as I got 3000 for my very old blackberry on exchange & 10% by using HDFC credit card..really good Deal..Really great phone..great performance..good Display..Overall a Great Phone",
            "date": "09 Feb 2015",
            "name": "Vijoe",
            "stars": "5 stars"
        },
        {
            "comment": "Absolute delight is what I felt when I saw the phone first. Decent display with good sunlight legibility. Great call quality. The speakers are placed on the front is the only thing I did not like. Can't keep the phone face up because of scratching the lens and if kept face down, the speakers get covered and ringtones get muffled. Battery life is great with one sim but with 2 sims, it will just get through the day.",
            "date": "09 Feb 2015",
            "name": "Anand AH",
            "stars": "4 stars"
        },
        {
            "comment": "GOT IT DELIVERED IN ONE DAY WITHOUT MISS:\"). GOD KINDA FUNCTIONS AT LOW END AS COMPARED TO OTHER BRAND AND MODEL..... GO FOR THIS IF YOUR GOING WITH THIS RANGE OF BUDGET:)",
            "date": "09 Feb 2015",
            "name": "Mohamad Tayeeb...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought 2 Moto G, One for myself and other for my wife .Mine is working fine but for my wife she is is not able to hear any incoming call .Even she picks up the call the other person still hear ringing tone and it looks like she is not picking up the phone .We got this checked at service centre but nothing changed even after they replaced the speaker. There is no exchange policy for manufacturing defect like this as per service center.",
            "date": "09 Feb 2015",
            "name": "Kalpesh Bohra",
            "stars": "1 star"
        },
        {
            "comment": "Except for conference calling that too in latest versions of android, this mobile fuctions absolute well and for that price getting all these qualities is a best part of this product. Thanks flipkart for your service.",
            "date": "09 Feb 2015",
            "name": "Sai Bharadwaj",
            "stars": "4 stars"
        },
        {
            "comment": "Bought this on exchange offer... Having grt time with moto g second gen... Battery back up is okay...",
            "date": "09 Feb 2015",
            "name": "Aditya Hegde",
            "stars": "4 stars"
        },
        {
            "comment": "Really good mobile compare to other product in similar price band. Performance is good, Camera quality very good, moto assist is additional benifit.",
            "date": "09 Feb 2015",
            "name": "Jayesh Moradiya",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola's come back vehicle was Moto X and Moto G (Both 1st Gen) Moto G was priced Rs13999/-. Great phone and great price. Moto G 2014 was priced Rs12999/- This is my personal opinion but I feel that 1.2GHZ seems a little underpowered for a 5inch display. I dont understand why reduce the price. Keep the same price and offer little something more. Like a bigger battery or a better chipset. There is no lag in everyday use but sometime when there are a 10 or so windows open in the background, you do notice slight lag in Kitkat. Lollipop have made the phone more refined. In normal use, you dont find the battery inadequate but use it a little heavily and the battery drain is quite noticeable. One needs to use teh phone keeping in mind that days itinerary! I am happy with the device with a few complaints which really shouldn't matter for the price",
            "date": "09 Feb 2015",
            "name": "Jimish Shah",
            "stars": "4 stars"
        },
        {
            "comment": "i always wanted to buy my moto g2 phone since it came out in oct. and now its here with me yesssss.... phone is good but i think my phones speaker quality is not up to the mark. but the rest is too far tooo good... moto please drop its price a little more",
            "date": "09 Feb 2015",
            "name": "raj",
            "stars": "5 stars"
        },
        {
            "comment": "Mentioning anything about this phone would be bit less, as per the specification mentioned, it proves its worth. The only con found is its \"batter life\" which Motorola needs to work upon a bit. Else & otherwise..its an All-rounder phone! My rating here proves the worth of price & had gifted it to my Beloved on our Anniversary! Going for the other Chinese brand & cheaper brands wouldn't help you much rather go for a Brand, which keeps it value & words! Also, Flipkart have done a good Job for Customers with tie-up of SBI Cards & an additional discount of 10%, adds one more advantage to buy this phone! Cheers to Motorola & Flipkart as well!!! Regards, Rakesh",
            "date": "09 Feb 2015",
            "name": "Rakesh Nayak",
            "stars": "4 stars"
        },
        {
            "comment": "With the update to lollipop...the battery backup was increased and ram free space also increase..overall a worth purchase.",
            "date": "09 Feb 2015",
            "name": "Sai Kiran",
            "stars": "5 stars"
        },
        {
            "comment": "Product is sleek and the performance is Very good. Satisfied with the screen and touch quality, Voice quality and design of the handset which is awesome. The moto logo is prominent and is the resting place for your index finger during calls and message, also helps well handling of the phone. Comes to Battery, which is average almost used up in approx. 10 hours. One drawback with Moto customer care support, as service centers are not easily available in all cities like Samsung & Nokia. Camera quality is good. Light weight Mobile in this range and functions.",
            "date": "09 Feb 2015",
            "name": "Ravi Gaur",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone with great performance N best part is the price Tag. SD card slot is plus point too Only thing i didnt like is that the charger has cable attached to it.",
            "date": "09 Feb 2015",
            "name": "R K raghav",
            "stars": "5 stars"
        },
        {
            "comment": "1. GOOD AND FAST PROCESSOR - NO LAG 2. CALL QUALITY TOP NOTCH WITH NOISE CANCELLING 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY.",
            "date": "09 Feb 2015",
            "name": "Balaji Paramas...",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is good for moderate use, battery life is on down side, needs to be charged twice a day, not recommended for games with Bluetooth console and all as RAM is limited. otherwise for normal use it is good",
            "date": "09 Feb 2015",
            "name": "JayaChandra Vi...",
            "stars": "4 stars"
        },
        {
            "comment": "i am not able to save several contact nos. to internal memory of phone. after saving the contact details, it may be lost automatically. if i try to import the contact details from my sd card , it is not possible to import it. after importing some contacts the process stopped automatically. and after sometime those imported contacts are lost automatically.",
            "date": "09 Feb 2015",
            "name": "harmish bhatt",
            "stars": "2 stars"
        },
        {
            "comment": "Worth buying. Screen Size, Crisp working. Battery backup all as expected and competitive. Only issue is Flip cover from Motorola are very costly.",
            "date": "09 Feb 2015",
            "name": "Amit Srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "while i place an order of MOTO G 2nd generation. Lots of problem is there in the mobile. USB not connecting with PC. USB cable is not coming with Accessories. Network issues is there.",
            "date": "09 Feb 2015",
            "name": "syed althaf hu...",
            "stars": "3 stars"
        },
        {
            "comment": "Purchased this on the day of launch and I am using this as my daily driver for past 4+ months. Camera is more than enough for casual pics. Stereo, front facing speakers sounds nice and when paired with decent headphones the audio quality is great, a clear improvement from Moto G 2013. (but the in box earbuds are bad as before). Battery life could have been better as on heavy use days I am forced to use battery bank at end of the day. Software is clean and smooth, though at times the Launcher redraws are a bit annoying. Overall a great phone for the price.",
            "date": "08 Feb 2015",
            "name": "Akilan K",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered it on 1st jan and received on 5th jan but it was a faulty piece had some lines on display so i had to replace it and filpkart did replaced it on 11th jan, It seemed a good phone then but after a few days its display again started to have problems at times screen would go blank as if the phone was switched off but the rest was working i tried calling my phone by my friend's phone and it rang but nothing on display, i tried restarting it but again nothing on display after sometime it started functioning normally but last night i again faced the same problem. Dont know if I received faulty piece both times or moto really sucks :(",
            "date": "08 Feb 2015",
            "name": "Ayush Upadhyay",
            "stars": "1 star"
        },
        {
            "comment": "Over all Good phone for the price. Pros:- Good screen size,quality(HD) Good looking phone. Good speakers (dual) Upgradable to Lollipop OS,the latest software Decent performance..its pretty quick Cons:- Average camera ,,can take decent photos..don't expect great pics especially in low light Average battery life Phone get warm/hot when the camera is used for a while and when connected to WiFi or 3G for long time or when games are played. Poor quality hands free. Over all a decent phone for the PRICE..I repeat for the price its not a bad phone to buy.",
            "date": "08 Feb 2015",
            "name": "K.Palaparthi",
            "stars": "4 stars"
        },
        {
            "comment": "Its my first smart phone ..i am full happy with this product...........................................",
            "date": "08 Feb 2015",
            "name": "srini",
            "stars": "5 stars"
        },
        {
            "comment": "This phone doesn't have its own Music Player and File Manager. But the good part is it got android L update. But I would still prefer Redmi Note over it.",
            "date": "08 Feb 2015",
            "name": "Nishant Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "good mobile with good fuction no network or call drops no hanging camera is good 8MP camera takes nice pictures",
            "date": "08 Feb 2015",
            "name": "vipin",
            "stars": "5 stars"
        },
        {
            "comment": "Every thing is awesome but only one think that is very bad in moto charging time, it takes almost 3 hr to full charge motorolo should solve this ....",
            "date": "08 Feb 2015",
            "name": "ALMARIO",
            "stars": "4 stars"
        },
        {
            "comment": "Product is gud ,,,, but i didnt get that...sd card unsupportred .. mike problem.. melting smell from the sd card slot.. if they didnt return the product .. ***********************8",
            "date": "08 Feb 2015",
            "name": "Madheen Ahmed",
            "stars": "1 star"
        },
        {
            "comment": "After battery drains to 60% ..phone dies in another 2 hrs whether u use it or not....another prob is with the secondary camera ..it is not enabled in my device or there is no option to take secondary cam.",
            "date": "08 Feb 2015",
            "name": "Sreeresh",
            "stars": "3 stars"
        },
        {
            "comment": "Pros:- Excellent Display with Gorrilla Glass Good Camera Quality Smooth and Fast Screen touch Latest Android Cons:- Can't play radio in loudspeaker, only with headphones Battery fixed to the device Will edit this review after 6 months.",
            "date": "08 Feb 2015",
            "name": "Anirban Chakra...",
            "stars": "4 stars"
        },
        {
            "comment": "I've been using this phone for two months and the interface is amazing and lag free unless one updates the phone to 5.0.2 Lollipop.. Else it is one of the best phones to buy in the market and the camera too is amazing (both front and read).. The front facing speakers also look classy and the expandable storage makes the buy a steal ...but moto please offer extra covers too for more variety Flipkart please send COD orders faster as i had to wait for almost a week for the phone.. I'd recommend all to buy this phone for its reliability too..",
            "date": "08 Feb 2015",
            "name": "Jithin Raj",
            "stars": "4 stars"
        },
        {
            "comment": "Delivery is excellent from Flipkart but if you face problem with phone, the customer service at flipkart is very disappointing. In my experience this is a very poor phone from Motorola. Please avoid buying this",
            "date": "08 Feb 2015",
            "name": "Udaya Shankar...",
            "stars": "1 star"
        },
        {
            "comment": "Hi All, I purchased MOTO G2 from Flipkart and had the worst experience ever. The camera quality is pathetic and pictures taken at night are hardly visible. The battery drains too much, hardly 6-8 hours of backup with a 3G connection and takes a lot of time to charge (mostly overnight charging). The gorilla glass is not up to expectations as scratches come to is very easily. Speakers gives a cracking noise at high volumes which is very annoying and unacceptable. And to top it off during the update from kitkat to lollipop the phone just crashed, and i am unable to start it since then. The mobile keeps restarting and nothing is happening, I feel terrible now to have brought this phone as it feels like a waste of money. Don't know what to do, would recommend all of you to think again before buying this product.",
            "date": "08 Feb 2015",
            "name": "Urvi Verma",
            "stars": "1 star"
        },
        {
            "comment": "Lollipop update is buggy, but less buggy than the stock version of Lollipop. Great phone. Exceptional price. Indeed.",
            "date": "08 Feb 2015",
            "name": "Harsh Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I got the phone yesterday and I update the software to I got the phone yesterday and I update the software to lollipop. It good work and a excellent. I would recommend to all.After seeing the phone and my friends like to purchase it...... It good work and a excellent. I would recommend to all.After seeing the phone and my friends like to purchase it.....",
            "date": "08 Feb 2015",
            "name": "suhail saleem",
            "stars": "5 stars"
        },
        {
            "comment": "NICE AND BEST PHONE IN THIS RANGE CAMERA BATTERY AND ALL OTHER FEATURES ARE MAST U CAN TRUST MOTO G 2nd GENERATION AND THE UPDATE FOR LLLIPOP IS GREAT",
            "date": "08 Feb 2015",
            "name": "AMIT KUMAR PATEL",
            "stars": "5 stars"
        },
        {
            "comment": "Android lollipop does make it a bit slower and less snappy, but otherwise quite an adorable phone. The feel and ergonomics are quite nice. You might keep wishing for a better specs but what what's it cost, the phone works nicely.",
            "date": "08 Feb 2015",
            "name": "Aravind A",
            "stars": "4 stars"
        },
        {
            "comment": "1.Best in updating apps. 2.Best in camera editing videos&photos. 3.Best in sound. 4.Best in app downloading. 5.I am thinking it is next to apple i phone.... \\",
            "date": "08 Feb 2015",
            "name": "Vijaykumar G",
            "stars": "5 stars"
        },
        {
            "comment": "good phone..battery backup is so bad...! i think any smartphone have battery so important so this phone is good phone note best....",
            "date": "08 Feb 2015",
            "name": "Anupam kumar",
            "stars": "3 stars"
        },
        {
            "comment": "To be fair Moto g2 outperformed mobiles under 15000 range.using it for more than one month will recognize any one to buy it.",
            "date": "08 Feb 2015",
            "name": "Aadhityan Vetr...",
            "stars": "5 stars"
        },
        {
            "comment": "East or West Moto G is the best. if you want then buy it without any problem. the mobile very good as compared of other mobiles of same rate. Features are good and simple.",
            "date": "07 Feb 2015",
            "name": "SHAILESH MOKADAM",
            "stars": "5 stars"
        },
        {
            "comment": "I can say only one thing about this phone, best phone you can buy at this price with reliability as major factor. Camera quality is good. i recently got lollipop update and its is running without any lag or whatsoever only problem is little bit of heating on prolonged use and sluggishness while playing heavy graphics gaming. five stars from my side as it fulfills all my requirements",
            "date": "07 Feb 2015",
            "name": "Pawan Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "i am using this mobile from last 15 days, i don t see any thing special compared to other brands ex: xiomi , but overall ok worth it..",
            "date": "07 Feb 2015",
            "name": "Karka Kiran Reddy",
            "stars": "4 stars"
        },
        {
            "comment": "good price for the product!!!!! thanxxx to flipkart for delivering on time and product work suceessfullyyy!!!!!!!!!!! motorola",
            "date": "07 Feb 2015",
            "name": "cool_21 ansari",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone in my budget.I have looked for a good selection over all the blogs for favorable reviews.At last I decided to avail this at reasonable price.It is recommendable for user with strictly looking for affordable price with good features.",
            "date": "07 Feb 2015",
            "name": "CHAITANYA KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "battery drags very fast......needs more mah battery,more ram needed otherwise its cool........................",
            "date": "07 Feb 2015",
            "name": "kumar gautam",
            "stars": "3 stars"
        },
        {
            "comment": "Good price, good spec - better chance of getting an upgrade from Motorola/Google compared to other vendors. Phone is decent, fast, no lag, battery lasts about a day with medium usage (just makes through) Overall a good phone nice phone- really NICE but how much did MOTOROLA save by not providing the data cable?",
            "date": "07 Feb 2015",
            "name": "Aritra",
            "stars": "4 stars"
        },
        {
            "comment": "MOTO G is a good phone at the affordable price. There are some drawbacks like less RAM capacity, non removable battery and no FILE MANAGER option. But overall the product is good with good camera, internet connectivity and also with a hassle free game environment.",
            "date": "07 Feb 2015",
            "name": "Mahesh Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Just brilliant....its my 5th month with it.....the only problem was arranging a cover for it cause flipkart doesn't hold much choices for me.",
            "date": "07 Feb 2015",
            "name": "Ritu Bhayana",
            "stars": "5 stars"
        },
        {
            "comment": "i hv purchased this phone from flip card 6 days ago.... when i got my phone it ws running on kitkat very smoothly but when i updated it to lollipop it start lagging.. and automatically switch off...network problem is there ........ otherwise phone is good lollipop sucka aftr restore the settimg phone is wrking fine lets see wt hppns next .....",
            "date": "07 Feb 2015",
            "name": "Amarpal Singh",
            "stars": "3 stars"
        },
        {
            "comment": "Good Product, got the latest lollipop update....and exploring the same now.....the delivery was smooth.... was disappointed with the call center staff as they could not further help track the product in spite of purchasing the product with the in a day delivery option......",
            "date": "07 Feb 2015",
            "name": "kev",
            "stars": "4 stars"
        },
        {
            "comment": "One word - Awesome! Since i need to write at least hundred characters. ## I say it again One word - Awesome! ! ! :)",
            "date": "07 Feb 2015",
            "name": "Satish",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 - Reliable product with stable built quality , performance oriented hardware and with recent update to Lollipop is surely going to surpass leading brands at this price. I expect quick updates in future once released and increase in Service Centres across India so that any bug in terms of hardware and software should be addressed immediately without follow ups. Thanks alot flipkart for providing great deals and establishing strong shipment network but still you have to widen your network.",
            "date": "07 Feb 2015",
            "name": "SURESH DODEJA",
            "stars": "5 stars"
        },
        {
            "comment": "If your planning to buy moto g 2 because of its \"brand\" then please dont! 2 months after I bought my phone it crashed and they told me that my mother board needs to be replaced because apparently \"quite a few Motorola phones are facing this problem\". Its been over 2 weeks since I gave my phone for repair and I haven't got it back yet. The service is terribly slow and disappointing. The worst part is that I lost all 8 gb of data id stored on my phone so thank god for auto back up that i could recover some of it. Apart from the fact that my phone crashed, its also most inconvenient to use and needs an app for almost everything including one to set a song as ur ringtone and a file explorer among others. The camera lacks basic options like timer and resolution settings. The drop down menu is very tiresome for example it requires u to go to settings then display then auto rotate instead of the usual single click. Also it dosnt come with a connector cable is if u dont have one from an old phone then thats going to be a problem. Its little things like these that make it very frustrating to use this phone. The best phone for this price is ASUS ZENFONE 5. Its a brilliant phone, amazing processing, useful inbuilt apps, a drop down list u can edit based on ur convenience and an overall a much more satisfactory phone. I've used both phones and buying moto g 2 to replace my Zenfone 5 (when it got stolen :/) was a bad decision on my part and I urge u to not make the same mistake. Im sure you've seen a lot of statistics, but from a user point of use Asus Zenfone 5 is the best choice at this price range and Moto g 2 is a huge disappointment.",
            "date": "07 Feb 2015",
            "name": "Malavi Srikar",
            "stars": "2 stars"
        },
        {
            "comment": "In simple words go for it!!.................................................................................................",
            "date": "07 Feb 2015",
            "name": "Varun Gawasane",
            "stars": "4 stars"
        },
        {
            "comment": "I've used many phones but truly this phone stands at a higher position than the rest. And moreover it will be upgraded to Google's sweetest Lollipop (5.0.2) Pros- 1. A classy, cool, professional look. 2. Comes with Android Kitkat (4.4.4) But recently have been upgraded to Lollipop (5.0.2) 3. It was fast before, but amazingly fast after the lollipop update. 4. Good storage space (16 GB internal) with expandable storage. 5. It is rain water proof. (Its not a problem if its in your pocket when its raining. But that doesn't mean you should try it out with a bucket full of water. Come on!!! Its not Xperia Z series) 6. I've more than 85 apps installed in my phone (facebook, skype, Chrome, hangout, Line, temple run (1 and 2), subway surfer, compass, Picsart, camscanner, Flipkart, Instagram, Paytm, HDFC, redbus, Truecaller, messenger, whats app, and many more) Even after that it runs amazing fast with only 1 GB RAM. 7. No need to switch it off for changing sims or memory card. 8. Camera quality is awesome in bright light. and in low light it's good. 9. Touch is awesome, though I've matte screen guard, but the smoothness is amazing. 10. Sound is good, as they have made the speakers in front. 11. Can be charged with any USB chargers, unlike Xaomi Redmi, which can't be charged with any charger. Cons- 1. The charger sometimes get hot (in some particular charging points, not at all charging points) Though the phone doesn't get hot. 2. The LED notification light color is white. It can't be changed to any other color. 3. You can't remove the battery.",
            "date": "07 Feb 2015",
            "name": "Rishav Saha",
            "stars": "5 stars"
        },
        {
            "comment": "very nice handling the mobile compare wit other, the camera quality is very good, the speaker is very nice to hear a song like a external speaker, touch is also nice, lollipop version is good looking...",
            "date": "07 Feb 2015",
            "name": "dev",
            "stars": "4 stars"
        },
        {
            "comment": "bought it 2 weeks ago for just Rs.10,000/-( Including my old mobile exchange offer hdfc 10% offer) so it was an awesome deal for me. ~Lollipop ~Quadcore - no lagging ~1 GB RAM - sufficient ~ 16 GB ROM - super ~8 MP, 2 MP cams- decent quality ~5\" HD screen - fine picture quality ~ But battery capacity should have been more than 2500mah..! Over all its simply best.",
            "date": "07 Feb 2015",
            "name": "Raghavender K",
            "stars": "5 stars"
        },
        {
            "comment": "Overall a value for money device 5 star for that Great performance, Great quality. But the headset quality is very cheap",
            "date": "07 Feb 2015",
            "name": "Madhur Navgire",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G, charger not working properly. I have given complaint but no response from Flipkart. I have asked for replacement, without responding they have closed my complaint.",
            "date": "07 Feb 2015",
            "name": "ENVY",
            "stars": "1 star"
        },
        {
            "comment": "Hot cake product listed by Flipkart. I am using this product without any troubleshoot. I am really thankful to Flipkart for bringing a nice product at a fair price.",
            "date": "07 Feb 2015",
            "name": "s.subramanian",
            "stars": "5 stars"
        },
        {
            "comment": "After a research of long time I bought this phone and found that it has the quality of phones having price range 21000/- to 30000/-. Also it doesnt hang like samsung phones and has Good Camera quality. You can take this phone without any doubt in your mind",
            "date": "07 Feb 2015",
            "name": "Amit Sehgal",
            "stars": "5 stars"
        },
        {
            "comment": "very good phone,i like its performance, delivery was also quick by flipkart, sound and touch is amezing",
            "date": "07 Feb 2015",
            "name": "mukund mane",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased mobile on 25th jan. They said offer on Airtel SIM will be activated soon but i didn't get it yet...inspite of calling customer care and do all hectic procedure i didnt availed offer yet also google map is not working properly...",
            "date": "07 Feb 2015",
            "name": "Ravi Hingade",
            "stars": "3 stars"
        },
        {
            "comment": "Its awesome.It has made my life easy in every aspect it can offer. Also got the Lollipop Upgrade a week ago. Its made the G2 even more better.",
            "date": "07 Feb 2015",
            "name": "Dilan menezes",
            "stars": "5 stars"
        },
        {
            "comment": "I would say that this is the best phone available right now for under 20000 INR. I have used it for like 3 months and haven't faced any issues like hanging, etc. Got my Lollipop update just a few days back as promised. The touch is crisp.. like poetry in motion... The camera is very good. The sound is pretty decent too. Only thing is that I would have liked the speakers to be a bit louder like the Nokia phones but then again you can't have everything..",
            "date": "07 Feb 2015",
            "name": "Keshav Kunal",
            "stars": "5 stars"
        },
        {
            "comment": "Very good mobile with decent price when compared to other brands, delivered in two days kudos to Flipkart. Highly recommended..",
            "date": "07 Feb 2015",
            "name": "Vinodh Janakiram",
            "stars": "5 stars"
        },
        {
            "comment": "It is overheating too much and the touch is not working at some circumstances. but overall performance of the phone is not soo bad. Best phone for normal users.",
            "date": "07 Feb 2015",
            "name": "kotipalli sahy...",
            "stars": "3 stars"
        },
        {
            "comment": "using since 5 months with no issues, got lollipop update as promised my motorola stylish design and build quality is also great there are many chinese brands coming but their major problem is the service support.. overall a good value for money product,go for it!",
            "date": "07 Feb 2015",
            "name": "amey vajpeyi",
            "stars": "5 stars"
        },
        {
            "comment": "Unbelievable... I bought Moto G (2nd gen) on 17th Dec 2014, i got the best product from the Flipkart and as well as, after the sometime there was some issue is coming under my phone, then i complaint against the product to flipkart, my complaint will resolved in a day and i got a new Moto G (2nd Gen) again. Now I am Happy with Flipkart and Happy with Products till now. Thank you Flipkart Regards Ritesh Bisht",
            "date": "07 Feb 2015",
            "name": "Ritesh Bisht",
            "stars": "5 stars"
        },
        {
            "comment": "nice product 9-10K range phone ..............................................................................................................................................................................................................",
            "date": "06 Feb 2015",
            "name": "Raghavendra Ba...",
            "stars": "5 stars"
        },
        {
            "comment": "purchsed on 12/11/2014.....start giving hanging problem on 25th december....visited service center they reinstalled software ...after few days same issue again.....again visited service center they were not able to trace problem...sometimes says software issues..sometime motherboard....now they are saying touch problem......more than one month no solution....everytime they motherboard and touch mangwai huyi hai aa rhi hai.......beware not only initial price matters but after sales service also..that is worst...its a chinese phone in name of mototola......",
            "date": "06 Feb 2015",
            "name": "PANKAJ GOYAL",
            "stars": "1 star"
        },
        {
            "comment": "i bought it last month this phone was awesome. this was exactly what i was want. iam happy to have this.",
            "date": "06 Feb 2015",
            "name": "Surendra Nath",
            "stars": "5 stars"
        },
        {
            "comment": "Writing this review after using the the phone for 2-3 days! Good: Its Moto Awesome screen quality Stock android experience Camera in daylight Nice grip and easy to hold Improved speakers Bad: Battery backup is not that good as compared to moto g 1st gen Camera in lowlight conditions Speakers give cracking noise at maximum volume If you are thinking to buy this mid-range smartphone with 13k it would be a great deal according to me, dont matter which phone you used before or this is first smartphone. I liked moto G 2nd gen very much then any other Brands beacuse of its display quality. I orderd on 29th Jan'15 & got my product delivered on 4th Feb 15. It's awesome but the problem was in the font camera & key section. The front facing cameras picture quality is ok but when i press the capture button its not taking the photo immediately it captures the photo after 5-6 seconds.The second problem is very bad response from the volume rocker buttons. So, i requested for replacement on 5th Feb 15 accepted by flipkart. Lets see how fast flipkart sovles their customers problem.",
            "date": "06 Feb 2015",
            "name": "Anindya Bhatta...",
            "stars": "4 stars"
        },
        {
            "comment": "I got my correct order with safe and secure but as a customer i do not like your packing please improve it",
            "date": "06 Feb 2015",
            "name": "Sandeep Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "Have been using this phone for more than a month, okey with it. VE Popints. 1. Very Good display 2. Very Good Camera quality, both front and back. 3. Speaker is good quality. 4. Call quality is fantastic. 5. Updated with Lolipop... really good one. 6. GPS and Google maps really work owsem. -VE Points. 1. Battery backup with standard use is not that good. It last for max 12 to 15 HRS with standard use. 2. Charger is 0.5 AMP, it takes minimum 3.30 HRS to get full charge. 3. Good to run basic applications, cant run more on it. it really get slow. 4. It hangs some time, have to restart the phone for that. 5. Cant remove the battery as well. 6. Cant keep customized wallpaper for Lock screen and home screen, have to use a common one for both lock and home screen. Out of 10 i rate it near to 7 points. But trust me far better than samsungs..",
            "date": "06 Feb 2015",
            "name": "Ritesh Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "YOU CANNOT PURCHASE A PHONE BETTER THAN THIS AT THIS PRICE, AND THE LOLLIPOP UPDATE IS GREAT.RAM USAGE GREATLY REDUCED.",
            "date": "06 Feb 2015",
            "name": "ANANG HARSH",
            "stars": "5 stars"
        },
        {
            "comment": "Appreciate Flipkarts service. was delivered in the mentioned timeline, the best part is you don't have to keep cash with you while the time of delivery as they bring the ATM scratch machine along with.",
            "date": "06 Feb 2015",
            "name": "kushal agrawal",
            "stars": "4 stars"
        },
        {
            "comment": "I have Two 1st Generation Moto G, Two 2nd Generation Moto G, & Moto E, All phones are well built & durable, Speakers are Loud, Good for Youtube Videos without handsfree. 2nd Generation after exchange after cashback with 2mths. 3g data,Cost me 8500 rs. Flipkart Best Online website. Motorola replaced Nokia.",
            "date": "06 Feb 2015",
            "name": "Amit Arora",
            "stars": "5 stars"
        },
        {
            "comment": "I was using Samsung S Duos 2 for the past 1 year and though I was a bit hesitant to change it, I am happy I bought Moto G 2nd Gen. Amazing phone really!! Easy to use and comfortable in your hand. Also fits easily into your pocket. Added to that the pure android OS makes it even better. The screen is also good and can text using single hand. Light weight and feels amazing to handle. If you are looking for a phone in the 12k price range, this the best one to buy!!",
            "date": "06 Feb 2015",
            "name": "Phaneendra U M",
            "stars": "5 stars"
        },
        {
            "comment": "I bought it 4 months back for my DAD. I am a Samsung enthusiast but same old design of Samsung are coming. You will not understand which model is which???!!!! Now coming back to Moto G 2nd Gen. After a setback from International market Motorola managed to launch a phone which grabbed a mass market all over the world with Moto E, G & now with Moto G2 & X2. This phone comes in Mid-Priced mobiles. Its looks are very good & its back cover gives a nice grip too. Just few days ago Moto rolled out Lollipop update for all mobiles and it good and faster than Kitkat at least I feel the same. It comes with raw OS so you will miss out some important apps like flash light etc. which you can download from Play Store. I will not go in technical details; but its display, color recreation & video output is really good. Also display comes with Corning Gorilla Glass 3.0. With 2 front speakers it not a loud phone but speaker volume is good. & in box head phones are waste.. do not use you will feel pain after some time... Specially camera of Moto G is awesome & it can capture good details in day light but you will observe a little noise in night shots. Its flash is power full. This phone can handle lot of games like Fifa 14, Real Racing 3, Asphalt 8... Minor heating is observed after some game play. All in all its a great phone to buy under 15K... Cheers to Moto :-)",
            "date": "06 Feb 2015",
            "name": "Rakesh",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought this product 1 months before from FK. Upgraded to Lolipop and its works fine. No issues at all.. PROS 1. Great display 2. Good camera quality,use HDR mode to get colourful pictures. 3. Stereo Dual speakers works well 4. Good Battery life (20 hours almost) turn off location service,auto sync,wifi,blue tooth, etc if not required. 5. Lolipop upgrade is available. 6. No lags even after opening 10 applications at a time If you face any issues just google it. Its only because of any bad configuration settings. change it and enjoy... No problems for the phone at all... Buy it and Enjoy it...",
            "date": "06 Feb 2015",
            "name": "Rahul Chandran R",
            "stars": "5 stars"
        },
        {
            "comment": "It is awful that despite being a smartphone a simple voice recorder is not available. I am told by Moto G support that they will not support any third party app as well.",
            "date": "06 Feb 2015",
            "name": "Sudip Bhowmik",
            "stars": "1 star"
        },
        {
            "comment": "I have bought this device by AXIS card EMI on 29th January though I received it 2nd February. After unapacking it when I started and connected with internet it showed the much desired Lollipop update. Before and after the lollipop update the experience is superb with this mobile. I have upgraded to this mobile from Moto E.. Really hats off to Moto for giving us such sweet experience.",
            "date": "06 Feb 2015",
            "name": "Shayan Podder",
            "stars": "5 stars"
        },
        {
            "comment": "Have been using the phone now for about two months. 1. Battery life is terrible even on 2G, with wife/ bluetooth off. 2. Extremely slow and hangs at least twice a day (both on Lollipop and the earlier version) 3. I used the Moto E for 8 months which had a fantastic battery and performance and upgraded to Moto G (2nd Gen) thinking this was a step up, but it isn't. I can't move back to the Moto E because the onboard memory is insufficient for most basic apps. I regret buying this, and because of this I do not have the confidence to buy the Moto X.",
            "date": "06 Feb 2015",
            "name": "SSS",
            "stars": "1 star"
        },
        {
            "comment": "Better than any other phone in this price range... Reliable and Quality product.. With latest andriod version.. Great camera quality..",
            "date": "06 Feb 2015",
            "name": "Ganesh Dalal",
            "stars": "5 stars"
        },
        {
            "comment": "Camera : Good Touch : Good Battery : If we use 3g it gets half in just a hour. But generally lasts for a day. Screen : Touch interface is very good and I have'nt fixed any screen protector till now. Apart from battery the phone is real awesome !!",
            "date": "06 Feb 2015",
            "name": "Palamadai Balaji",
            "stars": "4 stars"
        },
        {
            "comment": "Convenient to use, easily got the upgrade of Lollypop (Android 5.0), just fine on apks bundles, best one is Assist, nice to hold in hand, good utilisation for screen size, is smaller than other 5.0 inch phones, till now has not given me any worries.",
            "date": "06 Feb 2015",
            "name": "Lalit Grover",
            "stars": "5 stars"
        },
        {
            "comment": "Pros:1.Looks beautiful. 2.nice speakers. 3.smooth running. 4.nice pictures by cam. cons: 1.battery backup",
            "date": "06 Feb 2015",
            "name": "Shekar",
            "stars": "5 stars"
        },
        {
            "comment": "Using this mobile for quite some time (3-4 months). I found its the best branded mobile you can have in this budget. Recently i updated it to LOLLIPOP. Its now coolest mobile i ever had. I have used samsung galaxy series, Nokia Lumia, Experia. i found this one is the best.",
            "date": "06 Feb 2015",
            "name": "Manas Ranjan",
            "stars": "5 stars"
        },
        {
            "comment": "First of all I would like thank Flipkart for their prompt one day delivery. I was looking for a phone wherein i was not ready to spend too much money on the phone since the prices keep fluctuating in the market day by day and at the same time was looking for a exchange of my Samasung Galaxy Y. Flipkart was kind offering this product with an exchange along with 10% discount on HDFC card which is a cracker. Now over to the phone: This is a 5 inch display phone with Gorilla protective glass which is scratch proof resistant. It comes with KitKat OS and i have already upgraded to Lollipop. The battery backup is not very useful as claimed by the manufacturer unless not continuous browsing, watching videos or playing games. If none of these are used, the battery can be easily managed for 1.5 days. Its a RAW android and display looks just fine. The camera is crisp and clear though it does not have Image Stabilization, so expect pictures to be blurred or grains under low light. It does not hang, and sometimes it heats up which is quite normal in any phones for that matter. The battery is not detachable and will need to be taken to the service center for replacement. The packing of this material was awesome, thanks to Flipkart.",
            "date": "06 Feb 2015",
            "name": "Prasad S",
            "stars": "4 stars"
        },
        {
            "comment": "Great feature, attractive look, updated lollipop. Phone, Camera, Music, Video works fine. No issue found till now. Thanks FlipKart.",
            "date": "06 Feb 2015",
            "name": "pankaj khedekar",
            "stars": "5 stars"
        },
        {
            "comment": "It is 5 months old and still working with good condition. I like the way it respond to touch event. Good picture quality. Just go for it",
            "date": "06 Feb 2015",
            "name": "Mahavir Munot",
            "stars": "5 stars"
        },
        {
            "comment": "Bought it for my father. extremely good phone with most of the top end features and pretty economical too.",
            "date": "06 Feb 2015",
            "name": "Kunal Bhandari",
            "stars": "4 stars"
        },
        {
            "comment": "MUST BUY IF YOU TRUST MOTOROLA BRAND NEVER DISAPPOINTED ME TILL DATE NEVER HANGS AND ALWAYS YOU GET THE UPDATES ASAP...",
            "date": "06 Feb 2015",
            "name": "Dipen Gala",
            "stars": "5 stars"
        },
        {
            "comment": "Worth to buy. Having great features and very Handy. At this price, it is giving you all the things which require by one normal user.",
            "date": "06 Feb 2015",
            "name": "Akshay Shah",
            "stars": "5 stars"
        },
        {
            "comment": "Display,Sound quality,processor and camera quality are awsome..... battery will drain at end of day...after using net,gaming ,music player and all.... so enough in 13k...",
            "date": "06 Feb 2015",
            "name": "Komal Pandya",
            "stars": "5 stars"
        },
        {
            "comment": "I bought a MOTO G 2nd gen. from flipkart around 2 months ago.Last week the phone got shut down by itself and it's not turning back on.I tried rebooting it but that didn't work either. I will be publishing this in the newspaper if I don't get a reply from you guys within 24hrs.",
            "date": "06 Feb 2015",
            "name": "Kashif Ahmed S...",
            "stars": "1 star"
        },
        {
            "comment": "Very nice phone in cheaper prize .. LIKE IT, With lollypop version battery back up is also very good ..",
            "date": "06 Feb 2015",
            "name": "pranav Patil",
            "stars": "4 stars"
        },
        {
            "comment": "within 4 month it has 2 problems. once it stoped working and switch off and its sim slot 2 not working...",
            "date": "06 Feb 2015",
            "name": "amol",
            "stars": "2 stars"
        },
        {
            "comment": "If anyone is looking out for a phone, then this is the one which you have to go for. Amazing build quality, looks good, battery lasts decently longer than the other droid devices, touch sensitivity is good, and you get android updates faster than any one else. Being a stock android, performance of the phone is a lot better. And the best part is it isn't that costly.",
            "date": "06 Feb 2015",
            "name": "Suhas Gopalkri...",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome product Again a wonderful service from flipkart. Very professional. Moto G is great tech product with this price",
            "date": "06 Feb 2015",
            "name": "Rajeswar",
            "stars": "5 stars"
        },
        {
            "comment": "got the product within 22 hours... awesome delivery...very good work by Ws Retail.................................................................",
            "date": "06 Feb 2015",
            "name": "Arul Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is fast not because of its hardware but because of its software. The stock android interface is no nonsense and ultra light. It may not respond to blinks and blows but using regular features of a smart phone like calling, messaging, browsing, etc. is visually unappealing but super fast. For those who understand motorcycles, it's like riding a two stroke. Light, fast and fun to use. Overall the phone feels premium and worth a lot more than what it costs. So here are the ratings comprising Average, Good and Very Good. There's nothing explicitly bad about this phone. Hope this helps: Build Quality: Very Good Features: Good Speed: Very Good Camera: Average Sound: Average Display: Average Battery: Average Value for Money: Very Good",
            "date": "06 Feb 2015",
            "name": "Ruhshaad Daroga",
            "stars": "4 stars"
        },
        {
            "comment": "first of all thanx to flipkart for its packing & delivery,recieved the device within 48hours..:) moto g(2nd generation) is fabulous mobile within this price range..you can surely go for it..much better den samsung n sony mobile as its a pure android..no lags..",
            "date": "06 Feb 2015",
            "name": "siddharth",
            "stars": "5 stars"
        },
        {
            "comment": "Its worth. With Lollipop OS, its make is best phone with price range. Phone, Camera, Music, Video works fine. No issue found till now. Thanks FlipKart.",
            "date": "06 Feb 2015",
            "name": "Hiren Chhatbar",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto G 2nd generation phone is very bad.Every time we get the latest updates but the phone is very bad. The phone we are receiving its self by default we are having speaker and heating issues. Another issues is also with camera and the ui is not user friendly.",
            "date": "06 Feb 2015",
            "name": "Balaji Manikantan",
            "stars": "1 star"
        },
        {
            "comment": "Flipkart you should stop selling products if you cant deliver them on time. I am not gonna order anything from flipkart ever.",
            "date": "06 Feb 2015",
            "name": "Ashish Customer",
            "stars": "2 stars"
        },
        {
            "comment": "So after a much deliberation to get Nexus 5 or Moto G 2nd Gen, I have gone ahead with Moto G(due to budget constraints , lol). Flipkart got the phone to me one day in-advance than the promised date which is like a happy thing for me. The phone looks awesome, looks big and slim shaped, beauty of the Front cam is an asset to the phone. Rear Cam is obviously great not to forget. As soon as I loaded it up, it alarmed me that Lollipop is ready for upgrade. So I used to kitkat version for sometime to explore it was good and immediately upgraded to Lollipop. It was simply awesome. Loved the new look. Coming to the phone, touch is super cool, performance is too good. battery is what I will have to really check as today is the first day. So, I would say this looks like a mini NEXUS 5 for me atleast :) Thanks flipkart for being an awesome ambassador for a great phone in India.",
            "date": "06 Feb 2015",
            "name": "Sreekar Achanta",
            "stars": "5 stars"
        },
        {
            "comment": "Very nice phone in budget with almost all functionality desired in a smart phone. Nice processing speed. Feel satisfied after using the product for around a month",
            "date": "06 Feb 2015",
            "name": "ABHISHEK SRIVASTAVA",
            "stars": "5 stars"
        },
        {
            "comment": "Had some battery backup issues but got resolved with the lollipop update. Rest assured this smartphone is the best deal you can get :)",
            "date": "06 Feb 2015",
            "name": "Khushal Gautam",
            "stars": "4 stars"
        },
        {
            "comment": "i search for smartphone since couple of days...my search is eneded with this phone,,,this phone fulfill my expectation...dont miss to grab it.",
            "date": "05 Feb 2015",
            "name": "ujjwal mahale",
            "stars": "5 stars"
        },
        {
            "comment": "First of all let me introduce myself, I am Venkatesh from Chennai who hasn't owned a smartphone ever before..!! I actually had to think a lot as there were too many options available for me and I had to choose the best. Meanwhile the Yureka from Micromax's Yu brand played a swirling role in my decision making. There were many, Samsung S3 neo offered by Flipkart for 12500, Redmis's, the Micromaxes, the HTC's, the Nokia's...etc etc...woosh..I had a real wobble and spin into my head..!!! I ordered one, cancelled the next day...!!! Took me nearly a month to zero it to 2 phones...!! It was Yureka or Moto G2 to be chosen..!! Quality or Quantity..? Price or After sales service...? looks or build quality..? Ram or life...? It all converged into a single point...Why wasting money into a crap which has greater specs but will have no guarantee to last longer..? I made up my mind to select this one and was not at all disappointed...!!! I initially received a product one of whose speaker wasn't working...!! i replaced it with a brand new one and runs awesome...!!! Guess what..? I received the Android 5.0 lollipop update an the same day when I received it..!!! Battery life is average I would say...will drain out real quick if u are a photo maniac and keep clicking photos all day... :-) Best suited for the people planning for their first smart phone that should last longer and should be modern and little bit of gaming..!!! Awesome build quality and beautiful design..!!! Thumbs up for this phone for it came on my birthday and its my 9th day with my buddy...!!! I love him and im sure that u will too..!!! Close ur eyes and go for it...!!!",
            "date": "05 Feb 2015",
            "name": "Venkatesh R",
            "stars": "5 stars"
        },
        {
            "comment": "Using the mobile since two months. So far no issues !! Cam were superb for which I had choosen this mobile. Battery is draining fastly even in battery saving mode ON ! Regarding this Xperia M, which I own was doing well. Overall It was good phone with a little comprimise of battery backup.",
            "date": "05 Feb 2015",
            "name": "Sri ram",
            "stars": "4 stars"
        },
        {
            "comment": "Its a very nice phone at this cost, its has all the features that higher cost mobiles has. i like it.",
            "date": "05 Feb 2015",
            "name": "Shoban Babu",
            "stars": "5 stars"
        },
        {
            "comment": "Got it for my mother, exchanged it with her old NOKIA(legedary phone)!!!great deal!!service WS retail , as always perfect!!",
            "date": "05 Feb 2015",
            "name": "ANISH PANICKER",
            "stars": "3 stars"
        },
        {
            "comment": "I am very much satisfied with this phone..... features and performance are key features Little challenge u guys face with battery backup",
            "date": "05 Feb 2015",
            "name": "Chetan Rawat",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Generation was a superb phone with great specs. Best budget mobile and it is worth for money.",
            "date": "05 Feb 2015",
            "name": "Balasundar S",
            "stars": "5 stars"
        },
        {
            "comment": "Value for money, though the processor is a bit outdated. Camera quality is good for this price range. Battery life is decent.",
            "date": "05 Feb 2015",
            "name": "Balaji",
            "stars": "5 stars"
        },
        {
            "comment": "Its great phone for the features it is offering at this price but my recommendation would be any other cell phone except this under same price range. pros :- M sure u will get hell lot of pros over web search, so skipping it. cons 1 :- Customer service is not that good and representatives are really irritating sometime. So, for those who wants to buy a phone and stick with it a bit longer time, then my recommendation would be any phone which has good customer care service history. For eg:- Samsung , Nokia, Micromax(Indian company-must encourage it) cons 2 :- You would be luckiest alive creature to have a moto g/g2 phone with no network problem. It is really really irritating to see ur network playing hide n seek mostly when u will be needing it more. So, if u have a Girlfriend who calls u quite frequently, be prepared to breakup. Cons 3 :- Dual SIM feature is another myth - It all depends on your fon that wen u will be having single working slot, dual working slot or none of the slot working. Though, switching it off will serve the purpose. Well, there are lot more but once u r done with all f d above, I don't think I have to give u any more details. Conclusion :- Take ur time while purchasing one as it is going to stick with u quite for a good time... So, be choosy of ur selection. If some extra bucks will give u satisfaction, then its worth spending on. Good Luck! Happy Buying... (Y)",
            "date": "05 Feb 2015",
            "name": "divine amardip",
            "stars": "3 stars"
        },
        {
            "comment": "Well I brought this MOTO G 2 months back, so far experience is very nice, and user friendly, with the mobile........... PRO's---TOUCH, SOUND, DISPLAY, BROWSING, GPS, DOWNLOADINGS, ARE EASY AND USER FRIENDLY, CON'S---BATTERY(GIVES A BACK UP OF 18HRS MAX IF U USE NET ALL THE DAY), CUSTOMIZATION, THIS PHN DOES NOT HAVE FILE MGR, YOU HAVE TO DOWNLOAD IT. IF COMPARED TO SAMSUNG'S AND MICROMAX.................I THINK THIS IS REALLY A PHN WITH BOTH SOFTWARE AND PRICE BUDGET I WILL GIVE IT 9/10",
            "date": "05 Feb 2015",
            "name": "MANOJIT",
            "stars": "4 stars"
        },
        {
            "comment": "The feel of the Phone is not that good as per expetation... I bought this one for Dad. Not satisfied. Samsung is Better. Or go with Sony. Does not support regional langauge",
            "date": "05 Feb 2015",
            "name": "Trupesh",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart was excellent as usual. The phone itself has by now been reviewed to death. Lollipop looks nice on it, though does tend to make it lag just enough to be noticeable. An excellent phone for a not-so-demanding user.",
            "date": "05 Feb 2015",
            "name": "Animesh Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "i gave motog to service, 2 times for repair 1st problem was hanging 2nd was battery drain problem. wasnt able to switch on :(",
            "date": "05 Feb 2015",
            "name": "Delson",
            "stars": "2 stars"
        },
        {
            "comment": "I got defective piece. All these days I was thinking it is a setting, but got to know from my friend that it is defective piece.",
            "date": "05 Feb 2015",
            "name": "Praveen",
            "stars": "1 star"
        },
        {
            "comment": "Product was very good and i loved it. but price was little bit costlier, apart from this performance and clarity, looks was very nice.",
            "date": "05 Feb 2015",
            "name": "Sudeep N",
            "stars": "5 stars"
        },
        {
            "comment": "I gifted this phone to my brother and he loves it. For the first time i see him not complaining about battery life and hang problems he suffered in his other phones. I would suggest people to buy this phone if they are looking for the best phone within budget.",
            "date": "05 Feb 2015",
            "name": "Annu Verma",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the phone from flipkart and got it in mint condition. The packaging was very good. I also bought a motoshell flip cover which was equally prime in quality. Now coming to the review. The phone looks just brilliant and has smooth curved edges. It has got a non-removable battery, but that is not an issue for me. We hardly replace batteries for our smartphones, we just buy a new one!!! It ran on android kitkat but later I got the lollipop update and I am using that now. I have used the phone for a month now. No crashes and misbehaving UI for me as I have seen in certain forums about Moto G. The charger is just a beauty. It is sleek and white in colour and always does its job. It gets a bit hot while charging but it is not like it will melt and go out of order. I am using the phone without any clumsy screen guard (I have the motoshell for that :-)) and till now the screen is jet black and without any scratches. The HD display is mind boggling and it is such a joy to watch anything on the screen, whether it is playing videos or games or just reading books and stuff like that. I am in love with the digital vibrance of the display. Its too cool. Now coming to performance. Normally out of 1GB of ram 460 - 480 MB will always be free. While running some heavy weight games such as Asphalt 8 or Dead Trigger it will come down to some 320MB or so. So according to me it is quite efficient with its RAM usage. It is a joy to play games on it with it Adreno subsystem. There is not noticeable lag on the UI while entering or exiting heavy applications. Battery life (its a bit early to comment) could have been better but that is not a downside as per me. The stock headphones are not that good and does not produce good thump or bass. I would like Motorola to work on that in future iterations. There are no heating issues while playing games. I have played games for couple of hours straight, and the only heat I get is where I hold it, that is my own body heat transferred to the set. The stock android runs great and I dont like to disturb the ecosystem by installing rubbish apps. The apps bundled are enough for most of our needs except gaming which we need to download. Ofcourse there is no File manager software, which is a downside slightly to this awesome product but you can use freely available ES Explorer or Solid Explorer for this purpose, not a big deal. The speakers are awesome and generates stereo quality sound. I am not deterring you from buying Micromax Yu or Redmi mobiles, but there have there fair share of problems albeit the low price, but Motorola has got it perfect this time with Moto G. I would like them to add 4G LTE to future models though. Hope you find this review helpful. Thanks and do but it without second thoughts. You wont regret it :-) :-) :-)",
            "date": "05 Feb 2015",
            "name": "Aritra Chatterjee",
            "stars": "5 stars"
        },
        {
            "comment": "now feeling better with this product as the product is very nice. touch -very good sound-amazing display-very good connectivity-very good and lollipop made extraordinary this phone.. VERY GOOD PHONE......THANKS MOTO",
            "date": "05 Feb 2015",
            "name": "PRABHAT KUMAR...",
            "stars": "5 stars"
        },
        {
            "comment": "Despite the lofty claims, i was issued a defective piece by flipkart with dead pixels and wobbly power and volume buttons. Even the battery life seems to be erratic. I have requested a replacement but this incident has dented my trust in motorola and flipkart.",
            "date": "05 Feb 2015",
            "name": "K B Vishnu",
            "stars": "1 star"
        },
        {
            "comment": "good looking phone its value for money phone nice performance and now its lolly pop operating system update",
            "date": "05 Feb 2015",
            "name": "mahesh",
            "stars": "5 stars"
        },
        {
            "comment": "good features in this range.which full feel all requirement... it is most nice looking phone very slim..",
            "date": "05 Feb 2015",
            "name": "Dipam J shah",
            "stars": "5 stars"
        },
        {
            "comment": "awesum mobile... lolipop update is awesum.. but not showing punjabi.. i used this mobile from 4 month.. backup of mobile is gud.. i think it is the best mobile in this range",
            "date": "05 Feb 2015",
            "name": "Gurpreet singh",
            "stars": "4 stars"
        },
        {
            "comment": "Good buy this one. Most features are in the phone, except the Video call facility. The phone was bought by me in exchange of an old phone at Rs.10,000/-.",
            "date": "05 Feb 2015",
            "name": "Anurag Jaiswal",
            "stars": "4 stars"
        },
        {
            "comment": "Keeping it simple, Sound is good, Build quality way better than Samsung, is fast and got lollipop upgrade with none of the bugs as far as I have used. Definitely recommended.",
            "date": "05 Feb 2015",
            "name": "Nisheet Lall",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile is good worth for the money, Battery backup is 1 day. Overall its a good mobile. Initially I got a defect piece, within 48 hours got new mobile by replacing. Flipkart is doing a great job and prompt service. Really Appriciate flipkart !!",
            "date": "05 Feb 2015",
            "name": "Shrikrishna",
            "stars": "5 stars"
        },
        {
            "comment": "such a brilliant mobile it is moto g (2nd gen), its battery obviously a small. I will simply recommend this rather than very high-end phones .",
            "date": "05 Feb 2015",
            "name": "RaviKumar Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Brought moto g 2 about a month ago and very satisfied with its performance. PROS: Got official lollipop update 5.0.2 Gives around 12 hours of battery life with 3G network. Camera quality is good with very good flash, awe sum sound quality along with screen resolution. Play high end games like asphalt, and front line commando easily (Can crash one or two times) Internet Browsing speed is decent. Call quality is good with good noise cancellation CONS: Takes lot of time to charge Headphones provided along with handset are of low quality. No Data cable provided with accessories. Over all a very good budget phone under 13K, a must buy Product.",
            "date": "05 Feb 2015",
            "name": "Pal",
            "stars": "4 stars"
        },
        {
            "comment": "4 star only because of the battery life. rest its best in its range. the quality of build is perfect in comparison to sam price samsung, sony and htc phones, it lives up to the motorola brand name.",
            "date": "05 Feb 2015",
            "name": "Amitesh Rai",
            "stars": "4 stars"
        },
        {
            "comment": "I was looking for a smartphone for a long time and wanted to settle after careful consideration. Finally, i decided to bank upon MOTO G2. First of all, Flipkart services were great with delivery within 2 days (including a sunday). The phone is great to use. Pros: 5\" screen Great camera clarity Speaker system Smooth surface Quality of screen guard is so good that even after 2 months, i still have the same one on. Cons: No basic file explorer (thats with kitkat) Should have provided additional data cable( thats with Moto and not with the phone) 2070 mAh battery not enough for this smartphone. also , i got lollipop update and proud user of Moto G2 now.. must go for it ... Flipkart is the best...",
            "date": "05 Feb 2015",
            "name": "Himanshu Arora",
            "stars": "5 stars"
        },
        {
            "comment": "phone with all good features camera is outstanding got this phone in 8099/ in exchange of old phone app offer 10% less in hdfc cardthis was very good deal for me",
            "date": "05 Feb 2015",
            "name": "sunil soni",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, It's nice phone by look and features. I upgraded it to android L. The performance has been improved much. Go for it. Thanks, Sumit",
            "date": "05 Feb 2015",
            "name": "Sumit Chaurasiya",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased Moto G(2nd gen) on Oct 2014. From the begining iam faceing battery draining issues, recently it is more. Without using anything in the phone battery drains quickly.Flipkart washed their hands by asking me to go to service centre. Very bad product dont buy it",
            "date": "05 Feb 2015",
            "name": "na",
            "stars": "2 stars"
        },
        {
            "comment": "Mobile is very good. I got the all accessories except handset with battery.Is data cable would come with Moto G(2nd Gen) mobile",
            "date": "05 Feb 2015",
            "name": "Srikanth Borra",
            "stars": "4 stars"
        },
        {
            "comment": "I am using Moto G2 for six month. although application opens fast but The display and battery life is very bad. I moved now to tizen samsung Z1 (Rs 5500/- only) good battery, display and smooth OS.",
            "date": "05 Feb 2015",
            "name": "sourav kar",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G2 is pretty fast. Only major problem I am facing is quicker battery drain while wi-fi on, So I genenrally have to keep wi-fi off and use it only when required. Otherwise phone is fantastic. Camera fast and great, Android lollipop is awesome; I like the phone very much. Good buy.",
            "date": "05 Feb 2015",
            "name": "hardik ghunchala",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased this for my frnd...and seems to be working fine and of course its Motorola brand , so they kept build quality also in mind. However, it's getting heated from backside sometimes, that's y I'm giving 3 star to it otherwise i could have given 3.5..",
            "date": "05 Feb 2015",
            "name": "Sabir",
            "stars": "3 stars"
        },
        {
            "comment": "A very good product for a very good price. Thanks to Flipkart for bringing in such a good phone. The best part is the delivery service which is faster than any courier service in India. Thumbs up again…",
            "date": "05 Feb 2015",
            "name": "John De Silva",
            "stars": "5 stars"
        },
        {
            "comment": "Its the Best phone in this range and Nothing Gets better than this... The UI is one of the best along with the Camera performance. The Upgrade to 2nd Generation has been great.",
            "date": "05 Feb 2015",
            "name": "Parag Shah",
            "stars": "4 stars"
        },
        {
            "comment": "20,000 rupees spec phone at just this price....Legendary Moto Piece it is ! . . .",
            "date": "05 Feb 2015",
            "name": "Dhaval Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen @13k is a steal deal, it doesn't feel like a device of any less value than 18k. The display is amazing, built quality is top class, feels sturdy, the interface is impeccable. Supplied accessories are rubbish but they should have made the charger detachable (it is fixed, means no USB cable supplied, you have to buy or use old spare ones). But for the price I don't think it leaves anything to complain for. Hat's off to Moto for bettering a remarkable 1st gen device into an object of awe!",
            "date": "05 Feb 2015",
            "name": "Soumyadeep Roy...",
            "stars": "5 stars"
        },
        {
            "comment": "just 3 days in use... got by one day shipping... thanks for speedy processing by WS retail.... however, i am disappointed by the pack... expect the phone.. nothing else impressed me... non usb charger, outdated headphones... do we really get the worth of 13 k comparing Asus Zenfone 5...(actually i own one too... that one is way more superior in terms of product packaging) .. let me share more feedbacks on use...",
            "date": "05 Feb 2015",
            "name": "Emmanuel Vincent",
            "stars": "3 stars"
        }
    ]
}
