{
    "filpkart": [
        {
            "comment": "Great deal on exchange. Happy with the phone. Works perfect. Recommended!! (for those who are looking to buy motoG 2nd Gen)",
            "date": "10 Jan 2015",
            "name": "Deepal",
            "stars": "5 stars"
        },
        {
            "comment": "I am happy with this product ,got a 1 day delivery :) thanks flipkart :D",
            "date": "10 Jan 2015",
            "name": "Prajal Patel",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is even better than higher end mobiles,, both front and rear camera have better picture quality is superb ... but the option are less :( .. otherwise its a great mobile in the price !!!",
            "date": "10 Jan 2015",
            "name": "glarance",
            "stars": "5 stars"
        },
        {
            "comment": "he moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "10 Jan 2015",
            "name": "Kiranmai Malle...",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for 3 months now.Its far better than any other phones of this price range :) found many advantages like good sound effects and battery backup. All games are running smoothly without any heating problems.But i found that sometimes there is an echo during calls. Thats it :) Go for black one,its looks good (y)",
            "date": "10 Jan 2015",
            "name": "ihsan faseel",
            "stars": "4 stars"
        },
        {
            "comment": "Delivered before the expectation. Camera is fine. Manageable Battery backup two days on normal usage Picking distant wifi signal pretty well. Over all its a good phone. Reliable and trust worthy.",
            "date": "10 Jan 2015",
            "name": "Bhabani Ranjan...",
            "stars": "4 stars"
        },
        {
            "comment": "best phones, amazing featueres,camera is good,battery is also good, sturdy, reliable product... go for it folks... :)",
            "date": "10 Jan 2015",
            "name": "Varun Arya",
            "stars": "5 stars"
        },
        {
            "comment": "3000mH battery would do good for this phone.. the current battery SKS. The performance is good.. i play FIFA 15 and 14 with out any delay or obstacles...",
            "date": "10 Jan 2015",
            "name": "Bathula Sansi",
            "stars": "1 star"
        },
        {
            "comment": "1.First hats-off to the delivery by giving within 2 days with a huge surprise. 2.The Phone Is working Perfectly and all the features are awesome. 3.Just go for it don't be afraid you have Warranty.",
            "date": "09 Jan 2015",
            "name": "Aranganathan C...",
            "stars": "5 stars"
        },
        {
            "comment": "Good product to buy....battery is OK....in-built storage is amazing to say the least....speed of operations is great....both front & rear cameras are excellent....only catch is sound volume is very high....people around you can hear what you are saying over the phone; to summarise, great purchase as a budget phone on Android platform",
            "date": "09 Jan 2015",
            "name": "Suman Mukherjee",
            "stars": "4 stars"
        },
        {
            "comment": "Is anyone facing RAM management issue while playing games like Asphalt8. While playing this game suddenly black screen for a while appears and it closes. I saw few android devices with 1 GB of RAM but still Asphalt8 is running smoothly. Don't know what's the problem with Moto G 2014. If anyone facing same please reply...",
            "date": "09 Jan 2015",
            "name": "Rajeev",
            "stars": "3 stars"
        },
        {
            "comment": "Using it since 1 month. No complaints. It fit my budget. I required, whatsapp, linkedin, emails, gmail, calendar, good camera, optimum speed (1GB RAM), enough memory (16GB), good sound resolution, smooth screen (IPS display), durable screen (corning gorilla 3), alarm clock, good looks, smooth User Interface, non-Samsung but good budget phone., 9 hours battery back up. It gives all. Best phone in 13k range. You don't need anything else.",
            "date": "09 Jan 2015",
            "name": "Swapnil Desale",
            "stars": "4 stars"
        },
        {
            "comment": "5 Advantages: 1. Crystal Clear Display Quality. 2. Anywhere touch Camera 3. Pure Android OS 4.4.4 4. High watt improved LED Flash 5. Supreme Design 1 Disadvantage: For opening the Back Cover is Risky. A little Cutting edge is required",
            "date": "09 Jan 2015",
            "name": "Chandan Manna",
            "stars": "5 stars"
        },
        {
            "comment": "nice product I am satisfied with the overall quality of this product. cons: even with two speakers sound is less camera is not too good.",
            "date": "09 Jan 2015",
            "name": "Deepak Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "best phone ever...!!!!! must go for it (Y) 1.GOOD AND FAST PROCESSOR - NO LAG 2. CALL QUALITY TOP NOTCH WITH NOISE CANCELLING 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY.",
            "date": "09 Jan 2015",
            "name": "Harsha Mahendrakar",
            "stars": "5 stars"
        },
        {
            "comment": "Look and Feel is very good. Performance is awesome. Worth for Money. Pro's: Performance Android Update Battery Backup Con's: Not all games are supported.",
            "date": "09 Jan 2015",
            "name": "Murali R",
            "stars": "5 stars"
        },
        {
            "comment": "My mobile screen broken and flipkart replaced it with new one. I'm very happy. Delivered much earlier than expected. Awesome service from FlipKart :-)",
            "date": "09 Jan 2015",
            "name": "Badri",
            "stars": "5 stars"
        },
        {
            "comment": "Today am so happy with Flipkart Great service and prompt delivery, and quality products, I thank full to flipkart once again to resolve my problem ..lot of thanks, best wishes to flipkart.",
            "date": "09 Jan 2015",
            "name": "g. ravinder",
            "stars": "5 stars"
        },
        {
            "comment": "Superb phone with great camera quality, user interface is so good. Easy in playing games. But a bit less battery backup.",
            "date": "09 Jan 2015",
            "name": "Anshu",
            "stars": "5 stars"
        },
        {
            "comment": "Its good looking and easy to use................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "09 Jan 2015",
            "name": "Ajith Mohan",
            "stars": "4 stars"
        },
        {
            "comment": "Full Paisa Vasool...!! Much Much better than recent Samsung Phones. Smooth..nice to operate..Recommendable..!!!..Go for it..dont think.",
            "date": "09 Jan 2015",
            "name": "Abhishek Thopte",
            "stars": "4 stars"
        },
        {
            "comment": "lovely so much features and a great experience its a half nexus 5. i must say the camera is superb and can outnumber many digi cams.",
            "date": "09 Jan 2015",
            "name": "NICHI KAMAL",
            "stars": "5 stars"
        },
        {
            "comment": "I Have orderd 7 Motorola Mobile form Flipkart. Excellent quality. Attractive features. Up to date Android operatin system. Awsome Battery Backup",
            "date": "09 Jan 2015",
            "name": "Abhi Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Overall Good to use and UI is excellent ,camera is good and finally worth for the money. And i ordered on Wednesday i got in Thursday fast delivery thanks to flipkart",
            "date": "09 Jan 2015",
            "name": "SATHYA G",
            "stars": "5 stars"
        },
        {
            "comment": "Great product a truly value for money... COns: Battery life is one day Pros: Good speed , RAM and Processor speed good, phone does not hang and I can download and use multiple sessions effortlessly. Touch is responsive and screen contrast is quite good. In short if you are looking for value for money ..go for it.",
            "date": "09 Jan 2015",
            "name": "Dev B",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing phone given its cost...was supposed to receive Android L update but is yet to...Also phone has been showing a little lag post two months of usage...",
            "date": "09 Jan 2015",
            "name": "Akshay Tandon",
            "stars": "4 stars"
        },
        {
            "comment": "A very good mobile with all its functionality. Battery, Performance, Look Etc. I will prefer this one over other same budget mobiles. Camera quality is very good.",
            "date": "09 Jan 2015",
            "name": "Pravin Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "Good Gadget with in small budget. It works good and smooth. Sound is very nice. For Entertainment with in small budget and you will get nice features like screen size, internal memory and good processing speed. Nice Product.",
            "date": "09 Jan 2015",
            "name": "Dharmarao Balaga",
            "stars": "5 stars"
        },
        {
            "comment": "it is a very very good phone am using and enjoying i, price is also reasonable... ....................",
            "date": "09 Jan 2015",
            "name": "Pawan Rawat",
            "stars": "5 stars"
        },
        {
            "comment": "After 3 months of usage, i find some of the performance issues that certain games suddenly logs you out while playing. Not sure if the bug is in mobile or the games. But the mobile weighs heavy :( :( All other features are good.Overall I am satisfied with this mobile.",
            "date": "09 Jan 2015",
            "name": "Shree",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome Camera, Smooth Processor , Nice Touch , Awesome sound surrounding , Value for Money Go for it .....Nice Budget Phone",
            "date": "09 Jan 2015",
            "name": "Manu Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "i brought this mobile 2 months back. some time mobile heating,many times net not working.when i use battery full dry after that i put the charger ,mobile ll not on. i got this problem with in two months.",
            "date": "09 Jan 2015",
            "name": "Karhik Sushil",
            "stars": "1 star"
        },
        {
            "comment": "While charging MotoG2 with my car charger it has caused problems twice as follows 1. Once the phone did not reboot when the car charger was connected. It was just white screen. To fix this I long-pressed the phone power button for a minute it came up. (scary! - i decided of returning it) 2. Second time when I plugged out car charger it was in a loop rebooting. I just put the car charger back it came up. (scary! - fixed by itself within a min) To avoid above issues always use Moto recommended chargers :-)",
            "date": "09 Jan 2015",
            "name": "Amiya Mohanty",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart delivery service is fantastic. Its been 3 weeks since I'm using this. The phone is not as expected. It hangs for 4-5 seconds and resumes on its own, even when composing a message. The voice over phone is not so clear, as if it sounds that the other person is speaking from a hollow space, which is beating the prime purpose.",
            "date": "09 Jan 2015",
            "name": "Naveen",
            "stars": "2 stars"
        },
        {
            "comment": "Best phone in its price range. Very sturdy, like old nokia phones, good performance, camera a bit slow but good at this price.",
            "date": "09 Jan 2015",
            "name": "Avinash Srivas...",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone delivered only to discover that it drops wifi and internet connection as soon as it goes to sleep when not plugged in to power.Tried everything right from tweaking wifi settings to factory reset.I ordered a replacement and to my biggest surprise this one too had the same issue.I don't know about others but i am never going for moto again.",
            "date": "09 Jan 2015",
            "name": "kunal ravi",
            "stars": "1 star"
        },
        {
            "comment": "I got most of the features from this phone which I could get only in the costlier phones. I had to, however, sacrifice the language omission - I could not read Gujarati with this phone. Language support only for Devanagari scripts (Hindi/Marathi). The phone is quite fast and after using Samsungs it was a pleasant change. Highly recommended. Had it enabled me to read Gujarati I would have given it 5 stars.",
            "date": "09 Jan 2015",
            "name": "Umang Dholabhai",
            "stars": "4 stars"
        },
        {
            "comment": "I HAD BOUGHT A NEW MOTO G FROM FLIPKART AND IT WAS NOT EVEN WORKED FOR ONE WEEK AND THE MOBILE WAS HEATING AND CAMERA PROBLEM AND BLINKING DISPLAY.I HAD ASKED FOR REPLACEMENT AND FLIPKART HAS GIVEN REPLACEMENT.THE REPLACED PHONE WAS NOT WORKED FOR ONE DAY.THE MOBILE WAS HEATING LIKE A IRON BOX.SO AGAIN ASKED FOR REPLACEMENT.WAITING FOR THE CAL FROM THE TECHNICAL TEAM.MY BROTHER HAS ALSO HAS THE SAME PROBLEM .",
            "date": "09 Jan 2015",
            "name": "SANDEEP KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "its very good phone.. excellent value for money.. nice screen and everrything.. go for it guyzzzz.............................................................................................................................................................................",
            "date": "09 Jan 2015",
            "name": "Midhun",
            "stars": "5 stars"
        },
        {
            "comment": "I bought moto g 2nd gen 4 days back, i feel it is a good quality phone. Good specification, smooth design, and awesome display. Battery(2070 mAh) is OK (quite upset), but getting 14-18 hours in normal use.(with 2G) My rating out of 5.. - NETWORK - 2.5 - DESIGN - 4.5 - DISPLAY - 4 - MEMORY - 3.5 - CAMERA -4 - SOUND - 4.5 - SENSORS - 4 - BATTERY - 2.5 - OVERALL - 4 If your budget is below 14000 and it is for a normal use (not addicted in playing games :) ) moto g2 is GOOD.",
            "date": "09 Jan 2015",
            "name": "Binu K James",
            "stars": "4 stars"
        },
        {
            "comment": "Been using this phone for 4 months and its awesome. Battery's great as they claim, features are cool, camera's good, doesn't heat, speed's good...great job Motorola!",
            "date": "09 Jan 2015",
            "name": "Naksha",
            "stars": "5 stars"
        },
        {
            "comment": "M using this phone last 2 months. No hang issue is coming out.But Poor battery backup disappointed.more than 30 application i have installed...still working properly",
            "date": "09 Jan 2015",
            "name": "Ganesh",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this device since from last 15 days. Cons: I am quite upset with the battery performance. once i was socked when the battery drained out from 62% to 20% within 3 min of using UC Browser. i have tried all the tweak but it doesn't respond much Sterio sound is good but doesn't seems clear if played in high volume. Not able to play ppsspp games. RAM shows only 851 MB. Pros: Touch is very smooth. never realized lag between switching apps and in multi tasking.. Supports OTG. Anyway i don't feel any major issue except battery performance. if this can be resolved then I would never mind to give 5 star to this phone.",
            "date": "09 Jan 2015",
            "name": "Jitendra nanda",
            "stars": "3 stars"
        },
        {
            "comment": "d phn iz gud its camera iz just aswm i lvd it ........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "date": "09 Jan 2015",
            "name": "vishal patil",
            "stars": "5 stars"
        },
        {
            "comment": "First of all I would like to confirm that You made a right choice 1. Screen: Nice, crisp and vivid, but only 720p. With Snapdragon 400, I guess 720p makes more",
            "date": "09 Jan 2015",
            "name": "MUKESH SINGH RANA",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart Excellent Service and Fast Delivery. At first I received defective phone. When insisted second time I got replacement and it was found great. Thanks for prompt action on replacement too.",
            "date": "09 Jan 2015",
            "name": "Mahendra Chavan",
            "stars": "4 stars"
        },
        {
            "comment": "I had bought this phone about two moths ago. This is an awesome phone, No lag ,video quality is superb , battery is good. If u want to use the fastest android phone buy this..",
            "date": "09 Jan 2015",
            "name": "Diptesh Goswami",
            "stars": "5 stars"
        },
        {
            "comment": "I got this Phone on Jan 2nd on the same of delivery i faced some touch not performing properly..but i just waited for few days to do double check..now its one week still the phone touch function not working properly and also it getting hanged sometimes..i made a request for return..am very much unsatisfied in this purchase..To note, i got this phone on exchange offer for 11k, i doubt whether i got some defective item since i got for less price not sure. Now today Jan 14th i got my replacement mobile. But this phone once i opened and started using am getting wire burnt smell in usb port and in headphone port. While charging the smell is too much. Also once i opened back cover there are some sticker marks inside the phone which doesnt look like a new product. And browsed in net about this issue, came to know many moto g2 has these issues. Hence many people requesting for return, the replacement product given to customer is not a genuine new product, its another defective product returned by another customer. Flipkart & WS-Retail & Motorola is cheating people around here. Dont buy this phone. I lost hope on flipkart bad service. No proper quality check. Now i requested flipkart for good replacement or better return my money P.S : I am a regular flipkart buyer, got many mobiles through flipkart recently i got two moto products from flipkart which works fine till now..but this moto g purchase made me unsatisfied.",
            "date": "09 Jan 2015",
            "name": "Logeshwari Shekar",
            "stars": "1 star"
        },
        {
            "comment": "The phone is apt for all my works. Not at all lags. And as it has a great camera I could capture photos all my wishes.",
            "date": "09 Jan 2015",
            "name": "Basith Basheer",
            "stars": "5 stars"
        },
        {
            "comment": "battery takes long time to charge......as compared to other phones otherwise gudd product as compared to others",
            "date": "08 Jan 2015",
            "name": "pancham",
            "stars": "5 stars"
        },
        {
            "comment": "after getting replacement for two times . the phone is not good . simply cant waste time in replacing the the product . and running to custumer service center.. and any way flipkart service is very pathitic ...",
            "date": "08 Jan 2015",
            "name": "Jagadeep Reddy",
            "stars": "1 star"
        },
        {
            "comment": "usb charger wa s not provided. May I know why this component is not along with the order. ................",
            "date": "08 Jan 2015",
            "name": "Raghu",
            "stars": "4 stars"
        },
        {
            "comment": "good look. smooth functioning. sensitive touchscreen. fast response to touch. battery lasts for days together. speakers give clear sound.",
            "date": "08 Jan 2015",
            "name": "gautam dhok",
            "stars": "5 stars"
        },
        {
            "comment": "This is my first android mobile, very much satisfied with the performance display is good very much handy camera quality is outstanding good sound quality no phone lags little problem with battery backup and also charging waiting for the android 5(lollipop)",
            "date": "08 Jan 2015",
            "name": "krishna sai",
            "stars": "5 stars"
        },
        {
            "comment": "very good........................................................................................................................................................................................................................................................................................................................................................",
            "date": "08 Jan 2015",
            "name": "nishanth kodai",
            "stars": "5 stars"
        },
        {
            "comment": "I've used both Moto G IInd Gen and Asus zenfone 5. The performance of zenfone 5, i can doubtlessly say, is much much better than Moto G IInd. The main drawback is its low RAM. Many tasks get stopped while in the background. At normal use the free RAM is about 180MB which is very very low as compared to zenfone 5 which has about 1.2GB free RAM at normal use. Also, in price factor, Zenfone 5 is much better. Camera, is also better in zenfone 5. The benchmark scores of nenamark 2, quadrant standard and others are a way much better for zenfone 5. Even zenfone 4 beats moto g IInd in benchmarks. Only in looks is moto g IInd beter than zenfone 5. Zenfone 5 looks a bit large in size.",
            "date": "08 Jan 2015",
            "name": "Shubham Rawat",
            "stars": "2 stars"
        },
        {
            "comment": "Its really worth the price we pay. Excellent product for its screen size, sleekness. Processor & RAM though less, but still doesnt feel sluggish at all during routine usage. Camera has also improved a lot over the previous version.",
            "date": "08 Jan 2015",
            "name": "Rajat Maheshwari",
            "stars": "5 stars"
        },
        {
            "comment": "The best ever ph i hav bought its really awsm ph.. i love it a lot hav no wrds to say abt it.. jst awsm..",
            "date": "08 Jan 2015",
            "name": "Andrew Lazar",
            "stars": "5 stars"
        },
        {
            "comment": "never hangs, good camera, plays heavy games well. but the battery life SUCKS, and speaker volume not much loud and brightness not enough for daylight... all in all it's an awesome phone for this price range :)",
            "date": "08 Jan 2015",
            "name": "nanak nagpal",
            "stars": "4 stars"
        },
        {
            "comment": "Buy it U Will never Regret it, although some batter life probs apart from that u will love it, no hanging, easy handling and very stylish",
            "date": "08 Jan 2015",
            "name": "shashidhar",
            "stars": "5 stars"
        },
        {
            "comment": "as I hoped , camera quality is very good still secondary camera is little slow about capturing movements of object,still quality is better both for images and videos......as ram is 1 GB and processor is 1.2 GHZ , I didn't find my phone working so smoothly , looking wise good, toch is not working too well as I supposed but still this mobile is much better than its equivalent mobile of range 10-15 000.........",
            "date": "08 Jan 2015",
            "name": "Tumul Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "The way Flipkart delivered was wonderful. A great phone in medium budget. Initial item received has little fault but Flipkart replaced with new one in two days. Total experience with Flipkart was great !!!",
            "date": "08 Jan 2015",
            "name": "Durgaprakash B...",
            "stars": "5 stars"
        },
        {
            "comment": "Absolute value for money phone.. couldn't have asked for more.. definitely much better than Samsung Note 2.",
            "date": "08 Jan 2015",
            "name": "Ashwin Kamat",
            "stars": "5 stars"
        },
        {
            "comment": "Just buy its worth it. Android Lollipop coming soon. now 4.4.4 its just amazing. So short review because I have no words to define this phone.",
            "date": "08 Jan 2015",
            "name": "Arnav Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this mobile in flipkart. What i recived on the next day is used phone. The volume control button, screen locking button is very loose. I opted for replacement. Again the same used phone. Very shame from flipkart. Finally i asked the customer care representative to give back my money. Never buy MotoG from flipkart.",
            "date": "08 Jan 2015",
            "name": "Got a used pho...",
            "stars": "1 star"
        },
        {
            "comment": "I am using this phone since 4 months, till today fully satisfied with the product. Never hanged or stopped unexpectedly. Display is fine with 720p but rich colors appears slightly dull. sound is ok, needs to improve. head phone supplied along with the equipment is very low in quality. 3G speed is good.battery back up is same like all android phones, nothing special.No file explorer you need to download it from play store.take lot of time to charge the battery, may be because of charger issues. Overall very good product at this price",
            "date": "08 Jan 2015",
            "name": "Rajesh m",
            "stars": "4 stars"
        },
        {
            "comment": "Bought it for a friend. She loved the product. Although there was echo problem in calls but then it was replaced by Flipkart with a new piece.",
            "date": "08 Jan 2015",
            "name": "Smit Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using it for a month ... as of now dont have any problem for this ...hope it goes well...as my brother purchased it and in three months its not working ... so now i am scared off.",
            "date": "08 Jan 2015",
            "name": "samyukta Majeti",
            "stars": "4 stars"
        },
        {
            "comment": "Heartfull review ..Im using this phone for 10 days.. this phone comes with all you need in budget . superb display . handy mobile . awesome features. and what not. i really liked this phone and will prefer to any of my frnds,, As everyone says the phone comes with excellent features. Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb ,, Cons main draw back to this will be battery backup..",
            "date": "08 Jan 2015",
            "name": "sai satish",
            "stars": "4 stars"
        },
        {
            "comment": "The mobile is so far good with no concerns..but only negative i found is battery backup is bad. It is not even lasting for 1 complete day. I hope this will be fixed in coming OS updates..Other than this mobile is good with standard specifications.",
            "date": "08 Jan 2015",
            "name": "Chaitu",
            "stars": "4 stars"
        },
        {
            "comment": "Nice product... Felt that the space should be more. Not able to install many applications since the space is getting filled up.",
            "date": "08 Jan 2015",
            "name": "Chaitanya Mallela",
            "stars": "4 stars"
        },
        {
            "comment": "Best Value for Money. Love the build quality and performance. It's a great phone for the price. Still waiting for Android 5.0 though and hope Motorola seeds the update soon.",
            "date": "08 Jan 2015",
            "name": "Phanindhar Kum...",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is awesome, the best feature is the battery backup, but the camera has little pixel issues. Images are not clear when you see it at a little zoom. Otherwise, this is the best phone, I have ever used.",
            "date": "08 Jan 2015",
            "name": "Avanish Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Mobile, I Totally Like It...............................................................................................................................................",
            "date": "08 Jan 2015",
            "name": "Somnath Kaduskar",
            "stars": "5 stars"
        },
        {
            "comment": "Good Product fast working very very nice Two speaker working well, all app working fast including net connection.",
            "date": "08 Jan 2015",
            "name": "PALLAVARASU.V",
            "stars": "5 stars"
        },
        {
            "comment": "AIRTEL 3G OFFER 2 MONTH FREE. BUT I USE 1MONTH. 2ND MONTH NOT ACTIVATE. PLEASE HELP & SOLVE PROBLEM MOBILE : 8220161443",
            "date": "08 Jan 2015",
            "name": "Rajesh Kannan",
            "stars": "3 stars"
        },
        {
            "comment": "Extremely happy with me decision to buy Moto G .Even presented one to my father.The delivery was made in a day.One must go for it if planning to go for a new phone.",
            "date": "08 Jan 2015",
            "name": "Sandhya Shukla",
            "stars": "5 stars"
        },
        {
            "comment": "Best One At This Price Except The Slimness otherwise all Features Are Good to go.Fell free Flip it In A cart",
            "date": "08 Jan 2015",
            "name": "Hardik Vagal",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile rocks dude....in its price range....just go for blindly.. and flipkart hands off to all ur team what a delivery within 1 day i got this product.",
            "date": "08 Jan 2015",
            "name": "Sushant",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased a Moto G 2nd Gen Mobile from Flipkart, I got the mobile on hand the next day of order with regular delivery. After 20-30Day, I started facing Network Detection Issue in my Mobile, I called Flipkart and requested for Replacement , The Next Day itself i got my mobile replaced, The replaced Phone also was having some software related Issues. NOW THEY HAVE ACCEPTED FOR FULL MONEY REFUND TO MY ACCOUNT. Flipkart did as it promised.",
            "date": "08 Jan 2015",
            "name": "Shanmuguraj K R",
            "stars": "4 stars"
        },
        {
            "comment": "It was impressive when I held the phone in my hand.But the impression lasted less than a day. The phone was not charging, atleast thats what it displayed .But next day i tried it was fine..",
            "date": "08 Jan 2015",
            "name": "Vijaya",
            "stars": "4 stars"
        },
        {
            "comment": "Using phone since 6 days. Pros -Premium look -5\" HD display -dual speakers are loud n clear -8MP camera takes amazing pictures when HDR mode is on -1 day battery backup (on 3g netowork) - fast startup and shutdown - No lag - smooth user interface -Nice grip and easy to hold Con's - Earphone quality is not good - Only sim 1 slot support 3G network",
            "date": "08 Jan 2015",
            "name": "shashank sheekhar",
            "stars": "4 stars"
        },
        {
            "comment": "It's rrrrreally sexy in this price range....also this is my first Android experience..and believe me that's too sexy!!...it seems Google and Moto is going to play an Sachin-Sourav like partnership. :)",
            "date": "08 Jan 2015",
            "name": "Saptarshi Roy",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on 03 January and I got this on 07 January. I am now exploring the new features. It would be better if provided with a screen guard which is only for 99 INR. Will be back after few days with my experience.",
            "date": "08 Jan 2015",
            "name": "Daleep Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "using dis phone for abt a week now extemely good n fast no lag in dy to day usage hv been playing hd games on it no lags screen looks beautifull totally happy",
            "date": "08 Jan 2015",
            "name": "lovelesh",
            "stars": "5 stars"
        },
        {
            "comment": "Very Good product, prompt service, fast delivery........best experience with flipkart service & the mobile",
            "date": "08 Jan 2015",
            "name": "Pradeep Wadekar",
            "stars": "5 stars"
        },
        {
            "comment": "Honest review after 1 month usage. Dont expect nethin big from a 13k fone. Its gud enuf for a normal use wid 15-20 applications as usable ram is nly 840mb nd some basic games like temple run & subway. u can run big games like fifa nd asphalt smoothly only issue is device heats up. Camera s nt dat grt bt decent. Battery s gud enuf for moderate users. Nd for me no issue wid call quality. So all in all gud fone fr 13k budget. lollipop is also gud.",
            "date": "08 Jan 2015",
            "name": "Allwyn",
            "stars": "4 stars"
        },
        {
            "comment": "Never buy moto products just scrap they are selling. Still if you buy and if you are not getting any problems with in three months I can challenge on this. Worse service and junk products. Please friends don't buy Motorola products just junk they are selling. That is the reason they are not selling directly through retail vendors. If they are selling online nobody can do anything. Just because of Flipkart reputation and Android OS they are able to sustain Indian market. not because of MOTO brand. Just Junk. People don't waste your hard earned money....I am serious please don't buy MOTO MOTO MOTO.",
            "date": "08 Jan 2015",
            "name": "Paluri Ramakri...",
            "stars": "1 star"
        },
        {
            "comment": "I buy this phone actually I ordered this phone for my father but I must say those who are reviweing this in camera quality and saying having average camera or below average , I will say the camera is not average its above average provide u a clear picture I scanned 160 pages of book through this phone and convert in pdf through camscanner the camera is best u cannot say the e-book i made through this is not clear image and that with same sony xperia zr it worst . rest about the RAM i.e; 1 GB is i thought it should be 2 GB at this price point i didn hav any issue regarding RAM but as compare to other phone below this price having same 1 GB RAM but dont face any probleb regarding graphics, gaming crash or apps or picture quality sound call quality aall are good as I give anyone to suggest to buy but more disaapointment is battery backup my father didn play games or dont have any free time to use this phone but in morging he go to office to fully charge the phone 100% and in night when he come still plug in to charges as the battery remains 50-60% or less then 30%",
            "date": "08 Jan 2015",
            "name": "Arunesh deep s...",
            "stars": "4 stars"
        },
        {
            "comment": "nice product -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "08 Jan 2015",
            "name": "Ajay Kumar Dwi...",
            "stars": "5 stars"
        },
        {
            "comment": "from the day one i am facing problem with a phone which is when i am placing a call on either of the networks, the receiver can't able to here my voice,Initially i thought its a network issue but i tried with different sim cards even i did factory reset of OS as advised by customer care and local service center but the issue not resolved.",
            "date": "08 Jan 2015",
            "name": "venkat j",
            "stars": "3 stars"
        },
        {
            "comment": "USING PHONE SINCE LAST 15DAYS 1. GOOD AND FAST PROCESSOR - 2. CALL QUALITY GOOD 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY IS GOOD AND INTERNAL MEMORY IS ALSO GOOD 16GB OK'S 1.SCREEN PPI AND COLOR VIVIDNESS COULD HAVE BEEN BETTER. 2. CAMERA NOT THAT TOP NOTCH BUT NOT COMPLAINABLE.-GOOD FOR THIS PRICE RANGE 3. FRONT SPEAKERS- MANY PEOPLE PRAISE ABOU",
            "date": "08 Jan 2015",
            "name": "Ravi Shankar",
            "stars": "5 stars"
        },
        {
            "comment": "I have buy this cell from flipkart and they deliver within two days ,good job flipkart keep it up. Coming to the phone...Its the best smartphone you get for 13k except xiaomi mi3 but that has been discontinued from from flipkart,so moto g is the best option left if you want to experience android 5.0 Pros: 1.the display is awesome ,colors are vivid look natural ,not saturated like Samsung shit phones 2.all hd games can be played flawless except modern combat 5 which lags sometimes and asphalt 8 on high graphics setting. 3.stereo speaker are the best ,but don't expect anything like htc boom sound speaker. 4.battery back up can say average, had to charge every night. 5.rear camera produces great images in outdoor condition and average on indoor,better than my previous lg optimus g which has 13mp. 6.best low light images can be capture in dark areas. Cons: 1.there are some vertical lining on my display when screen is off ,only visible in sunlight ,but does not affect while using the device. 2.lags sometimes when multiples app open in background. and i would suggest that do not put matte screen guard on this device ,screen start to look like pixelated",
            "date": "08 Jan 2015",
            "name": "Aakash pandey",
            "stars": "4 stars"
        },
        {
            "comment": "This is my second Motorola Phone. Bought this after my MOTO G was stolen. Decided to stick to the MOTO phone due to its unmatched performance and premium feel, and i am really happy with the New Moto G ( 2nd Gen). Everyone has written about the phone, so i dont think i need to mention all the pros and cons all over again. For those guys who are confused between this and Asus Zenfone 5: * Go for Moto G Gen 2, though the camera is not as great as asus, but the lifeline (battery) of the phone is great, and this can save your life in difficult situations! Experience with Flipkart Return / Service: * Sadly the phone i received was faulty ( The second sim card slot was not functioning properly and The Power button was faulty ) * I Called up on the flipkart Toll Free number and spoke to the CSR, she was really helpful and placed a Replacement request. * Within a day, i got my faulty phone replaced by a New Handset.",
            "date": "08 Jan 2015",
            "name": "Saurav Chatterjee",
            "stars": "5 stars"
        },
        {
            "comment": "I bought my phone on 28th dec 2014 and i use one sim in sim slot 1. Atfer 3 days i bought a new micro sim from vodafone and i tried to insert. But i couldn't insert. So i sim card slot 2 is not proper. So i applied for a replacement on 2nd Jan 2015. They told that they will pick the phone on 5th jan 2015. Till now no pick up of old product is not done. I called in flipkart customer care many times. But no response. Very worst service.",
            "date": "07 Jan 2015",
            "name": "Thiagarajan De...",
            "stars": "1 star"
        },
        {
            "comment": "first experience with the flipkart! Thanks flipkart for the fast service to jaipur! cheers :) Next time i need superfast service like delivering the product next day! please start this service in jaipur :) best phone good battery back up! display and camera everything is good! Five Star to flipkart thanks for making the phone available to common people.",
            "date": "07 Jan 2015",
            "name": "Suhail Pervez",
            "stars": "5 stars"
        },
        {
            "comment": "Please do not purchase this mobile phone from flipkart as you will not get service and also poor back up of mobile",
            "date": "07 Jan 2015",
            "name": "hitesh wali",
            "stars": "1 star"
        },
        {
            "comment": "This phone is great.The display is awesome and the phone works excellent.First I had doubts regarding Mtorola but now I think its the best.",
            "date": "07 Jan 2015",
            "name": "Debraj Das",
            "stars": "5 stars"
        },
        {
            "comment": "Best in this range. Battery is good. Speakers are not very good, but loud enough, but for this range, it is quite perfect.Only con is the screen, the brightness is not that good, colours are less sharp. Overall... 'Go for it, if you want a phone, with a little bit of gaming experience'",
            "date": "07 Jan 2015",
            "name": "Kinshuk Majee",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart is just awesome.I ordered this in 1st january 2014 and received today.The product is just great.If you want an pure android experience just go for this phone.However the camera quality is not so good as expected",
            "date": "07 Jan 2015",
            "name": "Arunanshu Pal",
            "stars": "5 stars"
        },
        {
            "comment": "1. Happy New Year Everyone I have been using this product for a month i ordered it on 1 december 2014 and recived it on 6 december 2014 thanks to flipkart for delivering the phone on time so first thing about the phone when you look at it is that it's build quality build quality is realy good it does not look cheap phone motorola has doen a great job with that if you are using the first gen of this phone then processing wise both are same had same chipset of 1.2Ghz qualcomm quad core processor 1 Gb ram so if you have the first gen motorola moto g don't buy 2nd gen 2.The phone has upgrades like the 5-inch HD screen but it is not full HD it is 720p HD resolution another thing it has a memory card slot which we don't have in first gen moto g and expandable up to 32GB 3.Camera performs it has 8mp rear camera and 2mp front camera rear camera is good in day light and also low light imaging is very well motorola has upgraded this camera and it is good but it takes some time to focus in artificial light front camera is good but when you take selfie's with it it produces shakey images both the camera can take video's in 720p HD and it also has a slow motion with 720p HD resolution 4.Gaming the device can handle high graphics game like asphalt 8 etc.But the phone gets heat up while playing games the stereo speakers perform very well and produce good sound 5.Display is 5 -inch HD display which has 720 X 1280 pixels resolution it is an IPS LCD screen with 5 inches in size 6.Battery is of 2070 mAh same as the first generation but is ok for this phone works all working day 7.It also supports OTG USB device very smoothly 8.Graphics are realy good adreno 305, 450MHz single core 9.Os is kitkat 4.4.4 with upgrade of 5.0 *Cons of this device are 1.First it should have atleast 1.5 GB ram 2.It should have more battery it is 15% less than the first gen moto g because of 5 inch screen 3.Front camera could have been improved 4.It some times needs more time to shift apps while multitasking 5.It's brousing speed decreases with 5-4 tabs running at a time 6.using camera for about 10 to 15 min decreases the battery percentage 7.As above mention the device heats up while gaming",
            "date": "07 Jan 2015",
            "name": "Hrushikesh Bhad",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone. Perfect, Compact and most Importantly a A Budget phone.",
            "date": "07 Jan 2015",
            "name": "Kunal",
            "stars": "5 stars"
        },
        {
            "comment": "1.value for money 2.good processor 3.good style 4.best performance 5.good camera clarity 6.best performance of light sensor 7.good battery life 8.front camera was nice",
            "date": "07 Jan 2015",
            "name": "sridharan srinkl",
            "stars": "5 stars"
        },
        {
            "comment": "My motog 2 stopped working suddenly after three months and it is still lying in the service centre for last 15 days and yet no revert from them.. Very poor service from Motorola, in fact nobody get back to you even if you complain on their help line no.",
            "date": "07 Jan 2015",
            "name": "Anil Dsouza",
            "stars": "1 star"
        },
        {
            "comment": "Over all phone is good 4 star. camera & sound quality good value for money. sometimes i feels network problem on same operator dual sim. One more major issue with the offer from airtell they people making fool to you. i am very much frustrated from airtell people for offer & finaly i have not got any data offer from airtell.",
            "date": "07 Jan 2015",
            "name": "PK jain",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is quick and wonderful. I am loving it. My previous phone was S2. MotoG2 is much better than S2. I would love to play games on this ..",
            "date": "07 Jan 2015",
            "name": "Ranga.",
            "stars": "5 stars"
        },
        {
            "comment": "What is the return policy. Whether I will get the amount credited in my account or it will be with your wallet.",
            "date": "07 Jan 2015",
            "name": "Priyabrata Patra",
            "stars": "2 stars"
        },
        {
            "comment": "As long as people can accept the larger size, I think the Moto G will again be an extremely popular smartphone for the masses who don’t want to pay three to nearly five times this amount for a new iPhone 6 model.",
            "date": "07 Jan 2015",
            "name": "CDK Global (In...",
            "stars": "4 stars"
        },
        {
            "comment": "This phone simply works, for everything. It's fast, responsive, and does everything I need. I've owned several other Android phones in the past, but this beats everything else, hands down, at this price point. My only complaint is that the phone got wet, but the repairs were not covered under the warranty. I've seen notes that other Motos (X, X2?) have better warranty coverage. Still, the repairs weren't too expensive, and the phone is as great as ever. Highly recommended.",
            "date": "07 Jan 2015",
            "name": "Soumen Basu",
            "stars": "4 stars"
        },
        {
            "comment": "I am facing problem in SIM slot. Both the SIM slot is disabled. Manu users facing the same issue in Moto G. But still Flipkart selling this product.",
            "date": "07 Jan 2015",
            "name": "Rajasekar Rama...",
            "stars": "1 star"
        },
        {
            "comment": "at 1st i was reluctant to buy it..bt trusting my instinct nd gng through a bit of reviews i finally decided to have a go...nd trust me dis phn earned my respect..a true performer and a an awesum succesor to moto g...wrth every buck spent..",
            "date": "07 Jan 2015",
            "name": "Samir Rai",
            "stars": "5 stars"
        },
        {
            "comment": "Plus: Cost Effective: Each & every penny spent on Mot G2 worth it Good Features in the Mid range mobiles Good Gaming Exp Better display & Hardware quality Minus: Not even USB is inside the box ??? pathetic Atleast reduce the size of charger & make it USB cum charger for better effectiveness Screen Guard missing in the box \"Now a days mobiles worth 5k & Above provides 2 Screen guard & USB kit along.... Some mobile manufactures even provide additional back cover \"",
            "date": "07 Jan 2015",
            "name": "Santhosh R",
            "stars": "4 stars"
        },
        {
            "comment": "Mobile is Good and amazing. Thickness of the mobile is big than moto g.",
            "date": "07 Jan 2015",
            "name": "Arun Kumar Sha...",
            "stars": "3 stars"
        },
        {
            "comment": "I BOUGHT MOTO G2 FOR MY DAUGHTER ON 19-12-2014. NOW FROM AROUND 04 JAN 2015, IT SWITCHES-OFF AUTOMATICALLY. WE BOTH ARE DISAPPOINTED. I EXPECT MOTOROLA TO REPLACE THE PHONE WITH THE NEW ONE. HIMANSHU",
            "date": "07 Jan 2015",
            "name": "HIMANSHU GOKHALE",
            "stars": "1 star"
        },
        {
            "comment": "i used this phone and i am getting this by flipkart this is good and best flipkart also best 1 marketplace",
            "date": "07 Jan 2015",
            "name": "Arun Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this damn thing on the Big Billion Day sale. Listed below are a few of the issues I've faced till date, 1. Battery - There is no idle battery time on this device. The battery drains really quickly. When I goto sleep at 12:30AM with the moto battery showing 33%, with all services like GPS, wifi and mobile data turned off, the battery goes down to 1% when I wake up at 6:30AM. 6hrs of idle time drained 32% of the battery. This battery issue is there in all moto g2 mobiles across the globe. Don't be fooled by its 2070 mAh battery, it is worthless! 2. User Experience - It hangs most of the time, and suddenly you see a pop-up of an app, which was never opened, to have stopped working! Apps like whatsapp and facebook take a long time to load and when it does, these apps hang up during the middle.",
            "date": "07 Jan 2015",
            "name": "Sweekrit P",
            "stars": "1 star"
        },
        {
            "comment": "We have order this 1st time and it was hanging. then we complained to filpkart they have repalce with another piece. its just 2 months again it does not charge. only work power plugged in. need to get support. trying to contact flipkart. no response yet. Supid Motorol Gen 2. care full when you buy this product and careful with flipkart also.",
            "date": "07 Jan 2015",
            "name": "Rama Krishna",
            "stars": "1 star"
        },
        {
            "comment": "Great phone Amazing display one of the best I've seen Doesn't lag no clashing of app Only negative is the battery is horrible last about 4 hours for me",
            "date": "07 Jan 2015",
            "name": "Adarsh Panigrahi",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is good. You get full value of your money as compared to other brand in the market. It heats up during Charging and voice is little loud.",
            "date": "07 Jan 2015",
            "name": "Vijay Bharti",
            "stars": "4 stars"
        },
        {
            "comment": "It's good to handle... the only prob is some time getting network issue... otherwise superb mobile to use.....",
            "date": "07 Jan 2015",
            "name": "Sudha Rajan",
            "stars": "4 stars"
        },
        {
            "comment": "Fantastic and wonderful in any manner that's it....Motorola always rock, It is very in sound screen processor speed,everything is fantastic...",
            "date": "07 Jan 2015",
            "name": "sumit sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Since I am a big fan of expensive phones like xperia, note, apple, and its my first moto device experience though, but let's be honest, The G's greatest asset is its small price tag. For 13000 INR, it became awfully easy to forgive the thing for not being the quickest, the prettiest or the smartest. Still, it is one that wound up being more than just \"good enough\" Flipkart is just 10/10 with its delivery stats. Awesome !",
            "date": "07 Jan 2015",
            "name": "hemendra sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Its a nice phone with value for money. I am using it for a month now and have not faced any major issues. Pros: 1. Very good battery life. Mine lasts upto 2 days with normal usage. 2. touch is really good. 3. not heavy to carry and easy to hold as well. Cons: 1. Sometimes key '1' does not work while typing.",
            "date": "07 Jan 2015",
            "name": "Aashu",
            "stars": "4 stars"
        },
        {
            "comment": "I bought Moto G2 from Flipkart.Flipkart Promised a Cashback of 5% on VISA card and they never credited it.Never buy from Flipkart",
            "date": "07 Jan 2015",
            "name": "Rahul Phatangare",
            "stars": "1 star"
        },
        {
            "comment": "Firstly, can't praise enough for the quick delivery from flipkart and in a good packing condition. I received the product on the second day itself despite ordering through normal mode. Phone umm i dont think i need to repeat the excellent features as appreciated by the reviewers below but yes in one liner, I'd say \"GO FOR IT\"! But one thing i didnt like particularly is once you double tap on the screen, you would be zommed in but you cannot zoom out through the finger style (as taught by iphone). Rest all good. Music, camera, processor, looks--- THUMBS UP!!",
            "date": "07 Jan 2015",
            "name": "Dunkin Shah",
            "stars": "4 stars"
        },
        {
            "comment": "awsome........phone, good features, nyc camera, good sound battry bckup needs to be improvd smooth touch headphones not that good nyc for gaming, videos,etc",
            "date": "07 Jan 2015",
            "name": "Sonit Sinha",
            "stars": "5 stars"
        },
        {
            "comment": "Light to use .... Fast .... Great display ... Good Camera .... Just the battery could have been more bigger (Capacity) .... Overall value for money",
            "date": "07 Jan 2015",
            "name": "Great value for m...",
            "stars": "5 stars"
        },
        {
            "comment": "Got the product the next day of order but i did not get the offer of AIRTEL 2G OR 3G DATA OFFER..the offer was there till many days after i got the phone..",
            "date": "07 Jan 2015",
            "name": "Ashik k",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome Phone but battery backup is not good with data connection i love this phone n its amazing phone",
            "date": "07 Jan 2015",
            "name": "Sapan Biswas",
            "stars": "5 stars"
        },
        {
            "comment": "Please check your device thoroughly after you bought it. I git two consequent defective products. But flipkart is good enough to return my money.",
            "date": "07 Jan 2015",
            "name": "Gowtham",
            "stars": "1 star"
        },
        {
            "comment": "I bought this mobile 3 months back. Its really awesome. previously i used samsung galaxy S4 i dont find much difference.",
            "date": "07 Jan 2015",
            "name": "Arun M",
            "stars": "4 stars"
        },
        {
            "comment": "if u want a branded mobile which u can rely on for its lifetime then go for it. u may get a xolo or micromax for this price with amazing features but the thing is it might get spoiled fast and it wont be worth the money u bought it for due to the cheap quality of components that they use. i give a star less due to the fact that its ear phone is of sub-par quality and it takes about 4 hours to charge",
            "date": "07 Jan 2015",
            "name": "Vignesh Uchiha",
            "stars": "4 stars"
        },
        {
            "comment": "Basic functionality of calling has a really poor quality. Voice breaks in almost every call. I got a replacement phone but this issue still persists for long call durations (5-7 mins). Also voice call hangs ocassionally (You call the other person but cant hear anything and vise a versa).",
            "date": "07 Jan 2015",
            "name": "Karan",
            "stars": "1 star"
        },
        {
            "comment": "handy(perfect size), sexy, good camera quality, good audio quality, very nice and sensitive touch, good user interface, avg battery back up, very bad headphones means that are too ordinary, and a good charger but the phone gets charge very slow approx 3 hrs to get full charged....",
            "date": "07 Jan 2015",
            "name": "Dhruv",
            "stars": "5 stars"
        },
        {
            "comment": "Best mobile in less price. I dont play games but I tried few and performance is good. I was waiting for xiomi but i preferred MOTO G 2ND because of service. Go for it (y)",
            "date": "06 Jan 2015",
            "name": "Vinay Rajput",
            "stars": "4 stars"
        },
        {
            "comment": "Camera quality is too good with 8 MP clicks. Adding an external memory card slot in this 2nd Gen phone has improved the value of this phone to priceless in its class.",
            "date": "06 Jan 2015",
            "name": "RAvi Patel",
            "stars": "4 stars"
        },
        {
            "comment": "I received the phone within 3 days of ordering.Great looks.And really stylish one.Camera is also very good (front and rear both). Very smooth working with no lags .Really worth the price.Kudos to Flipkart for their services.",
            "date": "06 Jan 2015",
            "name": "Jitendra Madi...",
            "stars": "5 stars"
        },
        {
            "comment": "The good thing about this is a stock android and all the feature in the product are working gr8 which rate upto 20k phone having.",
            "date": "06 Jan 2015",
            "name": "JB",
            "stars": "5 stars"
        },
        {
            "comment": "Advantages: Great Display Smooth touch screen with Corning gorilla glass 3 Well designed Its having external card slot Stock android phone Will get new updates by Android Good bulit quality Great camera Bad about phone: Speaker on front that might irritate low ram",
            "date": "06 Jan 2015",
            "name": "Abhishek K R",
            "stars": "5 stars"
        },
        {
            "comment": "I will not review the product. It is as expected. Please refer to other reviews. It meets the expectation. I opted for the 1-day delivery. I placed the order 11pm and 10am I had the handset in my hand. Prompt delivery.",
            "date": "06 Jan 2015",
            "name": "Ankur Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone lil' damaged may be software issue!! but really hats off to FlipKart Service!! Moto G 2nd is Best phone in this price!! i searched a lot but Micromax and xolo were the competitor but i have choose a good brand and satisfied with it!! Nice configuration and superb features!!",
            "date": "06 Jan 2015",
            "name": "Vipul Parekh",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on 4th Jan 2015 with \"One Day Delivery\" and till I didn't get my package delivery yet. Poor very poor service... :(",
            "date": "06 Jan 2015",
            "name": "Shakir A. Ansari",
            "stars": "1 star"
        },
        {
            "comment": "Superb Phone and packing superb, item delivery zet speed...Thanks Flipkart team............................................................",
            "date": "06 Jan 2015",
            "name": "Sreedhar Chandra",
            "stars": "5 stars"
        },
        {
            "comment": "its one good phone i ever dreamt of. its my first android phone i have used it for a week and i have no trouble regarding it. The performance is good and the only thing i would love to have is some extra battery backup. otherwise for this cost this is a quality product from moto.",
            "date": "06 Jan 2015",
            "name": "wolverine",
            "stars": "5 stars"
        },
        {
            "comment": "All expectations and performances are fulfilled as per specifications mentioned. Best buy in this range.",
            "date": "06 Jan 2015",
            "name": "Piyush Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phones from motorola with Gorilla glass with new feature that makes us to purchase with in the budget range the offered with new stylish",
            "date": "06 Jan 2015",
            "name": "Naveen E",
            "stars": "4 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "06 Jan 2015",
            "name": "Souvik Das",
            "stars": "5 stars"
        },
        {
            "comment": "Best deal for the price. Fast and good at multitasking. Battery goes only for one day. I moved from Samsung to Motorola and I feel the interface is better. Also, Samsung models are so much identical and without design innovation.",
            "date": "06 Jan 2015",
            "name": "Jayakrishnan M...",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product.Display is crisp. it is almost 2 months since I bought and no issues so far. Only complaint is, no lollypop so far, although all other motorola devices got it. Bad service on their part",
            "date": "06 Jan 2015",
            "name": "Chandrasekhara...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for my father and he was so happy to use this. Its amazing how this has transformed his life. Its easy to use and is packed with the latest feathers. Its been quite some time since he has been using this and have not faced any issue with the functionality.",
            "date": "06 Jan 2015",
            "name": "Shopper",
            "stars": "5 stars"
        },
        {
            "comment": "my gsm phone was moto yuva phone. I was used that from 2007-08 to till now it working i.e reason why buy this.this phone excellent but a draw back is it become hot while playing games and using net conitnuaously",
            "date": "06 Jan 2015",
            "name": "pratapkumar sabba...",
            "stars": "5 stars"
        },
        {
            "comment": "nicee product ...................................................................................................",
            "date": "06 Jan 2015",
            "name": "Argil Sunny",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is a good phone in its class with better than expected responsiveness but little battery life.",
            "date": "06 Jan 2015",
            "name": "gaurav gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchase new motog2 but when start 3g service and due to network changes mobile hitting very much.",
            "date": "06 Jan 2015",
            "name": "hitesh sonagra",
            "stars": "1 star"
        },
        {
            "comment": "I bought this mobile 3 months ago and I am happy with my buy. In most of my use I do not found any major lag. All the apps running where well without any problem... I am using some heavy games like Ashphalt 8 and Thor, they working without problem but sometimes games stops and quiets automatically... Pre-insatlled Chrome browser not working at all.. Breaks every time when I do search anything... Built quality is super... I dropped my mobile 2-3 times but has not any effect on screen, body or any hardware... Camera result is also good... But not that we can say very nice.... Internet over wi-fi and 3g working very nice. Screen is also very good.... Touch is very smooth and not get any scratch in general use. Speaker is very loud but not sounds well. Earplug and charger quality is not that well. Also there is no USB connector either in charger or additional. So, overall it is good phone.",
            "date": "06 Jan 2015",
            "name": "Hardiksinh Gohil",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this phone for past 6 months, and it is working flawless. Initially I had Moto G first Gen, after the Moto G2 has launched I got it replaces, coz I need extra memory, and bigger screen.",
            "date": "06 Jan 2015",
            "name": "Karan Thakkar",
            "stars": "5 stars"
        },
        {
            "comment": "Reason: 1. Less Price. 2. Camera Quality almost same. 3. Advantage of this product over that: a) Bigger ring tone sound b) Latest android version 5.0 (Asus will release in March 2015)",
            "date": "06 Jan 2015",
            "name": "phani kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Nice smartphone to recommend. Class looks, great display, Nice Camera, excellent build-quality, great voice quality... Happy with this product.",
            "date": "06 Jan 2015",
            "name": "Sajin",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. operation is smooth-Never hang . That's why 5 star. 2. camera is very good. Cons: 1. Overheated during playing games and using mobile internet.",
            "date": "06 Jan 2015",
            "name": "Product is ver...",
            "stars": "4 stars"
        },
        {
            "comment": "Believe me, go for this product without a thought. The most amazing part of this phone is the display...amazing display i must say. Though it is 720p display, it feels like 1080p and colors come out really good...really good. Though it has 1gb ram but works very smoothly. I was on the verge of buying Nexus 5 but when i saw this phone and tried it..I must say this was my best decision. Flipkart service as always..rockin.",
            "date": "06 Jan 2015",
            "name": "sunny chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "I am changing my review of this product Pros: 1. Name of moto 2. Stock Android 3. Long Battery Life 4. Lollypop Upgrade 5. Working of Phone during navigation 6. Camera quality is excellent during sun light even better than Lumia 730.",
            "date": "06 Jan 2015",
            "name": "Sumit Atolia",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 is an excellently finished phone...................... but its battery backup is very poor if data is used it lasts only 5-6 hrs only ... but a ggod phone in its price range.. i would request the user to buy sony or htc phone in comparision to this....",
            "date": "06 Jan 2015",
            "name": "rahul joshi",
            "stars": "1 star"
        },
        {
            "comment": "About Flipkart delivery: Very much satisfied with fast and safe delivery. About Phone: Pros- Slim and Handy, good image quality both front and back, smooth touch screen, good multitasking processing, battery back-up is enough for whole day full activity use, good sound system, voice recognition system is excellent, display resolution is HD so its good enough. Cons- It keeps running out of battery very fast if continuously using GPS for even 1hr, ear piece point only works for Motorola ear piece (tried with other ear piece but its not accepting except Motorola), no usb cable-charger portability.",
            "date": "06 Jan 2015",
            "name": "Lax Sethi",
            "stars": "4 stars"
        },
        {
            "comment": "a good phone in the mid range, performs well with 1.2 Ghz,1 GB RAM, sharp and clear display/screen, 5\" screen is bis !! good camera, 4.4 kikat is a good upgrade.",
            "date": "06 Jan 2015",
            "name": "sanjiv vij",
            "stars": "5 stars"
        },
        {
            "comment": "I am quite satisfied by this product. Performance is good. Camera quality is also very good. Also, flipkart delivered the phone with in 2 days..so it has been a nice experience with my first online shopping with Flipkart",
            "date": "06 Jan 2015",
            "name": "Rajiv Dhingra",
            "stars": "4 stars"
        },
        {
            "comment": "Happy with my new phone. Pros: Stylish phone with matte back cover gives firm grip and makes it easy to hold. 5 inch wide screen, good performance, good camera, In call speech is quite clear while using headphones. Cons: Battery life average, data cable not included in the box. my overall rating to Moto G 2nd gen is 4 stars.",
            "date": "06 Jan 2015",
            "name": "Rumi Barman",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone ! So intuitive!! Super value for money at 12999!! Why can't Motorola sell two extra covers-one bright and one light color!!",
            "date": "06 Jan 2015",
            "name": "Rajan Viswanathan",
            "stars": "5 stars"
        },
        {
            "comment": "Hi All, This has been the 1st Experience with Flip kart which is good. i had previosuly ordered EXT HDD, Phone, Shoes Etc and all of them were returned back. this was the only time when the product was Amazing and the Delivery Brilliant. I would like to thank Seerat, Suhas, Delivery and Returns policy for sending the phone on time before the new year as this was a gift to my wife. I have one complaint : YOU GUYS ARE SELLING ACCESSORY FOR VERY HIGH COST. PLS LOOK INTO THIS.",
            "date": "06 Jan 2015",
            "name": "Vinit Mehta",
            "stars": "5 stars"
        },
        {
            "comment": "superb handset in this price....",
            "date": "06 Jan 2015",
            "name": "JATIN ANAM",
            "stars": "5 stars"
        },
        {
            "comment": "true value for money.using from last 5 days, running very smooth.Only i find back cover could be better else no complain so far.",
            "date": "06 Jan 2015",
            "name": "Mayank Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "Best part is you can use about 12GB of your internal memory for applications as well as data storage. Not like Micromax phones who write 16GB internal memory on the box and hardly 1.5GB is available for applications. It is fast, but full HD would have been better to suit all the your desires.",
            "date": "06 Jan 2015",
            "name": "Mayur Kulkarni",
            "stars": "4 stars"
        },
        {
            "comment": "i want to buy this phone please give an exchange offer so that i can exchange samsung star to this one.......",
            "date": "06 Jan 2015",
            "name": "Ajay Hr",
            "stars": "4 stars"
        },
        {
            "comment": "Great mobile, good battery back up no hang ups.! good speed since good internal battery.! Rather than HTC at this price go for Moto. Quite better, n quite the re launch. Hello Moto.!",
            "date": "06 Jan 2015",
            "name": "Shouvanik Sarkar",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone in amazing price range. 1) Superb design. 2) Great battery life if you are not heavy user. 3) Speaker is kind of OK. voice tearing out if u use it with full volume. 4) Does not support 1080p videos. On many website they have written that it supports 1080p video for playback but it does not. 5) camera quality is very good at this price range. Even 2MP camera for selfie is kind of OK. 6) Expandable memory is good option. 7) Best feature from my opinion it will get all next Android updates. Pure stock android experience. If u r fan of Stock android i dnt need to explain. Enjoy it. I think these are enough details to make you buy this phone. Enjoy the purchase.",
            "date": "06 Jan 2015",
            "name": "Rahul Upadhyay",
            "stars": "5 stars"
        },
        {
            "comment": "Worth for money. Flagship product from motorola. Thoroughly impressed with the looks of the phone. Awesome design. Hatsoff to motorola for keeping its standard high on style of their product.",
            "date": "06 Jan 2015",
            "name": "Nageswara Rao",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G 2nd gen is a good budget phone. However, it made me a bit sad with its speed, as it is powered with 1GB RAM. If you play high end games it would make your phone a bit slow and saggy. If MOTO would have given 2GB RAM, it would have been a dream phone.",
            "date": "06 Jan 2015",
            "name": "Jayant Ranjan",
            "stars": "4 stars"
        },
        {
            "comment": "Hi All, I have ordered this phone in Oct-2014 , order Id : OD101055211535211300 I gifted this cell to my mother. Don't know what is going on wrong but we are facing network issue from the first week of the usage. Due to my laziness i have not complaint till now. but now a day hardly network is avail for 5 hours in a day. No internet access even i am having 3G internet plan. Let's see now how flipkart can help me with this. Today only i register a complaint. But i willnot suggest this phone as i have also seen that one my friend ordered this cell in Dec and ask for return as he was also facing same problem.",
            "date": "06 Jan 2015",
            "name": "Harsh Kansagara",
            "stars": "1 star"
        },
        {
            "comment": "Super big screen.. Super clarity of video and photos.. Super speed.. Super music... Super look... Over all SUPER HIT PIECE... GO FOR IT..",
            "date": "06 Jan 2015",
            "name": "Maulik Desai",
            "stars": "5 stars"
        },
        {
            "comment": "BEST PHONE EVER I PURCHASED. THANKS good battery , nice function and all i love this phone the way it is. PRAKASH SINGH",
            "date": "06 Jan 2015",
            "name": "Prakash Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "its really amazing phone i purchase two mobile and thinking for more..................................................",
            "date": "06 Jan 2015",
            "name": "Fariyaad Chishty",
            "stars": "5 stars"
        },
        {
            "comment": "Battery is the biggest problem ..in this mobile..(after using for 1 month iam facing this problem).Need to charge twice in a day with normal use ..even in power saver mode..charging also takes huge time.. I have been using Moto g earlier version ..which has better battery performance.. other than that all are good.. except u r mobile signal will go down once in some days and u have to reboot the mobile to fix it ..(very less occurrence ) touch is good as it used to be....better check for battery power bank ..before getting it..",
            "date": "06 Jan 2015",
            "name": "Navaneethakris...",
            "stars": "2 stars"
        },
        {
            "comment": "I bought the phone because my galaxy s4 screen cracked. I got so sick and tired of manufacturers loading their bloatware and themed skins on top of the beautiful android interface. I also absolutely love on-screen navigation buttons. I would never go back to capacitive buttons or hard buttons again! This phone is guaranteed to get the Android Lollipop update in the coming weeks. What I love about the phone is its fluidity and battery life. However, since it is running stock android, I was disappointed because a lot of convenient CM11 features were missing. Things like not being able to customize the notification pull down menu, torch quick toggle etc. However these issues will be corrected once Lollipop is out as it borrows and improves upon a lot of features in CM11. Also, it would have been nice if it came with a multicolored notification LED :( The HD screen is sharp at normal viewing distance. I was honestly worried about whether I wouldn't like the downgrade from a 440ppi screen to a 300ppi screen. I'm happy to say that anything more than 300ppi is unnecessary as you won't be able to tell the difference 99% of the time and unless you hold a 440ppi screen right next to it. The only problem with the screen is that its not as nice as an AMOLED display. Although I appreciate the brightness of the LCD panel, i hate using it in bed due to the poor viewing angles. Tilt the phone too much and you start seeing the glow from the backlight emanating from the screen. It absolutely annoys me and it sometimes induces motion sickness. I hate how stupid the dual speakers look like. They could have been smaller... it makes the phone look like a plastic toy. The phone would have looked better if they just designed the speakers to look like grills instead of a bar. Anyways all in all its a fantastic phone. I don't have too many regrets except for the points stated above. But then again, I am paying only 13k for it and it is a bargain!",
            "date": "06 Jan 2015",
            "name": "Harish",
            "stars": "4 stars"
        },
        {
            "comment": "I have used this product for 2 weeks and am sharing my experience. I have chose this over others as it is an all-rounder. Build and looks-The ergonomics are good and does not feel very thick due to its curved design. It looks more like a 30k phone than a 13k phone Display-The display is crisp and has natural colours. Text is clearly visible in bright sunlight. It does not need a scratch guard as it is protected y gorilla glass Cameras-Both the front and back cameras are amazing in outdoors as well as indoors Storage-We have 16gb internal storage out of whick about 12gb is available. In the generation of 128gb expandable storage, motorola is only providing 32gb expandable storage which is a minor con Battery life-It is good enough to last you a whole day of normal usage RAM-It is very less and can be clearly noticed while doing multitasking. I wouldnt mind payong 2k more for 1.5gb ram Sound-The front facing speakers provide a good audio effect but it is not very loud. Even call quality is very good UI and updates-It runs on the google now launcher which is very smooth. Even software updates are guaranteed for about 18 months. Still waiting for android L though Ignoring its cons considering the price of the phone it is awesome for the price. Even grand prime having qHD screen is priced higher",
            "date": "05 Jan 2015",
            "name": "Adi",
            "stars": "5 stars"
        },
        {
            "comment": "I M happy to see that FLIPKART delivering Refurbish and Use Mobiles. Also Few are Defected. I Have Ordered 2 ZenFone, which were defected at delivery and a Moto G 2nd Gen, it was used phone as dust in screen. i now wonder that how cheap Big name is going. i have In a Day delivery but for replacement it took 2 days. Now i understand why india seem to be cheap in everything.. Coz Big brand have no value and their promises. Defected Delivery Is Daily Habit Of Flipkart",
            "date": "05 Jan 2015",
            "name": "Vinayak Singh",
            "stars": "1 star"
        },
        {
            "comment": "very nice phone. good camera, sound, does not hang, good graphics. optimum screen size. overall the phone is value for money.",
            "date": "05 Jan 2015",
            "name": "Swati",
            "stars": "4 stars"
        },
        {
            "comment": "A big thumbs up from my side,Best Budget phone ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! :D :D :D",
            "date": "05 Jan 2015",
            "name": "Pranav",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is quite fabulous and it is worth it you cant expect anything more from this phone bcoz this phone meets all your demands so please buy this phone only as i has a guranteed update and best brand motorola tied with google so go on and buy this phone....",
            "date": "05 Jan 2015",
            "name": "yash nigam",
            "stars": "5 stars"
        },
        {
            "comment": "Screen lock button struck up in new mobile, even though replacement provided as new mobile feeling very bad as a customer, scratch guard for 500 Rs pasted that is also a loss , again one scratch guard for the replacement mobile , it is a loss, complaint made on 17 th dec 2014 replacement done 31st december .very bad experience with flipkart",
            "date": "05 Jan 2015",
            "name": "Gopinath Shanmugam",
            "stars": "1 star"
        },
        {
            "comment": "i m using this moto G2 for the past months performance wise very good but battery is discharging quickly even in ideal why? and their is no suitable flip or pouch for this mobile, the moto group has to create the availability of spares in the market",
            "date": "05 Jan 2015",
            "name": "RAAJ",
            "stars": "3 stars"
        },
        {
            "comment": "1. The specifications truly define the phone 2. Though not slim, but it appears to be stylish and slim. So back cover may make it more bulky. 3. Screen guard may too be unnecessary although if needed invest in a good one.",
            "date": "05 Jan 2015",
            "name": "Rohan Surve",
            "stars": "5 stars"
        },
        {
            "comment": "i buy moto g(2nd) using flipkart great service,no issues. i used phone working is good but one day unfortunately it dropped from just one foot and screen break just from one foot.such cheap quality material when i go to service center they asked 6000 rs for screen replacement ....... so totally my phone cost is now 19000. :(",
            "date": "05 Jan 2015",
            "name": "Niranjan Gupta",
            "stars": "1 star"
        },
        {
            "comment": "I had to apply for a replacement as in the phone I received, the notification panel would not slide down at times. You had to lock and unlock the phone for the problem to be solved but it would reoccur. So if that's the case in your phone too, apply for a replacement as the problem has been listed in the Motorola forums and everyone facing it has got a replacement. Here I'm listing only some of the cons of the device that I received after replacement: ->The lock key and volume button of the phone are not sturdy. They are loose and move sideways. ->The sensor of the phone I received seems to be defective. When during a call, I need to switch on a feature like speaker or open the dialing pad the phone screen goes off as soon as I try to touch it and comes on again when I move my finger away which is very annoying. I just hope that the problem doesn't become worse :( MOST IMPORTANT NOTE: I really doubt that Flipkart gives you a brand new product when you go for replacement. The phone I received after replacement showed signs of being used earlier although it was a completely packed piece. It must have been returned earlier by someone. So I would say that as far as possible try not to go for replacement as it is more probable that you may get an even worse product. Therefore, I would say that getting a perfectly working product without any defect in the first go is pure luck.",
            "date": "05 Jan 2015",
            "name": "Glenn Mascarenhas",
            "stars": "4 stars"
        },
        {
            "comment": "A very good product by Motorola.. It has only heating Problem For whom ,, like gaming .. coz it has only 2070 mAh battery ..... Otherwise it is the better Phone Under Rs. 15,000.....",
            "date": "05 Jan 2015",
            "name": "Arnab Upadhayay",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "05 Jan 2015",
            "name": "YOGEESHA B N",
            "stars": "5 stars"
        },
        {
            "comment": "i was purchased this is a Google's company mobile after that Motorola sold to lenova :p. still im not receive lollipop update till now, im not satisfy much more.",
            "date": "05 Jan 2015",
            "name": "Syamsundar Chi...",
            "stars": "3 stars"
        },
        {
            "comment": "The phone looks great and and Motorola assist helps and works in a great way i was so impressed by the moto alerts it was amazing the device is so good and the battery runs 24 hrs",
            "date": "05 Jan 2015",
            "name": "bala kumaran",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best option I found in this price range. All features are as described. Picture quality is good. Voice, etc. thing are good. I am giving it 4 star after comparing it with other phone (especially S4 Mini) in this price range. Not giving 5 star because the only thing bad about going with Moto G is the Motorola customer care & service center. If by any chance you face any issue; definitely it is not going to be resolved or have to heavily pay for it. Otherwise phone is good; just pray you never need to contact the Motorola customer care & service center.",
            "date": "05 Jan 2015",
            "name": "Dhiraj Chouhan",
            "stars": "4 stars"
        },
        {
            "comment": "i purchased this phone after using nokia lumia 720, I found that overall performance of mobile are good but its battery backup performance are below average . I charged this phone twice in day even for a normal usage on internet.I also find that phone take around 3 hours for 100% battery charge from low battery condition. mobile also lost network for SIM slot 1 some time. i m not sure that the problem related to drop network are due to hardware problem of phone are due to improper cutting of SIM card otherwise display are good processor are good no delay even gaming.... voice quality are good battery performance are below average",
            "date": "05 Jan 2015",
            "name": "vikram singh...",
            "stars": "3 stars"
        },
        {
            "comment": "Bought this phone 3 days ago. The Flipkart delivery time was really good. Have been testing the phone since then. Here are some points about the phone 1. The primary camera is pretty good in day but at night there are some grains in image. 2. The screen is awesome with Gorrila glass 3. 3. The grip, look and overall dimension is really better than other phones in this price range. 4. The battery backup is average with dual sim but the word in the air is about a great improvement in battery performance after the Lollipop upgrade. 5. The speaker sound is uniquely better among all the phones in this price range. 6. The battery backup during gaming is pretty good. 7. THE MOST IMPORTANT ONE: STILL HAVE NOT RECEIVED THE LOLLIPOP UPGRADE!!!!!!!!! :'(",
            "date": "05 Jan 2015",
            "name": "Satyabrata Das",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is awsome in its range. Would recommend to go for this if anyone wants a great feature phone within a pocket friendly prize.",
            "date": "05 Jan 2015",
            "name": "Sarthak Swain",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto G (Gen 2) isn't going to win any beauty contests but it's a solid, utilitarian phone that doesn't present too many confusing options and is free of pointless bloatware.",
            "date": "05 Jan 2015",
            "name": "RAGHUL S",
            "stars": "4 stars"
        },
        {
            "comment": "Looks awesome like a nexus Amazing hardware with quadcore processor Super touch responses Amazing battery (lasts 2 days with medium usage). Probably because of the near-stock android Back cover is very neatly designed with very good grip. Battery charges very quickly I found the screen to be a bit glossy. Earphones could have been an in-ear phones.",
            "date": "05 Jan 2015",
            "name": "Chetan Raju",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is ok. But if you need to charge your phone after every 8-10 hrs it makes no sense. 1 con hides all pros for product. At least it should give 15 hrs backup. In 21 st century phones are not for only making calls, such a good specification android phone I guess is for at least person can use internet and listen music. ignore playing games, working professional don't even have time for that. If you are travelling forget your phone can be helpful. You start google map for the destination you want to go, obviously GPS will be on and battery drains like anything. or you want to update apps via wifi yes, it will updated no comments on processor but now you need to charge your phone as wifi have suck ur battery.",
            "date": "05 Jan 2015",
            "name": "Annkit khanna",
            "stars": "2 stars"
        },
        {
            "comment": "Awesome phone at this price. Totally meant for Indian users and standards. Both front and rear cameras clicked awesome pictures even in low light. Touch is superb. Descent screen size. Perfomance wise its gr8 as I have'nt faced any glitches after using high end games like GTA Vice City, Shadow Fight 2 etc.",
            "date": "05 Jan 2015",
            "name": "Himanshu Sanja...",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchaed this for my Father, the phone is easy to use. I Loved it. it is very comfertable in hand :)",
            "date": "05 Jan 2015",
            "name": "Neelash Verma",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen, I brought it from Flipkart ,and its awesome. Working fine value for money, the camera & performance is too smooth... I have already recommended all my friends to go for this Phone & people are already buying more from Flipkart. Thanks Flipkart.",
            "date": "05 Jan 2015",
            "name": "Flemy John",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone about 2-3 months.It is really amazing and battery performance is also good and picture and video clarity is superb.specially front camera is good for self's. As it is a 5 inch phone so it portable and fits anywhere in the pocket. And we can play games like temple run,subway surface etc, without any lag.and I also watch HD (high defination) videos on it and the video clarity is also good. I found only one problem with this phone is that the front camera is good but it sometimes it lags but it is good for video call and normal photo it very high clarity photos. So I give it a rating of 4 star . And flipkart 's packing is also good and delivery is also very fast. I recommend you all to buy this phone from Flipkart.com thank you !",
            "date": "05 Jan 2015",
            "name": "Vinod gopinath",
            "stars": "5 stars"
        },
        {
            "comment": "Pros : Very affordable Good battery life Great build quality Sharp 5 inch 720pHD display Cons : Lacks 4G LTE support No processor upgrade over predecessor Average front-facing speakers Camera struggles in low light Alternative : Asus Zenfone5",
            "date": "05 Jan 2015",
            "name": "Abhishek Nayak",
            "stars": "5 stars"
        },
        {
            "comment": "simply superb...except for the battery backup..value for the money...awesome service from flipkart...",
            "date": "05 Jan 2015",
            "name": "sumesh",
            "stars": "5 stars"
        },
        {
            "comment": "moto g2 Phone is Good but habi Multi tasking and hige grafiex game play phone was Lage. Camara Qualaty is Avarage",
            "date": "05 Jan 2015",
            "name": "Rajdeep Paul",
            "stars": "3 stars"
        },
        {
            "comment": "moto g 2nd don't have the basic features: you can't select multiple contacts at a time in your phone book, you will have to do it one by one for any operational purpose. it won't have file manager. you can't take the backup of your data (message), apps in your memory card. can't restore your data from memory card to your phone book. i had returned this moto g 2nd within 2 days.",
            "date": "05 Jan 2015",
            "name": "Alpendra Singh",
            "stars": "1 star"
        },
        {
            "comment": "In a single word, it is worth for money. Excellent camera Quality and Battery backup. Fluid display.",
            "date": "05 Jan 2015",
            "name": "Karthikeyan Sh...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product a week ago on new year 2015. The phone is good overall. but the problem i'm facing is the battery drains way quicker than usual.",
            "date": "05 Jan 2015",
            "name": "Ayush Aggarwal",
            "stars": "3 stars"
        },
        {
            "comment": "thanks moto for manufacturing this product,since 2 months i am using this device and didn't find any lags or any problems while using it.. guys go for it. its worths your money... keep rocking moto.... thanks",
            "date": "05 Jan 2015",
            "name": "Susobhan Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered Moto G 2 on 25th Dec 2014 with exchange policy and delivery is done on 28th Dec 2014. Great service by Flipkart. Its a week, I am using my new Moto G2. So far its gr8 experience using it. Its handy and battery life is very good.",
            "date": "05 Jan 2015",
            "name": "Viraj Save",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is very good, worth for the money spent. The only drawback is the Battery backup. Battery needs constant recharging.",
            "date": "05 Jan 2015",
            "name": "Ramakrishna De...",
            "stars": "5 stars"
        },
        {
            "comment": "Considering the price, looks, competitors and features ,it is one the finest product available in the market I will definitely recommend the product.",
            "date": "05 Jan 2015",
            "name": "Yogesh Madaan",
            "stars": "4 stars"
        },
        {
            "comment": "I think 1 GB RAM is not sufficient these days with such a huge amount of required apps in current market. If motorola can add some more memory with this phone its become awesome then. Because Phone lagging in some point of use. Let me use it more then I can be comment more expert manner.",
            "date": "05 Jan 2015",
            "name": "Gautam Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "ve Nice camera Bright display Super smooth touch Best exchange offer -ve Pathetic quality charger and headphones Build quality is average",
            "date": "05 Jan 2015",
            "name": "sujit jadhav",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen) this mobile all problems, battery, Kasper,and heating problem pl-leis my money back i am m.vijay kumar",
            "date": "05 Jan 2015",
            "name": "vijay kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I got my mogo G on second day after my booking, with well packed. thanks flipcart. it is a very nice phone with pure androind os. it is the best phone under the 10,000 - 15,000 range",
            "date": "05 Jan 2015",
            "name": "Shyju C R",
            "stars": "5 stars"
        },
        {
            "comment": "Even though I did not go with the express delivery option it was delivered within 12 hrs!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "05 Jan 2015",
            "name": "Sharat Shreedhar",
            "stars": "4 stars"
        },
        {
            "comment": "cons: delivery is very fast in flipkart, display is superb, camera quality is good, gaming gives u thrill, speakers are very good, Pros: Battery sucks, poor headset, not providing data cable.",
            "date": "05 Jan 2015",
            "name": "saikiran",
            "stars": "4 stars"
        },
        {
            "comment": "Pros Superb body & design ; dont need a cover to protect it unless you want to be too protective Speaker volume : Its more than expected Exchange : This is biggest advantage. My earlier xolo mobile battery was swollen 1 and half year hence in exchange I got good branded phone. Next android version: I dont know how would next version be but atleast i can upgrade by phone Cons Battery life : Its less but atleast you can use battery saver mode. You need to find ways to save battery. Full day use will drain out battery in 8-10 hours Ear phones ; Quality is average. Could have been better. Connector : The charger does not include the connector. I was fortunate enough to have a connector of old phone I am giving 4 star just because it is Motorola.....else this is 3 star quality phone",
            "date": "05 Jan 2015",
            "name": "Shailesh Bhavsar",
            "stars": "4 stars"
        },
        {
            "comment": "The mobile is too good in terms of looks functionality and processing speed. But one problem is that, you will not like the picture quality as it looks fainted.",
            "date": "05 Jan 2015",
            "name": "Rakesh Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "good phone. got phone within 3 days after the order confirmation. i am using this phone since last two day. never hang, battery is good compare to other android devices. touch is good.",
            "date": "05 Jan 2015",
            "name": "Rakesh",
            "stars": "5 stars"
        },
        {
            "comment": "i got this phone a month back and on my date to day use i have given the below comments 1. Sound rocks 2. Battery is ok for a day, if you dont browse much. But get drains fast when we browse 3. My phone heats a lot - This is the main disadvantage",
            "date": "05 Jan 2015",
            "name": "Vasanth",
            "stars": "4 stars"
        },
        {
            "comment": "The mobile display is very good Cristal clear and its camera clarity is also nice verdict: Go for it blindly",
            "date": "05 Jan 2015",
            "name": "Karthik",
            "stars": "5 stars"
        },
        {
            "comment": "finally i have received moto g......over all mobile is super....looks so good...battery is not good..and audio is not clear...remaining are so good",
            "date": "05 Jan 2015",
            "name": "K Jayaprakash",
            "stars": "4 stars"
        },
        {
            "comment": "very good phone.. i like this..everything is better than samsung.. very positive opinion.................................................................................................................................................................................................................................................",
            "date": "05 Jan 2015",
            "name": "MAYMOL THOMAS",
            "stars": "5 stars"
        },
        {
            "comment": "Good hardware Great Look Nice Performance Decent Battery Life A trustworthy brand - The software is very basic Verdict: Best smartfone in the range. Highly recommended",
            "date": "05 Jan 2015",
            "name": "asif ali",
            "stars": "5 stars"
        },
        {
            "comment": "The best one can provide for the price you pay. Still I am unable to find any replacements from any brand for the product in this price segment. That's great.",
            "date": "05 Jan 2015",
            "name": "Sumit Rana",
            "stars": "5 stars"
        },
        {
            "comment": "After use of 4 month i am giving review about this product, there is no doubt that this is best mobile in range. Till date i haven't find any issue. Mobile is working good.",
            "date": "04 Jan 2015",
            "name": "Sanil Patil",
            "stars": "5 stars"
        },
        {
            "comment": "The phone's pretty good,no lag after usage of almost a month.Although at first I had received a faulty phone whose memory card(sd) slot wasn't working(it wasn't detecting sd card),the phone was replaced and the new one had no problems and the whole replacement took less than a week. If you are wondering if it looks good in white,then let me assure you it does.",
            "date": "04 Jan 2015",
            "name": "Rehman",
            "stars": "5 stars"
        },
        {
            "comment": "Simply the best mobile at this price. Its always amazing using stock ANDROID. Speaker could have been better but its fine 4 budget mobile. Conclusion : buy this if your budget is",
            "date": "04 Jan 2015",
            "name": "aamir",
            "stars": "4 stars"
        },
        {
            "comment": "after using it for a week realized that its not hardy as moto e.already replaced once but still the same.the mic quality is not good always a static noise coming out of it and its because both are loud speakers...facing lot of problem with otg connections as moto g2 as per their company policy don't support it.",
            "date": "04 Jan 2015",
            "name": "shubhajit mitra",
            "stars": "4 stars"
        },
        {
            "comment": "Been using it for past 3 months......however got a problem recently but the phone is still amazing....the 1 star deducted is for the service centre....motorola service is not good....1 star for the service and 4 star for the phone",
            "date": "04 Jan 2015",
            "name": "Parth Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought this mobile on dec 04 2014.when my phone is in silent mode and i turned off when i tried to turn on it won't turn on..it happens twice for me in 1 month..this moto g2 as everything special but not battery !! my worst ever phone in my life!!Now searching for moto service centre...",
            "date": "04 Jan 2015",
            "name": "umesh BJ",
            "stars": "1 star"
        },
        {
            "comment": "when i'm playing games i cant listen to music it is stopping when i'm playing.....please dont try to buy this product....the worst phone i had buyed in this year...",
            "date": "04 Jan 2015",
            "name": "Sree Eedupuganti",
            "stars": "1 star"
        },
        {
            "comment": "Its a best phone in this category. Display, performance, camera quality , mic, speaker everything is best.... I want to say JUST GO FOR IT !!!",
            "date": "04 Jan 2015",
            "name": "Suraj Dhami",
            "stars": "5 stars"
        },
        {
            "comment": "5* for delivery. The product is phenomenal and is in the budget. Just watch out for the camera quality. Its freaking awesome. Performance is the prime feature. Not to forget the stereo speaker, just love the phone. before this I had Samsung SL, Samsung Grand, redmi 1s. Phone is above all these ^_^",
            "date": "04 Jan 2015",
            "name": "Deepesh Rohra",
            "stars": "5 stars"
        },
        {
            "comment": "display glass is too delicate, it was broken and they charged Rs 7000/- for it. i used many mobiles but i never went through this.",
            "date": "04 Jan 2015",
            "name": "Niranjan Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "heating problem phone sata dead not a gaming phone worst battery back up......starting problem worst customer service my phone in service center for 10 days and no progress information worst worst worst experiece",
            "date": "04 Jan 2015",
            "name": "ABHAY SINGH AMAN",
            "stars": "1 star"
        },
        {
            "comment": "Every good thing comes at a big price. Certainly false . just take a look at this phone. I mean just look at it. It's the best phone under 20000. And the thing to be notedis it is one of the lowest in the section too. Really a beauty to use. Pure android with good performance and is real fast. Working on this phone is flawless. The feature of expandable memory has made it almost perfect. But it too has some issues. The build quality is good but its glossy plastic back is still not a winner for all. It's camera which has 8 M is good but not great considering others in this price bracket. Also the screen resolution is not as good as the old moto g due to its larger screen size. But still it is not just good but great at this price. It's performance and the availability of pure Android is its biggest plus point. It's ability to handle high-def games is an added plus. If you have 15000 in your pocket look nowhere else.. Just go for it....",
            "date": "04 Jan 2015",
            "name": "Baldeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Operating speed is good, camera is excellent both rear and front.. Overall performance is excellent...smart deal for those who wants to spend less than 14000/- on phone.",
            "date": "04 Jan 2015",
            "name": "Shailendra Aryan",
            "stars": "5 stars"
        },
        {
            "comment": "Really love the phone. Its camera quality blew me over (It's way better than my 13 MP Xperia ZR camera). Battery backup is great too! My first Moto G 2 had a problem with touch sensitivity, but Flipkart was tremendous in their cooperation and response -- They promptly replaced it. Very happy to have bought this phone. :)",
            "date": "04 Jan 2015",
            "name": "Neha Chamaria",
            "stars": "4 stars"
        },
        {
            "comment": "It's very good Product in limited cost Touch and Camera Quality is very Good operating is very simple easily understand the option I refer to Buy this Product",
            "date": "04 Jan 2015",
            "name": "suresh",
            "stars": "5 stars"
        },
        {
            "comment": "Fundamentally I am Apple fan! Started with shuffle and now have an iPhone, 2 iPads etc. But wanted a second phone hence thought of Moto G 2nd Gen, off course after lot of research. I will split my feedback in three areas: 1. Flipkart Service - well excellent, you buy they deliver on time or before time. 2. Moto G phone: I am using this for a month now, excellent phone. But it took me time to get used to an \"non Apple\" phone. Initially was frustrated with sound quality, but realised that I have to hold it at a particular place and way and boom the sound was excellent. The battery was also a huge issue, draining at a speed higher than one can charge. Then I spent good amount of time on switching off all unnecessary things on the phone and the battery backup has been optimised to an extend that I have to charge once in two days. This is for full usage for its purpose i.e several con calls, email updates etc. I also used Jabber to login to meetings where the PPTwas being shared with the call, which means very heavy usage of net to display ppt and the call, worked very well as equivalent to my Apple, the display is slightly better. I deleted all unwanted preloaded applications and stopped a few, this optimised the storage. I loaded all those applications that I usually use but still the external 16 GB remains up utilised. The front and back camera are very good, it feels very comfortable to hold as well. My conclusion, you have to optimise the phone and learn to use it, and this becomes an excellent phone. 3. This is where the conflict, after using Apple IOS from the begning(I shifted from NOKIA very old hand set to iPhone 4s) I am finding android very clumsy and confusing. Simple example, if I have to switch off all notifications at one go, I can do that at one go in Apple, but in android I have to visit each app separately. My final verdict: if you want and excellent phone for usual office use with all relevant apps go for Moto G 2nd gen. Purely from operational perspective it is excellent value for money. Disclaimer: Apple vs android is my personal opinion/perception, and hence I do not want to argue which one is better.",
            "date": "04 Jan 2015",
            "name": "Raj Bhide",
            "stars": "5 stars"
        },
        {
            "comment": "This phone really has perfect specs of what all I needed. An absolutely tempting phone to buy and yeah its worth buying. The pros This phone got a great display, processing good enough to play high end processing games without lag, nice camera,speakers on the front are good, nice touch and great looking. the cons the headphone provided is not that good,- not happy with it the battery should have been a little more accessories such as usb cable not provided.",
            "date": "04 Jan 2015",
            "name": "Praveen Kumar Nir...",
            "stars": "4 stars"
        },
        {
            "comment": "Software Problem in phone, gallery not auto updated, some google service running automatically even it was off in application, Some application auto start without touching phone.",
            "date": "04 Jan 2015",
            "name": "Devender Pal",
            "stars": "1 star"
        },
        {
            "comment": "EVERY THING IS FINE ,,, BUT batter oh god !!! .... worst ......., i wont use it much ,, but still its battery is getting down tooooooooooo fast ....",
            "date": "04 Jan 2015",
            "name": "Thulasi Reddy",
            "stars": "3 stars"
        },
        {
            "comment": "I got this before time of due date delivery... -There should have data cable... -SIM (1-2)notification should alert. -Flip cover should have from MOTO G and screen gauard.",
            "date": "04 Jan 2015",
            "name": "Its me",
            "stars": "4 stars"
        },
        {
            "comment": "Just go for it. Or u can wait as its 4G version is going to be launched soon. No Cons. The front speakers are doing their best.",
            "date": "04 Jan 2015",
            "name": "Vivek Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "delivery bole to MASTTTTTTTTTT............replacement boley to aur bhi mast........replaced my defected moto g 2nd in two days on one call............",
            "date": "04 Jan 2015",
            "name": "arun gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "hi all i bought the product on 24 dec but after 1 week time. Unable to hear voice so i restarted the device again after a call. The second call again i am Unable to hear voice. So........",
            "date": "04 Jan 2015",
            "name": "Hari",
            "stars": "1 star"
        },
        {
            "comment": "I am very much happy to buy this phone as I got 10% off on this phone. Very fast service by flipkart as i have received this product in 2 days.",
            "date": "04 Jan 2015",
            "name": "Pramod Kakade",
            "stars": "5 stars"
        },
        {
            "comment": "Value for Money!!!..............................................................................................................................................................................................",
            "date": "04 Jan 2015",
            "name": "Bhushan R",
            "stars": "4 stars"
        },
        {
            "comment": "This is my Review for Moto G2 after using it for 2 months Display: It has good display.Video quality is very sharp with great brightness. Despite having gorilla glass 3 i have got a very small scratch on screen near bottom speaker.Great sensitivity , moto has rocked it. 5inch display is perfect for one hand use. Camera: Rear Camera of moto g2 is decent than many other phones in same price range. Camera interface is simple,effective and very easy to use.You need accurate settings for best pics from g2.Flash with auto settings hardly works so its up to u to keep it on or off. Front Camera is 2mp which is very below average.It is pretty laggy.Hope they fix it in lollipop update. Speakers: Call quality is best in G2.With dual front speakers call quality is much better this category and phones in range of 25k-30k. Listening to music is great experiance. Watching video is amazing with front speakers though not as premium as HTC Dual boom speaker phones. Performance: Best Performance in this category. 1.2ghz processor not the best but great performer as original moto g1. Most of games with medium or high quality graphics played good in likes of Dead Trigger,NFS Most Wanted,Dark Knight Rises,Batman Arkham Origins. Performance gets laggy when 3G downloads are multitasked with games or other apps. Connectivity: Connectivity of moto g2 is satisfactory.WiFi works great.Bluetooth and Gps work fine. Moto G2 is worst for 2G users.You should either have 3G or WiFi for good,better or best experience on g2. Inbuilt apps like gmail,chrome,firefox,opera,play store,google drive,facebook,Google search dont even work on 2G . They always say no connection with 2G i.e,GPRS or EDGE. Memory: It has 12gb internal memory.I use that for just Apps. I got myself 32gb sandisk ultra external microSD card in G2 for videos and music. Software: Pure Android which is just amazing.Using Kitkat 4.4.4 from day one which is great OS especially with phones with 1Gb RAM or less.I thought G2 will get Lollipop update in Nov 2014 but it hasnt arrived yet.Main reason is Motorola's Nexus 6 deal with Google stopping other moto phones from get 5.0.1 andriod update.Just hoping them to give us soon. Accessories: Headphones provided by moto are worst.They are equal to some china headphones with price 60Rs. on streets.I got myself a skullcandy headphone which works fantastic moto G2.Moto should learn from Sony about providing accessories. Battery: Worst Battery performance ever is in Moto G2.Its not just my phones , I have seen 2-3 g2's with worst battery performance.If 3G or WiFi is on constantly battery drains very fast.If brightness is medium or high it drains very fast.You need to keep ur phone on 2G for better battery performance but again no many apps work on 2G . With playing high end games battery will come from 100% to 30% in just 1 hour.Battery drains in medium rate during watching HD videos or playing music. You either have to carry charger with u or power bank with you.G2 needs atleast 2 charging for a single day i.e.15 hours with videos,music,3G,wifi,nearing no gaming. Hoping moto to improve battery performance in lollipop update. Motorola forgot that moto g2 is 5inch phone it is not 4.5inch moto g1 with both having same 2070mah battery which is enough for G1 but not enough for G2. Conclusion: It is great phone at great price with brand value than those who are no brand value like xiaomi or micromax.Good Smartphone go for it.",
            "date": "04 Jan 2015",
            "name": "Ishwar Bulbule",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best buy smartphone in India Everything is good Sound is really awesome Camera quality is superb One thing is not comfort is the power off on the right side and also the volume adjust which feels so hard to handle Expect everthing is mind blowing",
            "date": "04 Jan 2015",
            "name": "Kavi King",
            "stars": "4 stars"
        },
        {
            "comment": "It's an excellent phone in this price range. Great Camera, fast processing and bright colours. However I would like to advise everyone to buy Phone case/cover along with phone to protect it well. If you break your phone front glass, you will have to replace entire screen module (Digitizer, front glass, internal circuit etc) which costs Rs. 7000. Motorola doesn't replace only front glass, it replaces entire screen module.",
            "date": "04 Jan 2015",
            "name": "Piyush Parmar",
            "stars": "4 stars"
        },
        {
            "comment": "After a long gap of few years again bought a Motorola Phone. Honestly i am pleased that this phone has the same standard as the earlier motorola phones had. Being part of motorola for over a decade, i know the stringent process they follow. Over all happy with phone and any one wanting to buy a \"STOCK ANDROID\" phone please go for it. Your device will be fist to get the latest android updates... As this phone takes in micro sim i got one of my SIM cut and one exchanged with micro sim from AIRTEL. But the experiment worked out, i see a 50% drop on the cut sim compared with real micro SIM. So please spare some extra bucks and get a micro sim rather than cutting it. As usual got the delivery in flash time booked on an Wednesday afternoon and got it Thursday morning 9.00 am at my door steps. Keep it up Flipkart !!!",
            "date": "04 Jan 2015",
            "name": "Prakash.K.S",
            "stars": "5 stars"
        },
        {
            "comment": "i'm writing this review after using hardly 5days Con's -moto 2nd gen having no video calling option with 3G mobile network. -while i try to sharing the data from samsung mobile to moto 2nd gen via wifi direct it shows 'files sending failed' -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "04 Jan 2015",
            "name": "srikrishna thota",
            "stars": "3 stars"
        },
        {
            "comment": "you cannot find a better phone in this range. speed is great without any lags and i've played many games on this phone and it handled it without a glitch. ergonomics is fantastic, great to hold. and in this range, it was more than expected.",
            "date": "04 Jan 2015",
            "name": "Chetan Bharaj",
            "stars": "5 stars"
        },
        {
            "comment": "u can buy it ..go for it..VALUE for money there is no lag at all.overally good product to buy...go for it",
            "date": "04 Jan 2015",
            "name": "ABHISEK",
            "stars": "4 stars"
        },
        {
            "comment": "Product is in good condition. Impressed with the delivery. I ordered another phone few days before from another site, but i got Moto G2 a day before that. That is what distinguishes flipkart with others.",
            "date": "04 Jan 2015",
            "name": "Rahul Dhamija",
            "stars": "5 stars"
        },
        {
            "comment": "I bought moto g 2nd gen from flipkart and when i switched it on for the first time out of the box i was shocked that it had a screen with yellow tinge instead of white. i requested replacement from flipkart with request to ensure that the second peice does not come with the same fault. but my doubt came true as the replaced piece also came with the same hardware fault i.e. screen with yellow tinge. also after 4 days use the replaced phone's on/off button and volume button have started wobbling and loosely fitted i don't think they will last more than 6 months. now again i called flipkart and they asked me to visit service center and told me in clear terms that replacement is not an option unless the service centre acknowledges that there is fault with the screen. imagine the pathetic logic of flipkart that a customer is asked to go to service centre for a product which was faulty straight out of the box. now guys the thing is flipkart delivers poor quality product twice and then i am at the mercy of motorola's service centre to get the fault acknowledged.. in short customer is always wrong at first instance unless acknowledged by its brands service centre. this is the situation shoppers have been facing while shopping in our country whether you buy from a shop in your town or from online site. i suggest fellow customers to think twice before buying moto g 2nd gen unless they are ok with yellow screen instead of whit and with poorly fitted buttons. P.S. I compared the screen of both the phones delivered to me with the moto g 2nd gen of my freind who bought it 3-4 months back and he has a perfect white screen.",
            "date": "04 Jan 2015",
            "name": "sumit vegad",
            "stars": "1 star"
        },
        {
            "comment": "i brought moto G2, last month, it is nice mobile in all aspects like looks, touch, internet speed. also i observed some drawbacks, that is some times phone hanging, fast text typing smoothly not working.",
            "date": "04 Jan 2015",
            "name": "Suresh",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone 4 months ago. It has been a good experience. The screen is just the right size for all my uses. The phone never lags when I play games on it. The camera quality is satisfactory, however I would have preferred it be of a higher resolution. The touchscreen is highly susceptible to fingerprints, forcing me to use a screenguard. Also, the battery only lasts for 12-13 hours after being fully charged.",
            "date": "04 Jan 2015",
            "name": "Ajay Bhat",
            "stars": "4 stars"
        },
        {
            "comment": "compared to moto g 1st gen only thing which is less in level of quality is the speakers and sound producing power through headsets in g1 i found the volume is little loud than g2 but g2 has stereo sound system which is a good point and i also found,with the same set of earphone (here senneheiser cx-180),that g1 produced louder voice than g2 even though i turned off the equaliser but after all this this is better phone than g1 because it is also cheaper than g1, with more features.",
            "date": "04 Jan 2015",
            "name": "Tejinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "when i ordered it it came in 4 days its matte finishing was just awesome and it was very thin !!! its gaming experience was also good if u are a photographer and u want good photos believe me it will work very well on day time but in night time it cant take good photos it feels very good in hand !!!",
            "date": "04 Jan 2015",
            "name": "sachin raut",
            "stars": "5 stars"
        },
        {
            "comment": "A strong built phone loaded with all the best features.. Except battery backup every features are great.If your budget is 13K just go for it. (Don't forget to buy a power bank too :P)",
            "date": "04 Jan 2015",
            "name": "Vinesh Radhakr...",
            "stars": "4 stars"
        },
        {
            "comment": "Njoy madi...worths it's price............................................... ..... ......Goof phone in this price range..................................... ................................",
            "date": "04 Jan 2015",
            "name": "Prasun K Jha",
            "stars": "4 stars"
        },
        {
            "comment": "speed 1 day delivery by flipkart. Product was good after using it for 1 week. till now faced no issues like heating or sluggish behavior. I wont play for hours, processing is goog when switching apps. Battery will surely last for 1 day if we use it when it is neccessary. audio clarity is good during call. speakers are good but not too loud. Overall it is worth for every penny we give. It dont have Lollipop update.",
            "date": "03 Jan 2015",
            "name": "Joy",
            "stars": "5 stars"
        },
        {
            "comment": "Compare with Samsung and it seems Motorola scores high on performance. Purchased for my dad and it is really amazing, Thanks flipkart",
            "date": "03 Jan 2015",
            "name": "Amith Alur",
            "stars": "5 stars"
        },
        {
            "comment": "Hi guyzz, is there any one who won 50000 gift voucher or any one got full amount refunded as per the offer displayed on first week of december for moto phones ?? flipkart told that they will select the winners on 27th december and intimate the winners through mail.. i think no body has got. flikart might had played a prank with its trusted customers. i hereby asking flipkart to clarify on this matter.",
            "date": "03 Jan 2015",
            "name": "Ranjith",
            "stars": "4 stars"
        },
        {
            "comment": "It is a very good product. Most Impressive things are.... > Camera : 8MP Rear & 2MP Front Camera, both are excellent. > Screen : Very good screen resolution, It is 5 inches in size > Sound: The front dual speakers are awesome. Very good sound. > Storage: 16GB internal Memory & micro SD slot up to 32GB it's great > Battery Backup is average, take long time to get charge",
            "date": "03 Jan 2015",
            "name": "Kaushik Chakra...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone on two months back, after lot of research ,reading reviews from flipkart and other phone review sites, but i would like to point out few issues which you will find only after you use and will not find in many review sites. I am an average user, not many games, just online news reading and video watching and general use. Firstly pros- 1. Sleek and attractive design. 2.Good Cam(Above Average, low light images are also decent) 3.Sound clarity good(people had complained about it, but sound is quite loud and enough.) 4.Performance is spectacular,any no. of apps can be loaded and it will perform superbly. Hardly ever the phone had hanged. 5.Display is excellent. 6.GPS is excellent Now, cons: 1. I am not able to save any apps or media on sd card, i don't understand why the provision is there when u can't use it.(of course u can save cam pics and videos on it, but not downloaded videos or music.To do so you have to root the device with some app, but I was sceptical, so i didn't.) 2.Battery backup is the main problem with this phone, if you didnt recharge your phone to full capacity before leaving for office, then you are in trouble.Full battery hardly lasts for 16hrs,(with No data usage, that may be because of connectivity issues). 3.If the phone gets switched off , some times it happens that it will not switch on even after charging for 15-20 mins, apparently there is some calibration problem with the phone.(This u will not find in any review sites.) 4. If the face of the phone is placed touching the body part in pocket, it gets heated up to uncomfortable levels, this is scares me at times. 5. You can't assign your favorite song as ringtone,this is annoying and i dont know why, even basic phones have this facility. 6. I noticed battery performance is good on wifi than on 3g.(this may be common) It is better to go for lumia phones by spending an extra 2-3k rupees. Hope this is useful.",
            "date": "03 Jan 2015",
            "name": "Md Zeeshaan",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone in exchange offer for my old android phone from flipkart, This is very cool device with wide display. Only disappointment which i found is for battery back up is not as expected. But yes i will recommend this phone.",
            "date": "03 Jan 2015",
            "name": "Abhijit kulkarni",
            "stars": "4 stars"
        },
        {
            "comment": "A good mobile .. Waiting for Update of Lolly Pop.. Fast,camera is good. No Hanging problem.. Everything works fine One day Delivery is Good by Flipkart..",
            "date": "03 Jan 2015",
            "name": "Sameer Sehgal",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G improves on what its preessor , expendable memory and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -not a single hand operation -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "03 Jan 2015",
            "name": "kumaraja RAJA",
            "stars": "5 stars"
        },
        {
            "comment": "best smartphone with smart specification...in a smart price best in its performance finally awesome phone.....",
            "date": "03 Jan 2015",
            "name": "chandra shekar",
            "stars": "5 stars"
        },
        {
            "comment": "very good at this cost, good smart phone for smart people, works better especially net, other apps also works smoothly. not at the very high end cost, economical and one can go for it",
            "date": "03 Jan 2015",
            "name": "Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "it's really user friendly, and all the process will be completed i light speed, \"ok google\" enables to use fast access to net, camera is superrbb, overall its impressive for sure.",
            "date": "03 Jan 2015",
            "name": "karthik gm",
            "stars": "5 stars"
        },
        {
            "comment": "VERY GOOD PHONE..... GOOD VALUE FOR MONEY........................................... MAY WANT TO CONSIDER HUAWEI HONOR ONCE... ELSE AWESOME PHONE..",
            "date": "03 Jan 2015",
            "name": "Saurabh Anand",
            "stars": "5 stars"
        },
        {
            "comment": "After using the phone for 2 months i'm satistied with the performance and everything. One thing which I feel bad about this is the battery backup.",
            "date": "03 Jan 2015",
            "name": "Rohit Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone overall, animations lag a teeny tiny bit but you won't notice it unless you're used to 30k phones. I get around 5 hours of screen on time on 3g, which is decent I guess, nothing spectacular. Apps load snappily, but it has only 1 GB of memory so yeah, apps will restart at times while multitasking, if you have a lot of them open. If you like stock android, you'll love this phone. A very good buy for the price. If you're buying this phone, don't bother getting a screen guard, been using it without one for 3 months and not a single scratch. (This doesn't make it shatterproof though, get a case if you have clumsy hands!). Survived more than a couple of drops, but I doubt if the screen will hold up if I drop it face down, like any other phone it will probably shatter. The screen is sharp, alright in bright light, but viewing angles are pretty poor although it's an IPS LCD. Display colours and crisp and natural looking, no oversaturated nonsense. This is one of the few phones were I noticed the auto brightness works perfectly. Still waiting for the lollipop update though, you'd think Motorola phones would be the first to receive it (after Nexus) but it's January already. :/",
            "date": "03 Jan 2015",
            "name": "Sammok Kabasi",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g 2nd gen is pretty good... it feels a bit huge... and one of the main problem with this phone is that \"It wont connect to windows 8.1 thru USB..\" it wont get detected at all.. dats the prob with windows not the phone, still the Motorola device manager does not work too for this phone on win 8.1... sound quality is a bit dull and does not feel good with the head phones too.. but good for using other apps.... battery drains pretty soon and needs a long to time to charge the whole thing up again..... consider before buying..",
            "date": "03 Jan 2015",
            "name": "Ganesh",
            "stars": "3 stars"
        },
        {
            "comment": "excellent product.... no lags 3d games can play and camera awesome clarity REAR CAMERA IS AWESOME SOUND QUALITY IS ALSO GOOD THE ONLY BACKDRAW IS THE EARPHONES IS USELESS MOTOROLA HAVE TO GIVE GOOD EARPHONES",
            "date": "03 Jan 2015",
            "name": "NASEER",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G,beautiful 5\" inch display and 8MP camera . -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb",
            "date": "03 Jan 2015",
            "name": "Karthik Babu",
            "stars": "4 stars"
        },
        {
            "comment": "first hatsoff to flipkart for their speedy and excellent service . now back to the phone it looks nice and is a good phone at this price . so one word to sum it up ...the phone is AAAAAWWWWEEESSSSOOOMMEE.....",
            "date": "03 Jan 2015",
            "name": "sridarshan balaji",
            "stars": "5 stars"
        },
        {
            "comment": "Today I received the Moto G(2nd Gen) from E cart courier services as i open the mobile i found the blue spot on corning display. I just tried to clean it with paper but it was display issue. so i requested for the return of mobile.",
            "date": "03 Jan 2015",
            "name": "Sonal Dhuwali",
            "stars": "1 star"
        },
        {
            "comment": "Moto G is a good mobile. this mobile sound quality is very good and camera is very good and photo quality is so good.",
            "date": "03 Jan 2015",
            "name": "Koushik Dutta",
            "stars": "5 stars"
        },
        {
            "comment": "excellent phone with amazing features. no lag so far..battery is also working fine......no probs as such till now .... dont wait just buy now,....",
            "date": "03 Jan 2015",
            "name": "Himanshu Yadav",
            "stars": "4 stars"
        },
        {
            "comment": "First of all thanks to Flipkart. Delivery is very very fast. I ordered on 1st Jan afternoon & i got on 2nd Jan morning itself...what a delivery service....Keep it up Flipkart. Now, about the Phone No need to tell about the spec u already know. For browsing, downloading, phone working very well, touch is awesome, look is great, sound is great, all feature are really stunning. I am very much satisfied from this phone. Guys dont wait for the last moment. Go for it...",
            "date": "03 Jan 2015",
            "name": "Rajanarayanan R",
            "stars": "5 stars"
        },
        {
            "comment": "got the product on time. packing was great. no problem with the device.. working really great. a best budget phone ..!!",
            "date": "03 Jan 2015",
            "name": "Chandan Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I liked Moto G 2, Overall good buy. The only area where MOTO g2 disappointed me is camera quality.",
            "date": "03 Jan 2015",
            "name": "Amit",
            "stars": "4 stars"
        },
        {
            "comment": "I'm writing this review to just to clarify that this is the best smartphone in this price tag.. Camera clarity is super good !! Front speakers are clear !! And what a touch yaar!!! OMG fabulous touch feels like iPhone!! Awesome front facing camera !! Large storage and the phone never ever hangs... Overall,A fabulous phone..Dont worry about the negative reviews..If you are looking to buy it just go for it..",
            "date": "03 Jan 2015",
            "name": "Eshwar Ramesh",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered a Moto G 2nd generation 30th December 2014 and got it delivered on 1st January 2015. The earphones did not work and got the replacement on 5th Jan 2015. Once again thanks for quicker delivery. After 23 days of usage, touch screen at the bottom does not work and I see in the black background the screen gets fading out. I was very much satisfied with Flipkart since started using from 2012 and nowadays very much totally disappointed with flipkart products about the product quality. I DOUBT WHETHER FLIPKART IS SELLING GENUINE PRODUCTS or it's Moto G Made in China causing product issues being Flipkart the major imported of Moto products. Have raised a ticket on this issue. IF I AM NOT GETTING SATISFACTORY SOLUTION I WOULD BETTER PREFER RETURN THE PRODUCT AND GET MY 13K MONEY REFUNDED. Kind attention to new buyers: Better go to the stores and buy the products.",
            "date": "03 Jan 2015",
            "name": "Umesh V M",
            "stars": "1 star"
        },
        {
            "comment": "Pros : Good looking, nice touch sensitivity, picture quality good, light weight Cons : 1) Android Kit Kat has bug that shortcuts of Apps gets automatically disappear from desktop folder 2) When you talk to some one, the other person listen very low voice of your. 3) Battery backup not that good. 4) Expandable memory only upto 32GB, where market standard is 64GB 5) Charging time much much higher compared to Apple iPhone 6) No data cable",
            "date": "03 Jan 2015",
            "name": "Joy Chattopadhyay",
            "stars": "3 stars"
        },
        {
            "comment": "I used many brand but Moto (2nd) really awesome, outstanding phone. it's really perfect smartphone. Thanking you very much Flipkart, your service is really awesome.",
            "date": "03 Jan 2015",
            "name": "bhupendra singh",
            "stars": "5 stars"
        },
        {
            "comment": "The 1st piece which I received had problem with ear piece - voice was not clear and with all of disturbances - I returned the phone and flipkart replacement service was good. The 2nd one is ok. Early I was using i phone 4 - moto g2 is ok -but some times i feel this phone gets stuck for a while - all other application are ok - not the best phone but it is value for money.",
            "date": "03 Jan 2015",
            "name": "Kirubakaran pa...",
            "stars": "4 stars"
        },
        {
            "comment": "Though Moto G 2nd gen is looking good and cute, the battery back up is very poor, not even withstanding for 8 hours use. This is really unjustification to the customers.I want to know how we have to replace the battery please and its cost of the battery please.",
            "date": "03 Jan 2015",
            "name": "balaji daddanala",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart shipped me phone within one week doubles my pleasure, i am using this phone for last 2 month and didn't find a single point to criticize it, from camera, performance, everything is excellent, even battery is ok also. More than PAISA VASOOL",
            "date": "03 Jan 2015",
            "name": "Gaurav",
            "stars": "5 stars"
        },
        {
            "comment": "great phone with great spects. trust te build quality of hardware by motorola and haslefree usage. worth buying",
            "date": "03 Jan 2015",
            "name": "Anmol Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "The look and feel of the phone is great for a budget phone, but just a bit of a let down with the internals. They've bumped up the camera and speaker phones which is nice, it just needed a bit more power and battery and I'm sure people would've paid more it even.",
            "date": "03 Jan 2015",
            "name": "Zubin Dutt",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is cheating customers with faulty Moto G devices... Even after 2 consecutive replacements the device does not work. I am cheated of my money and still no solution has been provided. They haven't called me so far and simply send automated messages. Bunch of arrogant customer support executives who have been hired to harass genuine customers.",
            "date": "03 Jan 2015",
            "name": "Balakumaran G S",
            "stars": "1 star"
        },
        {
            "comment": "i have brought my moto g 2nd generation . all function of the mobile was porper , but after week my mobile show lot of problem",
            "date": "03 Jan 2015",
            "name": "konar",
            "stars": "1 star"
        },
        {
            "comment": "Got the delivery within 48 hours - with normal delivery with exchange offer for my Samsung 6012. Very much satisfied and am proud owner of Moto-G. Those who’re looking from basic android to next upgrade can go for Moto-G. Since there are few drawbacks in Moto-G, but don’t compare with this price range. Very good Professional Phone with Elegant Style.",
            "date": "03 Jan 2015",
            "name": "Saravana Guhan...",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this mobile for the last one month and the mobile is working fine, but only issue with the mobile is sometimes the screen will go blank i.e. even after unlocking the screen the mobile displays a blank screen.",
            "date": "03 Jan 2015",
            "name": "Pavan",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart awesome delivery on time and Excellent genuine product with no damage.product quality and usage is really good.",
            "date": "03 Jan 2015",
            "name": "Vig Nesh",
            "stars": "5 stars"
        },
        {
            "comment": "delivered in two days...phone is working fine...you can do many activities at once and phone doesnt hang...battery life is also good...you can go a full day and a half while using phone moderately..takes approx 90 minutes to fully charge..no heating problem in charger.",
            "date": "03 Jan 2015",
            "name": "abhishek vijay",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone for exchange of my old nokia and further creditcard discount offer. the deal was for 9k. good loaded phone. since it is from google there are no additional features. its a basic android installed in it. it lags inbetween when i play music. need to check with some different player. Games run smooth but takes time to load. waiting for upgradation of kitkat.",
            "date": "03 Jan 2015",
            "name": "amey naik",
            "stars": "4 stars"
        },
        {
            "comment": "My sis is enjoying this phone a lot..... It is better than Alcatel & Samsung. But a little over priced. And this phone lacks offers from flipkart. Flipkart delivery is great. No other site can beat this kind of service.",
            "date": "03 Jan 2015",
            "name": "Sam",
            "stars": "4 stars"
        },
        {
            "comment": "got the phone for a 4000 rs discount, thanks a lot flipkart... firstly the phone is beautifully elegant, the finishing and craftsmanship is very impressive. this give the phone a very polished and a very premium look. been using it for the past 1 week, and so far enjoying every bit of it.. now a breakup of summary. PROS: 1>the 294ppi display is a mesmerizing thing to look at, very good viewing angles, and very crisp display. 2> 1.2 GHZ quad core processer is a mighty beast, can run multiple apps without any lag. 3> the Adreno GPU is just a delight, all recent high end games work (but best in medium settings. ) 4> Camera... where do i even begin, the 8MP snapper is the standout feature of this device, can record videos in 720p only but that is not a let down, images captured are brilliant and very much comparable to a low end dslr... the front cam is just the icing on the cake images are just as good. 5> Storage is greatly improved with the provision of SD card Slot. 6> recharging time, is greatly reduced, from a standard charger supplied, the device charges in little less than 90 Mins. a very good thing.. CONS: 1> Battery could have been better, the 2070mah battery last's only for 13-15 hrs, even on moderate internet usage. 2> the Available RAM should have been atleast 1.5 GB, not that it is a major problem ... 3> I noticed the charger heats up at times, not sure if a faulty charger, or due to quick charging... OVERALL: a good buy, definitely go for it, wont be disappointing.",
            "date": "03 Jan 2015",
            "name": "Amardeep Mandr...",
            "stars": "5 stars"
        },
        {
            "comment": "I first got this phone delivered to me on 30.12.14 and unfortunately I had to go switch on the Talk Back feature on the phone. Thats it. My phone went for a royal toss and I had to return the product. But hey that happens and Flipkart was just awesome to give me a replacement within the next 2 days. Its a good phone after all. Not every phone works!! Now that I have my new phone, let me provide my views:- Pros:- Smooth and fast browsing (facebook and whatsapp is just super smooth to use) Thanks to Kitkat. Camera is just awesome (front and back) Almost every game can be played. Amazing skype experience. Voice clarity is simply superb and it doesn't hurt the ear. The headphones provided serves the purpose really well. And yes it can be upgraded to Lollipop. Easy to hold, and mainly easy to type. (Did not find any difficulty) Huge internal memory of 16GB and SD card upto 64 GB Cons:- Battery life is very less. And the fact that it is inbuilt makes it a lot more skeptical. (Make sure you own a power bank). As mentioned above, DO NOT SWITCH ON the TALK BACK FEATURE. Getting connected to a computer might be a bit of a confusion at the beginning but I am sure people will get used to it within a day or two. On the whole a very good product that is worth your money spent! Go for it. You will not regret!!!!",
            "date": "03 Jan 2015",
            "name": "Rajesh",
            "stars": "4 stars"
        },
        {
            "comment": "While Buying this handset there is a offer that \" 1 GB 3G/2G data per month for 2 months in 3G/2G circles for Airtel prepaid and Bill discounts of INR 250 and INR 155 per month for 2 months on subscription of 3G and 2G data boosters of 1 GB and above in 3G and 2G circles respectively Airtel postpaid. View T&C \" But in real i only get this offer for 1 month only. I ask the airtel customercare regarding this they replied this offer is for 1 month only. whyyyyyyyyyy",
            "date": "03 Jan 2015",
            "name": "Manish Rai",
            "stars": "2 stars"
        },
        {
            "comment": "A quality phone with great specs, at an unbelievable price that begins to question the profit margins of big corporations. Motorola's comeback couldnt have been better. Cheers to moto for delivering something truly amazing! Flipkart delivery as usual. No issues.",
            "date": "03 Jan 2015",
            "name": "vigitesh tewary",
            "stars": "5 stars"
        },
        {
            "comment": "Worth the money, quality is good.........................................................................................................................................",
            "date": "03 Jan 2015",
            "name": "Euro Men's brief",
            "stars": "4 stars"
        },
        {
            "comment": "The performance specs are pretty standard. But the quality is far better than what you would expect from a phone of this price range. The Stock android is awesome. Camer quality is also quite good. Although phone seems to heat up slightly on prolonged use of the camera. For my usage battery lasts one full day even after extreme usage. Under normal usage it lasts for around 2 days",
            "date": "03 Jan 2015",
            "name": "Ranjeeth Mahan...",
            "stars": "5 stars"
        },
        {
            "comment": "one of the best android phone in the market from google,,really awesome !! using past from 4 months..loving it...",
            "date": "03 Jan 2015",
            "name": "Thirumalesh",
            "stars": "5 stars"
        },
        {
            "comment": "screen size is not like a mobile its like note or tab and its difficult to handle with single hand so please make its scree size like moto g 1st gen.",
            "date": "02 Jan 2015",
            "name": "Vineet Vanherte",
            "stars": "4 stars"
        },
        {
            "comment": "surely the value for money.. just baatery a bit not powerfull but it doesnt matter...................................................................",
            "date": "02 Jan 2015",
            "name": "kp",
            "stars": "5 stars"
        },
        {
            "comment": "First of all i want to thanks Flipkart for its amazing service. They kept me updated and done an amazing job. even the delivery guys was helpful to me. Regarding the phone... Everything is fine except the battary. Other than that the speed is awesome. No heating even if i play High grafix games. No hanging. Amazing sound quality. Phone is charging so fast. Vedio is so clear. Phone is handy. Regarding Flipkart service.... I never had such an experience from any other online shopping company. May be your service made you best in india.",
            "date": "02 Jan 2015",
            "name": "Sachin Sojan",
            "stars": "5 stars"
        },
        {
            "comment": "Vibration not working,and the worst part is that i have moved to different place & hence cant go for return as per policy of flipkart.....Kindly make some arrangement to exchange it to my revised location",
            "date": "02 Jan 2015",
            "name": "Rishikesh Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "iReally unbeatable.No battery problem.Corning gorilla glass with HD display.Plays every format. This is my fifth mobile that i have purchased for me as well as for my friends..................Now nothing to say betyond this.AWASOME PHONE",
            "date": "02 Jan 2015",
            "name": "Lalit Rode",
            "stars": "5 stars"
        },
        {
            "comment": "long lasting battery....excellent touch..value for money product...best as compared to other smart phone..",
            "date": "02 Jan 2015",
            "name": "Hiten",
            "stars": "5 stars"
        },
        {
            "comment": "This is perhaps the best phone in its price range. The performance is superb. No lags. Camera is good. I'll try to list its points: pros: 1. Sleek look 2. Nice camera. 3. Superb performance. 4. No lags. 5. 16GB internal memory external slot available. 6. Good display. Cons: 1. The only bad thing I can say about this is that the speakers aren't too great. Yes, they can provide surround sound effect but only upto a very small range. So the only negative would be the Speakers. I would definitely tell others to buys this.",
            "date": "02 Jan 2015",
            "name": "Shabd Shashank",
            "stars": "5 stars"
        },
        {
            "comment": "best handset still no issues and dosnt lag or hang up....with best delivered by flipkart with 2-3 days.",
            "date": "02 Jan 2015",
            "name": "Nitin Chavan",
            "stars": "5 stars"
        },
        {
            "comment": "I got this mobile on next day of my order, Thanks for Flipkart's fast delivery. And it's almost a month I used this mobile. I'm sure this mobile is worth for what you pay. Battery last a day based on the usage.",
            "date": "02 Jan 2015",
            "name": "Prabhu A.P",
            "stars": "5 stars"
        },
        {
            "comment": "1. long time to charge. 2. phone gets heated up within 5-10 min's while call processing 3. battery gets discharge more faster than the time taken to charge. 4. charger heated up like anything............ there are the issues.......... i applied for Replacement lets see what going to be happen C U later...........",
            "date": "02 Jan 2015",
            "name": "Sudharshan Reddy",
            "stars": "2 stars"
        },
        {
            "comment": "This is my fist and best mobile which I buyed n online this is the first and best mobile which I buyed in online store. I like the features it contains.its design model attracted me very much with colours in black and white and its shells with attractive colours.its speciality is that it can be buyed through online only.I am very much satisfied with this product.but the charger is getting so heated when mobile is charged through that.my friends charger is not working right now.make sure to buy a quality product.",
            "date": "02 Jan 2015",
            "name": "ravilla. Vishal",
            "stars": "2 stars"
        },
        {
            "comment": "It is a very pleasant & nice experience by using Moto G 2nd generation mobile phone. This is a super quality mobile phone as far as its overall performance is concerned. I'll definitely recommend this phone to online buyers.",
            "date": "02 Jan 2015",
            "name": "C Satpathy",
            "stars": "5 stars"
        },
        {
            "comment": "Its simply superb . but battery life dissapointing and no lollipop update till now . Gorilla glass broken and service centre billed me 7000 and provided a cheaper duplicate glass !! thats y 4 stars",
            "date": "02 Jan 2015",
            "name": "Sai Kiran",
            "stars": "4 stars"
        },
        {
            "comment": "Except the fast that it is sold exclusively on Flipkart, the phone works pretty good and may just have the best price to value ration..",
            "date": "02 Jan 2015",
            "name": "Ronak Kothari",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is really nice and worth it....delivery by flipcart is really fast...got delivery 03 daysbefore.. good experience....",
            "date": "02 Jan 2015",
            "name": "adesh(delhi)",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is very popular phone , nobody need to give certificate again and again ! I'm came to thank flipkart for their excellent service and timing. Thank you flipkart ! I'm so happy customer",
            "date": "02 Jan 2015",
            "name": "RIZWANUDEEN P.B",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g 2nd gen is the best phone ever i have seen it is better than Samsung and Microsoft phones. It is the best phone in the range of 10000-15000 Advantages 5 inch display with gorilla glass 3,quad core processor, good battery life, Disadvantages no 4g support , only 1GB ram These disadvantages are very minor, the phone wont l usually and can run very high games and can play HD videos",
            "date": "02 Jan 2015",
            "name": "Harshith Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Nice one to use and I have purchased for my Sir's Son....:) I recommend to all................................................................................. :)",
            "date": "02 Jan 2015",
            "name": "Pradeep Ilayap...",
            "stars": "5 stars"
        },
        {
            "comment": "I am enjoying using this phone from the day I bought It.Excellent internal Memory provided.Now I can control my internet data usage by the special function.If i use phone for playing games and apps then the battery is down in the evening when charged full in the morning.No problem with speed,HD Display,good speaker quality.Nice Camera Quality .I easily imported my all the imp.contacts from my google account.wonderful phone at this price.",
            "date": "02 Jan 2015",
            "name": "Chaitanya Gaikar",
            "stars": "5 stars"
        },
        {
            "comment": "This is one the best model you get under 13,000. Most important its performance and quality is best. Loved it !!",
            "date": "02 Jan 2015",
            "name": "Gaurav Khanna",
            "stars": "5 stars"
        },
        {
            "comment": "For this budget,moto g2 is the best option. You can go for it without any fear. I loved it . Gaming is good too.. ! Camera .. :O 8 MP is best.. Selfie is ossum in 2 MP.. Thank you flipkart fa a good piece :)",
            "date": "02 Jan 2015",
            "name": "Vibisha Ann",
            "stars": "5 stars"
        },
        {
            "comment": "THERE WAS NO HEADSET IN THE BOX. i complain but they refused. worst service by flipkart though i was a priority customer.",
            "date": "02 Jan 2015",
            "name": "Arindam Mondal",
            "stars": "1 star"
        },
        {
            "comment": "dont think much. i bought one then i got so much satisfied that again i gought one for my dad then one for my wife then again for my brother in law.... i am using it for past 6 months ... n problem excellent built and performance. trust me u will luv this phone.",
            "date": "02 Jan 2015",
            "name": "Dr Adil Zia",
            "stars": "5 stars"
        },
        {
            "comment": "Its a very nice phone from motorola. with many features & reasonable price. Quick Service. Delivered before time.",
            "date": "02 Jan 2015",
            "name": "Piyush Morjaria",
            "stars": "5 stars"
        },
        {
            "comment": "its not water resistant... my phone fell in water and the display went off... not satisfied with the product.",
            "date": "02 Jan 2015",
            "name": "deaDpool",
            "stars": "1 star"
        },
        {
            "comment": "Lovely Phone with a Huge Screen compared to MotoG 1 and got it pretty cheap using exhange offer and Standard Chartered Offer. Phone performs very well and the most amazing factor is the Screensize",
            "date": "02 Jan 2015",
            "name": "Susmita Pathak...",
            "stars": "5 stars"
        },
        {
            "comment": "I got this phone after so much of research and was wanting to buy a phone from the big flipkart sale but couldn't. phone is performing well and smart. for the price it is tagged, it's an awesome experience. Battery quality great and i charge only time for two days. Believe me. it works. i just drained out battery two times as per friends advice and do not complete charging cycle everytime. Camera quality is good and works on skype calls. The shape is curvy and great looking. You can watch movies hastle free and no hang up as on date. If you are looking for a budget phone, then Moto G [2nd Gen] is the best.",
            "date": "02 Jan 2015",
            "name": "karunanidhi E",
            "stars": "5 stars"
        },
        {
            "comment": "just go for it. do not go for the covers that flipkart provides with the phone as offers.. u can always get new covers later. the delivery was fast and the phone is good..though looks like a modified version of Nexus 5 but its much better..",
            "date": "02 Jan 2015",
            "name": "Aditya Mulay",
            "stars": "5 stars"
        },
        {
            "comment": "The Phone is good. But I got a faulty piece. Call speaker (both earpiece & Loudspeaker) is not working sometimes. The problem is solved after a device restart, but it reappears again after some time. And also I got a damaged back shell. The former problem , i think its a software problem as the speakers are fine during media playback & the problem is only during the calls. However I have initiated a replacement request and my replacement is on its way. I'll put the detailed review after i recieve the replacement. Till now I'm satisfied with the flipkart service. Overall Review: * Build Quality is superb * Stereo speakers give superb audio experience * Battery is Average * Camera is awsome for this price( Both Front and Rear) * Phone is more handy compared to other phones with 5\" display * RAM should've been better, But can't complain because of its budget price * Proceesor is awesome ... No lag in response found * Display is of premium quality compared to phones in similar price range * Pure Android experience ( No much useful apps from MOTO) * Can't change the font style without rooting , Unlike from Samsung phones * No Overheating experienced * 13GB is available for apps ( Theres no app specific memory, user can use the memory according to them , that is for apps or media. * Charger that came with the phone is dissapointing as its so slow in charging (take nearly 4 hours for a full charge) and it heats too much",
            "date": "02 Jan 2015",
            "name": "Arjun Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this smart phone from past 3 months the battery back up is poor, if i started using internet for 3 to 4 hours the battery is reduces to 60% & i am using a App called Clean Master it will also not working to retain charging.",
            "date": "02 Jan 2015",
            "name": "vijay Sajjan",
            "stars": "2 stars"
        },
        {
            "comment": "Reallt i feel happy after bought moto g. The quality is superb compared to previous version. I would recommend this product those who look better moto product.",
            "date": "02 Jan 2015",
            "name": "Sambath Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "it awesome mobile because the best buildup and bright display also..no lag between playing game eg. asphalt 8 ...simply awesome...",
            "date": "02 Jan 2015",
            "name": "rajesh mali",
            "stars": "5 stars"
        },
        {
            "comment": "Bad front speaker quality. A white dot on the display. Bad customer service they are not ready to return or replace the product. WORST SERVICE WORST SERVICE WORST SERVICE It is not for a single star but just giving single star",
            "date": "02 Jan 2015",
            "name": "Kalesh",
            "stars": "1 star"
        },
        {
            "comment": "Really impressed with Flipkart service. Phone was delivered within 2 days. The only things that this phone lack is a good battery backup and a nice set of earpieces. On the whole this phone is a very nice buy for the price it being offered.",
            "date": "02 Jan 2015",
            "name": "Jetain Singla",
            "stars": "4 stars"
        },
        {
            "comment": "Good worth buying!!!!!!!!!!!!!!. Go for it for sure...................................................................",
            "date": "02 Jan 2015",
            "name": "Abhilaksh",
            "stars": "5 stars"
        },
        {
            "comment": "can any one tell me how to get lollipop update...... and battery tips also because its sucks.... quality is good only problem is battery... it drains fast when screen is awake but stand by is good.",
            "date": "02 Jan 2015",
            "name": "teja kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Battery lasts only a day. It got heated up quickly, if you use multiple application at a time. Rest all cofig is good",
            "date": "02 Jan 2015",
            "name": "Naveen Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "1. Phone Lags Too Much Within A Month.. 2. RAM consumes 80% Evn after having just 10 apps... 3. battery not proper.. drains very fast.. 4.speaker quality not good..",
            "date": "02 Jan 2015",
            "name": "Krunal Baphana",
            "stars": "3 stars"
        },
        {
            "comment": "Filpkart very fast Delivery 100% satisfied. Moto G 2nd Gen Battery drains in 4 to 5 hours have to charge phone 2 to 3 times a day. Camera quality not good .",
            "date": "02 Jan 2015",
            "name": "krishna kumar G",
            "stars": "5 stars"
        },
        {
            "comment": "It is a good product by motorola,but one mistake like Battery.Increase the battery mah upto 2600mah.it is better to help..........",
            "date": "02 Jan 2015",
            "name": "Rajesh Sarma K...",
            "stars": "4 stars"
        },
        {
            "comment": "This is an excellent phone in this price range. The performance is great. I've been using it heavily for about 6 months now. It has never stalled once.",
            "date": "02 Jan 2015",
            "name": "Andrew Femin",
            "stars": "5 stars"
        },
        {
            "comment": "This is by far the best phone in the budget with as may options as you need in an average smartphone..makes for the best gift or purchase if you need a phone that lasts..this has dropped out of my hand, bed table many times so far not even a crack or mark.",
            "date": "02 Jan 2015",
            "name": "Rahul Varma",
            "stars": "5 stars"
        },
        {
            "comment": "Best camera. No built in unwanted apps. nice dual speakers Over all best phone for 13000RS.... GO FOR IT...",
            "date": "02 Jan 2015",
            "name": "Biju Mohan",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone about last one month,Its picture quality video recording stereo sound and all other performances are Excellent.The only problem I felt wrong is a severe pain around the ears.Even the ear phone can't be put in the ears for music and talking more than 3 minutes.",
            "date": "01 Jan 2015",
            "name": "Vinod kumar",
            "stars": "3 stars"
        },
        {
            "comment": "+10 for Flipkart Services All should think twice as this phone is having a memory management bug in some pieces which can also make music do not work while browsing in chrome. So its not good for those who want to do good multitasking Once again Some pieces are having Some Reports says its debugged after ota update (after 5.0.1) buts its not cured 100% so do google for memory management bus of moto g. Thanks Flipkart for refunding.",
            "date": "01 Jan 2015",
            "name": "Karan Dhingra",
            "stars": "3 stars"
        },
        {
            "comment": "Hi Flipkart, I am facing network issue in phone. In the period of 20 days i faced this issue 3 or 4 times. I also checked that network is working fine in other phone, so issue is only with Moto G2. I called Flipkart customer care, they said me to Backup & Reset phone, I did that and since 2 days it is working fine. But just wanted to inform you if there is any need to replace phone as phone is in guarantee period.",
            "date": "01 Jan 2015",
            "name": "shweta gupta",
            "stars": "3 stars"
        },
        {
            "comment": "When i received the mobile, it was in ON condition with the front light blinking. I don't understand why a new phone was in ON condition. Battery got drained also. Added to that backside cover on the top right side is not getting locked properly. It remains open. There is every chance that dust gets going inside. After spending 1299 Rs, i am totally disappointed on seeing such poor quality of back cover. I would be my time waste, if have to take it for Motorolla for repairing the back cover. Can Motorolla do something for my mobile?",
            "date": "01 Jan 2015",
            "name": "Nagashree Rajanna",
            "stars": "1 star"
        },
        {
            "comment": "I have use this mobile for the last 3 months ...Suddenly my mobile getting hanged .mobile getiing on and off repeatdly ..I have given to motorola service centre tey are saying that motherboard pbm ..",
            "date": "01 Jan 2015",
            "name": "Krishna Kumar",
            "stars": "1 star"
        },
        {
            "comment": "The phone performance is outstanding but battery backup is very less .So if you are not frequent traveler and want a fantastic phone with great performance ,then this would be the right choice for you. I can play The Maze runner without any lag (I like the game). Pros : 1. Great look . 2. Photo quality is superb 3. Screen size is perfect 4.Screen resolution is high 5. Fabulous performance Cons: 1. Battery backup 2. Callers voice can be heard outside I guess because of stereotype speaker. I recommend this phone to my friends as I have not found any issues which annoyed me.",
            "date": "01 Jan 2015",
            "name": "Dodul Paul",
            "stars": "5 stars"
        },
        {
            "comment": "DO not go on the fake publicity of this product as i was also disappointed to see the bad quality product especially from moto an American Brand but chinese made go for other chinese option Xiaomi or huawei , bad battery back up worse speaker quality",
            "date": "01 Jan 2015",
            "name": "Robin Raina",
            "stars": "2 stars"
        },
        {
            "comment": "A nice phone with most of the features you can expect. Good packing and quick delivery by flipkart. I am using the phone from last two months. It is working fine. No hassles so far.",
            "date": "01 Jan 2015",
            "name": "Aravinda%20C%20L",
            "stars": "4 stars"
        },
        {
            "comment": "wow this is a fantastic mobile i ever had in my lifetime.as many people say its charger is not heated during charging",
            "date": "01 Jan 2015",
            "name": "sreejith babu",
            "stars": "5 stars"
        },
        {
            "comment": "pros: great specs at affordable price. cons: worst customer service and cost for repairing too high.",
            "date": "01 Jan 2015",
            "name": "Krupa",
            "stars": "1 star"
        },
        {
            "comment": "This is the worst service that one could ever think off.The product i receive is damaged and also doesnot include all its accessories and the only available accessory is the charger which is white in colour while the phone is black....hence i doubt if i have received a used phone or a phone which was returned by someone else...... Flipkart is taking an advantage since they are the only authorised sellers for this Phone -MotoG I ordered a phone on 30-Dec'14 was wanting it so much that i even opted for a speedy delivery by am extra payment. I receive the phone on 31-Dec'14 and to my great surprise i see that the SIM Slot2 is damaged...which left me dumstruck not even wanting to use the phone any longer, i report the case immediately to the customer care who are so negligent...each one of them just want to pass the ball from their court..thats all is what they are concerned abt; wanting me to wait for call from the tech team for the next 24hrs who will then understand what is my concer...Is this how they treat the customers when they adverstise for their products???? ...i receive a call at 10.30am i-Jan'15; when i am in a meeting hence ask the technical exceutive to stay on line for 10min,refuses to do so and offers call back at 11am and the story ends there..... i don receive any call after that...and i callback the tech team multiple times to hear their slogan.. \"We are sorry for the inconvinience the issue is escalated they will call u in nxt 24hrs however we cannot assure the call back today\". Am fed up hearing the some thing i even doubt if this is recorded..... Since i din want to use the damaged phone i did not even check the box and frustrated with their service when i finally decide to use the phone with the SIM Slot1 working, i notice that even the headsets are missing!!!!!! and the phone ordered is black in colour and the only available accessory is the charger which is white in colour",
            "date": "01 Jan 2015",
            "name": "Jayashree S",
            "stars": "1 star"
        },
        {
            "comment": "This definitely the best android based phone in the sub 15000/- range. It uses basic Android skin w/o any adulteration of superficial skin. I would recommend this one over the other cheap and useless chinese (read xiaomi) phones in the market. Absolute beauty and worth every penny and More. One more thing the Orignal Moto G flip covers even tough a bit expensive but they are of very very good quality and a must to save your phone from jerks and scratches.",
            "date": "01 Jan 2015",
            "name": "Animesh Verma",
            "stars": "5 stars"
        },
        {
            "comment": "within month phone get dead, and service center not supporting as required I feel very bad purchase experience.",
            "date": "01 Jan 2015",
            "name": "Sushil Singh",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto g (2g), from Flipkart but I found that it was showing authentication problem during wifi connectivity. At first I contacted to Moto customer care, but they could not do solve my problem on phone in spite of several efforts and then they advised me to go any near service centre. But on contacting to Flipkart, initially tried to solve my problem and after then promised to replace my mobile with new one. Soon I will get new one and hope it will be OK. I personally feel, Flipkart maintains its reputation and tries the best",
            "date": "01 Jan 2015",
            "name": "harish kumar",
            "stars": "3 stars"
        },
        {
            "comment": "This mobile would have easily retailed for more than 16K had it been available outside Flipkart. Super android device with everything working flawlessly that you can think of. I am not a gamer, so excuse me on that front. But after a very very bitter experience with Samsung Trend, this phone is breeze of fresh air. Camera is excellent to say the least. It takes breathtaking images in normal indoor lighting at night. Skin tone is superb. Flipkart delivered it to me in less than 36 hours from Bangalore to Hyderabad.",
            "date": "01 Jan 2015",
            "name": "Koushik Roy",
            "stars": "5 stars"
        },
        {
            "comment": "As we compare phones n budget simultaneously this model fits perfectly to my needs. but the handset which r being delivered by flipkart has always some defect. i have ordered the same and had to get it replaced twice n finally got refunded. as such the service of the flipkart is good. so 4star for phone n service!!",
            "date": "01 Jan 2015",
            "name": "Vivek Shrestha",
            "stars": "4 stars"
        },
        {
            "comment": "if u are looking for a good phn on a lower price tag range.. just go for it. have been using it for over a month now and have no troubles what so ever. replaced its back cover with a moto flip cover. and there i had a very durable moto g2. Pros are many. only cons i faced were. 1. Low battery backup. 2. speakers tend to distort sound at high volumes. 3. atrocious quality ear phones. DO NOT USE THEM. ( though i use samsung for calls n sennheiser for music). 4. bad quality charger.( again i use a samsung charger)",
            "date": "01 Jan 2015",
            "name": "Aditya Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Same Day delivery. Good job Flipkart. Phone looks amazing. Looks and feature truely apuladable. No issues faced uptil now. If you are planning to buy this phone but hesitating because of bad reviews. Don't Give a second thought. Just buy it.",
            "date": "01 Jan 2015",
            "name": "Rajeev Bajj",
            "stars": "4 stars"
        },
        {
            "comment": "Over all very nice phone in this range.... Support OTG. And both sim are HSPA+ no need to change sim for using HSPA net.. Stereo speakers has very nice sound quality....and no heating issue.....> So u can go for it.",
            "date": "01 Jan 2015",
            "name": "K2",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is not at its best.mainly it is overheating and it doesnot have a good battery life we can say,it drains.Better u go for panasonic p81ormotoe",
            "date": "01 Jan 2015",
            "name": "Sameendra Krov...",
            "stars": "3 stars"
        },
        {
            "comment": "flipkart is amazing prompt delivery timely followup 1)excellent phone 2)seamless operation even in multitasking 3)amazing display 4)good battery 5)good camera CON:- (my friend got d problem) 1)poor service 2)reply of service center is pathetic 3)phone got dead after falling in water hardly for 1 second",
            "date": "01 Jan 2015",
            "name": "NISCHAL PURI",
            "stars": "5 stars"
        },
        {
            "comment": "Guyz its very fantastic phone i have ever seen so u can go for it and its value for money product. I like this phone .best in class..all things in 1 package..1 should buy this Motorola G ..reputation of Motorola all we know is best in all.",
            "date": "01 Jan 2015",
            "name": "Brijendra Upad...",
            "stars": "5 stars"
        },
        {
            "comment": "Disadv- Battery Backup and Customer Care Support(Please provide Service Centre in All Main Cities) Adv- Extraordinarily Phone, Ever Seen like this...........",
            "date": "31 Dec 2014",
            "name": "Jesumani J",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: Working smooth and fine with No lag, Directly from OEM, Good build quality, Good speaker quality, Cons: Ear phone is average,",
            "date": "31 Dec 2014",
            "name": "Nitin Raina",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is best in its segment and way better than a lot of other phones available at a slightly higher price. Go for it and you wont be disappointed. You have the 30 days return guarantee too here but I'm certain that won't happen.",
            "date": "31 Dec 2014",
            "name": "rOsh Felix",
            "stars": "5 stars"
        },
        {
            "comment": "best smart phon....ever i m very satisfied with moto g 2g good betray life Good Performance .. .. ..",
            "date": "31 Dec 2014",
            "name": "Krunal Bhisara",
            "stars": "5 stars"
        },
        {
            "comment": "The more I use this device the more I am liking it. :) Everything is exceptional in this phone including Camera, processor, speed. Battery life is around 1 to 1.5 days depending on usage. Thanks.",
            "date": "31 Dec 2014",
            "name": "Manohar M",
            "stars": "5 stars"
        },
        {
            "comment": "I took moto G 2nd gen on 19th of Oct and the motherboard got dead after 2 months and i gave my device in service center in jayangar on 18th of DEC 2014 but still i didn't get my device so worst and useless service",
            "date": "31 Dec 2014",
            "name": "mohammed baseet",
            "stars": "2 stars"
        },
        {
            "comment": "this device is really amazing the only con i find till date is that its battery ,you have to charge it at night but i hope after Lollipop update the battery will last long at least it will run 90 minutes more(as said by google)!",
            "date": "31 Dec 2014",
            "name": "amey vajpeyi",
            "stars": "5 stars"
        },
        {
            "comment": "Great Mobile with Lots of feature at reasonable price and Thanks to flipkart for very fast and secure delivery with good packing condition.",
            "date": "31 Dec 2014",
            "name": "Chintan M N",
            "stars": "5 stars"
        },
        {
            "comment": "ordered my moto g 2nd gen on 21st of december and expected date of delivery was 29th of december. as usual they(flipkart) did not get it on time and after 2 days from the due date they told me that u have to cancel your order and re-order it . they told me that something is wrong with the ekart logistics. wtf........",
            "date": "31 Dec 2014",
            "name": "suryanshu gautam",
            "stars": "1 star"
        },
        {
            "comment": "This is really a good phone.Its very smooth to use.every thing works fine but only some features are missing ie marking feature of contacts(ie selecting many contacts ,and adding them to group or deleting them),voice recorder etc..... BUT leaving these minor things overall it is a VERY nice phone.........",
            "date": "31 Dec 2014",
            "name": "Priyansh Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Its a good mobile but in case of any issue I doubt the service availability and also i heard that the spares are too costly.",
            "date": "31 Dec 2014",
            "name": "Kiran Chandaka",
            "stars": "4 stars"
        },
        {
            "comment": "Just received a defective motoG2 with a defective SIM1 slot.Was excited seeing the phone,its look and feel just to find the piece defective.Was waiting to start the new year with the 3rd model of MOTO ( have used moto g1 and e already and was quite happy with the experience of the phone and flipkart and WS Retail but badly disappointed now) Now there is no one day guarantee as i will be waiting for 1(with defective piece) +2(for the new one). Hope i don't have this experience next time though am pleased that atleast the return order was promptly verified on-call(though they take time for the emails. Now waiting,will post an updated revie once i recieve a working piece.",
            "date": "31 Dec 2014",
            "name": "Divya",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone with all the features needed... Best value for money..... Dosen't look cheap. Sturdy, build quality nice. a bit on the heavy side..",
            "date": "31 Dec 2014",
            "name": "Subhramoy Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "As you all know, Moto G is good product. I give the same feedback as you get more for the 14K. Worth buying. the only thing needs to be considered is Service centre?",
            "date": "31 Dec 2014",
            "name": "Mohamed",
            "stars": "5 stars"
        },
        {
            "comment": "Really good phone, a true all rounder. Great features, Camera is also world class. Size is bigger than the provious gen so only had to buy a new cover thats all",
            "date": "31 Dec 2014",
            "name": "Nauzad Munshi",
            "stars": "5 stars"
        },
        {
            "comment": "i advise to eveyone who buy moto G. this product not working good...and flipkart service is also to slow if you find andy trouble in your phone your phone is replace with in 15 days..if you are ready to buy then buy........i never told you not buy this product but i tell you to buy this product on your own risk !!!",
            "date": "31 Dec 2014",
            "name": "PRAKASH KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "Ordered the phone on 22/Dec/15 and got it in one day 23/Dec/14 I bought this phone in Exchange offer to my old Samsung Galaxy LCD (First Generation). I got 3000 Rs for the old phone which was very good. I have been using this phone for more than a week PROS: 1) Screen Resolution is Amazing and 5 inch phone looks very good. I have compared it to Nexus 5 and Moto G2 looks 80 percent of Nexus 5 - 5/5 2) Camera clarity is simply mind blowing and its a awesome 8MP Rear camera. - 5/5 3) Front Speakers are good - 4/5 4) Response time is very good and apps open immediately and no lag is found - 5/5 5) Gaming - Played Temple run 2 and subway surfer without any hiccups - 5/5 6) Lollipop - Eagerly waiting for lollipop Upgrade. CONS: BATTERY: Battery is average. For every 3min of internet browsing you will loose 1% of battery and Moto g 2 should have provided 3000mAH Battery. But is is far better than iphone 4. I have installed Battery Saver App and after that Iam able to control the Battery. Also bought MI Powerbank so Iam relieved and does not have check my battery all the time. Eagerly waiting for lollipop Upgrade and maybe battery condition will improve",
            "date": "31 Dec 2014",
            "name": "Bindiya",
            "stars": "5 stars"
        },
        {
            "comment": "USed this phone for around 4 months now. Nice features and good for net surfing, reading and watching youtube on Wifi.",
            "date": "31 Dec 2014",
            "name": "Sandeep Gabhale",
            "stars": "4 stars"
        },
        {
            "comment": "The mobile is always a nice choice and was something that i was literally very eager to own. But motorola needs to improve on battery back up. the battery is kinda okay. but the phone is really cool thumbs up to Moto G 2. :-)",
            "date": "31 Dec 2014",
            "name": "Mohit Thakur",
            "stars": "5 stars"
        },
        {
            "comment": "this is very good phone but one day my phone is not working .i gone to motorola service centre and saw that there are 13 set was facing this problem .the problem is motherboard dead.but it is a nice phone",
            "date": "31 Dec 2014",
            "name": "MD AKRAM ALI",
            "stars": "2 stars"
        },
        {
            "comment": "I am still a user of the Moto G 1st Gen, I bought the 2nd Gen for my brother.. Obviously G2 is better thanks to its screen size. The only difference between the two phones is the battery backup which is better in the 1st Gen. External slot doesn't really matter, because they DO harm the phone in many ways. I too would have bought the G2 but what held me back are the speakers.. If Motorola would have continued the same model with just the size update, it would have been so much better. Those speakers are really ugly !! I just hope Motorola Mobility or Lenovo, whoever wears the pants in the family now does not continue with those speakers for the next phone to be released by them, and even if they do please manufacture with a colour like metallic grey which camouflages those speakers. To sum it up, MotoG2 is still the real MVP !!!",
            "date": "31 Dec 2014",
            "name": "Ausaf Rahman",
            "stars": "4 stars"
        },
        {
            "comment": "Thanks to Flipkart for timely delivery of this product within a day. I was planning to buy Asus zenfone 5 or redmi. Finally after a proper assessment decided to go with MOTO G 2. This Phone may not be the best in various areas, However it is the best in all round perfomance at this Price when compared to any other Phone below 15k rupees. So if you are looking for a good brand phone with maximum features and good battery backup go for MOTO G 2nd Gen. ** I will soon be getting Android Lollipop on My MOTO G 2nd GEN. Also MOTO G 2nd GEN battery charges very quickly ( within 1-1.5 hours 100% ) and lasts for nearly 24 hours at moderate usage. (other features are already mentioned by many buyers). Thank you FLIPKART !!",
            "date": "31 Dec 2014",
            "name": "Inder",
            "stars": "4 stars"
        },
        {
            "comment": "It has been two months since, I am using this phone. Pros: 1. UI 2. External Look 3. Apps 4. Sound 5. Camera Cons: 1. Speed",
            "date": "31 Dec 2014",
            "name": "Vikas%20 Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered moto g on 25 dec and got it delivered on the very next day! Thanks for that flipkart But the next day i found my phone display to be very yellowish! it sucks.White pixels are not properly displayed! I have already requested replacement for this phone but flipkart has not get in touch with me yet! I hope Flipkart replace this faulty device! fingers cross! I'm giving this 2 starts just for the flipkart. not yet satisfied with the product quality! I'll update once i get a replacement!",
            "date": "31 Dec 2014",
            "name": "Mihir Shah",
            "stars": "2 stars"
        },
        {
            "comment": "The Moto G has been a very friendly and most useful phone for me \"The king of budget smartphones returns with a larger screen and a new and improved camera\" It is very good. I'm using this from Release day.NO heat up, well battery backup, excellent camera, good RAM, no hanging. Very happy with battery up time and charging rate as well.",
            "date": "31 Dec 2014",
            "name": "Rajkumar A",
            "stars": "5 stars"
        },
        {
            "comment": "I bought it on the big app shopping days and got Rs.750/- off on it. The phone is awesome camera is well above average, The manual focus setting is very good. Talking about the performance I am disappointed about no improvement in the processor from the previous model. Problems running super heavy graphics intensive games like ShadowGun. havent received 5.0 lollipop update till 31/12/2014 but I am eagerly waiting for it.",
            "date": "31 Dec 2014",
            "name": "Pulkit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Especially if u have a old phone lying around waiting to be returned you cant go wrong with this phone. Thanks to flipkart for the great service.",
            "date": "31 Dec 2014",
            "name": "Abhishek B U",
            "stars": "5 stars"
        },
        {
            "comment": "Very happy to have purchased the phone under exchange offer. It is more than Value_for_money. Voice clarity is good. Good speed for browsing. Camera is very good for this price. Battery life is also very good. One charge gives me two days' usage. The product that I received was faulty. Used to reboot very often. I got it replaced by Flipkart within two days. Thank you flipkart. The replacement that I got is very good.",
            "date": "31 Dec 2014",
            "name": "H.R. Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "as per my view when this phone launched,i had a certain obsession with this phone. when I heard about exchange offer i felt lucky. This phone you have to buy 5 inch HD display, 1.2 Processor,11 GB app memory, Exellent sound quality,4.4.4 kitkat version,awesome selfie camera But the main disadvantage is RAM . Ram is only 1 GB instead of giving 2 GB.otherwise in midrage price phone.This is the best Phone",
            "date": "31 Dec 2014",
            "name": "saurabh ghare",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is very good looking at the price. Pretty fast after loading lots of applications. Build is good. Little heavy.",
            "date": "31 Dec 2014",
            "name": "Bidhu Baral",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from last 3 months & performance is very good. software is very good hardware is very good camera is also very good",
            "date": "31 Dec 2014",
            "name": "Manoj Goswami",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased from flip cart and using since last three days and found battery getting drained very fast. worst experience for bad battery back up. It was clearly mentioned in product page on company website that it comes with upgrade to lollipop version, but system is not getting upgrade. I don't know why Flipcart or Moto people are considering concern and try to rectify problems observed.",
            "date": "31 Dec 2014",
            "name": "Jignesh Derasari",
            "stars": "2 stars"
        },
        {
            "comment": "Good Phone",
            "date": "31 Dec 2014",
            "name": "Manu M",
            "stars": "5 stars"
        },
        {
            "comment": "After 6 days of use, I find Moto G is excellent phone by Motorola which is the first company to make cellular phones. Motorola is also American company (recently bought by Google), you can compare its build quality with Apple. I also happen to have Ipad Mini 2 Retina display. 1. Phone function 5/5 Clear audio quality. I used to get poor signal with my old Samsung Galaxy R at home but now that problem is solved. Thanks to Android 4.4.4 you have simplified view of contacts, call log. But message log and call log are separate. Nowadays sms use is lesser. Hardly anyone mentions this feature which is still very relevant today. Many high end phones have complicated calling function. 2. Display 5/5 294 ppi to be exact. Small fonts can be read without eye strain. My Ipad Mini 2 Retina has 324 ppi and you CAN'T tell difference. Now there are phones with 500 ppi displays, but you won't notice these tiny pixels beyond human eye capacity. 3. Battery 4/5 I get upto 2 days as my use is less. But heavy user can get a day's backup. 4. Camera 5/5 Impressive photos in low light. Takes multiple shots per second!! It makes sure you get a perfect snap in sports or when moving speedily. 5. Original Android, Google now 5/5 6. White LED notification Good feature for those who don't check phone constantly. You can set for just personal message in WhatsApp or a missed call etc. 7. Build quality 5/5 Better than Samsung, close to Apple but without metallic back. 8. Design 5/5 Slightly curved back with matte finish helps gripping. Phone is not too thin. Too thin phones are difficult to hold. My Ipad is thin and slightly uneasy to hold. Other important features are Gorilla glass, Android 5 update, Motorola brand. And it is almost a 'budget' phone costing 13k. Only thing is to be seen is how Motorola service is. I hope it will hardly be needed.",
            "date": "30 Dec 2014",
            "name": "Shridhan Patil",
            "stars": "5 stars"
        },
        {
            "comment": "Wonderful specifications compared to other mobiles in the market. Very good build quality. Compared to this moto g 1st genaration is good in display quality and performance.",
            "date": "30 Dec 2014",
            "name": "vinodkumar",
            "stars": "4 stars"
        },
        {
            "comment": "It was delivered by flipkart within 2 days. Overall product is nice. Camera quality is good. Battery backup is good. Sometimes hangs for milliseconds while running games.",
            "date": "30 Dec 2014",
            "name": "Avi Jain",
            "stars": "4 stars"
        },
        {
            "comment": "Bought this on its launch day itself... I've been using for over 3 months.. till now no issues like hanging or heating as such other than battery running out soon when using 3G network.. but that's just androids & Moto's way of telling you keep your charger close by.. phone comes loaded with most of the features which are generally abundant in all other brands so not much to tell.. camera is decent so is the dual stereo speakers.. they are loud but who plays music on mobile phone speakers other than plug the headphones.. the packaging comes very simple & there's no data cable which is a big negative point if you don't have any lying around.. I already had 2-3 so no worries there.. the headphones provided inside are very basic variety you would do better to buy a good one separately, I use Tekfusion Twinwoofers with Poweramp so music listening is awesome... picture quality is clear & bright even when the brightness is turned down a lot... i dont use any screen guard as the screen comes with gorilla glass 3 which does its work pretty decently... till now no nudges or scratches on the phone or maybe I keep my phone safe from all that.. Flipkart delivery was late by 2 days but packaging was good... overall a good phone to invest.. Update - Ok, after upgrading to Android Lollipop.. I've noticed severe drop in battery life.. Now a full charge lasts max 5-8 hour with just music listening & minor surfing on 3G & whatsapp & fb chat app.. I use a separate cell for phone calls... earlier it would last at least 16 hours.. upgrading to lollipop has sure made the UI look much cooler but the battery life is something to be wondered about, Motorola should look into it asap..",
            "date": "30 Dec 2014",
            "name": "Partha Sarathi...",
            "stars": "4 stars"
        },
        {
            "comment": "This mobile from Motorola is definitely worth the price considering it has such great specs. Plus the performance is also very good, the touch is not great as a iPhone :) But Love everything else about this phone. If someone is looking to buy a good rather great phone under 15k - this phone is the one to buy. And the white shell is just 'awesome', the color matte finish!",
            "date": "30 Dec 2014",
            "name": "Waq",
            "stars": "4 stars"
        },
        {
            "comment": "Hello, It's been more then two months I am using this phone. I am moderate user (not a gaming freek) and the phone is going quite well for me except many minor but irritating drawbacks. Pros: 1. Master piece in price range 2. Looks extremly good (I baught black color handset with two additional orignal back cover and it looks great) 3. Does'nt hang in moderate usage (m not gaming freek but dozen of app runs in my phone all the time) 4. Latest andriod OS 5. Camera is fast 6. Good quality sound. Cons: 1. Camera is not great in night/dull light. What it shows in display is not as same as what it captures. 2. Zoom in / Zoom out pinch gesture is irritating and doesn't work smoothly. Issue with the default app. 3. SPEAKERS CANNOT BE TURN ON while listening to RADIO. (not sure if this is the hardware issue or the default app issue) 4. Some time while listening to music on headphones if you eject to move to speakers, it does'nt work or there is a reduction in volume. you need to pause and resume and speakers starts working. 5. Buttons on earphone (call pick/drop/change song/adjust volume) does'nt work. 6. Ear phones shipped with the product is of cheap quality. 7. There is NO NEXTLINE KEY in the keyboard. (not sure it is OS issue, I am usnig 4.4.4) This makes extremly unpleasent while texting. Thanks!",
            "date": "30 Dec 2014",
            "name": "Rahul Arora",
            "stars": "4 stars"
        },
        {
            "comment": "simply amazing ... nice camera quality nd awesome sound no lag in gaming... love it.. ram is enough for gaming user like me ...",
            "date": "30 Dec 2014",
            "name": "Dinbandhu Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Motorola Service is very worst, if its only one month old they will replace the phone, No one can expect the problem to persist within one month. Phone is Good,But Very very bad Service, Please do not buy the phone. Even if I bought the phone about 2-months ago, they are replacing the Motherboard of the phone, They denied to provide me replacement.",
            "date": "30 Dec 2014",
            "name": "Vijak",
            "stars": "1 star"
        },
        {
            "comment": "Phone has some nice feature.. 1. Gorilla glass 3 2. Water resist coating 3. Up-gradable to releases as mentioned by google. 4. Easy to handle, with nice design. 5. light weight. 6. Affordable with 10% off on 13K No issue till now....",
            "date": "30 Dec 2014",
            "name": "Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "We have bought the phone yesterday. but the offer which shows \"1 GB 3G/2G data per month for 2 months in 3G/2G circles for Airtel prepaid and Bill discounts of INR 250 and INR 155 per month for 2 months on subscription of 3G and 2G data boosters of 1 GB and above in 3G and 2G circles respectively Airtel postpaid.\" is fake. After visiting www.airtellive.com/offers from the new phone using my airtel sim, we found that only 2g data is available. No story of 3g data. Flipkart customer care does not have any justification to clarify it.",
            "date": "30 Dec 2014",
            "name": "Anindita Shit",
            "stars": "1 star"
        },
        {
            "comment": "problems are below: 1. Its take 4 hours to get 100% charged. 2. Battery does not support when using data. 3. Not caching 3G network signal properly. 4. Phone gets heated some time.",
            "date": "30 Dec 2014",
            "name": "NEFI",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart is very good in service .I have given complained about the battery and flipkart replaced the phone with a brand new phone within 24 hrs but the performance of battery is same. Battery needs minimum 2 times of charging a day for normal usage .God only can you save you if you play game or browse. battery performance is very very very very poor",
            "date": "30 Dec 2014",
            "name": "San",
            "stars": "2 stars"
        },
        {
            "comment": "Using Moto G and has a Hearing Speaker Problem. Got Serviced Recently at Pramanik Mobile Service, Jayanagar for Noicy Speaker. After Repair now speaker is not audible at all. Again They take our mobile for Service and 4-5Days More with out mobile",
            "date": "30 Dec 2014",
            "name": "Keshav Prasad P N",
            "stars": "1 star"
        },
        {
            "comment": "Moto G (2nd Gen) - Product have all feature which i want. Hardware side these phone have enough power to handle New Era, \"The Smartphone Era\". Look wise, much better then one design & many size.",
            "date": "30 Dec 2014",
            "name": "Rohan Patel",
            "stars": "5 stars"
        },
        {
            "comment": "i have purchased thz phn in sept within 3 months it has stop wrking it suddenly get switched off evn smetym it dont get charge so plz dont by any phone of moto g frm flipkart evn i have alsu purchasd moto g i face same prblm wid it",
            "date": "30 Dec 2014",
            "name": "aman aulakh",
            "stars": "1 star"
        },
        {
            "comment": "I was planning to buy a good Android mobile phone from quite some time, but I was confused between Asus Zenphone 5 & Moto G2. But later I decided to go with Moto G2 for 2 reasons - - Good Exchange offer ( I got 2K exchange price for my 3 year old Samsung Wave Y ) - Moto G2 will get 5.0.1 update in next month. Moto G2 doesn't look like a big phone, it's easy to hold in one hand and screen resolutions are really good. Battery performance is good and I didn't face any issue in last one week. The only complain I have from Moto G2 that it doesn't have data cable and good quality earphone.",
            "date": "30 Dec 2014",
            "name": "Sanket Jain",
            "stars": "5 stars"
        },
        {
            "comment": "There are so many options available in smart phones. But just compare with any phone which is above 25-30 K and you find this best suitable.",
            "date": "30 Dec 2014",
            "name": "Amit Mali",
            "stars": "5 stars"
        },
        {
            "comment": "good product ,fast shipping and good configuration phone low price good company phone in lowest price delivery in door step",
            "date": "30 Dec 2014",
            "name": "BENIT ARUN RAJA C",
            "stars": "5 stars"
        },
        {
            "comment": "The Buy Back offer on Nokia Phones 10% Off On Standard Chartered Bank gave an effective price for this phone. Thanks Flipkart. I won't talk high of this phone as i use iPhone 5s ;) This was for my Mother.",
            "date": "30 Dec 2014",
            "name": "Beny Mahajan",
            "stars": "5 stars"
        },
        {
            "comment": "best phone under the range of 15000,awesome performance and camera too........battery is also good a whole day battery life.a quad core processor phone with almost everything hat satisfies the needs of the customer.",
            "date": "30 Dec 2014",
            "name": "Sunil",
            "stars": "4 stars"
        },
        {
            "comment": "Picture quality, resolution and touch is very good. Many more features are there which are very impressive.",
            "date": "30 Dec 2014",
            "name": "Anita",
            "stars": "4 stars"
        },
        {
            "comment": "I had bought my phone Moto G Second Generation (white) from flipkart in month of October and due to some reasons mobile screen has been cracked and i gave it to near by service center they said that should change panel and it cost me seven thousand rupees. I gave my mobile and money to service center people at first they said that they will get it repair with in one week and now it is one month every time they say that company doesn't have white panels they only have black panels wait for another week and this story continued for one month and there is no result. if company is not in a position to produce white panels then what is the need of producing the white phones and marketing them. So please be careful before going to buy this mobile.",
            "date": "30 Dec 2014",
            "name": "Goutham",
            "stars": "1 star"
        },
        {
            "comment": "Excellent value for money. Good buy if you are exchanging a old phone to get this. Its very sleek and has all the latest features of smart phone. Best of Motorola so far",
            "date": "30 Dec 2014",
            "name": "Manikandan P",
            "stars": "5 stars"
        },
        {
            "comment": "The Phone is excellent in performance except the RAM as compared to Chinese counter part like ..Everything is working as Expected but on the RAM side i got disappointed...And just waiting for the Lolly Pop update , to see that is there any changes will be in its performance..",
            "date": "30 Dec 2014",
            "name": "Abhineet Anand",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile is very much good in price as well as in specifications and it doesn't hangs 2much even after opening many more than 10 applications at a time.....Really its a good product of moto G from FLIPKART 2 me",
            "date": "30 Dec 2014",
            "name": "Sachin Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone, worth more than the money spent. One star less for the dull looking buttons & bulky size (compared to SIII)",
            "date": "30 Dec 2014",
            "name": "Pavan",
            "stars": "4 stars"
        },
        {
            "comment": "Pros: High build quality. Pure Android Screen quality is excellent Cons: Have not received the Lollipop update yet",
            "date": "30 Dec 2014",
            "name": "Shaurya S",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought the product on first day with introductory offers. It has bigger screen and expandable memory over previous generation Moto g. A great device to buy for first time android user. Display: 5 inch display is very bright & with vivid and punchy colors but only 720p which is okay considering price. Great for watching videos. Processor: No upgrade in processor but still a snappy device. No hiccups or crashes with day to day app usage. OS: Near pure android experience which i love very much. Waiting for Lollypop 5.0 Camera: Decent camera. Images are noisy (grainy) in less light. Flash is Ok types. Battery: Enough for day and half with moderate usage (only 2G, no 3G) Sound: Front facing stereo speakers is a bonus but loudness is less. A disappointment. Problem: Heats up while normal gaming also like subway surfer etc.",
            "date": "30 Dec 2014",
            "name": "Siddharth Dixit",
            "stars": "4 stars"
        },
        {
            "comment": "they said its gorilla glass 3 ... but it cannot able to survive a 2 cm fall.. worst... glass got completely broken... to replace the glass the service center is asking 5300 rs...i feel completly irritated with such a device... dont buy it... money waste....and stress",
            "date": "30 Dec 2014",
            "name": "nobin rules",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2 is the best Phone in medium budget, There is no Hanging problem at all. Thanks Moto. Battery backup is also very good, sound clarity also good.",
            "date": "30 Dec 2014",
            "name": "Naresh Thotakura",
            "stars": "5 stars"
        },
        {
            "comment": "sim 2 slot is not working ,i would recmnd to check the phone one the arrival................... ,........................................................................................................................................... .............................................................................. .......................",
            "date": "30 Dec 2014",
            "name": "Ambu Reddy",
            "stars": "1 star"
        },
        {
            "comment": "I have ordered this product on 23rd of dec at night 11.30 PM even though my product was delivered to me on 24th around 1 PM such a great and speed delivery with oput any extra deliviery charges.And the product is toooo good. Keep going Flipkart.Very good delivery and genuine products. All the best!!!",
            "date": "30 Dec 2014",
            "name": "amalodbhavi pidege",
            "stars": "5 stars"
        },
        {
            "comment": "After usage of 2.5months, it has been a good experience with Moto G. Need to look at some pros and cons as below Pros: Nice display, Nice Camera but not as much level we used to have with Samsung, LG. Cons: Need to reboot once a while to get connection with the second sim, though I am using second sim for data only. Performance is not tooo good, but we could say ok if we compare with the same budgeted phones. Heavy weighted phone it would have decreased.",
            "date": "30 Dec 2014",
            "name": "VJ",
            "stars": "3 stars"
        },
        {
            "comment": "Its been working very nicely since I have used it. very nice product at this price. Recommended for buying. Thanks.",
            "date": "30 Dec 2014",
            "name": "Gaurav Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "good product in given price and good service of flipkart....................................................................................................................................................................................!!!!",
            "date": "30 Dec 2014",
            "name": "Arun Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Very nice, fast, easy operating. Good phone, RAM, Processor is very nice. Speed and good Phone for indian peoples.",
            "date": "30 Dec 2014",
            "name": "Prasanna",
            "stars": "5 stars"
        },
        {
            "comment": "I just bought Moto G (2nd Gen) and the first impression was amazing, I felt like this is only made for me. It's 5\" HD display is great fonts are crisp all the icons where clear in good color. Screen can be viewed from any angle and does not inverts the colours thanks to IPS LCD display. Its 1.2 GHz Quad Core power pack is really fast and does not lags at all with 1 GB RAM and 16 GB Internal and has a micro SD card slot. I installed almost 20 apps in it with a ease and it does not lags. Its 8MP rear and 2MP front camera are impressive and able to click some really nice shots. In a nutshell, its a good phone to buy and recommends this to all. And also thanks to Flipkart for introducing this great smartphone",
            "date": "30 Dec 2014",
            "name": "Abhiranjan Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent mobile with super fast processor. Mobile Charges Lill Slow with its own charger. Go ahead MOTO-G2 provides good exchange deal.",
            "date": "30 Dec 2014",
            "name": "Girish Kumar H...",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent mobile with super fast processor. Mobile Charges Lill Slow with its own charger. Go ahead MOTO-G2 provides good exchange deal.",
            "date": "30 Dec 2014",
            "name": "Girish Kumar H...",
            "stars": "5 stars"
        },
        {
            "comment": "I like moto phones. they are reliable and better products than so called chinese manufactured ones. If u are gifting it to ur mom or dad, it worth the value paid.",
            "date": "30 Dec 2014",
            "name": "Arun Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Everything works fine with the phone apart from the Speakers which makes terrible frequency noises during voice calls. I hate that and its really annoying. I've master reset the phone but still the problem persists. Clearly its a defective product.",
            "date": "30 Dec 2014",
            "name": "Shubh Luthra",
            "stars": "1 star"
        },
        {
            "comment": "It's a nice phone supporting all mid level games (did not tried games with high graphics requirements)",
            "date": "30 Dec 2014",
            "name": "SD",
            "stars": "5 stars"
        },
        {
            "comment": "Yes now time is correct to change name FLIPKART TO FLOPKART. Reason:- 1) They people think that customer is stupid. Obvious yes cause we are buying from FLOPKART.COM. Never buy any phone in an exchange offer. Because they will not accept the phone in the exchange offer without any reason. 2) Rude, illiterate Courier boy, zero knowledge about the product. Very busy and no time for customer. 3) Extremely slow and non-responsive customer care service. Why, cause they take upto one week to update simple order status. 4) FLOPKART is totally professional in harassing the customer. Note: I had bought lots of product, and had lots of trust on FLIPKART. But now a days they don't care about customer anymore, Just care about pissing them off. Never buy FLOPKART.COM",
            "date": "30 Dec 2014",
            "name": "Krunal Indrodiya",
            "stars": "1 star"
        },
        {
            "comment": "Yes now time is correct to change name FLIPKART TO FLOPKART. Reason:- 1) They people think that customer is stupid. Obvious yes cause we are buying from FLOPKART.COM. Never buy any phone in an exchange offer. Because they will not accept the phone in the exchange offer without any reason. 2) Rude, illiterate Courier boy, zero knowledge about the product. Very busy and no time for customer. 3) Extremely slow and non-responsive customer care service. Why, cause they take upto one week to update simple order status. 4) FLOPKART is totally professional in harassing the customer. Note: I had bought lots of product, and had lots of trust on FLIPKART. But now a days they don't care about customer anymore, Just care about pissing them off. Never buy FLOPKART.COM",
            "date": "30 Dec 2014",
            "name": "Krunal Indrodiya",
            "stars": "1 star"
        },
        {
            "comment": "Motorola phones moto g is awesome at this price range its too awesome the camera quality is brilliant..touch pad is also so smooth and screen quality is also best in class",
            "date": "30 Dec 2014",
            "name": "Hemant Rajak",
            "stars": "5 stars"
        },
        {
            "comment": "best buy and love my phone. everything you need is in a black beautiful smart handsome device.. go 4 it,,,,",
            "date": "29 Dec 2014",
            "name": "sangram keshari",
            "stars": "4 stars"
        },
        {
            "comment": "Overall phone looks gr8. However we found provided headset is unable to be inserted into 3.5 mm audio jack. Unable to run FM or talk through headset. requested to look into this issue or returned back this set.",
            "date": "29 Dec 2014",
            "name": "Rajeev",
            "stars": "3 stars"
        },
        {
            "comment": "ITS AWSOME BUT WIFY CONETING IS SOME PROB CHECK IT MY FRND USING DIS PHONE ITS LOOKING GOOD AND FILP KART SERVES IS VERY GOOD ONLY 3DAYS TO DELIVERY GERAT MOBIL",
            "date": "29 Dec 2014",
            "name": "SUPER QUALTY",
            "stars": "5 stars"
        },
        {
            "comment": "this is a good phone.. no complaints regarding its performance but company should work on it`s looks and battery backup.",
            "date": "29 Dec 2014",
            "name": "aashu",
            "stars": "4 stars"
        },
        {
            "comment": "Good , All Features , Memory , Camara, etc all Good, Battery also last long.I would recomment all to buy this Mobile Phone , Good Processer , Good Looks , Slim , also big in Size.",
            "date": "29 Dec 2014",
            "name": "Joseph Devassy",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Phone, Vivid Displays, Royal Look It charges with USB Cable Too ( saw someone said it doesn't, which is wrong) Good Loudspeaker, Sturdy Design Battery could be a notch better, and the RAM as well. Overall I am pretty satisfied with the device. Recommended from my side",
            "date": "29 Dec 2014",
            "name": "Amit Chakraborty",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing product at an affordable cost. Ordered the Phone on the day of release and gives a very good usage",
            "date": "29 Dec 2014",
            "name": "PRINCE SUDERSA...",
            "stars": "5 stars"
        },
        {
            "comment": "i placed an order for moto g(2nd gen) and you guys cancelled the order yourself. you did'nt delivered it in the correct time. I was planning to give the phone as a christmas present for my brother and you guys spoiled everything. it was the first time i used flipkart and the service was too bad. I would never recommend flipkart to any of my friends.",
            "date": "29 Dec 2014",
            "name": "Marshal tomy",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this product for two weeks. This product is just awesome. To be honest, I didn't expect this product to be this good in such a mid range. Battery life: good, display: fabulous and performance: mind-blowing",
            "date": "29 Dec 2014",
            "name": "Sudipto Das",
            "stars": "5 stars"
        },
        {
            "comment": "Its just 1 week I'm using MotoG 2nd Gen.. Till yet I didn't face any issue with this phone. Except the icon size (it's little bit big ) everything is looking fine to me..",
            "date": "29 Dec 2014",
            "name": "Pramod",
            "stars": "5 stars"
        },
        {
            "comment": "Today i got this product. So i think it's not a right time to rate a product. I was just attracted by the brand venture Motorola-Google and of-course its cost effective features.",
            "date": "29 Dec 2014",
            "name": "Palanivel Koothar",
            "stars": "5 stars"
        },
        {
            "comment": "Just a great product from Motorola at this price. The only problem is zooming in an out of the camera - that's actually trouble some",
            "date": "29 Dec 2014",
            "name": "Rudra Biswas",
            "stars": "4 stars"
        },
        {
            "comment": "You know the specs, you know the price, you know all the details required. As far as usage is concerned, very user friendly. Beautiful response to touches and a very classy looking phone. Adds a lot of features from the previous gen. It has a 16GB internal memory plus an SD slot upto 32GB, that is a LOT of storage offered. Even with both internal and external memories almost full, the phone runs smoothly. If you want an Android phone and that too something that isn't a Micromax, a Karbonn or a Spice, Then look no further - MOTO G2 it is.",
            "date": "29 Dec 2014",
            "name": "Lijin Varughese",
            "stars": "5 stars"
        },
        {
            "comment": "Best quality at much affordable price. Thanks to flipkart..Very much satisfied with this product. Product: Looks \"amazing\", Display \"superb\"",
            "date": "29 Dec 2014",
            "name": "Balakrishna N",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Good phone..",
            "date": "29 Dec 2014",
            "name": "BJ",
            "stars": "5 stars"
        },
        {
            "comment": "This is my 2nd Moto G2.. bought this for my friend.. never has been technology been so affordable.. Moto G2 is an excellent phone with features that can put others in this price range to shame..",
            "date": "29 Dec 2014",
            "name": "K Savio Devasia",
            "stars": "5 stars"
        },
        {
            "comment": "This has good facilities which is needed for smartphones.. I am much attracted with Camera clarity with this price.. Google product never fails..",
            "date": "29 Dec 2014",
            "name": "Ijaz Kuthpudeen",
            "stars": "4 stars"
        },
        {
            "comment": "Its a really good mid level smartphone. Its just 3 days happened. So far no complaints. Totally in love with this phone. Problem is with delivery guys. I purchased this mobile on EMI.. on Delivery day they called me and asked where I'm? I told in some abc restaurant then they requested we'll come to that restaurant with-in half-an hour not to your address, just coz restaurant is on the way to my home so no need to travel up-to my home (Called at 12:30PM, even they have car) I told okay(I told YES just because they requested a lot). after that I waited 2 hours in that restaurant, They dint come I gone to my home(2PM). After half-an hour(2:30PM) they called and told we'll be at that restaurant with-in 5 minutes. I told I waited for 2 hours now deliver to my home. They told No, If you want come else sorry. We can't come to your address. I gone to that abc restaurant again. There he's scolding me just coz I was not there and told we are gonna return back your product to flipkart by signing \"Customer's Unavailable\" if it happens again. OMG!!! I'm really confused.. In phone he requested he can't come up-to my home address and now he's blaming for the change of address. I'm really requesting flipkart people to tell Ekart delivery guys Just to deliver to given address not calling and requesting to come to some other places just because they can't travel far. Because we guys are already paid money through Debit/Credit cards and waiting for products. from now on I'll do cash on delivery. If something like this happens next time I'm gonna return the product. In that case blame your delivery guys not buyers. Packaging was so good from flipkart and the offers what they given for that smartphone I got it. Thanks flipkart except in the matter of delivery guys. My 2 stars for flipkart and product. Delivery guys are completely horrible.",
            "date": "29 Dec 2014",
            "name": "Ramakrishna Udupa",
            "stars": "2 stars"
        },
        {
            "comment": "Just buy it. It is one of the best 5 phones of 2014 for this price and set of features. Every review of this phone has been great (almost).",
            "date": "29 Dec 2014",
            "name": "Amit Kapoor",
            "stars": "5 stars"
        },
        {
            "comment": "Good smartphone in the given price. Camera Quality, battery backup is excellent compare to asus zenfone 5, also we have wifi hotspot which we don't have in asus. but battery drain gradually which we have to manage in all smartphone today..",
            "date": "29 Dec 2014",
            "name": "Feroz Mansuri",
            "stars": "5 stars"
        },
        {
            "comment": "After using almost 3 months, below are my review. 1. 5 inch easy to handle with Single hand 2. Cameras (Front and Back) and Stereo impressed me 3. Zero Lag. 4. Brilliant Display 5. Expandable memory - Additional advantage 6. Battery Life is longer than Moto g. 7. Nice build quality 8. Touch response & performance is also good. Finally 2 words \"Simply SUPERB\"",
            "date": "29 Dec 2014",
            "name": "Arvind Balichwal",
            "stars": "5 stars"
        },
        {
            "comment": "One of the best phone at Good price and having stunning look. As per my experience it would be the best smart phone for mid range buyers.",
            "date": "29 Dec 2014",
            "name": "SHOUKATALI SHA...",
            "stars": "4 stars"
        },
        {
            "comment": "value of money grate feacher. but bad material quality. best phone i ever had............... .....love this. ;)",
            "date": "29 Dec 2014",
            "name": "Sameer Nautiyal",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone for the prize what ever we pay for. I have exchanged my micromax with this phone, its for for better then my previous phone, in terms of sound quality and robustness.",
            "date": "29 Dec 2014",
            "name": "Indra",
            "stars": "5 stars"
        },
        {
            "comment": "I am using Moto G2 from last 3 month and i m very happy to say its awesome phone ever.Camera,sound clarity.Hardware, everything is good in this phone.in 13000 u get best qulity phone.",
            "date": "29 Dec 2014",
            "name": "Rohit Magdum",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchase this mobile on October 2014, At that time its awesome for use and i really like this mobile but Suddenly in December 2014 (Within 3 Months) its display/Touch pad are not working without any physical damage, I don't no how this happen !!! but I Really unsatisfied with this product. I give this mobile in service station but it will takes 15-20 days for repairing. What can i do at this time without Mobile!!! and also I have lost my all data which is in mobile. I'm very unsatisfied with this product. :( :(",
            "date": "29 Dec 2014",
            "name": "Shyamal Manger",
            "stars": "1 star"
        },
        {
            "comment": "Value for money product,earphone is not good as we dont get good quality of sound.No data cable avialable.Delivery commitment is good.",
            "date": "29 Dec 2014",
            "name": "Raghavendra G S",
            "stars": "5 stars"
        },
        {
            "comment": "within 5 days mob got switchedoff cant reboot.And asked for replacement lets see what gonna be happen quiet disappoint.this happen while playing clash of clan and it so struggle to return to the main menu but 1 thing i real lve is battery life upto 1.7day",
            "date": "29 Dec 2014",
            "name": "Manoj",
            "stars": "1 star"
        },
        {
            "comment": "Friends this phone is pure VFM. At this price, it comes with many features which are the same in costly ones. Performance is also good for this phone. However camera quality isn't impressive.",
            "date": "29 Dec 2014",
            "name": "ANTO JOHN",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is so pleasing with all it's features . so good to get a tier one phone at this price.personally it's superb phone",
            "date": "29 Dec 2014",
            "name": "Naresh uppada",
            "stars": "5 stars"
        },
        {
            "comment": "Got this for my Mom today. Comparing it to my Honor 6, this lags a bit, but overall quite decent. Mainly, switching between tasks, tabs in chrome, launching Skype, show some stutter or delay in launching, but overall, it's quite good.",
            "date": "29 Dec 2014",
            "name": "Prakhar Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Got this for my Mom today. Comparing it to my Honor 6, this lags a bit, but overall quite decent. Mainly, switching between tasks, tabs in chrome, launching Skype, show some stutter or delay in launching, but overall, it's quite good.",
            "date": "29 Dec 2014",
            "name": "Prakhar Singh",
            "stars": "4 stars"
        },
        {
            "comment": "I bought moto G wit great hope. But after 2 days found 1. battery was so worse that if u will not do anything with screen off it consumes 8-10%. if u want to play games or browse internet have ur chargers nearby always. 2. Network problem- it can only hv networks at only very good network otherwise when my samsung mobile with same sim and same location shows good signal strength, and this moto g shows \" Emergency calls only\". Rest is gud.. if u want not to call any body, chat or browsing u can go with this mobile because u will not find not network neither battery backup.",
            "date": "29 Dec 2014",
            "name": "Krishna",
            "stars": "1 star"
        },
        {
            "comment": "This is one of the best smart phone in range of 15K. I bought it and I am happy to use it. I gave it 4 stars instead of 5 stars because all I needed was an android default launcher for Android vr.4.4.4 but all other moto system upgrades,the default launcher will be replaced with the google now launcher. Although its not a demerit I have checked it completely and found it to be a useful device... What I checked that other critics or buyers were saying a lot about its low voice from speakers, not so good display and a bad battery backup. i) My Moto g (2nd Generation) has an awesome display with everything good-> brightness, contrast, colors etc. ii) My Moto G2 has an amazing voice clarity form speakers even if I listen to any music or play any game (RipTide GP 2). iii) My Moto G2 with 100% battery lasts upto 6-8 hours if continuously used. Its a merit cause as fas as I have tested so many android phones, they doesn't lasts for even 5 hours when used continuously. If you can afford it, then you should buy it, cause its the best among the bests. Although it has a good competitor that is, hTC 616, but still I'll advice you to buy this..... As already said that it is, \"Best out of bests\". Even a title to Moto G1 was given by so many magazines and newspapers, it was, \"POOR PEOPLE's NEXUS\", so Moto G2 can be easily titled as \"POOR PEOPLE's NEXUS6 \". I guarantee.",
            "date": "28 Dec 2014",
            "name": "Kirtimaan Chhabra",
            "stars": "4 stars"
        },
        {
            "comment": "As Usual great Service from Flipkart - Thanks Exceptional phone, Exceptional price..... Truly Great Phone for a First time Android user. Been using this phone for around a month now, no issue with the Phone. Battery is good, was able to get a max of 2 days without charging... At first was not sure of buying this Phone. But after checking the reviews finally got it and I don't regret it. Thanks Moto and Flipkart.......",
            "date": "28 Dec 2014",
            "name": "Rohan Daniel",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen. is amazing smart phone with superb features. The most attractive thing of this smartphone are 5\" display & low price. And i am happy with the flipkart because they always provide better product and fast delivery.",
            "date": "28 Dec 2014",
            "name": "Vivek Kushwah",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 is really a great phone with amazing performance, camera, display and storage space... I recommend Moto G2, if the price range is 12 - 15K...",
            "date": "28 Dec 2014",
            "name": "Suresh Kumar B...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought Moto G 2nd Gen in the month of Sept'14 - expecting a great phone from Moto. From the day one, i have been facing a issue of battery backup - hardly four to five hours. Now, its time to reinvest in mobile phone as some couple of other problem developed - like slow response/ delay response. If you are looking for good battery life & faster response - it would be advisable to look for all other options",
            "date": "28 Dec 2014",
            "name": "Prakash Bharati",
            "stars": "2 stars"
        }
    ]
}
