{
    "filpkart": [
        {
            "comment": "I think moto send me the 2nd hand phone on exchange policy.i got 1st mobile on 20th July there is charger problem on that mobile and than i exchange with another on 28th July only i used 2 days only the screen is shaking and camera is not working and i capture pic that is is not store in device.Last but not least Battery is worst it's gives 6 hours charging only. My friends also faces this problems I think Flipkart and Moto both are cheated the costumers with the exchange mobile policy.I don't rec amended This mobile to any one.",
            "date": "03 Aug 2015",
            "name": "M Pavan Kishor...",
            "stars": "1 star"
        },
        {
            "comment": "First impression is good. Back panel is of god quality and has good grip. So phone will not sip from your hands easily. Dual speakers are good. I struggled with importing contacts from my old feature phone using inbuilt \"Migrate\" app but finally successfully imported all the contacts. But the extra information like birthday (birth dates are stored in my old phone for each contact) was not imported. I didn't see any option to add birthdays/ anniversary dates to contacts in Moto G2 which is disappointing. Even though it is mentioned on few websites, I was not able to import photos and videos from my old phone using Migrate app. Multi user and switch user options are good... I can now handover my phone with guest user to my son (2 years old) with no fear of loosing any data :) While setting Radio, first select the region and then scan for stations. Camera is not very good, I struggled with focusing and capturing initially. If you want to capture the moments fast, it is not useful. Low light picture quality is very bad (even with flash ON). After receiving the new camera update, I can adjust the exposure which is a good feature. I'll explore the camera more and will post the updates. I didn't like the headsets provided with this phone. USB cable is not provided. :( SAR value is very high (4.52 W/kg at Head - 1.6 is SAR limit in India) I guess Oneplus One is having very low SAR values. It takes around 3 hrs to fully charge the batteries. If I use the phone while charging, I got wired experience like while tapping backspace, \".\" was inserted or while tapping some letter, adjacent letter was inserted. When I turned off the power, and restarted the keyboard, it worked fine. I observed the same many times even I'm not charging the phone. I'm unable to re-size the speed dial list icons (wanted smaller sized icons) I was not able to set custom sound equalizer for speakers. I also didn't like the google mp3 player which has limited options. How to record the calls? Seems there is no default option. I may need to download some app for this.",
            "date": "03 Aug 2015",
            "name": "Hemant Phadke",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G 2nd Generation is undoubtedly a fantastic Android phone in 10k-12k range. It has everything required for a moderate to high usage. For this order, I was quite disappointed with Flipkart delivery. I ordered this phone for next day delivery. Till evening of the expected delivery day, I called multiple times in WSRetail and Flipkart call centre to locate the delivery boy and an estimated time of delivery. And all of a sudden, I got an SMS stating the phone has been delivered, which was a shock for me. I was at home all day awaiting delivery and nobody knocked my door. Even then, when I called Flipkart call centre, I got reply that it will be delivered shortly. After an hour, when I was leaving my building, the security person told me that Flipkart has delivered my order at the security gate. This was extreme example of being un-professional.",
            "date": "03 Aug 2015",
            "name": "Rudrajyoti Biswas",
            "stars": "4 stars"
        },
        {
            "comment": "Am very satisfied after purchase of this device some months ago. It is fast, the camera is good, voice quality is loud and clear, fully charged battery lasts the whole day with reasonable internet use. I also enjoy the text prediction. There is a bit of a problem with the phone getting heated after lengthy internet use and sometimes after a long call.",
            "date": "03 Aug 2015",
            "name": "DJ Dadoo",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product for 10000. cant expect from in such a price. delivery was swift and product is jut amazing. camera, memory, screen size are great. Resolution could have been better",
            "date": "02 Aug 2015",
            "name": "Sunny Wadhwa",
            "stars": "4 stars"
        },
        {
            "comment": "Within 2 month right half side of the touchscreen has stopped responding. Lots of problem with the connectivity, call connects but connection is one way. Factory reset also did not help. Not sure if flipkart sold me a refurbished product in the name of discount sale. Also Read some reviews about G3 looks as if motorola is constantly degrading the product quality. Now I am advised to run around the service center.",
            "date": "02 Aug 2015",
            "name": "Amitabh Saha",
            "stars": "1 star"
        },
        {
            "comment": "Mobile gets switched off automatically, even when you are using it. Started the return of product let's see the response from flipkart.I'll update soon.",
            "date": "02 Aug 2015",
            "name": "Ankit Wasankar",
            "stars": "1 star"
        },
        {
            "comment": "The device that I received have faults related to its speaker. Their is a disturbance sound coming from the phone and I have requested for the return twice but yet to receive any assistance from flipkart's side.",
            "date": "02 Aug 2015",
            "name": "Anurag Agarwal",
            "stars": "1 star"
        },
        {
            "comment": "worst phone i ever purchased battery drains quickly charges late asked for return but rejected from flipkart. Could have given zero stars if possible",
            "date": "02 Aug 2015",
            "name": "Prashant singh...",
            "stars": "1 star"
        },
        {
            "comment": "Before I purchase this phone i do a lot research or compare and i also read a reviews and after i purchase this phone i fed-up this phone.. It is too much hanging issue and the phone get slow.. But thanks flip-kart for resolve the issue.",
            "date": "02 Aug 2015",
            "name": "Rahul",
            "stars": "3 stars"
        },
        {
            "comment": "Worst Product Ever.. it get heated frequently,,,, executives of them telling to force stop applications thanks they didn't said not to use them. Fake one",
            "date": "02 Aug 2015",
            "name": "Rizwan hasan",
            "stars": "1 star"
        },
        {
            "comment": "i bought this phone and soon i discover heating issues and software lagging issues in this phone. i requested for replacement but it seems to be lengthy and tiring procedure. Technician called up and tested my phone remotely and declared phone has no issues.(LOL) Another thing because of my job conditions i can not take a leave on a weekday, now this person is saying go see to service center then he will help you in this matter. Again then whats the use of 30 days return policy? Should have declared you will not get a replacement at any cost. Where are the privileges of being Flipkart First User? i am seriously hoping if flipkart take a look in this matter. or else it will be really a big disappointment to me. Even i know flipkart will have no effect of braking relation with one customer. So even i am doubtful whether to keep hopes or not.",
            "date": "02 Aug 2015",
            "name": "Aniruddha Khairnar",
            "stars": "2 stars"
        },
        {
            "comment": "Almost best smart phone, all features working very well, Camera quality is very good........ battery performance is okok, no hangging.",
            "date": "02 Aug 2015",
            "name": "Amar Singh",
            "stars": "5 stars"
        },
        {
            "comment": "no body can beat its display very good excellent very smooth running good for daily use very good battery",
            "date": "02 Aug 2015",
            "name": "Sanjeev Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone since 8 months now. This device has constant wireless problem, Signal keeps on dropping. So while you are on important call on skype it will suddenly go.",
            "date": "02 Aug 2015",
            "name": "SG",
            "stars": "1 star"
        },
        {
            "comment": "I have been using the Moto G 2nd generation for the past three months and below is my review in brief - 1. The processor of the phone may be just quad core but it provides really good results even in heavy usage. I have played games and listened to music via my bluetooth headset and also downloading 1 GB of movies all at the same time without any lags. It does not heat up too...initially it does though in the first use later on it doesnt. 2. Moto provides the latest Android updates quicker than even Google can give to its Nexus which is a major boon for users who'd like to have the latest Android version to brag about to their friends. 3. Coming to the camera it is a 8mp rear and 2mp front. The cameras are good not great as compared to hi-end phones but as compared to the same price phones which boast a 13 mp camera, I would say the pictures clarity is the same if not better on the Moto G2. The HD video recording is also good. 4. The display of the phone is just 720 x 1280 pixel but the ppi is very good as compared to other phones and I dont find much difference. The phone has good viewing angles and in bright sunlight too it is visible. Overall, Motorola doesn't just put any hardware of high spec and expect it to work flawlessly it does test it phones for performance and most importantly long lasting ability. There are phones that give better specs like octa core processors nad 13 mp cameras but they won't give you a better performing machine. Definitely Motorola phones are gonna last you longer than any other phone in the price range for the simple fact that it performs in every situation when others fail. Its a trusty phone that wont let your hard spent money go waste...go buy it !!!",
            "date": "02 Aug 2015",
            "name": "Denzil D'Souza",
            "stars": "5 stars"
        },
        {
            "comment": "I bought moto g in april but within two months screen started to freez.. After replacement of screen the problem is still there. Even though there are great specification on paper bit in reality it is not. Totally disappointed.....",
            "date": "01 Aug 2015",
            "name": "Haramrit Singh",
            "stars": "2 stars"
        },
        {
            "comment": "Airtel offer not working.. Not sure why it is given with the phone. to fool people and just to add on for show off.. Poor response of the Call center and rude replies... Dont expect poor replies on Flipkart part. When u have a name.",
            "date": "01 Aug 2015",
            "name": "Garvit Girotra",
            "stars": "1 star"
        },
        {
            "comment": "I've bought this mobile a week back.The charger is useless.It discharges the battery instead of charging it.When I asked for a replacement, I got a reply saying that my request has been rejected.But why? And there are issues with calls too.Is there any problem with the device because few of my friends have no issues with the mobile.",
            "date": "01 Aug 2015",
            "name": "Meghana Reddy",
            "stars": "1 star"
        },
        {
            "comment": "I bought the phone some three months ago and immediately started facing issues. Apps such as moneycontrol keep frequently crashing, the screen brightness is not that adaptive and the screen size is less than 5 inches (due to onscreen buttons - a lot of body space wasted). The battery!!! Today I fully charged the phone at 3.00pm. At 7.00 pm I have 58% battery and I was home the entire time with almost zero phone calls!!! The battery issues started in the first month itself when from 100% the battery fell to 18% in 5 mins (I have the screenshot). These days I have to recharge every 8 hours or so else I will be carrying a piece of rock instead of a smart phone. Request everyone to stay away from this phone.",
            "date": "01 Aug 2015",
            "name": "Jimmit Shah",
            "stars": "1 star"
        },
        {
            "comment": "good product reasonable price n fast delivery.........................................................................................",
            "date": "01 Aug 2015",
            "name": "Mustafa Soni",
            "stars": "5 stars"
        },
        {
            "comment": "1st generation is much time better than this one. having 5\" inch screen but battery is lesser than 1st gen. poor battery, hang issue. don't go for it. Because of that price is reducing day by day.",
            "date": "01 Aug 2015",
            "name": "Gaurav Tiwari",
            "stars": "1 star"
        },
        {
            "comment": "By using pure android it's really a great feel. By using other smartphones it's give a great touch feel. Good camera. Only problem is batter backup is not for whole day when using wi-fi or mobile networks",
            "date": "01 Aug 2015",
            "name": "Dhamu",
            "stars": "5 stars"
        },
        {
            "comment": "everything is good except battery performance, since it android platform what more can we expect with this budget",
            "date": "01 Aug 2015",
            "name": "Vidyasagar Ra...",
            "stars": "4 stars"
        },
        {
            "comment": "By using pure android it's really a great feel. By using other smartphones it's give a great touch feel. Good camera. Only problem is batter backup is not for whole day when using wi-fi or mobile networks",
            "date": "01 Aug 2015",
            "name": "Dhamu",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing performance........ CAMERA Video Recording Yes, 720 x 1280, 30 fps Flash LED Other Camera Features Auto Focus, Slow Motion Video, Burst Mode, Auto HDR, Panorama, Tap to Focus Zoom Digital Zoom - 4x HD Recording HD Rear Camera Yes, 8 MP Front Facing Camera Yes, 2 MP MULTIMEDIA Video Player Yes, Supports MPEG4, H.263, H.264, HD Music Player Yes, Supports WAV, MP3, eAAC+, AMR-NB, MIDI, AAC+, AMR-WB, AAC FM Yes DISPLAY Resolution HD, 720 x 1280 Pixels Other Display Features Corning Gorilla Glass 3 Type IPS LCD Size 5 inch BATTERY Type 2070 mAh MEMORY AND STORAGE Expandable Memory microSD, upto 32 GB Memory 1 GB RAM Internal 16 GB PLATFORM Operating Freq GSM - 850, 900, 1800, 1900; UMTS - 2100 OS Android v4.4.4 (KitKat), Upgradable to v5.0 (Lollipop)(OTA Upgrade) Graphics Adreno 305, 450 MHz Single Core Processor 1.2 GHz + Qualcomm Snapdragon 400, Quad Core *******************************************************************************************************",
            "date": "01 Aug 2015",
            "name": "Asutos Choudhury",
            "stars": "5 stars"
        },
        {
            "comment": "worse phone in my life ................................................................................................................................................................................",
            "date": "01 Aug 2015",
            "name": "Rakesh Gowd",
            "stars": "1 star"
        },
        {
            "comment": "dont buy moto g2 now because if u purchasing moto g2 they will send u only refurbished products not new one i bought moto g2 from ws retails they sold me faulty one then i claim for refund they give me replacement again the replacement was faulty it has camera issues again same request for refund but again replace faulty again reund.... and so on it took me 4 replacements then finally they approved for refund and still they didnt give my refund in original payment mode they give it in flipkart wallet again i thought the product is good at this price so i purchased it again( NO OPTION CAUSE MY MONEY STUCK IN WALLET ) and again they sold me faulty product which is hanging tooooo much and tuch respond is horrible !! too much bad experience with flipkart !!",
            "date": "01 Aug 2015",
            "name": "Pankaj",
            "stars": "1 star"
        },
        {
            "comment": "Got this phone within two days of ordering............ writing this review after 2 weeks of complete usage. PROS - 1.Great display... crisp display... Great to watch videos.... 2. Awesome rear and front camera...some ppl said that camera is not upto the mark...(they dnt know how to use it effectifvely)..pic are crystal clear and perfect.... nature photography lovers will love it..... 3. Battery performance is just like android phone but slight better than others... charge lasts 1day with normal use of 3g, calling etc..... CONS- none yet.... no lags.. no issues.... VERDICT- great phone...great price range....must buy.... P.S : Flipkart's amazing delivery is the cherry on top.",
            "date": "01 Aug 2015",
            "name": "Anirudh Madiq",
            "stars": "5 stars"
        },
        {
            "comment": "Too much hanged and music player not properly working when i contact to flipkart they only said reboot the phone this is not the solution of the problem.Totally frustrated.",
            "date": "01 Aug 2015",
            "name": "Priyanshu Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Nice product ,Really good service from flipkart for replacement , W S seller is the best seller on this site ....",
            "date": "01 Aug 2015",
            "name": "Shrikant Pohekar",
            "stars": "5 stars"
        },
        {
            "comment": "Camera quality is Good but sometimes it stop working. mobile stuck on calling screen and reboot after some time.",
            "date": "01 Aug 2015",
            "name": "Mohsin Shaikh",
            "stars": "3 stars"
        },
        {
            "comment": "Pros 1) Good desing 2) Handy body 3) Nice screen size Corns: 1) Hangs out during operating (for 2-3 secs) 2) Speed is not as per the technical specifications 3) Works slow From second month of my purchase the price slashed by 2 K And is stil want to sell it (its been 4 months is using it).",
            "date": "01 Aug 2015",
            "name": "Ravi Tiwari",
            "stars": "1 star"
        },
        {
            "comment": "The Moto G (2nd generation ) mobile purchased on 27th june 2015 had camera problem after a week. When the camera icon is clicked a black screen appears. Can it be replaced?",
            "date": "31 Jul 2015",
            "name": "Anjali Chatterjee",
            "stars": "1 star"
        },
        {
            "comment": "worth it :D happy.. strongly recommend .... camera clarity is too good .. head set is not too gud...................................",
            "date": "31 Jul 2015",
            "name": "Ketan Bhalerao",
            "stars": "5 stars"
        },
        {
            "comment": "Camera is good. Look is average. But takes long time to attach to network after power on. Some time stucks also. Some time I receive call but it does not work on touch screen. After multiple try it get received or call was not received at all. After using for 4~5 months, it becomes slow. Take times for all operation.",
            "date": "31 Jul 2015",
            "name": "Aditya",
            "stars": "2 stars"
        },
        {
            "comment": "one of the worse cell ever.. battery disfunctioning just after 3 months of usage.. and many other small issues which are really irritating. i suggest not to buy this phone,,",
            "date": "31 Jul 2015",
            "name": "Sagar Badgujar",
            "stars": "1 star"
        },
        {
            "comment": "Extremely poor call quality with humming beep in the back ground. The beep gets loud and irritating at times. I suspect that the front speakers near the earpiece is giving the interference noise. A basic design defect, probably.",
            "date": "31 Jul 2015",
            "name": "Jolly Gabriel...",
            "stars": "1 star"
        },
        {
            "comment": "Good product. Had battery life been bit more I would have rated this 5. Every possible good things you will get which you require from a middle ranged Android phone. Especially the display and touch feel are superb, makes it stand out from other phones within this price range.",
            "date": "31 Jul 2015",
            "name": "Biswarup Bhatt...",
            "stars": "4 stars"
        },
        {
            "comment": "Very good product with really amazing features. Nice build quality. The quality of the pictures taken from front and rear camera of this device is outstanding. Totally fallen love with this piece of engineering. The only issue I am facing is the charge: it won't last for single day. Overall its nice to have Moto G 2 in my arsenal of si-fi toys :)",
            "date": "31 Jul 2015",
            "name": "Parakrant Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "This mobile will not supports to 4g, battery back up, camera, and product quality is really very good, after some months mike was not working for 4 times and again automatically its working god now from 1 month.",
            "date": "31 Jul 2015",
            "name": "Shiva Mantur",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Product and quality. Good looks and features. Is functioning well. Sleek appearance. I only feel it should come along with cover.",
            "date": "31 Jul 2015",
            "name": "RAHUL PRIYADARSHI",
            "stars": "5 stars"
        },
        {
            "comment": "I Request people not buy Electronic Items from flip kart, especially Mobile Phone I had a very bad experience have lost my 10k, the bloody who's there in Technical Team Ajay, he's hell I don't know how he got appointed in technical Team. Please value customers don't cheat them, handing over the defected Products.",
            "date": "31 Jul 2015",
            "name": "Chandru",
            "stars": "1 star"
        },
        {
            "comment": "Battery lasts just for 8 hours in full Brightness With3G uasge. Okayish Selfie Camera. As well as hangs up on installing more applications.",
            "date": "31 Jul 2015",
            "name": "Rushabh Shethiya",
            "stars": "1 star"
        },
        {
            "comment": "If you need a perfect Android phone with a brand name, good specifications and under budget, the only option is Moto G.",
            "date": "31 Jul 2015",
            "name": "SATYAKANTH KOM...",
            "stars": "5 stars"
        },
        {
            "comment": "very nice phone..............................................................................................................................................................................................................",
            "date": "31 Jul 2015",
            "name": "Ujjval Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "Compared to other phones it was better, but 3rd generation beat this..Could have waited for 3rd generation",
            "date": "31 Jul 2015",
            "name": "Vishnu",
            "stars": "4 stars"
        },
        {
            "comment": "it is quiet good.But it have hanging problem and its camera quality is very good.Camera is in comaparable.But i suggest overall it is good phone.",
            "date": "31 Jul 2015",
            "name": "Ankit Shukla",
            "stars": "3 stars"
        },
        {
            "comment": "Best product, good packing, got delivery in a day! It would've been a 5 Star rating but I ordered White model but Flipkart delivered Black! -1 Star for that!",
            "date": "31 Jul 2015",
            "name": "Ninad Sathe",
            "stars": "4 stars"
        },
        {
            "comment": "while using vidio camera...after few minutes camera portion getting heated and also when using wifi or data continously then this problem arises..",
            "date": "31 Jul 2015",
            "name": "sagar bhardwaj",
            "stars": "3 stars"
        },
        {
            "comment": "frnds as we all know that WS RETAIL (seller) is own seller of flipkart. they are fooling all the public. they are playing with public. do nt buy any electrical goods which u get from WS RETAIL unless u get the same product from other seller.. actually they are playing tricks and fooling every one. comming to product: they are mentioning many features to describe the phone, but those are not applicable wen u apply for replacement, let me describe u answers given by them for my questions........ i called their customer care and asked:>>>>: Q my phone is heating up so fast.....? ANS: donot usethe phone for long time countinously.. Q am getting sound from speaker. it is disturbing me a lot ....? ANS: u update ur apps it will be resolve.... Q I again asked wat is the link between speaker and software...? ANS: u update ur apps it will be resolve.... their are many questions like dis and finally they cancelled my return request.... IAM GIVING 1 STAR BECAUSE IT IS THE LAST OPTION",
            "date": "31 Jul 2015",
            "name": "sankalp",
            "stars": "1 star"
        },
        {
            "comment": "Phone performance is good however there are two big issue which are battery and heating problem. Battery will die in 10 to 12 hours if you are using data. While call/Charging/Hotspot/Data Transfer mobile get heated which is surely harmful.",
            "date": "31 Jul 2015",
            "name": "Nishant Jagdale",
            "stars": "2 stars"
        },
        {
            "comment": "my 1 months experience is a battery problem of mobile 2040 not sufficient battery using moto g2 all of the day use all time internet will be on so battery fast be less....",
            "date": "30 Jul 2015",
            "name": "Pandurang Chopade",
            "stars": "4 stars"
        },
        {
            "comment": "the device is really good in all aspects of configuration. but here it failed in few basic needs of mobile phones. it makes continuous cracking sound on calls. i did complain flip-kart for this problem, as they said i installed there shitty smart-check app also. they couldn't help me and also denied for return policy. one more major problem was the SAR value, it is very high for head as 1.52w/kg. (INDIAN SAR norms is maximum 1.60w/kg) its just 0.8w/kg less than that. i usually be on calls for hours together. these radiation did affect me very badly, it also does same even while using WiFi and Bluetooth. i suffered from sever head ache for almost 6days, tried all medicines. finally removed sim from motog2 and started using my old Samsung mobile phone (SAR VALUE 0.32w/kg) felt really great relief. and sold motog2",
            "date": "30 Jul 2015",
            "name": "Chiru",
            "stars": "1 star"
        },
        {
            "comment": "Feels good to have this mobile.. this is really value for money. look is awesome. comfortable to carry. Touch is really good. using this device since one week. no problem observed. Not hanging. You need to charge everyday morning it will work till late night. Voice quality is good. It is not something great but it is good!! so go for it!! now even Moto G 3rd generation is available...",
            "date": "30 Jul 2015",
            "name": "Amit Soni",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased an MOTO G 2nd Generation mobile from flipkart, the mobile was horrible working condition and its not working properly. I have requested for replacement and customer support people confirmed the replacement and they have not replaced my mobile.",
            "date": "30 Jul 2015",
            "name": "Nageswararao Y...",
            "stars": "1 star"
        },
        {
            "comment": "Awesome Product..Always recommend this mobile to my friends...keep it up Moto... Very good service from flipkart...Thanks",
            "date": "30 Jul 2015",
            "name": "Vivek",
            "stars": "5 stars"
        },
        {
            "comment": "worst battery of the mobile...I have seen in my life....hence not recommended to anyone..I never expected that flipkart will cheat me like this being the old and esteemed customer of Flipkart. Very disappointed to buy this phone..battery get drained in 5-7 hours without usage.",
            "date": "30 Jul 2015",
            "name": "Anupam",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this mobile for my Papa. And I would say this was really a perfect gift for him. If someone wanna get a rigorous testing of a mobile phone; they can consult my Papa. He has downloaded a no. of apps and although the battery drains out but still I am happy that he is enjoying it. Thanks Moto and thanks Flipkart.",
            "date": "30 Jul 2015",
            "name": "Tushar Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "After buying 4-5 Moto G handsets and 2 Moto G 2nd Gen sets, leave alone the other purchases, never ever expected such service from them. Am hugely dissappointed from flipkart and its technical team. Will think twice the next time before booking any orders. I wish I could have gone for zero star but there is no option as such. Feeling cheated!!",
            "date": "30 Jul 2015",
            "name": "siddharth ladh...",
            "stars": "1 star"
        },
        {
            "comment": "HI ALL, I BOUGHT THIS PRODUCT MID JULY AND WITHIN FEW DAYS I HAD A SO MANY PROBLEMS WITH IT, SIM CARS IS GETTING REMOVED AUTOMATICALLY AND SAME IS HAPPENING WITH MEMORY CARD EVERYTIME I HAVE TO SWITCH OFF THE PHONE AND AFTER FEW MINUTES SAME HAPPENS.WHENEVER I PLUG MY PHONE TO CHARGE MEMORY CARD GETS UNMOUNTED AUTOMATICALLY AND THEN YOU HAVE TO SWITCH IT OFF AND ON. VERY BAD EXPERIENCE WITH MOTO I CALLED MOTO CUSTOMER SERVICE AND THEY SAID WE CAN'T DO ANYTHING CONTACT FLIPKART OR TAKE YOUR PHONE TO SERVICE CENTER THERE'S SOME HARDWARE ISSUE.I CAN'T BELIVE THIS THE PHONE WHICH I BOUGHT 1-2 WEEKS BEFORE I HAVE TO TAKE IT TO SERVICE CENTER. NOT ONLY THIS MUCH I APPLIED IT FOR A REPLACEMENT ON 29/07/15 SO FAR NO RESPONSE OR ANY CONFIRMATTION FROM FLIPKART EITHER.THEY ARE CHEATING CUSTOMERS AND GIVING FRAUDLENT PRODUCTS.I'LL UPDATE THE SAME ON SOCIAL NETWORKING AS WELL IF WON'T GET NEW ONE ASAP!!",
            "date": "30 Jul 2015",
            "name": "Ankur Khullar",
            "stars": "1 star"
        },
        {
            "comment": "Very good phone, works like butter, minimal lag and stutter, takes excellent pictures, and has no bloatware. Super buy for the price and now with a price cut it is like a supper buy.",
            "date": "30 Jul 2015",
            "name": "Krishanu Majumdar",
            "stars": "5 stars"
        },
        {
            "comment": "I took this mobile on 24th June. In two days i got problem with charger. Now from 32nd day i was getting problem with phone no vibration no ring while getting calls. If we call this flipkart the ultimate response is \"if you have placed complaint on 30th day. We will replace\". I just wondering. If we are facing problem on 32nd day how will complaint on 30th day?",
            "date": "30 Jul 2015",
            "name": "Chandrakanth",
            "stars": "1 star"
        },
        {
            "comment": "pathetic would be a soft word for the battery this fone has.... cant last more than 4 - 5 hrs with 100% charge. 2 months old and already pissed off with the battery backup... Even i phones give better battery performance. Also the phones lags a lot, hangs quiet often, screen also flickers at times....",
            "date": "30 Jul 2015",
            "name": "Sunveer Singh...",
            "stars": "2 stars"
        },
        {
            "comment": "phone design is very bad and camera is too bad.photos that are taken by lenovoA7000 much better than the photos taken by moto rear camera",
            "date": "30 Jul 2015",
            "name": "Karra Ashok Kumar",
            "stars": "1 star"
        },
        {
            "comment": "V bad phone overall. Superior Lag time. Heats up on charging. Look wise tacky and I would never recommend it to anyone",
            "date": "30 Jul 2015",
            "name": "Savio DSOUZA",
            "stars": "1 star"
        },
        {
            "comment": "After using it for 2 months i will say one must go for it however battery backup is not as per standard but it is resolved after upgrading to lollipop.",
            "date": "30 Jul 2015",
            "name": "AMAN SINGH",
            "stars": "5 stars"
        },
        {
            "comment": "High radiation, week battery and taking long time to recharge. Little bit of touch problem and sometimes phone not working properly",
            "date": "30 Jul 2015",
            "name": "SWARGAM SRINIVAS",
            "stars": "1 star"
        },
        {
            "comment": "Awesome phone but all the memory card does not support. This is good in comparison of other phone with this price. I recommend this phone to all my friends :)",
            "date": "30 Jul 2015",
            "name": "Abdul Hasan",
            "stars": "4 stars"
        },
        {
            "comment": "Battery Issue in 3 months.. when i',m connect my charger phone showing battery is full but few min phone will switch off automatically and battery showing 0%..",
            "date": "30 Jul 2015",
            "name": "Sohan Lal",
            "stars": "1 star"
        },
        {
            "comment": "trust gained from flipkart again i ordered moto g2 on 16 n got it on 17 ... as per.handset that was defected out of the box.. battery was 46% than drained in 1 hr..... got the replacement without any prb.>!! service rocked..!! that time..!! 2nd piece got..that was the biggest disaster out of the box 42% battery ..than the disaster happened.... 35 minute battery dead..!!! wow but flipkart service i would say itz awesome because of 1 executive.. Emraan Or Imraan the one whom i spoke to ..!! Amazing executive..!!!! before talking to executive..!! the expert called and checked it through smartchk app Battery Draining Like..!! Downloading 5 mb song at 244kbps..! lol.. and sometimes no voice over the call this happened when expert called me.>!! withing tat ..!! and the prb found..than told me i will get refund.>!! thaan sddnly ...i when i saw status \"Replacement Rejected\" that time.>!!! i was out of my mind.!!! i called than i talked with this executive solved my prb.>!! today they picked up the device..!! at 12.40 pm..and at around 8 pm.>!!! i got my money back..!!! Big Thumbs Up..!! For The Flipkart Service... Flipkart Best Trusted Site When They Have A Executives Like Imraan/Emraan Rating 5 star on bases of flipkart service and got refund on the same day",
            "date": "30 Jul 2015",
            "name": "Un'predictable...",
            "stars": "5 stars"
        },
        {
            "comment": "overall all things are good ..after 4 day of use moto g run well...and flipkart shipping is always be awesome for their delivery.",
            "date": "29 Jul 2015",
            "name": "udeshya kumar",
            "stars": "4 stars"
        },
        {
            "comment": "FLIPKART was the best online portal in India and now they are the worst online portal in India. Soon the portal will be banned in India due to their cheating business! They have so called customer kill department who never understand the issue and keep on irritating customers! Stay out of Flipkart if you love your money! I want to share the experience with my latest purchase of Moto G 2nd Gen. I purchased Moto G on 23rd June and from there my fight with the worst portal in India has started. The phone received by me was defective and it had issues in the speaker. I lodged complaint the very next day. Flipkart tried all their ways to retain with me. They asked me to install the smart check soft \\ware and mentioned that the executive will call next day which never happened. After struggling 5 days they called and asked me reset the phone which never used! Have you ever experienced? I am sure there would be people who purchased from Flipkart!. The executive tried all his techniques to establish the fact the phone is in good condition and without issues but in fact it is a defective piece which they sold with discount rate! I never agreed whatever he said and later the guy agreed to replace the item. But they said they cannot pick up the item and I need to send to them. I spend Rs.310.00 to sent the item to their warehouse on 6th July. IT IS CALLED HASSLE FREE RETURN! BEST IN WORST SERVICE! FLIPKART WINS! I received the replacement on 16th July which is after 10 days! WHAT A SERVICE! FLIPKART WINS! The replacement item was also defective! When I switched on the phone it showed only colored lines! I again lodged complaint! Again they asked me to install smart check software on the phone which has no display! WHAT A CUSTOMER SERVICE AND INVSTIGATION CAPABILITY! AGAIN THE BEST IN WORST SERVICE!FLIPKART WINS! This time I clearly mentioned that I will not spend even single rupee to send a defective piece! Flipkart never agreed and asked me to wait till 22nd July to get an answer and on 22nd they closed my ticket without resolution! I re-opened the ticket which they closed again! Then I opened all my previous tickets and opened new tickets for the issue. I have sent out 84 emails to them! They made a customer to write so much! FLIPKART WINS! Finally after all bad emails communications they agreed to take back the product through courier service for which they provided me token which was opened for 24hrs and they never informed the timelines! When I visited the courier service they did not accept since the token becomes invalid! Again the fight started and provided new token after 3 days! FLPKART WINS! At last I decided not to accept MOTO G anymore since FLIPKART carry all the defective pieces which were returned customers due to issues. Flipkart found a good solution to sell ot off through discount program! So I clearly told them not send the defective product again and move the money to wallet to purchase a brand product which is not defective or discounted item. They agreed and confirmed that the issue will be closed on 27th July. But to make everyone surprise! The shameless creatures shipped another defective piece on 28th July and delivered on 29th July! WHAT A CUSTOMER SERVICE! They have delivered a product which is already cancelled by the customer! My family who is o\\not aware of this shameless and non sense business of Flipkart accepted it the item! Everyday the customer case will give one ring and next moment write a SMS stating the non sense customer care could not reach out to me! Now I am sitting with the defective Moto G piece! FLIPKART WINS! They sold a defective piece! My advice to everyone who love to purchase things online. STAY OUT OF FLIPKART! They are the worst hassle free return policy portal and the worst customer support policy.",
            "date": "29 Jul 2015",
            "name": "Riju",
            "stars": "1 star"
        },
        {
            "comment": "Awesome budget phone i ever used .. this is really a mass product from the great creator motorola 1) lag free 2)nice cam 3)screen awsm no word to express .used since 3 months",
            "date": "29 Jul 2015",
            "name": "athulraj",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this mobile past 6 months. Performance is extreme. No time lag is there during multi-tasking. Even it recoognises our voice and responds without time lag. Gaming in this device is good. The Camera performance is EXTREME. I would u to go with only MOTO products coz they r DAMM GUD.",
            "date": "29 Jul 2015",
            "name": "Sriram Ganesh",
            "stars": "5 stars"
        },
        {
            "comment": "Phone getting heat when we used camera for 15 minutes. Even observed same when we used internet for 30 minutes. Even observed that getting heat when we used phone for 30 minutes for calling purpose. I am not at all satisfied with this product. Regards Venkatesh",
            "date": "29 Jul 2015",
            "name": "Venkatesh Kona",
            "stars": "1 star"
        },
        {
            "comment": "This was my 3rd Moto G (2nd Gen) purchase on flipkart (for my family members). Easily the best & obvious choice in the entire segment. Though I had cheaper choices with similar specifications in 7k-10k range. The peace of mind & quality confidence from having a reputed brand like Motorola tilted my decision in its favor every time I searched for a mobile. On this occasion my sole requirement was to find a phone with best ear piece quality as my uncle is having problems in hearing the voice of the caller on the other side in voice calls on his samsung smart phone especially when in heavy traffic. I started my research on google with this single requirement in the price range of 10k. Surprisingly, I found Moto G to be having a very good loudness i.e. 81 db voice output level. On par & also slightly better than some of the best selling 30-40k range mobiles. This sound level is far better than all the mobiles in 10k range. Even the loudspeaker is best in the segment. So, if you are looking for a mobile that has best earpiece voice loudness below 25k price, this is the one for you. However, after using the phone for 3 days, the display has completely blanked out. I can feel the phone still working normal except for the display. Despite not able to see display, I can receive calls & talk when i touch on the location where the answer slide used to be. I can hear the incoming call & message notifications. But, the screen was always blank. May be a power circuit to the screen issue. My uncle has started using it only after 10 days. So, on the 14th day I raised a replacement request with flipkart via website explaining in writing the complete issue. Further, I had to wait for 2 days for a call from the executive to whom I had to explain the same problem again. He has asked to me go through the trouble shooting & it couldnt be done as the screen was blank. Finally, he said that I would get another call from a senior executive. This took another day & I had to explain the same issue & go through the same conversation again. Finally my replacement request was accepted & delivered next day. I am completely satisfied with the product MOTO G & also the fact that replacement was finally done as promised. But, the replacement process could have been better. My uncle was using this phone for the past 3 months & no problem whatsoever and he is very happy about the voice loudness on the calls.",
            "date": "29 Jul 2015",
            "name": "Tejeswar Raavi",
            "stars": "5 stars"
        },
        {
            "comment": "awesome phone, great build quality, outstanding camera, a sharp screen,smooth interface,great in performance, good multitasking, but a bit disppointing battery backup.. overall it is a best phone in its price range as per my thoughts... thanks to motorola and flipkart delivered to me 7 days before the estimated delivery date quality of premium brands at the budget of local brands... motorola rocksssss... best phone must buy....",
            "date": "29 Jul 2015",
            "name": "Shivam singh",
            "stars": "5 stars"
        },
        {
            "comment": "After a lot of thoughts, I bought Moto G and I am very confident that it is the best among the budget phones with superior features! It runs absolutely smooth and runs games, videos with no issues whtsoever. Two Thumbs Up!!",
            "date": "29 Jul 2015",
            "name": "Sureshkumar Gu...",
            "stars": "4 stars"
        },
        {
            "comment": "flipkkart service is very bad Moto device id good but they are sending me defective product and not providing replacement",
            "date": "29 Jul 2015",
            "name": "Sadanand Pandey",
            "stars": "1 star"
        },
        {
            "comment": "Damn worst cell, its hang like any thing, got fedup with this. dont have any optipn to change, its only 2 mnth old cell, i installed only 10 apps not morethan not even one game. worst mobile have seen ever",
            "date": "29 Jul 2015",
            "name": "suryanarayana...",
            "stars": "1 star"
        },
        {
            "comment": "Good product. Have been useing this for a while now. It is a good buy for the price, but not a great one. Flipkart service remain impeccable",
            "date": "29 Jul 2015",
            "name": "Sharat Varma",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G(2nd Generation) is an excellent phone i ever used. features wise , design wise and permormance wise very good. Camera is excellent",
            "date": "29 Jul 2015",
            "name": "J N S Narasimh...",
            "stars": "5 stars"
        },
        {
            "comment": "My Moto G stopped working three months after purchase. Service center requires 10 days to fix the issues. Pathetic service. Reason enough to never buy a Motorola phone.",
            "date": "29 Jul 2015",
            "name": "Sanjay",
            "stars": "1 star"
        },
        {
            "comment": "The battery suck big time. Hardly 4 hrs with full gaming. Others fetaures are good but battery is bad.",
            "date": "29 Jul 2015",
            "name": "Utkrist Shrestha",
            "stars": "3 stars"
        },
        {
            "comment": "The battery performance is way below expectations, it can heardly takeup 6 hours of daily business operations, on both SIM cards being active. Lollipop make it more worse. Not recommended at all.",
            "date": "29 Jul 2015",
            "name": "Sandeep Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "I won't recommend this phone to anyone ... i was facing battery backup issues ( it was giving only 2-3 hrs backup in 2G/3G network) and getting an exclamation mark beside mobile network. i raise the complaints for replacement and Flipkart technical support person requested me to wipe entire data and to do the factory reset, i done & it worked for 2 days after that its started giving same error. without waiting the next updates flipkart closed my request saying seller is refuse to accept your request for replacement.Now I'm not able to use this phone it won't syn properly for 2G /3 G network and keep on getting exclamation mark due to this mobile data is not syncing to any apps like whatsapp & FB",
            "date": "29 Jul 2015",
            "name": "Victor Roshan...",
            "stars": "1 star"
        },
        {
            "comment": "good camera good sound good display stock android experience good battery backup headset quality is not good",
            "date": "29 Jul 2015",
            "name": "Nandu Krishna",
            "stars": "5 stars"
        },
        {
            "comment": "Seller shipped the Product within 4 days which is a good thing. After a week I was unable to hear voice from phone while on call for which I initiated the Refund, however, I managed to resolve the problem on my own. For this issue the seller cannot be blamed.",
            "date": "29 Jul 2015",
            "name": "Shailesh Tambe",
            "stars": "4 stars"
        },
        {
            "comment": "Nice fone with excellent features. Must buy if one doesnt want to spend much. Excellent camera quality and touch.",
            "date": "29 Jul 2015",
            "name": "sharvari nalnikar",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G (2nd Gen) is an all-rounder. Sturdy build quality and impressive specs make this phone a value-for-money buy. The battery life lasts almost 1 day with 2 SIMs, full-day Wifi with 2 hrs of 3G usage and average of 15-20 calls per day. I have almost 46 apps that continuously stream bytes of data throughout the day like Facebook, WhatsApp, Slack, Asana, Inbox, LinkedIn and the likes. Charging using the Moto G charger takes a long 3 hrs to charge. However, replacing it with a fast charger reduces this time to 1.5 - 2 hrs. Combine this phone with the original Moto G 2nd Gen Flip cover and you get all the protection needed for the device. Overall, very happy with the purchase. And Flipkart delivered it swiftly which enhanced the overall buying experience online.",
            "date": "29 Jul 2015",
            "name": "Mustansir Udai...",
            "stars": "5 stars"
        },
        {
            "comment": "the charger which came with the phone is not working and its only two month old and its damaged so i want it to be replaced",
            "date": "29 Jul 2015",
            "name": "Vishnu Sadani",
            "stars": "1 star"
        },
        {
            "comment": "Best brand under 10,000, Worth to buy, Special thanks to Camera and its HD Video Recording and Pictures, 16 GB Great enough for storage, Best to grab.",
            "date": "29 Jul 2015",
            "name": "Kolanchi Krishnan",
            "stars": "5 stars"
        },
        {
            "comment": "but flipkart service is toooooooooooooooooooooo gooooooooooooooood this product is super performanceeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee",
            "date": "29 Jul 2015",
            "name": "suman",
            "stars": "5 stars"
        },
        {
            "comment": "overall moto g2 is awesome phone... Battery back up not so bad...lollipop os performance is superb... sometime not able to call any contact, no issues with touchscreen but call is not forwarded...u have to switch off & on fone to call.... It takes 2-3 hours for 100%charge using the charger provided with the phone....while using charger of any other brand, it take below 1 hour to reach 100% battery",
            "date": "29 Jul 2015",
            "name": "Mohammed Shabeer",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent for Flipkart & Motorolla both. Thank you very much please keep it up. ws retail really rocks",
            "date": "29 Jul 2015",
            "name": "Jayesh Sarvaliya",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought moto G2 almost two months back. The phone is very good in features but having call pick up problem. We have to call back the caller. The person calling gets irritated on why person is not picking up my phone. The problem developed almost closed to month after installations of varIous app. I had called up call centre just two days before 30days of return policy and the person on support told to perform factory reset which was done couple of times. Post factory reset problem again developed almost week later. By the time return policy expired and I was told to get in touch with service centre which is in thane. Patches were applied and it worked for couple of days. Again same problem developed. Despite of writing email to customer support no response from flipkart. If you have time to visit service centre multiple times. This is phone for you. Be careful before you buy. Read review of buyers first then buy. Flipkart launching G3. Flipkart does not allow posting review of g2 on G3. People buying fresh product will get chance to know what may happen if you buy this. Restricted for sufferers to post reviews. Moto G3 launched today. Check out exchange offer only moto e/g earlier generation option available for exchange. Flipkart so confident about their faulty products which were sold month / quarter / six month or year back. Good business. Mobiles which were sold for more than 10k they r buying back for less than 3k.",
            "date": "28 Jul 2015",
            "name": "ART",
            "stars": "5 stars"
        },
        {
            "comment": "I had purchased this unit as a friend wanted to switch to android. I would recommend this to anyone who is learning to use android for the first time. This is the 3rd unit I purchased from Flipkart, and I have to say WS Retail have done and excellent job with the deliveru",
            "date": "28 Jul 2015",
            "name": "Melvile de Melo",
            "stars": "4 stars"
        },
        {
            "comment": "AMAZING PHONE AT SUCH A REASONABLE PRICE,WELL BUILT .AMAZING TOUCH . VIBRANT COLORS. ABOVE ALL VVALUE FOR MONEY CLYSTAL CLEAR SOUND",
            "date": "28 Jul 2015",
            "name": "MANISH GAKHAR",
            "stars": "5 stars"
        },
        {
            "comment": "Hi I got this product in given time.. Amazing features of MOTO G2. This is my first smart phone and getting so much features in it. Look wise good. Sound ok. Dual speaker is very good feature. Back cover is very smooth and silk.",
            "date": "28 Jul 2015",
            "name": "Nikunj Parmar",
            "stars": "4 stars"
        },
        {
            "comment": "The Moto G 2nd Gen is an awesome mobile in which are available in the market. This is one of the best....",
            "date": "28 Jul 2015",
            "name": "Vivekananda Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone very recently and was dissapointed to find that it didn't come with an USB cable and the supplied handsfree really hurts my ears after 5 mins of use. The phone itself is smooth and clean, its no iPhone but its a good buy. I just wish it had comfortable headphones.",
            "date": "28 Jul 2015",
            "name": "Shubhanan Sinh...",
            "stars": "2 stars"
        },
        {
            "comment": "Using this one for last 4 months. No problem. The best one at this price range. Camera quality is very good (But i miss my xperia quality), sound and battery backup is also good. No lag. and pure android with awesome touch response. This is the best handset you can have at this Price. Go for it.",
            "date": "28 Jul 2015",
            "name": "Sourav Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "I BOUGHT THIS MOBILE AGAINST REPLACEMNET OF MY MOBILE., GOT THE MOBILE AS PROMISED BEFOR ETHE DATE , MUST BUY",
            "date": "28 Jul 2015",
            "name": "ANYA",
            "stars": "5 stars"
        },
        {
            "comment": "I have read so many reviews which showcase this device in a negative way but i did purchased in 2014 and i am using this now and i am very happy to tell you that this device is awesome and you can use this at a ease. Apps are good, Download speed is sooper, Qaulity is Excellent, Additional features like Moto Assist, Help will secure your mobile safe.",
            "date": "28 Jul 2015",
            "name": "Suman Babu Pad...",
            "stars": "5 stars"
        },
        {
            "comment": "This is my third Motorola Moto G (2nd gen) purchased in Flipkart. Value for money... ❤ ❤ ❤ ❤ ❤",
            "date": "28 Jul 2015",
            "name": "Bejoy Balakris...",
            "stars": "5 stars"
        },
        {
            "comment": "I think there is too much hype around this phone and the Custom Android version.Phone is ok but not that great from performance perspective. I was using Samsung phone before this and feel that custom Android lacks certain customization which would have improved user experience.",
            "date": "28 Jul 2015",
            "name": "Abhishek Kala",
            "stars": "3 stars"
        },
        {
            "comment": "A best Android phone I ever used. Battery is the only con I feel after three months of use... Everything else is value for money....?❤",
            "date": "28 Jul 2015",
            "name": "Bejoy Balakris...",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Very stylish mobile Display is awesome Camera is superb for its price Sound is up to the mark Cons: It automatically switches off",
            "date": "28 Jul 2015",
            "name": "Jayanth Ganesh M",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks to flipkart...delivered in one day..overally MOTO G(2nd gen) is good.............................. :)",
            "date": "28 Jul 2015",
            "name": "Shubhankar Sahoo",
            "stars": "4 stars"
        },
        {
            "comment": "Need to charge every 2 hours. The battery does not even stay for more than 2 hours after charging full. Cant return it since its 34 days from buying it.",
            "date": "28 Jul 2015",
            "name": "Deepak",
            "stars": "1 star"
        },
        {
            "comment": "just Awesome.......Some much freackin Awesome.....!!!.....delivery before date......product in gud condition ..........nyc pakaging........Awesome Experience Shopping From WS Retail......Thanq So much",
            "date": "28 Jul 2015",
            "name": "Yash Kalkar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Generation) The product was amazing. It has a expandable memory slot. It has many sensors like magnetometer, proximity sensors etc....",
            "date": "28 Jul 2015",
            "name": "Bal Gopal Subudhi",
            "stars": "5 stars"
        },
        {
            "comment": "Its a very good phone . i have been using it for a week ..... is giving me a superb performance with no lagging...... MKoreover the camera quality is gr8.................. I mean Whenever u buy a phone if money is not a problem consider this phone :) I appritiate its built qualtiy,speaker sound,battery back up and camerq quality that ol is awesome. It is more faster and battey performance is very good It is awesome Moto G2 is lucky to me Camera is good......if u want a simple android phone then go for it....its buil quality is the best....very durable ...not like Mi3 or Mi4....",
            "date": "27 Jul 2015",
            "name": "Ashutosh",
            "stars": "5 stars"
        },
        {
            "comment": "It's awesome, totally worth the money. camera quality is just perfect good battery life games are smooth using from almost 6 month it never hang one problem, that is with android OS and not the phone, sometimes the battery left is not what is shown by the phone (This is Androids problem) My calls usually tops 30 minutes and never felt the phone is overheating or something. Though it gets hot sometimes while charging but not too much.",
            "date": "27 Jul 2015",
            "name": "Joker",
            "stars": "5 stars"
        },
        {
            "comment": "this is the biggest row mobile every i lost my money and time west of time i am first buyer of online",
            "date": "27 Jul 2015",
            "name": "amar phadatare",
            "stars": "1 star"
        },
        {
            "comment": "Hi, I have purchased Moto G from Flipkart, I got it in one day with one day delivery. I Had Following Problems from Beginning A. THE BATTERY WAS DRAINING VERY FST EVEN WITH ONE SIM CARD. B. THE MOBILE WAS HEATING WHILE BROWSING. C. FROM TODAY THE DISPLAY WENT BLANK THOUGH I RECEIVE CALLS. I Launched The RETURN Request On Flipkart, But They Told Me To Install Some Software On That Phone, It Was Not Possible For Me To Do It Because The Display Is Not Working. So VERY UNHAPPY with the product and product support given by Flipkart !!",
            "date": "27 Jul 2015",
            "name": "Kaustubh Khand...",
            "stars": "1 star"
        },
        {
            "comment": "I bought this handset on 27th of June 2015 and after two weeks it started showing issues in saving anything that i get on watsapp or whenever i download anything. It just do not get saved in the internal memory at all. I asked for the return last week, the guy from Motorola came and fixed it but the problem was again there the very next day and there is no way to communicate with these sellers or Flipkart executives as they just keep u busy looking for the options on their site till the time u get frustrated and write these kind of product reviews. I AM NOT GOING TO BUY ANY DAMN THING FROM FLIPKART EVER",
            "date": "27 Jul 2015",
            "name": "Rahul Pawar",
            "stars": "1 star"
        },
        {
            "comment": "its a great experience for using it. never hang or working smoothly....always in all season in short it a paisa wasool deal............",
            "date": "27 Jul 2015",
            "name": "prakash barua",
            "stars": "5 stars"
        },
        {
            "comment": "I have a very bad experience with my MOTO G 2nd Gen which i ordered on flipcart and received 1 1/2 month back. After 1 month and 6 days of receipt its screen started going Off automatically. I gave it to the Service centre at Varanasi and he informed that its screen was malfunctioning. Received the phone after 4-5 days on 24th July'15. It has new issues now; its speaker is not working properly, Voice call quality to other phone very bad, and even the middle of the screen shows light blue when screen is ON.",
            "date": "27 Jul 2015",
            "name": "Shyam Patel",
            "stars": "1 star"
        },
        {
            "comment": "This cell phone I ordered is as it was specified in product details page.Work perfectly and packaging and everything is very nice. Product is 100% authentic. Thank You.",
            "date": "27 Jul 2015",
            "name": "Keyur Mandani",
            "stars": "5 stars"
        },
        {
            "comment": "while using wifi it heats up and if i listen to sing and open up some tabs on chrome i feel the phone starting to lag.... during fruit ninja also sometimes phone lags... need help...battery backup is too poor",
            "date": "27 Jul 2015",
            "name": "rabi shrestha",
            "stars": "3 stars"
        },
        {
            "comment": "The phone arrived neatly packed.The phone has a crisp screen and display is good.The performance is also lag free.The camera gives decent photos.",
            "date": "27 Jul 2015",
            "name": "Alkesh Kumbhat",
            "stars": "4 stars"
        },
        {
            "comment": "Ok in this range. not expect more from motorola bcz it's only support English Language. Even We are not able to read Gujarati and others languages.",
            "date": "27 Jul 2015",
            "name": "Ankit Jariwala",
            "stars": "3 stars"
        },
        {
            "comment": "It realy nice phone i realy like this phone, its better then samsung phone, before i use samsung its hang every time",
            "date": "27 Jul 2015",
            "name": "Rajesh Rane",
            "stars": "5 stars"
        },
        {
            "comment": "Again it was a gift for my dad. Flipkart has become main portal for me to buy gifts for my family :) My dad was surprised and was really happy to have his first android. Though its not much convenient as samsung, but he liked the speed and responsiveness. And all his concern are well taken care by \"Ok Google\". Happy with the product and flipkart's service",
            "date": "27 Jul 2015",
            "name": "Ankur Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Donnt want to write log just to say it is awesome set in this budget event you want to expense 5k more....",
            "date": "26 Jul 2015",
            "name": "Manobrata",
            "stars": "5 stars"
        },
        {
            "comment": "not satisfied this mobile i am getting some heating issue and charging takes long time to full the battery around 3 hrs",
            "date": "26 Jul 2015",
            "name": "nag",
            "stars": "1 star"
        },
        {
            "comment": "So I got an awesome offer from Flipkart. A Moto G at a discounted Rs 5400 after all discounts and exchange. I was all excited. Till the time Flipkart refused to send me the phone. I had to wait 1 month before getting a reply from Flipkart #flipkartservicesucks",
            "date": "26 Jul 2015",
            "name": "Sumit Shrotri",
            "stars": "1 star"
        },
        {
            "comment": "The performance of this product is awesome.... I like it.... Back camera is awesome and front camera also good bettry backup is very good and sound is best",
            "date": "26 Jul 2015",
            "name": "Shabbir Mohammad",
            "stars": "5 stars"
        },
        {
            "comment": "Pros : 1. fast response 2. picture quality good 3. feels comfortable in hand Cons: 1. Battery life - does not last more than 1 day with average usage of apps 2. Overheating of the phone - the phone gets heated quickly",
            "date": "26 Jul 2015",
            "name": "Rajat Chakraborty",
            "stars": "4 stars"
        },
        {
            "comment": "used it for 6 months its durable slim and prefarable for the ones who want large screen . get a good case i prefer kickstand case for this phone and my phone have survivors many droptests it is good for price go for it !!!!!!!!!!",
            "date": "26 Jul 2015",
            "name": "rajan pawaskar",
            "stars": "5 stars"
        },
        {
            "comment": "Really Good one I purchased for my DAD. for Camera I can give out off 10 only 8 apart from other this all are good on this price..",
            "date": "26 Jul 2015",
            "name": "Kittu Siva",
            "stars": "5 stars"
        },
        {
            "comment": "first of all i had ordered dis product and i got a faulty one but it happens and thanx to the flipkart guys they helped me with the xchange and coming to the phone it's a nice one.. camera quality is nice and good also in low light conditions can play games with minimum heat problems as compared with other phones of dis much specs. phone looks nice in hands.. thanx flipkart for quick delivery.",
            "date": "26 Jul 2015",
            "name": "Gopal das",
            "stars": "4 stars"
        },
        {
            "comment": "This is my second motto g2 and i am very satisfied with the phone's performance.After using motto g first gen, i buy motto g(2nd gen) and using it very happily.",
            "date": "26 Jul 2015",
            "name": "deepak bhandari",
            "stars": "5 stars"
        },
        {
            "comment": "1 star is compulsory so there is that So my experience about this phone is disappointing,frustrating and beyond... Half the time screen doesn't work other than that apps go haywire for no reason. Sometimes it gives you so trouble that you cant even receive a call. And about the services after product purchase if you submit it to service center for repair there is no guarantee that it will be fixed speaking from my own experience I have submitted 3 times and each time rather than solution I got more troubles And customer care let's assume they are only there so you can call and share your regret that you purchased this product. So my advice don't waste your time and money on this.",
            "date": "26 Jul 2015",
            "name": "1 star is comp...",
            "stars": "1 star"
        },
        {
            "comment": "I am a Regular and Satisfied Customer of Flipkart from last 3 Years approx. I bought this Mobile for my Dad, who is not that techy. And he is able to comfortably use the phone. User Interface is friendly and simple. Rear camera quality is very good. Display is also awesome. ** The box contained the Phone, Headphone, and Non USB Charging Cable. It would have been better if the Charger be a USB Charging cable. (Overall 4 Star) And not to forget Flipkart's packaging, was as usual Awesome.",
            "date": "26 Jul 2015",
            "name": "Moumita Banik",
            "stars": "4 stars"
        },
        {
            "comment": "Strangely enough the phone has occasional issues with the battery level indicator. Even after a full charge the phone will indicate a level of 100 to 0 in a matter of an hour. Happened a couple of times. Putting the phone to charge again makes it jump from 0 to 100 in 5 mins. Can be quite misleading.",
            "date": "26 Jul 2015",
            "name": "Javed Hasan",
            "stars": "4 stars"
        },
        {
            "comment": "YEPPP..... a nice product.... Moto id delivering its best to customers.. Camera if quite better than 1st gen and the speeeed..... obviously mainained as same...",
            "date": "25 Jul 2015",
            "name": "Dini",
            "stars": "4 stars"
        },
        {
            "comment": "I'm facing lot of problems with this product....it hangs,heats,battery problem....etc.The order made me regret and disappoint... Not happy with the product....please think twice while ordering.",
            "date": "25 Jul 2015",
            "name": "K Milind Kumar...",
            "stars": "1 star"
        },
        {
            "comment": "In one word, The phone is the best budget phone in the world. Alas, it is now ruined by Android 5.0.2 lollipop update. But wait, don't hold back. Android 5.1 is coming on it's way to remove bugs and slowness. Good display, Awesome stereo speakers, Great Camera and Normal battery backup makes this phone , a BEST BUY.",
            "date": "25 Jul 2015",
            "name": "Sriram M",
            "stars": "5 stars"
        },
        {
            "comment": "This is an excellent phone, a value for money with features and screen size at this price range. There are two many options in the market these days, and I find this to be a good for those looking for a durable phone with all the goodness that android offers, plus for those who like to change their phone once every two years (not very costly).",
            "date": "25 Jul 2015",
            "name": "Siddharth Fadnis",
            "stars": "5 stars"
        },
        {
            "comment": "Long battery life, Better than previous E1 in terms of screen size, battery and Camera quality. I got best deal @ 5400 .... Thanks Flipkart !",
            "date": "25 Jul 2015",
            "name": "Vaibhav Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Just 8 days old phone with hell lots of problems. The phone is automatically turning dark the display is not visible until the phone restarts after long press........ Raising complaint repeatedly but no ultimate solution from Flipkart!!!!!!!!! Please refund my amount our replace the product asap, it is a kind request to Flkpkart.............",
            "date": "25 Jul 2015",
            "name": "Subhajay Goswami",
            "stars": "1 star"
        },
        {
            "comment": "Actually there is no problem with the KitKat versiion of the mobile. If once upgraded to Lolipop... YOU ARE A DEAD MAN. Also the battery drains heavily. Cust care says, \"if you have mobile data and Wifi, on...the battery drains heavily\" But this dowsnt happen on the Moto-e or moto g1",
            "date": "25 Jul 2015",
            "name": "Tarun Reddy",
            "stars": "1 star"
        },
        {
            "comment": "I explained my problem to customer care but they keep on repeating that there is no problem and if there is then I need to go to Moto service center and show my mobile there. this happened within 2 weeks of purchase. after I restart it sometimes show 80% battery and sometime still show 0%. customer service is pathetic and never expected from flipkart.I have to struggle with my mobile now.",
            "date": "25 Jul 2015",
            "name": "Piyush Garg",
            "stars": "1 star"
        },
        {
            "comment": "DON'T BUY ON OFFER DAY............ PRODUCTS ARE DUPLICATE............ OTHERWISE I USE MOTOROLA MOBILE BEFORE THIS ONE......... IT PERFECTLY OK.............",
            "date": "25 Jul 2015",
            "name": "UNHAPPYSHOPPER",
            "stars": "1 star"
        },
        {
            "comment": "received this device just yesterday...7 days before the expected delivery date...thanks to flipkart for the fast delivery...the device is absolutely brilliant....it came preinstalled with android 5.0.2 lollipop...and the phone runs buttery smooth.....there was no lag found when i switched from one app to the other app...the display is fantastic...the viewing angles are great...the touch is very good...and the dual stereo speakers are quite loud and decent as well...the phone looks very sturdy in the hands...so in a nutshell i would say that this device is definitely a bang for the buck...and one would get a very decent android experience similar to that on high end smartphones at exceptionaly low price...!!!",
            "date": "25 Jul 2015",
            "name": "Ritam Karak",
            "stars": "5 stars"
        },
        {
            "comment": "poor battery life....... grt performance,gud gaming experience,fab display......... the only cons....battery drain rate",
            "date": "25 Jul 2015",
            "name": "Surya",
            "stars": "4 stars"
        },
        {
            "comment": "This product is no doubt good and I am truly satisfied by this product and the only problem i am facing in this phone is Battery backup according to me.For this phone the battery should be minimum 3000mah and due to thhis I am waiting for moto G 3rd gen it may be the increased battery in this phone...",
            "date": "25 Jul 2015",
            "name": "Sanjeev Kumar Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "This is good one....I like this product beacuse of user friendly and network catching power...please buy this product but not from deepworld seller...",
            "date": "25 Jul 2015",
            "name": "KANCHAN SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "good phone worth for money. but it slightly heats when u in long call due to inbuilt battery using up to 6 months battery backup decreases",
            "date": "25 Jul 2015",
            "name": "mahesh",
            "stars": "4 stars"
        },
        {
            "comment": "online browsing very fast any mobile compare no-1 Moto-G2 Rear camera clarity very super...front camera it ok mobile display unbelievable good mobile Iam Enjoy in this product.......",
            "date": "25 Jul 2015",
            "name": "K.S. SELVAKUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the mobile considering its specifications & reading all good reviews. But the tough 'Gorilla Glass' shattered after falling from just a height of 1 foot only on smooth floor. Now, I have to spend 5K to repair it and service center told that, this will not be covered under warranty. Moreover, the service center in Guwahati has very slow response & don't have the spares as well. It said, 'It'll take more than 2 weeks to change the display'. I've not received any help from Motorola Customer Care also. My Samsung Grand fell 10 times, if not more, but the glass got no scratches. Why Motorola is selling mobile with false claims that the display is tougher with Gorilla Glass? I shall advice all the buyers, who are planning to buy Motorola phones, please reconsider your decision. I'm at total loss buying the Moto G (2nd Gen) mobile and regretting my decision.",
            "date": "24 Jul 2015",
            "name": "Anirban Bhatta...",
            "stars": "1 star"
        },
        {
            "comment": "it is a good phone after all.. just one drawback i have faced is that battery consumption is a bit much.",
            "date": "24 Jul 2015",
            "name": "ahmed faraaz",
            "stars": "3 stars"
        },
        {
            "comment": "poor battery life. regular heat up issues. Only camera and screen clarity is good. not good looking phone. ear set speaker is not with that much voice clarity. Overall bad experience with this phone.",
            "date": "24 Jul 2015",
            "name": "Hariharan s",
            "stars": "2 stars"
        },
        {
            "comment": "Phone seems quite fragile and battery backup is pathetic. It takes a lot of time to get fully charged 3 hours and gets drained up in just 12 hours and that too when you are not using it much.",
            "date": "24 Jul 2015",
            "name": "Nikhil Gupta",
            "stars": "2 stars"
        },
        {
            "comment": "It is a very nice product. Functions are smooth and easy to use. I recommend to buy this product. Thanks Flipkart",
            "date": "24 Jul 2015",
            "name": "Amar Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "the battery is really very very bad and it is not worth the money. and they are not doing replacement. my kind advice is to not to buy this mobile.",
            "date": "24 Jul 2015",
            "name": "Singam Amrutham",
            "stars": "1 star"
        },
        {
            "comment": "If you are loking for a mobile within 12000..... Just go for it..... Slim look. Android Version Can Be Upgraded Easy Handling....",
            "date": "24 Jul 2015",
            "name": "Purnanand Giri...",
            "stars": "5 stars"
        },
        {
            "comment": "I have bought Moto G 2nd Gen phone in Flipkart. But, the SD Card slot is not reading the SD Card. if we enter Galley, the phone hangs.",
            "date": "24 Jul 2015",
            "name": "chandrakanth b...",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone, quick deliver by flipkart. Thanks to them. But disapointed that if there are any issues and need to change the phone, they are only given a new one. First of all, how will i go for the same product when i find there are issues. i don't want to use the phone no matter if i don't get the return of my investment or allowed to buy a different product from flipkart. Anyway i applied for a return and not satisfied with this phone.",
            "date": "24 Jul 2015",
            "name": "Jesus Premraj",
            "stars": "2 stars"
        },
        {
            "comment": "Using this product for the last three months. Pros: The camera is WONDERFUL and the pics come out sharp and brilliant as if from a professional camera. Cons: BATTERY IS WORST. I Have to recharge it everyday. if you continuously play with your mobile , is into gaming, or watch movies or is continuously in whatsapp then you will have to recharge it after every 6 - 8 hrs. I charge it fully before starting for my office and by the time I reach after 1 1/2 hr it has already discharged by 15 - 20% and that too without any usage as i drive at that time.",
            "date": "24 Jul 2015",
            "name": "Smita Lahiri",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone 6 months back. It, on it's own, damaged it's motherboard first. Then, one fine day the flash stopped working automatically, it also stopped detecting my airtel sim card (every other sim was working and my sim was working in other phones too) The worst thing about this product is the SERVICE!!! Motorola has pathetic customer service and satisfaction. They exchange or lose your phones. They do not co-operate and and are very very rude. Please dont buy this phone, specially from flipkart.",
            "date": "24 Jul 2015",
            "name": "Maitri Chaturvedi",
            "stars": "2 stars"
        },
        {
            "comment": "I took MotoG2 in March 2015.Since then full of problems speciaaly call connecting.Moto G2 with Idea net work out going calls audio full worst,MotoG2 service too poor",
            "date": "24 Jul 2015",
            "name": "anil reddy",
            "stars": "1 star"
        },
        {
            "comment": "I am using this mobile, it is working quite well. Over all it is good. But when I play subway surfer, some times it gets slow, It is worth for the money.",
            "date": "24 Jul 2015",
            "name": "GANESAN NARAYA...",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered this phone for an exchange offer. But, these dumbass Flipkart people, had the model number coded on the site wrong. So had to buy the phone with a full price tag the very same day. This phone is amazing. The hardware provided under 10k is superb. It comes with Android L. Very high quality calls. Speakers are amazing. Screen is excellent. I recommend this phone. However, do make sure you got a 100% reliable product when you receive this phone. I read a lot of reviews concerning the battery on this site. The battery is great. I play a lot of games and find sometime for texting too, the battery doesn't fail me. I'm very impressed.",
            "date": "24 Jul 2015",
            "name": "Saswata Mitra",
            "stars": "4 stars"
        },
        {
            "comment": "I duno why others wrot a good review but I seriously didnot like this phone. Moto g was better. Gen 2 hangs quite a bit and network vanishes suddenly especially when you are using dual sim cards. Also 3g 2g nothing works properly. Google play store doesn't open. Its crap. Just the cam is good.",
            "date": "24 Jul 2015",
            "name": "soma banik",
            "stars": "2 stars"
        },
        {
            "comment": "Mobile is value for money if u gets the perfect peice i had to return the item due to display issue hopefully will get a nice piece without any errors and faults in it soon About product *Low price compair to other brands *Great looks *Good quality (non-faulti) *Quick service ( as usual experiencewith flipkart) *Best color for both gendrs If u r looking for a low budget phone... then this will b a good option but u should consider few points as wel like *Piece gets heatup very easily *charger is worthless ...too slow & requires too much time to charge the cellphone 100% *Earphones are not up to that quality like sony and other brands over all i will recomend this product",
            "date": "24 Jul 2015",
            "name": "Sahil Bijapure",
            "stars": "3 stars"
        },
        {
            "comment": "This is an absolutely shabby product which has overlooked some primitive features especially: 1. battery charging time - unbelievably takes 4-5 hours for a full recharge. When contacted the tech support, the typical answer is \"it is per the design\" 2. battery standby time - lasts not more than a day for nominal use like talking, FM radio for an hour and some browsing. 3. Noisy loudspeaker - call receptor - especially while listening to FM radio, the speaker is noisy. When contacted Flipkart support for returning this item, they only ask you to install an app for performing couple of technical tests. The final judgement by them is quite obvious to conclude as no issues with the product and therefore the return request is rejected. So if you are a big fan of moto g series, please put off your plans and wait until moto g3 appears. Please read the Flipkart return policy and put a check on impulsive buying abilities before buying this phone.",
            "date": "24 Jul 2015",
            "name": "Prashanth ga",
            "stars": "1 star"
        },
        {
            "comment": "NOW I AM UNABLE TO USE TOUCH SCREEN OF MY PHONE BECAUSE OF IT THE PHONE IS USE LESS FOR ME TELL ME HOW CAN I GET HELP TO RESOLVE THIS PROBLEM PLEASE TELL ME",
            "date": "23 Jul 2015",
            "name": "Pavan Joshi",
            "stars": "1 star"
        },
        {
            "comment": "Good service by flipkart And quick service product is nice .And i wish the flipkart team good luck for serving the people better service keep it up.",
            "date": "23 Jul 2015",
            "name": "Avinash Sangavi",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is worth every penny! It's fast, the camera is great, there's loads of storage, and the screen is good. I'm really happy with this!",
            "date": "23 Jul 2015",
            "name": "Sven Punt",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 Good Performance at all but phone battery is 2070 MAH. It's not enougt for this phone. It must have 3000 MAH. Totally disappointed with the poor performance of battery. Over all Phone is too good.",
            "date": "23 Jul 2015",
            "name": "Mohd Salman",
            "stars": "4 stars"
        },
        {
            "comment": "Worth a buy in this price. Less specification but still better than other Chineese phones in the Market. In fact you can say it the best phone in this range.",
            "date": "23 Jul 2015",
            "name": "Prabhat Kagra",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G (2nd Gen) A Cellphone to watch out for. Got it on the 3rd day after the order was placed, in perfect condition. Look at any sub 15k phones and the first thing that you will notice (at least the established brands) that most of them have internal memory of 8 GB only. Believe me you would soon run out of this in a hurry once you start downloading apps. First thing i noticed, this is pretty good value for money at 12k (from Flipkart). It has a decent processor, good display, decent camera and battery life. Moto G2 is still the KING of budget Smart Phone. Pros : Much-improved camera Strong battery life Solid, well-built design Excellent value for money Will edit my review for cons, if I come across with one.",
            "date": "23 Jul 2015",
            "name": "Rishabh Priyar...",
            "stars": "5 stars"
        },
        {
            "comment": "5-6 month it work properly then it hank every time...and network problem in second sim...i inform the new purchasers do not purchase it...",
            "date": "23 Jul 2015",
            "name": "RUPESH YADAV Y...",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone for 1 month now.....No issues with the phone,battery or display only one issue...while multitasking the battery gets heats-up",
            "date": "23 Jul 2015",
            "name": "Kiran Chikka",
            "stars": "4 stars"
        },
        {
            "comment": "if you are looking for a budget smart phone then this is the perfect choice.. good touch screen response.. good phone speed.. good camera.. advanced android version.. never gets hanged or slow.. only con - no 4G...",
            "date": "23 Jul 2015",
            "name": "Mehul Adhia",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone since from 2 weeks.No heating issues,no hanging problems,camera clarity is good,sound clarity is good.I love motorola products.",
            "date": "23 Jul 2015",
            "name": "Mahesh N@ni",
            "stars": "5 stars"
        },
        {
            "comment": "I use my phone mainly for browsing, reading and photos.This phone does the job perfectly well. Browsing is quick, Reading is intuitive and camera is cool. Bang for the buck.",
            "date": "23 Jul 2015",
            "name": "Director",
            "stars": "4 stars"
        },
        {
            "comment": "overall good phone but got an issue with the mic hardly after 20 days of buying, so filed a complain on flipkart site but they didnt respond, so overall a bad after sales service. :(",
            "date": "23 Jul 2015",
            "name": "Akshay kankariya",
            "stars": "1 star"
        },
        {
            "comment": "I have faced lots of issue with this product, like battery issue, Hiting issue, Network issue. this is not good handset to purchase.",
            "date": "23 Jul 2015",
            "name": "Mohammed Hamid",
            "stars": "1 star"
        },
        {
            "comment": "You guys have cheated me again... the replacement Piece I got of MOTO G2, when I compared with another MOTO G2, I observe that you have put some FAKE SCREEN where the Pixels are so clearly visible and the screen is so dull, the 'PPI' quality is very low.. where as the other MOTO G2 is so distict and clear with no pixels seen to our eye.. A LOW Quality Screen is been inserted and sent to me as the replacement piece.. I dint know You would be such cheaters!! Really Disappointment... Dont know if i have to go for a replacement again for the fear of getting cheated again!! Guys be careful when you get the Replacement from these fraud guys...",
            "date": "23 Jul 2015",
            "name": "kavya",
            "stars": "1 star"
        },
        {
            "comment": "+ I used this phone nearly for a year + Camera is the best + when compared to asus zenfone 2 , samsung J7 , nokia lumia 720 and sony Xperia z Ultra + battery stands for 2 days + though i play Cash of Clans,Gta San Andreas and Modern combat 5 + i had no issues + no lags + Screen display is awesome which u can compare with iphone 6 plus +++ descent phone+++ +++Value For Money Very Much+++ Waiting For Moto G3 Waiting For Moto G3 Waiting For Moto G3 Waiting For Moto G3 Waiting For Moto G3 Waiting For Moto G3",
            "date": "23 Jul 2015",
            "name": "Derin Maxman",
            "stars": "5 stars"
        },
        {
            "comment": "i have got this product from flipkart 3 months back althogh display camera everything is fine but baatery back up is a let down,will suggest to go for micromax or samsung they are having better battery back up.avoid",
            "date": "23 Jul 2015",
            "name": "poor battery reserve",
            "stars": "2 stars"
        },
        {
            "comment": "excellent features and excellent camera in this price. the major issue is only the battery which is insufficient for this big screen mobile.",
            "date": "23 Jul 2015",
            "name": "Madhukar",
            "stars": "5 stars"
        },
        {
            "comment": "I Bought MOTO G2 Two Months Back.. But While Speaking Sometimes Its Struck, Voice Is Not Clear Also.. Some Disturb Sound Is Coming Always.. After Listening The Music Without Ear Phones, If You Make A Call or Receive The Call It's Won't Audible.. Touch Also Not Proper Sometimes.. My Friends Also Facing The Same Problems.. So My Sincere Request To Everyone That Don't By The MOTO G2..",
            "date": "22 Jul 2015",
            "name": "SravanKumar Am...",
            "stars": "1 star"
        },
        {
            "comment": "fantastic phone in its price range.. Display & photo quality is good, light in weight as compare to other Moto phones...",
            "date": "22 Jul 2015",
            "name": "atul singh",
            "stars": "5 stars"
        },
        {
            "comment": "the phone i received was in healthy condition and the software and all are functioning in proper way. this is an awesome phone with good battery backup, great camera quality, and good screen resolution. I received phone before estimated time.",
            "date": "22 Jul 2015",
            "name": "Prakhar Shriva...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g has the stock andriod. Which is fluidic and fast.Good display, decent battery life, superb call quality.",
            "date": "22 Jul 2015",
            "name": "AMlan",
            "stars": "5 stars"
        },
        {
            "comment": "This product was worst and duplicate . if we ask they won't replace. i request you don't bye this product.it was producing to much heat while charging. the worst service.",
            "date": "22 Jul 2015",
            "name": "siva b",
            "stars": "1 star"
        },
        {
            "comment": "The mobile is awesome in price I bought 10000. But I am little disappoint with battery...It does not sustain for 12 Hrs after 100% charge if 2 SIM are there and continues data is ON",
            "date": "22 Jul 2015",
            "name": "Pratik Deshmukh",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is sturdy and had survived few falls from 3-4 feet ht. TG... camera is good for macros... sometime stucks...when gets into network and data is connected then all apps become active halts for say abt 7 sec. then comes back to normal functioning...",
            "date": "22 Jul 2015",
            "name": "Viney Kapoor",
            "stars": "4 stars"
        },
        {
            "comment": "Received defective device for the third time and flip-kart as well as Motorola are playing with people's patience. Should be Zero rating but no option available.",
            "date": "22 Jul 2015",
            "name": "Raj",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone since Jan 15. Its been 7 months but still runs like a charm. May be you won't be impressed by its look but i bet you will be impressed by its features & performance.",
            "date": "22 Jul 2015",
            "name": "Yogesh Gurjar",
            "stars": "5 stars"
        },
        {
            "comment": "Dear Sir , Please resolve the problem, only 4 months old phone and sim stole is not working. Product is warranty period .Please resolve the Problem",
            "date": "22 Jul 2015",
            "name": "Neeraj kumar",
            "stars": "1 star"
        },
        {
            "comment": "Happy to buy such a good product that too on offer at 3000 off. The quality of camera is very good but a bit slow processor as some time got hanged, overall cool product at such price",
            "date": "22 Jul 2015",
            "name": "Nil",
            "stars": "5 stars"
        },
        {
            "comment": "i am having major issues of battery , sim detection, etc. since i bought the phone . i went to sevice centre also but problem is not yet solved till date...so plz dont buy phones .....exclusively i bought it from flipkart as because i believed that it will be a good item....but the is not = my expectation.",
            "date": "22 Jul 2015",
            "name": "ankit jain",
            "stars": "1 star"
        },
        {
            "comment": "satisfied by moto g 2 and flipkart. good specifications , handy plus points : os dispaly specifications negative points battery",
            "date": "22 Jul 2015",
            "name": "Pradeep BAdiger",
            "stars": "5 stars"
        },
        {
            "comment": "Except battery backup and common android problems, this phone is very good. The display, expandable memory option, of course the size(not big and bulky),",
            "date": "22 Jul 2015",
            "name": "Rabi%20Sankar Dey",
            "stars": "5 stars"
        },
        {
            "comment": "this prouduct is not have a long battery life & call waiting service & hanging when you calling this is the verst prouduct",
            "date": "22 Jul 2015",
            "name": "Naveen. Hadimani",
            "stars": "1 star"
        },
        {
            "comment": "service of flipkart is as always without fast delivery got on 2nd day screen quality is awesome no lagginess camera take good shot overall value for money",
            "date": "22 Jul 2015",
            "name": "abhi",
            "stars": "4 stars"
        },
        {
            "comment": "Please don't buy this phone. i was trapped in this phone because of exchange offers and other discounts. Glass is broken. fallen from a distance of 30cm. moto service centers are asking INR 4400 (in Koramangala, Bangalore). please google about screen problem. You will find lot of such reviews. PLEASE DONT BUY MOTO G2",
            "date": "22 Jul 2015",
            "name": "Nikhil",
            "stars": "1 star"
        },
        {
            "comment": "Stanadard delivery time is more. price is reasanable. satisfactory performance. battery back upp is ok.",
            "date": "21 Jul 2015",
            "name": "gopal sarawade",
            "stars": "4 stars"
        },
        {
            "comment": "A nice budget phone for reglar use. no much difference between first gen MOTO G. Buy a flipcover also from flipkart.",
            "date": "21 Jul 2015",
            "name": "Sree",
            "stars": "5 stars"
        },
        {
            "comment": "there is a buzz sound while calling and recieving call. despite of all settings nothings changes so the problem is with the sound of phone, cam quality is poor you can go for better phones in this prize",
            "date": "21 Jul 2015",
            "name": "rohit sharma",
            "stars": "1 star"
        },
        {
            "comment": "I would suggest you not to buy any product from Flipkart. I had been a loyal Flipkart customer but now their service sucks. I purchased a Moto G2 which is defective. One of the sim slot is not functional. I raised a return request but they never called me at the scheduled time as they need to troubleshoot before they replace. They say that before they call they will send a message to inform but I never received any such messages. Worst Service ever from Flipkart.",
            "date": "21 Jul 2015",
            "name": "Unhappy Customer",
            "stars": "1 star"
        },
        {
            "comment": "I doubt the originality of this product. I was using this phone all well till last couple of weeks when it stopped charging all of a sudden. When I went to show this to the authorized Motorola service center in Pune, they firstly did not attend me as a customer. Secondly when I insisted them to do so, they took the phone, saw it for 5 seconds and said that they cannot repair this under warranty. The phone has 3 months warranty left then why cant these people repair it and solve my issue. I really doubt the originality of this product as when I raised this issue with Flipkart and demanded a replacement, they took my request but have not yet got back to me inspite of contacting them 3 times till now. I would raise this to the consumer court but wanted to write this review so that other customers are not caught up with such issues.",
            "date": "21 Jul 2015",
            "name": "Nilesh Oswal",
            "stars": "1 star"
        },
        {
            "comment": "Mobile was working for only 5 days .We were not able to start the mobile after the battery got drained and recharged as well .",
            "date": "21 Jul 2015",
            "name": "Beril S",
            "stars": "1 star"
        },
        {
            "comment": "Money worthy phone . with all feathers . I like this phone very much and easy to use . I recommended to many of my colleagues to buy a beautiful mobile . Thanks.",
            "date": "21 Jul 2015",
            "name": "Parthiban Koth...",
            "stars": "5 stars"
        },
        {
            "comment": "I got MotoG 5 days back, and since then all i hvae faced is problems with this product. the scenns keeps going blank and i have to restart the phone get the screen working again. i have also requested a return for the product and all flipkart is doing is scheduling a call with techenical team again and again. i never receive a call from the techenical team and they keep postponing it. I have been given a defective product and flipkart is not doing anything to resolve it. highly disappointed",
            "date": "21 Jul 2015",
            "name": "ashutosh pathak",
            "stars": "1 star"
        },
        {
            "comment": "AFTER BUYING G2 , WAS VERY EXITED TO USE AND ENJOY BUT FOUND HANGING UP AGIAN AND AGAIN..............WANT TO CHANGE THIS ONE WITH ANOTHER ONE....BUT NOT MOTO",
            "date": "21 Jul 2015",
            "name": "TRILOK",
            "stars": "2 stars"
        },
        {
            "comment": "Initially performed very good. After using 3 months it is working very slow and some time it is testing my patience.",
            "date": "21 Jul 2015",
            "name": "Sachin Pechhetti",
            "stars": "3 stars"
        },
        {
            "comment": "Its been 3 months now since using the Phone and the Phone seems to be working just fine. Had purchased 3 phones in total within a span of 2 weeks. No issues observed yet. Although the battery life could have lasted longer. No heating problem. No hangs observed. Phone processes quick. Good phone for that price tag from Motorola.",
            "date": "21 Jul 2015",
            "name": "Shashank",
            "stars": "4 stars"
        },
        {
            "comment": "This is one of the best phones out there when you take into account the price/performance ratio, also the getting started or \"help\" feature is amazing, its really useful for beginners who aren't used to touch screen based phones. Great work there Motorola. And as for Flipkart they did an amazing Job, ordered on the 7th of July, they tried to deliver on the 10th, but I wasn't available so rescheduled it for the 11th (a Saturday) :) . Not a lot of courier companies deliver on Saturdays, but if its Flipkart's eKart logistics then you're in safe hands.",
            "date": "21 Jul 2015",
            "name": "Danny George",
            "stars": "4 stars"
        },
        {
            "comment": "Gud one not best one... product is gud... but i dont think competetive product.. I wud suggest MI in Xiomi instead of buying this...",
            "date": "20 Jul 2015",
            "name": "Ganeshkumar C",
            "stars": "4 stars"
        },
        {
            "comment": "Perfect phone for everyday use not for xtreme usage like too much mulittasking and gaming but everything else its handles well. Build quality is really good. feels like a sturdy nokia device and a plus which I liked most its water resistant.",
            "date": "20 Jul 2015",
            "name": "Srikanth P",
            "stars": "5 stars"
        },
        {
            "comment": "Dear Flipkart The problem of this device( Camera and Network issues) has been already complained to you but we didn't got the right solution to operate my mobile without any problems. How can we overcome these issues. The problem was occurred since we received the product. We are not satisfied with your customer services. So please resolve the problems as soon as possible.",
            "date": "20 Jul 2015",
            "name": "Ashok Kumar",
            "stars": "1 star"
        },
        {
            "comment": "Nice phone with nice price and wonderful specification.Camera is its best part. Upgraded to lollipop. But its slows down now around after 1 year of purchasing",
            "date": "20 Jul 2015",
            "name": "Ashutosh Bhardwaj",
            "stars": "4 stars"
        },
        {
            "comment": "I never expected this worst experience from Motorola. I felt very good while buying this product and felt very bad after using it and upgrading to lollipop. Mobile gets slow and charging will take 6 to 7 hours to get fully charged. Applications get crash with out any notice. Motorola Team please do something about this.",
            "date": "20 Jul 2015",
            "name": "Nagarjuna Mukara",
            "stars": "1 star"
        },
        {
            "comment": "Great phone, its been a year now since i bought this, has gone a little slow after the latest OS upgrade! but this is a durable phone nevertheless. Glad i bought this.",
            "date": "20 Jul 2015",
            "name": "Anoop G Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "As the name Moto G. It already defines itself. Comes with 1 GB ram enough to run any app. Nice performance, Gaming, Battery Backup, Till date I have not experienced any slow performance or any lag. and the look is very best.",
            "date": "20 Jul 2015",
            "name": "Ajay Kumar Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is very good and the futures are good the only problem is battery except that everything is dam good with this price this is excellent phone.",
            "date": "20 Jul 2015",
            "name": "DasthaGiri Reddy",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this mobile six months back and still working good ...no heating , sound problems as reviewed by others ....only one thing we can say negatively about the battery issue..but its enough for normal office users (8 to 10 hours )..not supposed for game users...no need of screen guard , its perfectly scratch resistant and good grip in hand ..finally my suggestion is this one a price worthy ..",
            "date": "19 Jul 2015",
            "name": "Swaroop",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is getting worse, out of the box product is malfunction and flipkart is not giving a damn about it, I have invoked my return policy and they rejected it just because I didn't attend their call, Well not everyone is available 24x7 everyone has job to attend. flipkart customer service is not responding at all they are hanging up the call again and again... Customer care is their to rectify our error not to create more. Flipkart Should take action to replace the product as soon as possible.",
            "date": "19 Jul 2015",
            "name": "Manoj kumar R",
            "stars": "1 star"
        },
        {
            "comment": "i bought moto g 2 in last month fortunately my phone is fallen dowdwn and the display is broken is there any waranty to the display",
            "date": "19 Jul 2015",
            "name": "ganesh",
            "stars": "3 stars"
        },
        {
            "comment": "Its worst experinance with it i ever used such worest phone like that. I used to charge thirce daily it gets verty quily dry the batter. dear friends my sincere suggested that don't choose it.",
            "date": "19 Jul 2015",
            "name": "Pabba Rakesh",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone on feb 2015. Till today the phone works really good. Did not face even a single issue in the working of phone. Camera is of excellent quality. Upgraded from kitkat to lollypop very easily and hassle free.Best buy in less than 12k category.Far better than samsung and microsoft mobiles in this category. Beyond comparison with other local products like micromax, intex etc.",
            "date": "19 Jul 2015",
            "name": "Muthukumaran",
            "stars": "4 stars"
        },
        {
            "comment": "After 2 months, excessive battery drainage happened...(100% battery loss in just 2 minutes) When I contacted Local Service center, they told me to submit phone for 15 days. Even after 25 days, they said the battery has not come. I complained Motorola and got to know the status was Completed before 10 days. Again contacted the local service center, They said they have changed the job-sheet no. When I asked for status, It was Touch-pad and Battery replacement. \"Touch-pad\" was replaced without my permission... When I asked Motorola to give me full details of new job-sheet as I'm having old one, They refused because they're with service center and not customer. Still I'm waiting for my phone and helpless too. WARNING : If you are from Udaipur, Rajasthan, Don't Go to \"Motorola Authorized Service Center\" parts will be replaced without your permission and Motorola won't help you... ( I'm facing the problem ) :( Sorry Flipkart, Your services are great and I'm not blaming you.....",
            "date": "19 Jul 2015",
            "name": "NEERAJ SUTHAR",
            "stars": "1 star"
        },
        {
            "comment": "almost a year old since launch bought this three days back... no lag, battery backup is good, camera is more than fine for a 10k phone!! no problems yet loving it...",
            "date": "18 Jul 2015",
            "name": "thufail abdulla",
            "stars": "5 stars"
        },
        {
            "comment": "My experience with the phone is good. But the charger disappointed me as it got darkness in my house for a while. Charger was burned due to an inner short circuit by its first use. However charger was replaced by moto service centre. The funny thing is the exhausted charger was an Indian made. Chineese made charger is not making any issue. Be cautious on initial charging.",
            "date": "18 Jul 2015",
            "name": "subhash S",
            "stars": "4 stars"
        },
        {
            "comment": "Its a good phone with bigger screen in this range. RAM is less so don't expect to do multi tasking like iPhone or other high end Android phones. Camera is average but is best in the price range. Look wise, not very good. Design is good so feels good while holding without mobile cover. With mobile cover it becomes very big and does not hold good. Overall I am happy with the Phone. the 1 star I removed is for the performance but still it is good in the price range.",
            "date": "18 Jul 2015",
            "name": "Naveen Vasu",
            "stars": "4 stars"
        },
        {
            "comment": "As expected, this time also Flipkart's delivery and service was lightening fast.And no doubt, MOTO G2 is the best phone one can have at this budget.",
            "date": "17 Jul 2015",
            "name": "Prateek Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "Love Moto G 2nd generation. Nice features and extremely reasonable when it comes to price. Thanks Flipkart",
            "date": "17 Jul 2015",
            "name": "Manasa M",
            "stars": "5 stars"
        },
        {
            "comment": "good mobile. Value for money.. but they are not coming up with latest hardware configuration.good mobile. Value for money.. but they are not coming up with latest hardware configuration.",
            "date": "17 Jul 2015",
            "name": "Pradeep Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I got a phone with defective Battery or Calibrator. I requested flipkart to return or replace my device but all that was in vain. I am very much disappointed with flipkart's return policy. and still I am suffering for it.",
            "date": "17 Jul 2015",
            "name": "Shubham Mehta",
            "stars": "1 star"
        },
        {
            "comment": "Thanks a lot FK you have proved that you are the best to deliver authentic products so fast without any issue . this is my second purchase of moto g2 and i am fully satisfied with my dream phone .. this is just like a younger nexus..no leg.. HD display.. good battery pack up.. which makes me happy by whole day playing games..n watching movies.. Audio sound is best with its dual speakers .. feels like a 3d cinema sound and 3g is also fast as compared with my old samsung phone.. thanks again",
            "date": "17 Jul 2015",
            "name": "Umesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "This item is really a tremendous. Performance is really good. i have purchased 10 pieces and all of are running without complaint.",
            "date": "17 Jul 2015",
            "name": "hitesh dutt ma...",
            "stars": "5 stars"
        },
        {
            "comment": "I found only one god thing which was facility of dual sim. its laggy because ram is very less just 1GB. battery drain is too much on standby. i slept at 11 pm battery was 48% when i woke up at 6.30 am it was 32%(wifi and net was off). no updates for long periods, from current date android 5.2 update was relased to USA people 1 month back but still we Indians have not got. clearly shows how much motorola is serious about their indian clients. I would suggest to buy xiaomi products they are more user friendly and they are loyal to their customers. or if u have money go for one plus. for god sake avoid this shit. but i appreciate moto x2, its fabulous in every aspect.",
            "date": "17 Jul 2015",
            "name": "Pawan Sohanda",
            "stars": "2 stars"
        },
        {
            "comment": "hey there, i baught a MOTO G 1st gen on March 2014. And yesterday it died. The service center told me that they need to change the motherboard and would charge me 4500 Indian rupees as its been 3 months above warranty period. . ( new phone MOTO G 2nd GEN would cost me 9000) A reputed company mother board going out like this is not acceptable. i have been using Moto ever since the Moto Ming days. The worst part is, i have bought both my mother and sister, MOTO G 2nd gen. now very unsure of its fate. I am not going to pay this amount for an outdated phone, i am ending this relationship at a very bad note. I WOULD ALSO ADVICE PEOPLE TO THINK TWICE BEOFRE BUYING ELECTRONICS ONLINE. thank you, yours faithful customer (ex) aachman gupta",
            "date": "17 Jul 2015",
            "name": "Aachman Gupta",
            "stars": "1 star"
        },
        {
            "comment": "pros: -good display -good UI, like stock android cons: -heating issue! even for browsing 5mins -battery sucks! for regular use -unnecessary motorola default apps to blame eating up ram, battery",
            "date": "17 Jul 2015",
            "name": "Vikram H",
            "stars": "3 stars"
        },
        {
            "comment": "i got the pphone two weeks back, and in the first week i had battery problem, then i am facing tat i cannot answer my calls when the screen is unlocked. called the customer care, they said they will call me and resolve the issue. the phone works else is very good",
            "date": "17 Jul 2015",
            "name": "kunal",
            "stars": "3 stars"
        },
        {
            "comment": "1.battery backup is ok 2.cam is ok 3.software is very good 4.looks handy in many aspects 5.phone gets heated up, when used continuously",
            "date": "17 Jul 2015",
            "name": "Rakesh Rasala",
            "stars": "4 stars"
        },
        {
            "comment": "I use to use samsung phones only. This time i brought this phone. compare to samsung this is really a good phone.good battery life, touch works fine, I would have given this phone 5 stars if it had 2GB RAM and if it supported 4G. We have many phones which are offering that features.",
            "date": "17 Jul 2015",
            "name": "prashant mirajkar",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is good. Audio quality is good. Charger could have been with a data cable. It molded together. Flipkart promised delivery of the product on 20th for an order placed on 9th. I was not happy with the delivery estimate. They delivered it on 14th. Still not happy with them for giving incorrect estimate dates. They need to give accurate dates. Delivery earlier used to be in 2 days flat. Now it is not so. If this continues, one may choose to buy items in stores around their locality rather than waiting endlessly.",
            "date": "17 Jul 2015",
            "name": "ARUL GERALD",
            "stars": "3 stars"
        },
        {
            "comment": "Phone just one month total dead my phone, So many problems Servicing also no free amount of some parts wast of 12k amount on moto g2 Filipkart Also no Quality items on moto g2 but Don't sell on non Quality Items",
            "date": "17 Jul 2015",
            "name": "Nagaraju",
            "stars": "1 star"
        },
        {
            "comment": "I got this product which few days back. the screen becomes hot after few mins of call. !!! Caution for those people who needs to talk a lot . DON'T BUY!!!!",
            "date": "17 Jul 2015",
            "name": "vikesh patel",
            "stars": "1 star"
        },
        {
            "comment": "Awesome smartphone in that much of price range i ll say to every one go for it...... i love this phone..",
            "date": "17 Jul 2015",
            "name": "shiva vishist",
            "stars": "5 stars"
        },
        {
            "comment": "Worst Phone Ever on very 1st day 1. got hanged 2. Automatically restarted 3. While Calling so sound 4. Getting Heated up on surfing internet 5. Flipkart is not replacing the defective product",
            "date": "17 Jul 2015",
            "name": "Utsav",
            "stars": "1 star"
        },
        {
            "comment": "it has plenty of good features but battery power only about 2100mAh is quiet less when working on 3G connections , also front camera disappoint me it has to be atleast 5MP at this range where other good mobile in this range provide this . But i think after launch of Lenovo K3 and Lenovo A7000 it sales will decrease .",
            "date": "17 Jul 2015",
            "name": "Ashish Kumar",
            "stars": "2 stars"
        },
        {
            "comment": "Battery is not so good. When i ask for return as the phone is getting heat, flipkart said someone will call me for resolve the problem. They advised me that the phone is good, until the phone temperature cross 45 degree celcious. Are they making me fool or it is right i donn't know. My phone temperature is allways showing 41-42 .C.",
            "date": "17 Jul 2015",
            "name": "Avik Pal",
            "stars": "2 stars"
        },
        {
            "comment": "The initial Moto G was a great deal but the minor upgrade for the 2nd generation leaves it behind the competition. Pros - Almost stock Android. Cons - Low signal strength / connectivity issues.",
            "date": "16 Jul 2015",
            "name": "Shakti Singh",
            "stars": "3 stars"
        },
        {
            "comment": "I orderd Moto G 2nd Generation and unfortuantly got damage mobile phone ..I made a complaine against it ..according to your custmer care agent some one called me and my number was not reachable ..I was surprised how come it happened because I am living in metro city and I am recieving continusly call from my freind and never being faced this type of response for network related issued..and another agent said that some one called me once and I did not pick the phone.. I am still waiting yr call if possible give me any concern person number... be honest I am not satisfied with your services.",
            "date": "16 Jul 2015",
            "name": "NAGENDRA SINGH",
            "stars": "1 star"
        },
        {
            "comment": "Amazing phone with amazing features. It doesn't have a comparison so dont waste ur time on comparing. U can't find any other phone with such features at this price. Dont waste ur time reading this just go for it !!!!!!!!!!",
            "date": "16 Jul 2015",
            "name": "Surinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "i buy 4 mobiles...2 mobiles are safe and gud..bt other 2 mobiles are not gud ,full complaint.... now my last product moto g2 full complaint..i send replacement request but no couries service for pick the phone from my home...now i send my phone to your warehouse.. im nt satitisfy wid ur product...vry poor delivery ....",
            "date": "16 Jul 2015",
            "name": "Rakesh R.S",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone on 10th June and after 1 week it started creating problem. Phone that i received is having battery issues. Initially phone was good but after few weeks,it showed its true colors. Battery started draining with in an hour(100% to 0 %). Buying this product is totally waste of money.",
            "date": "16 Jul 2015",
            "name": "Abhishek",
            "stars": "1 star"
        },
        {
            "comment": "Flipkart has shipped me a faulty mobile and has been negligent in hearing my concern. It is also arm-twisted to make sure i don't get the refund or replacement product. It suggested some eye wash troubleshooting steps which is off no use. Now they are not even ready to connect the call to the escalation team and give the proper reason. I have already raised request for replacement 3 times in the past 22 days which has been unheard. I have been a loyal customer to flipkart and have purchased tons of products. But now i lost faith is flipkart and i just want this to be my last purchase with flipkart as i have lost faith in flipkart. Trying your luck with flipkart in getting a working product or else you will also be a looser like me.",
            "date": "16 Jul 2015",
            "name": "Elango",
            "stars": "1 star"
        },
        {
            "comment": "Great Phone,Revolutionary great performance. Only one drawback, It starts hanging after a continuous use of 7-8 months. Also flipkart should lower down the prices.",
            "date": "16 Jul 2015",
            "name": "Mohit Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "overall product is good. Good sound quality, good camera and picture quality. But headset is malfunctioning with in 4 months.",
            "date": "16 Jul 2015",
            "name": "sudipta samanta",
            "stars": "3 stars"
        },
        {
            "comment": "thanks flipkart for some awesome deal ,with that i dont think twice to go for the product . keep giving these kind of offers in future also.",
            "date": "16 Jul 2015",
            "name": "manoj kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Fantastic product, go for it. Another quality product from Motorolla, sound from speakers is clear, operation has no lag, call volume is crisp & clear.",
            "date": "16 Jul 2015",
            "name": "Anupam Bhoumick",
            "stars": "4 stars"
        },
        {
            "comment": "In all ways Moto G2 rocks. 1. Performance 2. Stability 3. Last long Battery 4. Stylish 5. Durability 6. Amazing Price 7. Fast upgrades (Google Phone).",
            "date": "16 Jul 2015",
            "name": "Mehul Sant",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone and extra thanks to flipkart for speedy delivery as well as response.....Happy with phone and would recommend for all........thank you",
            "date": "16 Jul 2015",
            "name": "Mi2U",
            "stars": "5 stars"
        },
        {
            "comment": "two sims doesnt work on my phone. I got to know about this after the validity gets expired. Now, what should i do?",
            "date": "16 Jul 2015",
            "name": "Nikhil Verma",
            "stars": "1 star"
        },
        {
            "comment": "Last month I purchased Moto G( 2nd Gen) online through flip kart. From the day, mobile was delivered to me, till today I am facing tough phase as everyday I face some new issue i.e. speakers issue, screen gets blackout, it hangs too much while operating and many other issues. Even I called them up thrice as it was within the replacement period but I didn't get any positive response. They just did a mere formality by doing a so called speaker test and told everything is fine inspite of telling them all the issues. Till now I didn't find a positive response from flip kart. This mobile is just a waste of \" MONEY \" for me. Advise all not to buy electronic gadgets from flip kart.",
            "date": "16 Jul 2015",
            "name": "rahul prajapati",
            "stars": "1 star"
        },
        {
            "comment": "I bought this product few months back. We are extensively using it for gaming, browsing, skype, chats, whatsapp without any issues. Drop back of the phone is battery backup not come up more than 1 day but, still worth to buy the phone.",
            "date": "16 Jul 2015",
            "name": "Raja K",
            "stars": "4 stars"
        },
        {
            "comment": "Battery life needs to be increase and Mobile weight is high compare to other product apart from this over all mobile is good..:)",
            "date": "16 Jul 2015",
            "name": "Manjunathan Sa...",
            "stars": "4 stars"
        },
        {
            "comment": "Very good phone for the price of 10k. I like the look,sound,touch and it's fast response but the battery life some how disappointed me.",
            "date": "16 Jul 2015",
            "name": "VISHWAJEET KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "Having glitches of not able to hear voice of the person calling. First I had it for just once or twice but now its too frequent and annoying. After checking for the solutions over the internet I got to know that many users are facing the same issue. What is the use of phone when you cant receive voice calls with good quality. So for me bad rating unless I get my product replaced and working fine.",
            "date": "16 Jul 2015",
            "name": "Swati Sharma",
            "stars": "1 star"
        },
        {
            "comment": "this phone is good . working fine. looking is very good. fast working, camera quality is good. battery is drying, i am using by 4 Months one time it gets hang. other than super phone",
            "date": "16 Jul 2015",
            "name": "Ramesh Kanike",
            "stars": "4 stars"
        },
        {
            "comment": "from delivery to product....awesome deal.I'm very happy with the delivery & the mobile is far better than samsung's high price mobiles.",
            "date": "16 Jul 2015",
            "name": "Sanjay Kr. Ray",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone two days and my upfront reaction after using it is 1. Phone gets heated very soon. You cannot talk for more than couple of mins. I had to use headphone to complete my 30 mins office call 2. Phone battery is fast consumed. Though this may be fixed by adjusting usage but still I think it is too fast depleting when I used the phone with standard settings 3. Biggest issues seems to be in voice quality. It is not great at all. 4. Why does the speaker is at the lower end - may be i'll get used to this but again this is odd design. I may review the ratings based on usage going forward. I used phones for long official calls and don't think this phone will support me.",
            "date": "16 Jul 2015",
            "name": "Rajiv Sharma",
            "stars": "2 stars"
        },
        {
            "comment": "Excellent product from Motorola, anyone who is looking for a budget smartphone with latest software can go for it, Thanks Flipkart for your prompt service.",
            "date": "16 Jul 2015",
            "name": "Ranjan Boral",
            "stars": "5 stars"
        },
        {
            "comment": "it is good phone but some common problems are there which irritate the camera is awesome,speakers are not bad. and a little lagging overall its a average phone",
            "date": "15 Jul 2015",
            "name": "Ajith Kumar U K",
            "stars": "3 stars"
        },
        {
            "comment": "The phone is not at all good. It hangs all the time. Sometimes we will not able to answer a call(the basic need). It was better in the beginning with kitkat OS. But when updated to Lolipop it makes me cry. I feel like hitting it hard on the floor :(",
            "date": "15 Jul 2015",
            "name": "Rahul Maram",
            "stars": "1 star"
        },
        {
            "comment": "Hi The phone have received defective one and returned the product and money got refunded. Good service from Flipkart but i would not suggest this phone to any one.",
            "date": "15 Jul 2015",
            "name": "Meyyappan S",
            "stars": "1 star"
        },
        {
            "comment": "Used for 9 months now. Pros: Awesome phone! Great integration of google apps. Stock Apps like Maps, Navigation and Location are very accurate. GPS locates quickly even if in car / building (without Wifi/internet) and even if location is kept off for long. Lollipop update is good. Dual sim features are also good. Stock Camera has good features too. Screen quality, Call quality and earpiece volume is good. Battery life is ok considering screen size. Cons: Phone: Had frequent disconnection issue with memory card and sim card on new product. Got the sim tray replaced under warranty. No problems since then. Loudspeaker could have been louder. Accessories: Stock headphone could have been canalphones instead of earphones. (But sound quality is good) Could have provided with a data cable for charging with laptop (can't always expect power source) On the whole, I'm now a Moto fan!",
            "date": "15 Jul 2015",
            "name": "Akash Kamat",
            "stars": "5 stars"
        },
        {
            "comment": "Good Phone , worth the money spent for an andriod phone. the Camera is very good, real get SLR like photos, sharp and crisp.",
            "date": "15 Jul 2015",
            "name": "Good Phone",
            "stars": "4 stars"
        },
        {
            "comment": "BATTERY SHOULD BE MORE POWERFUL AND NETWORK IS FLUCTUATING WHEN DUAL SIM USE. THE BATTERY CANT LASTING WHOLE DAYS.",
            "date": "15 Jul 2015",
            "name": "arindam kumar...",
            "stars": "1 star"
        },
        {
            "comment": "Dont compare this with flagship models from other brands..Frankly speaking Pros: 1. Performance is decent 2. Decent screen 3. Pure Android Cons: 1. Earphone is of low quality. 2. Camera quality is not that good, especially in night. 3. Poor signal reception 4. Second sim slot, it will easily get damaged and stops working if you insert a cut sim. Overall it's a good phone under 15K",
            "date": "15 Jul 2015",
            "name": "Anand",
            "stars": "4 stars"
        },
        {
            "comment": "Replacement Policy of Flipkart is very good and worth mentioning. The first one, which had some problem, was replaced by Flipkart immediately after the matter was reported to them. The performance of Moto G (2nd Gen) is very good till date. The only problem area is battery, which has to be charged daily and perhaps every smartphone has the same problem.",
            "date": "15 Jul 2015",
            "name": "Kalyan M",
            "stars": "4 stars"
        },
        {
            "comment": "Within one and half month its mother board is damaged no response from the customer service center Three times i walk in the customer service center Not yet get any proper solution.",
            "date": "15 Jul 2015",
            "name": "Shiju k joseph",
            "stars": "1 star"
        },
        {
            "comment": "Really a nice phoen to hang out with, the only problems comes is of heating while playing games or surfing.",
            "date": "15 Jul 2015",
            "name": "Akki",
            "stars": "4 stars"
        },
        {
            "comment": "well balanced product. Upgraded to android lolipop and is working well. Battery Backup as well as battery optimisation is too good. No hanging up or overheating issues till now (using it for 7 months).",
            "date": "15 Jul 2015",
            "name": "Aritra Kar",
            "stars": "5 stars"
        },
        {
            "comment": "Nt lasting for a day also. If I ask for replacement they are asking me to go for the nearest Motorola custumer care centre and get repair it.",
            "date": "15 Jul 2015",
            "name": "Rakesh Bommisetti",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome phone at given price Pros: Excellent camera, Battery life is good, light weight Cons: Heating problem during summers, it becomes difficult to handle the phone during summer. Otherwise phone is excellent.",
            "date": "15 Jul 2015",
            "name": "HIMANSHU GAWANDE",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is good. you will not disappointed to buy this model.however in this price range some other model also available.",
            "date": "15 Jul 2015",
            "name": "Ashish Anand",
            "stars": "4 stars"
        },
        {
            "comment": "It Is a Bogus means Hopless Product. Very bad in service after sale. If Moto cannot resolve my issue than i will never purchase any product from Flipkart because i have already visited service center for 4 time but did not resolve issue regardig my mobile. if ican give star in minus than i will choose -100000000.",
            "date": "15 Jul 2015",
            "name": "Ajay Barot",
            "stars": "1 star"
        },
        {
            "comment": "Amazing Product... Buy it any day... Delivery on time... Excellent packing and what not... I have ordered this before for 12,999 and this time i got the same product for 8999 with some clubbed offers... If you are paying 8999 for this product it is worth the buy any day...",
            "date": "15 Jul 2015",
            "name": "Raja Ram",
            "stars": "5 stars"
        },
        {
            "comment": "Hello friends, Early stages you will like the phone, but as the time passes the performance of the phone becomes a nightmare.",
            "date": "14 Jul 2015",
            "name": "Lakshman Kolap...",
            "stars": "1 star"
        },
        {
            "comment": "I;m experienccing some problems within a month. When I remove it from charging it still shows it is being charged",
            "date": "14 Jul 2015",
            "name": "Aaikya Mamnia",
            "stars": "3 stars"
        },
        {
            "comment": "Product is good.. Initially theiw is problem of battery backup but thanks to Motorola Customer care and flipkart to reslove this issue. this is due to lack of synchronisation between software and battery hardware.",
            "date": "14 Jul 2015",
            "name": "kT",
            "stars": "5 stars"
        },
        {
            "comment": "overall its a good phone to carry, stylish however it gets heated up soon if using 3G network. If it comes it with a 2gb ram, no one can beat this phone. Music is little embarrassing. I wish they could have worked on good music output.",
            "date": "14 Jul 2015",
            "name": "mansoor ali",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome , in 9999 what you can expect? Awesome battery life, lollipop, corning gorilla glass. everything is great.",
            "date": "14 Jul 2015",
            "name": "Shashank Vedante",
            "stars": "5 stars"
        },
        {
            "comment": "uses experience is camera is awesome both front and rear no comparison to other ..problem only is battery if you are travelling then its drain all battery in a day ....buy it with power bank then it is worth of its price...apna bolee tau khareed bhai mast hai",
            "date": "14 Jul 2015",
            "name": "Ritesh sundaram",
            "stars": "4 stars"
        },
        {
            "comment": "i buyed this phone in january 2015 ,after 6 month this phone started showing its true color, phone start hanging , as soon as i unlock the phone the screen get freeze. i did everything worked on safe mode,uninstall all the apps, even did factory reset but still the problem is same screen get frozen, keyboard hangs while typing cant even pick or cut the calls due to frozen screen .. So this is my genuine review to all buyers plz don't waste your money on these kind of bullshit phones.. better go for other phones bt not for moto.. I DON\"T WANT TO GIVE EVEN A SINGLE STAR BUT HAVE NO CHOICE.. :(",
            "date": "14 Jul 2015",
            "name": "Swati Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "I am quite happy with the product. I quite liked the styling of the G2 and that's the reason I bought the phone. It's quite a sturdy phone. I only have one issue with the phone and that is frequently I fail to have signal on the phone. Did not face this issue with my previous Android phone which was HTC Desire. Specification wise I only wish that Moto offered a 2GB RAM rather than a 1GM RAM. Apart from these I am quite happy with the phone. I do have an issue with Flipkart though. They dropped the price by 3K within a month of me buying the phone. I think it's a bit unfair on the recent buyers!!",
            "date": "14 Jul 2015",
            "name": "Sriram Raghavan",
            "stars": "4 stars"
        },
        {
            "comment": "Ordered Moto G 2nd Gen. It was delivery after 15 days that was first disappointment. Exaclty after one month phone is not working, nothing appears on screen. Phone gets extremely hot. Very very frustated by Flipkart for delivering bad product.",
            "date": "14 Jul 2015",
            "name": "Vaibhav Kulkarni",
            "stars": "1 star"
        },
        {
            "comment": "I have been using the phone for 6-7 months now. I've never faced any major challenge other than lost network while other phones using the same provider in the area are enjoying the network coverage. In such situations I had to either reboot or find network to resolve the problem. Otherwise its good one, value for money, a budget phone from a big brand. I'm not a gamer so it's performance meets my need. However it's RAM is smaller (almost half) compared to the other android phones in the segment.",
            "date": "14 Jul 2015",
            "name": "Abhisek Basu M...",
            "stars": "4 stars"
        },
        {
            "comment": "Very nice smartphone. All features are very good i.e. Camera Quality, Weight, Look, Material quality, etc.",
            "date": "14 Jul 2015",
            "name": "MANOJ PRADHAN",
            "stars": "5 stars"
        },
        {
            "comment": "Am just keeping the phone as flipkart left me with no other way. They are not genuine as they informed flipkart guaranteed. Am tired of calling and contacting them, no refund no help. bad service.. liar flipkart.",
            "date": "14 Jul 2015",
            "name": "Ashwinidas",
            "stars": "1 star"
        },
        {
            "comment": "Waiting for 3rd Gen in Motorola...! Moto Offers good android mobiles for attractive prices...! Worth For Money...! Suggestion to increase the service centres.",
            "date": "14 Jul 2015",
            "name": "Sathish",
            "stars": "5 stars"
        },
        {
            "comment": "ek to har din is ka price kam ho jata hai.. don't buy it...its worst product ever launched by motorola.. and battery is damn.. 2 hours backup",
            "date": "14 Jul 2015",
            "name": "Shubham Yadav",
            "stars": "1 star"
        },
        {
            "comment": "There is no doubt that Moto G always a good option in this price range. Good Camera quality, battery, storage, speed everything is good.",
            "date": "14 Jul 2015",
            "name": "Jitu Tiwari",
            "stars": "4 stars"
        },
        {
            "comment": "The phone performs well, as expected. However, the earpiece volume is too high. Even at mid-range, most people around the user can hear the conversation very clearly. Some tweaks are needed there.",
            "date": "14 Jul 2015",
            "name": "Ujval Nanavati",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased moto g2 phone 5 days ago.today am fasing some problem in this phone. problem is phone automatically hanged.",
            "date": "14 Jul 2015",
            "name": "Rajit Goyal",
            "stars": "1 star"
        },
        {
            "comment": "HI I had recently purchased the Moto G2. and over all the product is nice to hold and does the basics well. I am not a very heave user but the phone struggled on most part to work with few social media apps. I am not sure whether it is because of the lollipop update but hte phone becomes ver slow number of times. For eg: if you want to call a contact then click on the name and nothing will happen for the next 3-4 seconds then the dialer screen will appear and the call will get connected. Over all a ok phone with a nice camera the pics come out really well and the display is also very nice.",
            "date": "14 Jul 2015",
            "name": "Manojit Bhatnagar",
            "stars": "2 stars"
        },
        {
            "comment": "Flipkart service super.. Moto G 2 gen simply superb... Good one. Camera - 8MP takes pics with good clarity; 2MP - great selfie. Speakers Simply superb .Stereo speakers Awesome !! 16 GB internal memory Micro SD card slot.",
            "date": "14 Jul 2015",
            "name": "Gopal K",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone a year ago, it was awesome. It broke down and I decided to buy it again. This time the phone quality for the same product was PATHETIC. Display is not any more crisp like before. Do not buy. Motorola is not good anymore.",
            "date": "14 Jul 2015",
            "name": "Rahul Kochar",
            "stars": "1 star"
        },
        {
            "comment": "front camera during new purchase is very awesome but slowly with use it gets degraded... no other problem occurred yet.... if u r fan of selfies go for xiaomi mi phones.....other wise this phone is a very decent product under this cost....",
            "date": "13 Jul 2015",
            "name": "Baljit Singh",
            "stars": "4 stars"
        },
        {
            "comment": "need improvement in battery back up...excellent clarity of photos..but my phone is getting strucked frequently..even my music player wont play frequently still there are some technical issues pls solve them",
            "date": "13 Jul 2015",
            "name": "hima varsha",
            "stars": "3 stars"
        },
        {
            "comment": "This is a good phone with great build quality, excellent screen (color accurate and silky smooth to touch), nice camera (under good lighting). The Lollipop OS is far improved from its predecessor, but still lags behind customized versions of Samsung etc in terms of intuitiveness. Things are all \"hidden\" under the hood and, you should know how use it from else where. eg: when calls comes, there are multiple options, 1) take the call, 2) reject 3) reject with message etc, this can be done by swiping right/left or up/down. But the problem is, that none of these option are shown on the screen at first. You need to fiddle around to see how to even take a call !. Once you get used to it, it is easy, but there is a learning curve, which I think could have been easily avoided. The biggest problem however is the excessive radiation (SAR) which is 1.51 against the limit of 1.6 required in India. Note that Samsung S3 has only 0.55 SAR. That is a lot of difference. If you are sensitive to RF exposure, please be aware about this. I have also seen the phone going out of network for a few seconds and coming back for no apparent reason. Battery life is not very great (hits 50% in a day with minimal usage). However idle backup with 2G is exceptional, lasts 3 days to hit 50% battery, ie may last up to 6 days! Once you put in 3G, it consumes 2-3 times more power even under idle (mobile data/wifi off)",
            "date": "13 Jul 2015",
            "name": "Sudheer Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this phone for my sister-in-law.Not even a month went by when the phone started to hang misearably. We contacted flipkart but they refused to return the product. After a few days the audio was also gone ans then also flipkart refused to return and tried to troubleshoot the problems over call which did not restore any functionality. Flipkart is selling these cheap products with no gurantee and no returns even if they deliver defective products. It's simply a waste of money to buy this phone from Flipkart.",
            "date": "13 Jul 2015",
            "name": "Arnab Bhattach...",
            "stars": "1 star"
        },
        {
            "comment": "awsome phone from the house of google(moto) in 10000 /- no any hanging problem very smooth and handy camera 8/10 performane 9/10 processor 9/10",
            "date": "13 Jul 2015",
            "name": "Alok Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Overall its a good phone. But from last few days i am facing some trouble with it as it stop doing work. it shows no sim in the phone after few minutes sometimes, due to which i have missed some important calls. Request you to please send me a new phone or rectify the problem. please",
            "date": "13 Jul 2015",
            "name": "Satpal Kaur",
            "stars": "4 stars"
        },
        {
            "comment": "Brilliant and durable set... reminds me of old nokia phones with rough & Tough style along with good features/usage etc",
            "date": "13 Jul 2015",
            "name": "Gurpreet Sing...",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is decent to use however battery needs to be more powerful. It drains quickly and need overnight charge",
            "date": "13 Jul 2015",
            "name": "gurpinder5 singh",
            "stars": "4 stars"
        },
        {
            "comment": "Recently am bought mobile.Moblile looks cool but performence wise not give full satify.Its haungs several times when am using and battery drains fast.",
            "date": "13 Jul 2015",
            "name": "Murali Krishna",
            "stars": "2 stars"
        },
        {
            "comment": "Using this phone since 7 months, my experiences are as follows: 1- after 2-3 months phone started hanging because of installing apps as it can handle only few apps, it will work great for those people who aren't into installing many apps. 2- with time battery backup started to decrease, when it was new it could run games and surf internet whole day, but now even if I don't touch it, at the end of the day its battery shows 30% remaining. 3- not good phone for playing games, it starts hanging. 4- autofocus doesn't work properly, it takes 3-5 seconds to focus which is frustrating. So if u r light user go for it.",
            "date": "13 Jul 2015",
            "name": "Deep Singh",
            "stars": "3 stars"
        },
        {
            "comment": "I am facing probelm with sim 1 slot from the date i have received the mobile, the same has been informed to Flipkart, but they just pushed it for 1 month so that they no need to replace the phone. Its annoying a lot. And i don't know how to resolve this problem now,",
            "date": "13 Jul 2015",
            "name": "Narendra",
            "stars": "1 star"
        },
        {
            "comment": "I had high hopes from this product but was greatly disappointed. The phone hangs a lot, multiple apps cannot function together. Plus after upgrading to lollipop version of android it functions in a worse manner. The earphone started malfunctioning in about 4 months. the phone heats up too and loses charge so soon. Greatly disappointed.",
            "date": "13 Jul 2015",
            "name": "Avirup Chattaraj",
            "stars": "2 stars"
        },
        {
            "comment": "Battery was not good.i havwe already using moto g2 but all the things are good except the battery life.",
            "date": "13 Jul 2015",
            "name": "Shiva Kumar Gowda",
            "stars": "1 star"
        },
        {
            "comment": "Initially there is no issues with the handset, but currently getting more issues on daily basis. Requesting for a call back and replacement.",
            "date": "13 Jul 2015",
            "name": "Veera Teja",
            "stars": "1 star"
        },
        {
            "comment": "Flipkart sent me a damaged piece at the first attempt, i have to fight for getting it replaced. i would say flipkart return policy is very bad, we would be informed that there would be a call back from flipkart at a specified time, you would receive a call and always it disconnects due to some issue. and if you call flipkart , they will ask you to wait for one more day. this is not right , we are spending money and after receiving a damaged part, does customer have to fight to get a replacement. guys who ever face such issue - dont wait for the replacement guys to call , the computerized calling system is completely a nightmare, just go and hit the call center number and give them left and right.",
            "date": "13 Jul 2015",
            "name": "Ravi D",
            "stars": "2 stars"
        },
        {
            "comment": "worst service by flipkart to solve my issue. poor battery backup not at all satisfied with moto mobile",
            "date": "13 Jul 2015",
            "name": "b.k.",
            "stars": "1 star"
        },
        {
            "comment": "I would like to share few points based on my 2 week experience With Moto g 2nd Gen Positive Comment 1. Battery is Descent (will be alive for 15 hours even after using Whatsapp, FB and other online services). 2. Both front and Rare picture quality is very good and bright. 3. Phone design is very unique. 4. Music and Videos clarity is awesome. Bass Booster is fantastic.(should use some good ear phones) 5. Phone doesn't get heat up, even after playing the games for more than 30 min. 6. on call voice clarity is very good. 7. Music over loud speaker is very clear and pleasant. Negative Comments: 1. Contact gets appended in the speed dial list after you dial the number from contacts. It becomes too much clumsy and give you a headache of removing them manually. 2. some zoom tap settings are very irritating. 3. there are not many customizing options. 4. Default ear phones are very pathetic. So am using Senheiser ear phone. Overall its a very good product and Filpkart's customer deliver and service is one among the Best.",
            "date": "13 Jul 2015",
            "name": "Santhosh Gowda",
            "stars": "4 stars"
        },
        {
            "comment": "Having All Updated Feature, ...........................................................................................................................",
            "date": "13 Jul 2015",
            "name": "Abhinit",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased motog2 on the very first day of release but experienced worst experience with service . Within warranty period Charging point slot gets damaged, Mobile dispaly gets hanged up al the time after few days of use, and either motorola nor flipkart gives any service for that. Cons: 1. Charging slot being much thinner gets damaged soon. 2. Charger gets heated up like hell. 3. Mobile also gets heated up. 4.Display gets hanged up. 5. No Service for online purcahse. 6. After sale service cost is huge where u can get a new mobile. And only one authorised service centres through out pune centre. There were 3 centres and due to continuous issues with Moto mobiles 2 of the authorised dealers denied for service but when u contact with Motorola or flipkart they will provide you all 3 address for servcie. And when u reach at that centre ull come to know that thay have stoped service for the Motorola. Once the charging point slot gets damaged due to any reason you need to pay 70% of total cost near upto 7K for repairing to replace complete PCB else Mobile is of no use. When i visited Service Center at Pune and found many of MotoG & MotoE users facing same issues of Charging slot getting damaged. And At Pune being only one service centre you need to wait for more than 2-3 hours for your turn to explain your problem with mobile which you can never claim n warranty. So Guys just think before purchasing MOTO Mobiles.",
            "date": "13 Jul 2015",
            "name": "Arun Nalwade",
            "stars": "2 stars"
        },
        {
            "comment": "its just horrible....worst experience...the phone has got gud camera...nd rest everytn is ok..bt problem is with the sim slot,every tym,i replaced the product same problem existed....",
            "date": "13 Jul 2015",
            "name": "shruti",
            "stars": "1 star"
        },
        {
            "comment": "Writing this review after 6 month of use. Battery drain out very fast. faced a lot of hanging problem. you can not use map and music player together . 1 gb ram is insufficient . call took 2 4 sec to recognize the contact and call. Only good thing is goriila glass,camera and lollipop . Build material is also very good . overall not a worthy phone . So please check for alternative before buying it",
            "date": "13 Jul 2015",
            "name": "ASHUOUTLOOK SINGH",
            "stars": "1 star"
        },
        {
            "comment": "Everything about this cellphone is right. That explains many things, doesn't it? Will just state the bad things though. 1.Stock Camera App sucks. 2.Also, video capture resolution could have been 1920x1080. 3.Charger gets super heated, you can make an omlette with the same. 4.Battery life is ok, but the mah capacity itself could have been more. Anything greater than 2200mah will be pretty good. 5.Doesn't come with a data cable. Sob Sob. That should not stop you buying from this wonderful phone. It runs like butter (I have seen very few android devices live up to it). The price is awesome. And many more wonderful features.",
            "date": "13 Jul 2015",
            "name": "Albert Basumatary",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G has really degraded there quality, I am having 4 Moto G at my home and am really very upset with the product quality even from from last 6 month I had took my mobile for 6 times in Moto service center and I am still facing the same hanging issue. I have also placed the return request to flipkart just after 3 days of purchase because I was start getting hanging issue after 3 days only but didn't get any response from them and that ticket is still in open state. NEVER NEVER buy Moto product.",
            "date": "13 Jul 2015",
            "name": "Himanshu Jain",
            "stars": "1 star"
        },
        {
            "comment": "Did have some sim problems but they resolved after 2-3 times of restart. Apart from that, amazing product! No complain whatsoever till date.",
            "date": "13 Jul 2015",
            "name": "Pranjal Singh",
            "stars": "5 stars"
        },
        {
            "comment": "I was excited when i got this cell but my excitement was just for 3-4 days bcoz after that i start hating this cellphone i'll explain why ? - In 3-4 Days I start facing battery issue (100 min Battery Backup). - Then Hang issue (OS get hanged). - Call Flipkart for replacement they verified my issue with there app. but it took 2 to 3 weeks for them to provide replacement. - After getting the replacement, still i'm NOT HAPPY :( NOTE : Lesser price product comes with LESS QUALITY. so please don't buy this cell if you don't wanna waste your MONEY.",
            "date": "13 Jul 2015",
            "name": "Shaikh Arbaaz",
            "stars": "1 star"
        },
        {
            "comment": "bought about 6 months back. its still going well and great to play games. Thanks, Moto, you hardly get hanged.",
            "date": "12 Jul 2015",
            "name": "Ram Pimgley",
            "stars": "1 star"
        },
        {
            "comment": "Moto G Mobile Battery Backup Problem, And Charging Problem It takes long time to cover 100% charging It takes Minimum 6-7 Hours for completing 100% charging. and If I run net on moto G then Battery not support whole day. It runs only 8-9 hours",
            "date": "12 Jul 2015",
            "name": "Battery Backup Pr...",
            "stars": "3 stars"
        },
        {
            "comment": "Service is a big problem, not found service centers near to me, faced lot of problems once upgraded to lollipop.",
            "date": "12 Jul 2015",
            "name": "Raghunandan",
            "stars": "2 stars"
        },
        {
            "comment": "Moto G2 might be visually good but performance wise it is far far below the regular standards... am facing hang issues even if i using 3 or 4 additional applications other than the in-buile apps..... Don't buy it/...",
            "date": "12 Jul 2015",
            "name": "Chandu yerpedu",
            "stars": "1 star"
        },
        {
            "comment": "Poor battery back up which is one of the major drawback and rest of thing is awesome need 2 time charging in a day",
            "date": "12 Jul 2015",
            "name": "vipin gusain",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone on 21-st April 2015 from Flipkart and just more than 30 days my phone started hanging.I don't have many apps too. the touch does not function for a few hours and then starts to function suddenly. Usually new phones atleast don't hang like this. My phone has never fallen, nothing is damaged. Bloody trapped with this phone. It's got a poor battery life.This is probably my worst buy on flipkart!!!",
            "date": "12 Jul 2015",
            "name": "Lok Gurnani",
            "stars": "1 star"
        },
        {
            "comment": "It looks very attractive phone when you carry on your hand. Features are very good specially camera. Android version updation in this phone is make this phone popular.",
            "date": "12 Jul 2015",
            "name": "Girishkumar Vi...",
            "stars": "4 stars"
        },
        {
            "comment": "Greatly satisfied with the phone the camera is Average and that is the only defect otherwise a great phone in such a price range. no problem after 3 months great battery backup",
            "date": "12 Jul 2015",
            "name": "Rahul Jothe",
            "stars": "5 stars"
        },
        {
            "comment": "Have used for couple of weeks and found it to be a great value for money. Does not heat up like most other Android phones I have used till now.",
            "date": "11 Jul 2015",
            "name": "Prashant Deshp...",
            "stars": "4 stars"
        },
        {
            "comment": "It's nice phone. I purchased for my Dad. Nice working, touch screen, auto update, I updated Android 5.1.1 Lolipop. Its fabulous.",
            "date": "11 Jul 2015",
            "name": "Abhishek Dubey",
            "stars": "5 stars"
        },
        {
            "comment": "its just fantastic phone but just with a prob heating and takes too much time for charging...............................",
            "date": "11 Jul 2015",
            "name": "tanmay bakare",
            "stars": "4 stars"
        },
        {
            "comment": "Good Product but as per cost RAM must be 2GB and Battery enhanced. PRO: ALL GOOD CONS : BATTERY DRAIN VERY FAST IMPROVE THIS OTHERWSE PHONE IS GOOD",
            "date": "11 Jul 2015",
            "name": "amit sharma",
            "stars": "4 stars"
        },
        {
            "comment": "hi guys i brought new moto g2 mobile recently the performance is good but it is taking too much time for charging 100%",
            "date": "11 Jul 2015",
            "name": "Rama krishna Kota...",
            "stars": "4 stars"
        },
        {
            "comment": "USING IT FROM 3 MONTHS NOW ,IT IS FYN AT THIS PRICE...VERY MUCH VALUE FOR MONEY................................................................................................................................................................................................................................................",
            "date": "11 Jul 2015",
            "name": "MADDY",
            "stars": "4 stars"
        },
        {
            "comment": "This phone was too much good to use. the processor was fast no hang battery backup its Ok camera quality is nice one easy to use",
            "date": "11 Jul 2015",
            "name": "Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Good Performance, Good Battery Backup , Smooth touch . Everything is working fine. Nice phone in this range",
            "date": "11 Jul 2015",
            "name": "Vivek Negi",
            "stars": "4 stars"
        },
        {
            "comment": "Overall phone is good, Just one problem- 2 SIM slots won't work at the same time,Please help in this regards.",
            "date": "11 Jul 2015",
            "name": "Vinil Mehta",
            "stars": "3 stars"
        },
        {
            "comment": "I am Using This mobile for more then 6 months . This mobile is having Very Good camera quality , Good Music . But the irritating thing is it became very slow now . 1GB Ram is not enough .",
            "date": "11 Jul 2015",
            "name": "Shailendra",
            "stars": "3 stars"
        },
        {
            "comment": "these fon is good but have a huge drawback that is battery(2020mah) using from 7 month these fones battery consumption like any sports bike's petrol pros-have sexy look camera is okkk but not enough good interface after lollipop fon memory is enough cons- already mentioned battery is not suitable for 3g network networking automatically changed 3g to 2g if network fluctuate that is frustatting not like samsung that remain unchanged my personal advise go for new updated fon rater going for these old....",
            "date": "11 Jul 2015",
            "name": "vijay yadav",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent offer. Value buying - only on \"FLIPKART\"! This is my first on-line purchase. I will look for such fabulous offers from \"Flipkart\" for any product. Kudos to eCommerce!",
            "date": "11 Jul 2015",
            "name": "P NAGARAJU",
            "stars": "5 stars"
        },
        {
            "comment": "Earlier version has battery drain issue. After update solved battery problem, but the font size and appearance changed. Overall a good phone.",
            "date": "11 Jul 2015",
            "name": "Anand k",
            "stars": "4 stars"
        },
        {
            "comment": "good features,but slow , heats fast ,hangs fast, but good sensors,and operating systems, worth for the money.. need upgrade ... battery is the main bug.. falls rapidly ... only 2070mAh ......need to fix this bug",
            "date": "11 Jul 2015",
            "name": "prabhu haran",
            "stars": "3 stars"
        },
        {
            "comment": "I bought that phone from Flipkart and i must say that flip kart have done a great job in delivery of the phone. Having Moto G2 is like a dream come true. Great phone ,great service. Thankyou flipkart and Mototrola",
            "date": "11 Jul 2015",
            "name": "Ankit",
            "stars": "5 stars"
        },
        {
            "comment": "my smarty mobile for smart me.. :-) i really love using internet on my moto, clicking really good pics in awesome mausam.",
            "date": "11 Jul 2015",
            "name": "Bika",
            "stars": "5 stars"
        },
        {
            "comment": "brought it about 6 months back.very nice phone.very good battery backup.very handy.you can do hell lot of things together without the fear of phone hang.all total very nice product.",
            "date": "11 Jul 2015",
            "name": "Alokananda Bose",
            "stars": "4 stars"
        },
        {
            "comment": "Best mobile ever used in my life with latest android version. But has low battery backup. 1 gb ram but its more than sufficient in today's generation.",
            "date": "10 Jul 2015",
            "name": "Kishor P",
            "stars": "4 stars"
        },
        {
            "comment": "It's good for first few months then it behave like ordinary smart phones. good battery backup and good sound quality.Touch is nice but it distort when you touch it with wet hands. Good camera quality and front camera is also very nice. overall my rating is 7/10.",
            "date": "10 Jul 2015",
            "name": "Arnab chowdhury",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought moto g2 after lots of personal research . There were other phones in the market offering higher specification at cheaper price . But finally I decided to go for it. The first product which I received was a defective piece [ touch and network issues] . I contacted flipkart and the replacement was made . The replacement procedures are poor and it takes lots of time . I had to courier the phone myself and they refunded the amount onto my flipkart wallet . Then I received my new phone . You wont regret buying this phone . Its an ideal phone for regular users . I play Asphalt 8 without much lag [ almost smooth ] in medium graphics . The phone is smooth , handy . Overall I would recommend it to my front . Go for it without hesitation . The only drawback is battery life . With WiFi and regular usage , it almost last for a day .",
            "date": "10 Jul 2015",
            "name": "Derik Roby",
            "stars": "4 stars"
        },
        {
            "comment": "IT IS ONE OF THE WORST MOBILE IN MY LIFE, IT HAVE HANGING PROBLEM, BATTERY AUTO DISCHARGE WITHIN A MINUTE PROBLEM, MEMORY AUTO DELETE PROBLEM, PHONE WILL LOST THERE MEMORY OF ANY PARTICULAR DAY",
            "date": "10 Jul 2015",
            "name": "Akash Jain",
            "stars": "2 stars"
        },
        {
            "comment": "Hello I bought this phone few months ago..So wanted to give honest review. Pros Camera 4.5/5 Performance 5/5 Heat Issue - No 4/5 Battery 3/5 (Drains quickly if data plan is active) Sound 4/5 Video 4/5 Look 4/5 (looks quite bulky) For those users who just want a good phone with great performance and camera..go with it.",
            "date": "10 Jul 2015",
            "name": "sachin bhosle",
            "stars": "4 stars"
        },
        {
            "comment": "Bought this Phone for 8999 with lots of expectation. Came pre-installed with Lollipop. Phone is fast and looks trendy. Yet to enjoy the phone to the fullest. Battery is average for a normal user and needs recharge twice a day. Photos are good and very user friendly(compared to my Xperia SP). Nice Phone for the paid price.",
            "date": "10 Jul 2015",
            "name": "Sam s premkumar",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Phone & battery backup & no hang problem.Good camera quality even in low light.specially rear camera is awsome.",
            "date": "10 Jul 2015",
            "name": "Ankit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile at reasonable price. It is as I expected and shipping and communication with flipkart is very good.",
            "date": "10 Jul 2015",
            "name": "Deepak",
            "stars": "5 stars"
        },
        {
            "comment": "Dooms day !!! 29 july i'll throw this phone away , cause 29 july is the day where win10 is gonna rock .",
            "date": "10 Jul 2015",
            "name": "Sunny Brahma",
            "stars": "4 stars"
        },
        {
            "comment": "Awesome phone... Best smart phone ever used. Best Points : 1)1 GB RAM 2)Never Hang 3)Super Camera 4)Sexy look 5)Fast processing Using this phone since last 2 months but not found any problem or negative point till now. i suggest to everyone for purchasing this..",
            "date": "10 Jul 2015",
            "name": "Dharil Kothari",
            "stars": "4 stars"
        },
        {
            "comment": "FLIPKART DEFINITELY GOT WORST EVER SUCCESS IN ONLINE MARKETING MADE THEM DEFYING THE MARKET NORMS NOBODY IS LISTENING TO YOUR COMPLAINTS. THEY BROUGHT SOME NONSENSE SMART-CHECK APP TO MAKE CUSTOMER FOOLS BY BOASTING THAT THEY HAVE CHECKED WITH SMART CHECK AND YOUR PHONE IS ALL RIGHT. SO MANY COMPLAINTS ARE THERE ABOUT SIM SLOT PROBLEMS AND AUTOMATICALLY SIM GETS DISABLED, EVEN MOTOROLA FORMALLY ACCEPTED SOMETHING WRONG WITH SIM SLOTS AND THEY ARE WORKING ON IT, BUT FLIPKART CONSTANTLY AND HYPOCRITICALLY DENYING IT..................DONT WASTE YOUR MONEY AND AVOID UNNECESSARY HEADACHE........WORST.........IF THEY WOULD HAVE ALLOWED I WOULD HAVE GIVEN ONLY HALF STAR.....AS THEY PICK UP YOUR CALL",
            "date": "10 Jul 2015",
            "name": "milind ajay ja...",
            "stars": "1 star"
        },
        {
            "comment": "it is a wonderful phone........... you get everything in this mid-range smartphone....... carry on moto,expecting more such brillliant smartphones",
            "date": "10 Jul 2015",
            "name": "RAGHAV MEHROTRA",
            "stars": "5 stars"
        },
        {
            "comment": "I am really going to post about this on twitter and Facebook I bought cell phone from flip-kart 20days back and it start giving me display problem. When i complained about this to flip-kart, then there are just giving a new timing to receive a call from their technical depart and i am asked to wait for the call.This is happening since last 2 days.I don't understand why the guarantee 30 days of replacement. when i called the flipkart executive Name (Vadhu) to change the timing of technical call since i have a meeting , he did not behave properly with me neither he transferred my call to his manager even i requested him multiple times and asked me to wait for call. I want quickly replacement of this handset as soon as possible. I would request all not to go for flipkart option if you want to buy a cell. There service is highly frustrated if the handset goes bad.",
            "date": "10 Jul 2015",
            "name": "kumari Nitu Singh",
            "stars": "1 star"
        },
        {
            "comment": "Moto G2 (2 Gen) has issue with phone calls receiving. when ever call hits and tried to receive call it does not gets received and call turns into a Missed calls. every time we have call the person who was trying to call us. Heavy weight Speakers little bit issue but doesn't matters Good Camera quality.",
            "date": "10 Jul 2015",
            "name": "maykumbhar13 .",
            "stars": "4 stars"
        },
        {
            "comment": "As always Moto G - 2nd is very handy and easy to use. But one thing i felt was battery is draining too fast though i have not installed many apps.",
            "date": "10 Jul 2015",
            "name": "Ganesh kumar S...",
            "stars": "4 stars"
        },
        {
            "comment": "good phone nice built good batery. nice camera. buter smooth performance with stock android. RAm can handle even the tough games witn ease.",
            "date": "10 Jul 2015",
            "name": "Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this product few month ago from Flipkart and this is very nice product like bag quality is good , finishing is good etc.",
            "date": "10 Jul 2015",
            "name": "Nahid Ahmad",
            "stars": "5 stars"
        },
        {
            "comment": "Bought it in exchange offer....flipkart delivery & packing was very good. Any day pickup item from ur site...WS retails rocks!!",
            "date": "10 Jul 2015",
            "name": "Sethu",
            "stars": "5 stars"
        },
        {
            "comment": "If you're buying a phone just to buy a new one in a week, go for this. I've bought several smart phones over the last 5 years (HTC, Samsung, Nexus, Nokia, etc.) and each one had lasted several years. The glass of Moto G broke in less than a month because of a fall of less than one foot. The cost of fixing the glass is about the half of the phone price itself. I'm going for a new phone just to save myself of recurring expenses! The phone used to be value for money before this happened. I'm surprised that such phones are even sold these days.",
            "date": "10 Jul 2015",
            "name": "S S",
            "stars": "1 star"
        },
        {
            "comment": "Product is good it take too much time in delivering the product.I got mobile after 2 week.shown deliver on expected date and got product after 2 day delay and the flipkart team irritating by constant send meaning less email and sending sms regarding delay it added the another irritation level even not stopoed sending sms and email after place complain for that. it clearly show the careless attitude towards the customer .flipkart team not the customer orientation even they consider the customer take it granted, and they only interested in only doing business not believe in the customer relationship. I m not recognize the flipkart for the customer who live in the semi metropolitan city.it is good to buy some similar or even less feature phone instead buy on flipakart. at least u have got phone instance payment rather then wait for 14 day.",
            "date": "10 Jul 2015",
            "name": "Ronak",
            "stars": "1 star"
        },
        {
            "comment": "i bought this phone 3 month before. after using 3 months iam fully satisfy with this. good camera touch also very good battery backup for normal user charge 1 time in a day for heavy user charge 2 times.overall avg battery back up performance wise it flawless best in its range now it available 10K in this range u can find better than this so dont think if u want to buy phone around 10K go for moto g2",
            "date": "09 Jul 2015",
            "name": "ARUN KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "Good product but battery backup is not good even-though i turn off all option like bluetooth, wifi, reduce display brightness, geo location, mobile data...",
            "date": "09 Jul 2015",
            "name": "Janarthanan S",
            "stars": "4 stars"
        },
        {
            "comment": "During game installation phone got hanged. Phone is not rebooting. We tried to factory resting but it will not working. Call customer care but no proper response. After two days back tried to restore, on that it work and restored. now its working fine",
            "date": "09 Jul 2015",
            "name": "SANTHOSH ramkumar",
            "stars": "2 stars"
        },
        {
            "comment": "I bought one moto g2 sumtime in april. after using the phone for 5-7 days i experienced major technical faults with the phone like the battery was draining way too fast. Moreover the phone switched off and the battery drained to 0 percent in 1 sec from 81 percent. this kind of incident occured twice or thrice. so i first initiated a exchange request. i was assured of callback once a downloaded a certain app of flipkart's. no such call was received. tthis whole process of calling the customer care nd not getting a call happened 4 times. can u believe that. Finally after 2-3 months they posted that your exchange request has been cancelled and we r not to exchange or refund for your product. completely outrageous. not gng to buy any product from flipkart until and unless its not available anywhere.",
            "date": "09 Jul 2015",
            "name": "Saras Choudhary",
            "stars": "1 star"
        },
        {
            "comment": "Moto-G is undoubtedly a good phone. But the larger 5 inch model is uncomfortable to handle. I would rate Gen1 higher than Gen2.",
            "date": "09 Jul 2015",
            "name": "Manoj Gaonkar",
            "stars": "4 stars"
        },
        {
            "comment": "good phone but it could be very good if battery capacity was more but steel a handy gadget to use i bought it for my father & he is happy so i have no problem with at all :)",
            "date": "09 Jul 2015",
            "name": "Dhaval Sumesara",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone since 6 months, never had any issue. Battery Backup is above average, Ram consumption is super. Never Hangs. Fully smooth and responsive.",
            "date": "09 Jul 2015",
            "name": "Satyajit Koralm",
            "stars": "5 stars"
        },
        {
            "comment": "good one and i would recommend everyone as the features are also good, just it gets hanged sometime rest all is fine and worth of money.",
            "date": "09 Jul 2015",
            "name": "Abhishek Banerjee",
            "stars": "5 stars"
        },
        {
            "comment": "Pathetic phone. Lolly pop makes it even more slow. I have to switch it on and off at least twice a day. Its gets hanged every two hours",
            "date": "09 Jul 2015",
            "name": "Mukund",
            "stars": "2 stars"
        },
        {
            "comment": "One of the best mobile i have seen in recent time at this price. A worth for money In one word i just love the phone. As usual flipkart delivers before delivery date & time. Hats off to them . Really very happy with flipkart service !!!!1 Guys grab it !!!!!!",
            "date": "09 Jul 2015",
            "name": "Mohammad Hida...",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone in this budget. Only drawback is battery backup. If you wanna a stock android phone, this phone is for you. no lagging till now.",
            "date": "09 Jul 2015",
            "name": "Kanwal Singh",
            "stars": "5 stars"
        },
        {
            "comment": "good phone. good srvice by flipkart for this one. I appreciate the speed of delivery...........................................................................................................................................................",
            "date": "09 Jul 2015",
            "name": "Tarun Bhati",
            "stars": "5 stars"
        },
        {
            "comment": "it is very bad. i bought it 1 month before i had problems with speaker and battery. i don't how to fix it. plz help me",
            "date": "09 Jul 2015",
            "name": "kumar",
            "stars": "1 star"
        },
        {
            "comment": "this is very good product at this price range- feels real good in hand, look is awsome man, with lollipop but sometimes it hangs as well but very few chances. but yes if you are hard game lover then it might create problem for you. so be aware. battery life is as usual average. supports OTG too. good to go if you under this price range.",
            "date": "09 Jul 2015",
            "name": "Ashutosh Jha",
            "stars": "4 stars"
        },
        {
            "comment": "best phone at that affordable price with wide range of features.sometimes while using many apps at a time,phone gets heated.But then after a while it looks ok.No battery saving apps are recomended for this mobile,they doesnt work fine with this mobile.white mobile,looks pretty cute.I recommend moto g2 for this price.",
            "date": "08 Jul 2015",
            "name": "Sravan Vavilala",
            "stars": "5 stars"
        },
        {
            "comment": "This piece is good and seems reliable. Pros: Good Touch response,Stock android,Good Form factor. Cons: Get slower when some heavy apps are running and Battery backup is not so good.",
            "date": "08 Jul 2015",
            "name": "Prasanjit",
            "stars": "4 stars"
        },
        {
            "comment": "This mobile is worth its price.",
            "date": "08 Jul 2015",
            "name": "Viraj Nalawade",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G (2nd Gen) is my secondary phone which I bought for saving my Xperia Z1 from my trips(Because it already undergone a display re-plantation surgery which placed a big hole in my pocket). Unlike many others, I fall in love with Xperia's water resistant capabilities and was searching for a phone which I can use at-least when it is raining and ended up with the moto g. That means water resistance is the only reason which caused to switch my decision from Micromax Yureka. The following are my conclusions after using this phone for a month. It performs the basic operations like calling and whatsapping very well(not so charmingly like my Xperia does but the prize tag equals result) Gaming is not butter-smooth but satisfactory results obtained from this area. Again the prize tag that matters and it does pretty well according to its prize Calling while its raining is a party trick that still works. I didn't tried any underwater shooting unlike I done in my Z1 and I'm not sure it can done that with the exposed charging port GOOGLE CHROME KILLING MY DEVICE frequently and I thought it is a problem with piece I got but confirmed with my fellow G2 owners. Multiple tabs which act like individual apps results crashes and it slows the phone like hell. Using UC Browser solved the problem up-to a level but I really likes the stock android browser very much but nothing I can do here other than switching my fav browser. Moto guys, please give some more processing power for the phone which offers future android updates. The problems getting bigger and bigger with updates. Browsing is a basic feature so don't mess it up. Losing a star for outdated hardware. You can still go for this because we gets a product which worth the money which we are paying. Thanks for reading my review.",
            "date": "08 Jul 2015",
            "name": "Dan the Gadget Lover",
            "stars": "4 stars"
        },
        {
            "comment": "Got it for my dad last month... He is pretty happy with the specs, size and performance. Great experience... Though he informed about slight heating issues certain times but still great phone.",
            "date": "08 Jul 2015",
            "name": "Arpit Mohapatra",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone, but has following cons; 1) battery discharges like hell, after seven hours i have to juice it up! 2) Heats up on playing prolonged games. 3) Lil expensive, in terms of what we are getting in this price band. 4) Screen shattering issue, as many have already mentioned.",
            "date": "08 Jul 2015",
            "name": "Satyam Tyagi",
            "stars": "2 stars"
        },
        {
            "comment": "I had heard great reviews of Moto G2 before I bought it. But I guess we can't trust opinions unless we have tried something for ourselves. It's been almost 3 weeks since I'm using this phone. Flipkart, as usual, delivered much before promised time. One concern I had after opening the box, the phone already seemed to have two Wifi connections previously configured (No signal, none of these was near me and I've never caught them on any other Wifi device I use). This brought me to think if the piece I got was used by someone (although for a short period). Not sure if I can trust Flipkart on that anymore. The phone looks good. Can be held and easily handled by one hand - I don't like those excessively huge handsets. Also, this is my first Android phone so my experience will be affected by both the phone and the OS's performance. Performance:- The battery backup is awful. I need to recharge it frequently - Once every 15-16 hours after normal use. This is when I play no games at all. I have a few apps, and I browse, that's all. I was travelling the other day and there was a disruption in connectivity. I think some apps were trying to connect and suddenly the phone went haywire! Some random things opened on their own on the screen, the flash turned on, and the touchscreen stopped taking any inputs from me. The phone was not even a week old at that time, and I was so freaked out! Even the power off button needs an input from the touch screen, and the battery is not detachable so I could not just remove it and shut the thing down. I somehow managed to forcefully power it off after trying for 10-15 minutes. I have also kept the vibration off, but the phone still vibrates when I type. Other features are okay. I guess to each his own. One more disappointing thing, I got the phone for 10.99k just 3 weeks back and it's down to 9.99k already :(",
            "date": "08 Jul 2015",
            "name": "M.S.",
            "stars": "3 stars"
        },
        {
            "comment": "excellent,classic , good speakers, high battery backup up I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones.",
            "date": "08 Jul 2015",
            "name": "JOHN MATHEW",
            "stars": "5 stars"
        },
        {
            "comment": "1.Phone is getting heating up if am using phone more then hr. 2.The battery backup is not at all good. if we use internet or WiFi(not up-to mark). 3.Its Requires too much time for charging. 4.Voice is not clear.Lot of disturbance in call. 5.If i connect to OTG some of my apps are disappearing.",
            "date": "08 Jul 2015",
            "name": "Jagadisha B S",
            "stars": "1 star"
        },
        {
            "comment": "hi flipkart my moto G2 problem 1-Battry charging not proprly worked 2-Sim card switch folty plz retun my cell phone",
            "date": "08 Jul 2015",
            "name": "Mahesh Patil",
            "stars": "4 stars"
        },
        {
            "comment": "Team, I have just bought it 2 months back and now I am facing battery issue with this phone. If my battery is showing 100% then within 5-6 minutes it shows battery low indicator and finally within 10 minutes phone gets shutdown. One more issue is with this phone is if you are running 3-4 apps then it gets hang and some time I am not able to attend the call due to not to able to see the screen. Today I contacted to customer care and I came to know a shocking fact that in case of submission of phone they do not provide you a stand by phone, moreover their executive's talk like \"Hitler\". -Praveen",
            "date": "08 Jul 2015",
            "name": "Praveen Rawat",
            "stars": "1 star"
        },
        {
            "comment": "If something happens for your phone, MOTO service center people will say that it is physical damage. They asked me to pay 8000 for changing the motherboard for IC. NEVER buy anything from MOTO",
            "date": "08 Jul 2015",
            "name": "Vignes Arul",
            "stars": "1 star"
        },
        {
            "comment": "This mobile is soperb in its class , camera is average but zoom is not good voice is claer touch is soperb little bit hanging problem front camera is satifactory soung is very good",
            "date": "08 Jul 2015",
            "name": "Anurag Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "Bought MOTO G 2nd Gen from flipcart, and i made biggest mistake in my life, battery life was hardly 3 hours, and i had charge mobile 4 times in day. Also cell was heating a lot, that it can burn my skin, I had to carry mobile in my bag rather than in my pocket. Customer service was even worst.",
            "date": "08 Jul 2015",
            "name": "Jiten Patel",
            "stars": "1 star"
        },
        {
            "comment": "After using the Moto G for 10 days found some issues and good things. Pros: 1. Worth at this price. 2. Camera quality is good. 3. fine with internal memory. cons: 1. Taking 2 to 3 hours to charge 100% battery. 2. 100% battery will come for 10 to 11 hours only. 3. while charging the phone, charger adapter is heating like a iron box. 4. Sound clarity could be better. some times noise is coming. 5. Some time signals not coming for one sim, other sim is working fine. to solve this we need to restart the phone. But its manageable.",
            "date": "08 Jul 2015",
            "name": "Mallaiah Mejari",
            "stars": "3 stars"
        },
        {
            "comment": "the mobile was not delivered by the courier company and order got cancelled from flipkart , was specifically scheduled to be delivered on a working day which was not done",
            "date": "08 Jul 2015",
            "name": "Akhil Kadakia",
            "stars": "1 star"
        },
        {
            "comment": "After using it 15 days i am writing about this product..the speakers and camera is awesome when compared to moto e but the battery is too bad with a lollipop os..it gets drained very soon.. i tried the resetting option twice..now am thinking about returning and ordering a new one..",
            "date": "08 Jul 2015",
            "name": "Keerthi",
            "stars": "2 stars"
        },
        {
            "comment": "Nice one ,but 1 problem in phone bsnl 3g sim network is not working , i ask customer care they replied moto g not supported",
            "date": "08 Jul 2015",
            "name": "Adinarayana",
            "stars": "4 stars"
        },
        {
            "comment": "the website says easy replacement and it wasnt that easy for me.............flipkart kept sending defected pieces and they had a problem replacing it",
            "date": "08 Jul 2015",
            "name": "deathstroke",
            "stars": "1 star"
        },
        {
            "comment": "Not a great phone. Better products are available at cheaper price from Xiaomi & asus. This is manufactured by Motorola China Co. Pvt. Ltd. which is ultimately a 100% chinese origin & is not a usual motorola which we have used for decades.",
            "date": "08 Jul 2015",
            "name": "Subhrajit Sanyal",
            "stars": "4 stars"
        },
        {
            "comment": "This is my Secound phone from flip kart, i was really happy to use Moto G 1st gen, were has i exchanged it with Moto G 2nd Gen the phone is really getting heated badly and some times hanging, very slow charging its been just 3 months i bought it and from yesterday the phone was not working i went to service center to show the mobile they took and and after one hour of checking they said the mother board id damaged and battery is damage, i am shocked with the service center reply the phone did not even fall down from my hand, the exterior is very good i am surprised with the reply i am unable to understand what to do now is that flip kart had sent me the damaged piece or what had happen Hyderabad guys please do not buy Motorolla mobile because we do not have good services centers here",
            "date": "08 Jul 2015",
            "name": "praneeth Jp",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto G (2nd Gen). It worked fine for 3 months, but thereafter I started observing erratic behavior of touchscreen. It works for few hours and then stops working for another few hours. I handed over my mobile to Noida Service Centre. After much followup they returned it after 7 days (mother board replaced). But, after 2-3 days the same touchscreen problem re-appeared. I mailed to Motorola with the issue. They responded by requesting me to hand over the phone once again at the service centre and share with them the Job Description No. I did the same and handed it over to Noida Service Centre and shared JD No. with Motorola. After 3-4 days I got back my mobile (Touchscreen replaced) and was assured by the engineer that now the problem has been completely resolved. But, to my surprise only after 2 hours the problem re-appeared. Again I wrote a mail to Motorola and in response they wrote that my case is closed and as per their records my mobile's issue has been resolved. However, if my mobile is still having issue I have to hand it over to the service centre for the 3rd time. I called up their call centre and the so called trained executives kept on insisting me to go to service centre again. I asked them the number of times I have to visit the service centre if problem re-appears or at least give me an assurance (in writing) that this time this issue will be resolved. Failing to get any satisfactory response from Motorola I mailed to Flipkart and they gave me an instantaneous solution by replacing my mobile.",
            "date": "08 Jul 2015",
            "name": "Suyash Chaturvedi",
            "stars": "1 star"
        },
        {
            "comment": "Very poor quality by motorola in this range, Battery is not good, Also charger get defect with in 1 month.",
            "date": "08 Jul 2015",
            "name": "Sukant Kaushik",
            "stars": "1 star"
        },
        {
            "comment": "pros- -good camera -good sound of stereo speakers -no over heating issues -after 5 months of usage phone has never showed an unresponsive state,or such. cons- -phone lags a lot in simple issues like showing contacts list,the time between dial button and screen to appear is sometimes more than 5 seconds. -battery life is ok if only use is calling,but even connected to internet is enough to drain the phone in less than 10 hours,if you browse,game, whatsapp backup is less than 5 hours.. overall- the phone is not outstanding,an average performer",
            "date": "08 Jul 2015",
            "name": "zen",
            "stars": "3 stars"
        },
        {
            "comment": "This phone is totally worst...always getting hang....as u said me also moto g user me also faced alot of problem on it now the most problem is wifi connection mine moto g now unable to connection wifi dunno having wat solution for it now",
            "date": "08 Jul 2015",
            "name": "Saurabh Mishra",
            "stars": "1 star"
        },
        {
            "comment": "My brother suggested me to buy MOTO. After using this i am very happy about the phone's performance and looks. Nice phone to buy within budget.Good to go.",
            "date": "08 Jul 2015",
            "name": "Niranjan",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone for the price range! Best phone below 11000 rupees, hands down! Works well beyond expectations! Not too huge and not too small.. they seem to have improved the camera.. the display is way beyond expectations for a phone with that pixel density... The reduced price by 1000 just 3 days after I brought it lol..",
            "date": "08 Jul 2015",
            "name": "Abdul.Kadir Me...",
            "stars": "5 stars"
        },
        {
            "comment": "Handset is v. good , but Battery life is not so good ,On net its maximum 12 hours .Some time at time of playing games and other apps It have hanging problem . I purchased it on 13,000 but after 2 days flipkar change rate .and It I have lose of 2,000 Phone look is v.v nice .. I am happy my purchase",
            "date": "08 Jul 2015",
            "name": "Gautam Rana",
            "stars": "4 stars"
        },
        {
            "comment": "The Moto g2 has been good mobile for only two months. its screen is not stable flickers a lot and become useless now. I do't recommend this cheap quality phone. (cheap things come cheap)",
            "date": "08 Jul 2015",
            "name": "Raj",
            "stars": "2 stars"
        },
        {
            "comment": "moto g 2nd gen. awesome phone",
            "date": "08 Jul 2015",
            "name": "Harshit Vijay",
            "stars": "5 stars"
        },
        {
            "comment": "I really feeling disapointed to buy Moto G phone,calls was not working I was called to any one first time they lift the call but my voice was not heard to them and second time i called again its works normmly I lost lot of money this way and after charge the mobile are any games play in mobile call was not going to any one for few minutes mints call option was not touched and I never recommend it",
            "date": "07 Jul 2015",
            "name": "FASIL MN",
            "stars": "1 star"
        },
        {
            "comment": "moto g is one of the best cell phone which i used till now . when some want to by a smart phone under the budget then its a good option . all the feature of phone is dam good",
            "date": "07 Jul 2015",
            "name": "pkt",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone, and on time delivery by Flipkart.Good for those who want latest google updates. But Lenovo k3 note have better specs than this.",
            "date": "07 Jul 2015",
            "name": "Gaurav",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is just awesome... totally awesome. Firstly I would like say that those of you who are planning to buy this phone, dont go by others customers reveiw.. I was doing the same mistake and very apprehensive but finnally I bought this phone and its just worth the money....Smashing features, great quality of camera pics n many more.... Overall its rocking phone within 10000 budget",
            "date": "07 Jul 2015",
            "name": "Kajal Verma",
            "stars": "4 stars"
        },
        {
            "comment": "This product was beautiful and attracting finishing. And this body was powerful and the switch on the mobile was very beautiful graphics.Thank u",
            "date": "07 Jul 2015",
            "name": "SANDEEP NAMBIAR",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this phone about few months back. Battery is very bad - It can lost only 1-2 hrs with continuous operations Performance is also not good - Very bad with browsing internet Having phone hanging issue also now - I cant hear other talking and some time it hangs when trying to call",
            "date": "07 Jul 2015",
            "name": "Shivakumar ven...",
            "stars": "1 star"
        },
        {
            "comment": "Battery dies down in few hours and very poor backup when GPS is ON... Disappointed with the product..",
            "date": "07 Jul 2015",
            "name": "Adit Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "Hi I bought this phone 2 months back and suddenly it has gone blank. For a while i could load the lock screen but on unlocking it went blank, now after factory reset it is completely blank!",
            "date": "07 Jul 2015",
            "name": "Smriti Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "Worst battery backup.. please don't go for it.. Camera quality is better but front camera is not upto the mark...",
            "date": "07 Jul 2015",
            "name": "Pradyoth Mantri",
            "stars": "2 stars"
        },
        {
            "comment": "purchase on march month. delivery very fast. user for 2 months : performance very good but don't buy this phone. spoiled due to rain water. submitted to authorized service center in , karnataka denied to repair because liquid damage. suggested to replace parts worth rupees 7000/- only. for Rs.11,000 paid for hand set. not good hardware. which wil not withstand for monsoon rain",
            "date": "07 Jul 2015",
            "name": "Sudhir",
            "stars": "3 stars"
        },
        {
            "comment": "1. Battery is draining very fast. Hardly getting for around 10 hrs only. 2. Getting burning smell some times while playing you tube videos. (Not all times.) 3, Some times it become very slow. I am really disappointed with this mobile for these issues.",
            "date": "07 Jul 2015",
            "name": "Satheesh Galla",
            "stars": "2 stars"
        },
        {
            "comment": "The mobile battery is very poor backup and in standby mode it works only 4 hours maximum. Company should check once before market sell",
            "date": "07 Jul 2015",
            "name": "goel",
            "stars": "2 stars"
        },
        {
            "comment": "my phone's gorilla glass broke after falling from 3 feet. upon calling flipkart I got to know, it is just scratch proof. I'm not sure whether I got fake product because i got it in exchange offer or a repaired one with cheap quality gorilla glass please beware of such terms and conditions. planning to throw it off and go for branded phones.",
            "date": "07 Jul 2015",
            "name": "smarika sharma",
            "stars": "1 star"
        },
        {
            "comment": "Love this product. I've been using one since last October... No issues Yet...!! Motorola is the Best..",
            "date": "07 Jul 2015",
            "name": "Sangeet Kochar",
            "stars": "5 stars"
        },
        {
            "comment": "good product. the animation and user interface visual appearance is not that appealing. But good value for money product..",
            "date": "07 Jul 2015",
            "name": "Pravish Ponnappan",
            "stars": "4 stars"
        },
        {
            "comment": "I guess Flipkart along Moto are Screwing the Customers... over all the Mobiles good... But the Batter back up Is Pathetic i feel... 3G on for Few hours and Browsing it will screw up the Complete battery... I have Requested Flipkart for Return and Replace with New mobile.. and the Customer care so called Technical Team tell me that if you switch on 3G and Use mobile the Battery will Get Drained very quickly... Really!!!! IT's Pathetic from Flipkart i had Requested Return thrice and all the three times it was rejected... I feel Flipkart is Cheating customers this way... saying that some Problem with products bought from us we will replace... but that does'nt happen at all... For the worst ever Battery and Flipkart's worst Return Policy i rate this mobile with 1 star.....",
            "date": "07 Jul 2015",
            "name": "aswani ram kumar",
            "stars": "1 star"
        },
        {
            "comment": "Hello Everybody, I brought Moto G 2nd generation before 6 month, so after using six month I am really satisfied with this product. firstly I am thanking flipkart for delivering this product safely and perfectly to me. so after using it for six months I am writing this review firstly the build quality is very good but not awesome good because it looks like a costly premium device while holding it in your hand and not so good because it gets oily sweaty by holding it in your hand for long time. thee the display is just awesome its cool and all the colours are perfectly mixed and viewable. Then the camera is awesome in outdoor lightning but it is good in indoor lightning pictures get blury in low lightning condition. then about software, software is working awesome it works perfectly but it does not support the state level languages like gujarati, Marathi,etc. though it has 1 GB of Ram but it works lag free because of the vanilla android installed in it. I has tested it with a very high end games like Asphalt 8, GTA 3, Modern Combat 5. etc. and the great thing is that it Supports OTG so with this functionality you can able to use a pendrive , keyboard, mouse (all things tested) anywhere and u can use this functionality to charge others phone like a power bank (also tested)... so all over this us the awesome device... I will recommend to buy this... and thank you for watching my review...",
            "date": "07 Jul 2015",
            "name": "Dhruv Viroja",
            "stars": "5 stars"
        },
        {
            "comment": "A good device except for the battery performance . Worth for the money . Would recommend to people looking for good front camera quality .",
            "date": "07 Jul 2015",
            "name": "Jo Zach",
            "stars": "4 stars"
        },
        {
            "comment": "The performance is not as expected. It hangs quite often while playing games. When compared to the price it is the best option in this price range and I would recommend to buy this.",
            "date": "07 Jul 2015",
            "name": "Bindyachal",
            "stars": "3 stars"
        },
        {
            "comment": "i have taken moto g2 on 24 june, which is my fourth handset in motos, previous three handsets are too good, but this one is too worst.. for my surprose the handset getting heated up when i keep in my pocket and moreover the battery getting drained within 2 hours of its full charge,,,,..............",
            "date": "07 Jul 2015",
            "name": "g giridhar",
            "stars": "1 star"
        },
        {
            "comment": "very good phone with this price range. if anyone is planning to purchase go for it. ..................................",
            "date": "07 Jul 2015",
            "name": "taslim arif",
            "stars": "4 stars"
        },
        {
            "comment": "Last month I have purchased it from Flipkart. Really wonderful mobile withe excellent performance. As usual Flipkart delivered it one day early.",
            "date": "07 Jul 2015",
            "name": "shaik mohd sharief",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this mobile for 3 months. Initially it was good. Nowadays it is slower as it is 1 Gb RAM. U need little patience after tapping on particular apps. And many apps crashes often:( So think twice b4r spending bucks on this",
            "date": "07 Jul 2015",
            "name": "Naveen Venkatesan",
            "stars": "2 stars"
        },
        {
            "comment": "i m using phone from last 1 month till now no issues good performance.good battery life. camerra also nice one.",
            "date": "07 Jul 2015",
            "name": "Ananda Hajare",
            "stars": "4 stars"
        },
        {
            "comment": "i bought moto G2 in the month of march with two months data free offer my mobile battery draining out very faster, upon advice of flipkart executive i installed smart check the examined for 3 days they observed the same. But there was no solution second time i repeated the same complain they said to install the smart check... this time they didn't called back.. I placed a request for returning back the product, Flipkart have rejected the offer now they are saying to visit Moto service center. worst kind of costumer care i have ever seen",
            "date": "07 Jul 2015",
            "name": "Hari Prasad P",
            "stars": "1 star"
        },
        {
            "comment": "Very poor battery backup and very bad service even though it is not fix in refund policy. Suggest flipkart to don't cheat peoples...",
            "date": "07 Jul 2015",
            "name": "Nilesh Aasare",
            "stars": "1 star"
        },
        {
            "comment": "Bought 2 for my younger siblings My brother complained that within few days of the purchase, the battery abruptly showed Zero charge then went up to 80% abruptly once plugged in. Then worked as normal",
            "date": "07 Jul 2015",
            "name": "Zubair",
            "stars": "4 stars"
        },
        {
            "comment": "Service is very poor. Screen damage as charge for replacement is too much. Better we can choose another phone.",
            "date": "07 Jul 2015",
            "name": "Rajeev Jha",
            "stars": "3 stars"
        },
        {
            "comment": "it works good, camera and other futures working smoothly, after i got the immediately i have updated my phone to loly pop version,,,,,,,,,,,,,its amazing.......",
            "date": "07 Jul 2015",
            "name": "mani kannan",
            "stars": "4 stars"
        },
        {
            "comment": "Heating problem is there if you use mobile internet. If you install more apps/games etc you will experience hanging problem, for less apps there is no such problem.",
            "date": "07 Jul 2015",
            "name": "Sravan Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "I ordered Moto G2 and received it within 4 working days in Noida, UP. Phone is really good. hardware is better in comparison to other phones. Durable Camera is of good quality (both). The most imp thing in a phone is that it should last at least a year and half when I am spending 10K, and it appears that this one would definitely last that long. So far so good. I also believe more in Motorola than Xiomi, Gionee, Lava, Intex and low range Samsung phones!",
            "date": "07 Jul 2015",
            "name": "Ankur Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "Hello Friends, Its getting heat when we talk even for 10 min ... i am getting irritation because of this.. battery backup is ok for one day.. i think they are clearing the stock with all return or old phones......",
            "date": "06 Jul 2015",
            "name": "Ashok K",
            "stars": "1 star"
        },
        {
            "comment": "the 2Gen is great. Have used the first gen but this is just great. Not just it terms of specs, but performs as Motorola claims. The screen is crisp and the form factor of the phone is very good. Anyone looking for a budget phone, just go for the Moto G2.",
            "date": "06 Jul 2015",
            "name": "Rhishav Phukan",
            "stars": "5 stars"
        },
        {
            "comment": "Maybe with the lollipop upgrade moto G 2nd gen has lost it. The applications crash often,hangs or freezes a lot. Very average performance for the kind of hardware on board.. Battery is average as well,5-8 hours on continuous usage is very less. Hopefully upgrades will improve the interface. Camera is a high point. its worth only if the price reduces further. Buyers can go for asus zenfone 2 which is a better prospect.",
            "date": "06 Jul 2015",
            "name": "Ganesh R",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone 4 month back and this mobile is good. yaa it will hang when we install some high configured game even if we install subway surf, temple run it will hang for first time but after that it will work fine. when I bought this phone that time I was worried but now I like this. and I also like flipkart service.",
            "date": "06 Jul 2015",
            "name": "Rahul kalsariya",
            "stars": "4 stars"
        },
        {
            "comment": "I had purchased this phone and in 2 weeks time the phone went dead. Flipkart was kind to give me a new one, which is working fine. I went to the MOTOROLA service center at Rajajinagar, Bangalore. The experience is dissapointing. New buyers keep in mind, the customer service is expensive. A cracked screen cost you 7k which is 60% of the purchase value. Think before you wanna own this piece of item Phone is worth the bill . Motorola customer service is a complete let down.",
            "date": "06 Jul 2015",
            "name": "Sony Thomas",
            "stars": "3 stars"
        },
        {
            "comment": "Facing heating issue from day 1. device goes above 45 degree Celsius then upper part of screen stop working. Battery is taking too much time to charge 100%. Android lollipop is not user friendly. I have seen no. of people in Service Center who are facing problem within a month. For me this product is not worth. If you are lucky then you will get the device without defect.",
            "date": "06 Jul 2015",
            "name": "Rohit Natekar",
            "stars": "1 star"
        },
        {
            "comment": "This is not a review about the phone..!! Its about their service!! I have placed the moto g 2gen on 17th may 2015, and cancelled it and placed another order. But after cancelling the money which i payed through the credit card is not yet refunded till date. Even after sending a lot of emails, nothing happened . Frustrated customer!!",
            "date": "06 Jul 2015",
            "name": "Siva",
            "stars": "1 star"
        },
        {
            "comment": "This phone is wonderful and great value for money. It offers all the features of major phones in bugdet price range. Go for it.",
            "date": "06 Jul 2015",
            "name": "Navneet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone and nice performance, camera quality also sup but battery backup if using only for call mean's it ll stand by 1 and half day or using fully gprs mean one day stand by other wise sup ...",
            "date": "06 Jul 2015",
            "name": "Prasanna Raj",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this phone on Jun 07 and it showed expected delivery on Jun 20. But didnt received the item. I tracked the courier and it said not able to reach the place so cancelling the order. I raised request with Flipkart and got a response. Dear Customer, We are continuing to look into your issue on priority. We reassure you that we will resolve your problem by 27 Jun, 7:00 PM. Thanks, Flipkart Customer Support Till now Refund has not been initiated. :( I checked Order status now.,It says Refund (Return ID: 2252***) - CANCELLED Not sure when I will receive the refund. :(",
            "date": "06 Jul 2015",
            "name": "Krishnakumar",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone for mid range price. My old phone broke and bought this new one. Delivered very next day. Great phone to use. ALL features are perfect and its faster than high configuration phones. Really better than samsung phones.",
            "date": "06 Jul 2015",
            "name": "Gerard Arockiaraj",
            "stars": "4 stars"
        },
        {
            "comment": "i hate moto g after using dis brand. n really upset frm flip cart services. i dont wanna give nstar. i just wanna 0",
            "date": "06 Jul 2015",
            "name": "mosam rani",
            "stars": "1 star"
        },
        {
            "comment": "The Product which has been delivered to me has an Mrp of Rs.9999 & you are showing us Rs.10999 & you have taken my Black berry phone for Exchange of Rs 2000 the it an loss for me . This Retailer is a cheater don't bye anything from him & you are showing the Price as Rs 10999. kindly check with the retailer. Fooling the customer.",
            "date": "06 Jul 2015",
            "name": "Sumit",
            "stars": "1 star"
        },
        {
            "comment": "No complaints regarding Moto! it's great in every aspect. Go for it if you are looking for a reliable phone in the 10k range.",
            "date": "06 Jul 2015",
            "name": "Sailesh Hota",
            "stars": "5 stars"
        },
        {
            "comment": "first of all i would like to convey issues with the mobile -whenever i'm making a call no ring tone is coming.no voice clarity while talking over phone. -Most of the times screen touch is not functioning. -poor battery. -it is unable to catch good network like samsung.",
            "date": "06 Jul 2015",
            "name": "Venkata ramana...",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone for 5 months now and to sum it up in one word, unreliable . Upgraded to Lollipop (OTA) which slowed down the performance considerably. The phone will just die anytime, randomly, and will not boot up unless you charge it for 15-20 mins. and If you are outside and cannot charge the phone, you're out of luck !! Phone has some nagging issue/glitches , some processes which stops to respond every now and then, usually some google process ,hence it requires factory reset at least once in a month . Heats up while playing games like FIFA, Asphalt etc .Works OK with games like swordigo , shadow fight etc. To summarize , I would definitely NOT recommend this phone to friend and family.",
            "date": "06 Jul 2015",
            "name": "nikhil nimbhal",
            "stars": "2 stars"
        },
        {
            "comment": "This review is about the user experience after receiving a faulty device. With all excitement I bought this phone MOTO G 2nd GEN and I am not satisfied with the phone. Here are the reasons I did face an Issue with Battery, So requested a replacement. Flipkart People told me that they will replace my mobile with new Handset, But they sent me the Same Mobile. The battery drains like anything. It drained in less than 3hrs. It is Getting Reduced to 40% in half an hour. The battery draining very fast and has to be recharged every few hours even if the phone is not in use and all applications are closed. No apps installed. The OS itself is drawing heavily from battery. Sometimes phone rings but doesn't let to answer call. If you get more calls then, its has to be always kept plugged in. Ear phones are very poor quality. I will suggest you to please don't go with this particular Mobile MOTO G 2nd GEN.",
            "date": "06 Jul 2015",
            "name": "Yathisha",
            "stars": "2 stars"
        },
        {
            "comment": "Hello All buyers!! Please read my story carefully before buying expensive products from Flipkart online sale. In the name of online bumper sale/discount Flipkart sales defective product as brand new products with warranty. In this business model flipkart is hand in glove with seller. For example, take my case. I bought a moto G2 on 22 June, 2015. The phone delivered on 24th. I discovered on the same day that bluetooth is not working. We, customer, expect after spending thousands of Rs for a product is to enjoy the product with all features meeting to the specifications mentioned by the Seller (Motorola in this case). If this is not happening it is defective product by basic definition. For my case, Flipkart first committed me that \"they will arrange a tech visit and then Flipkart will decide whether to replace or not\". Surprising right? Anyway, in my case, the technician, on his visit, discovered that MAC ID was not set on my phone. Just imagine!!. He did something on my phone and convinced my wife at home, when I was away at office, that all is well, took her signature and submitted all is fine. When I came back home, I discovered the same problem and raised the issue with Flipkart again. Then Flipkart said go to nearest Service centre. Now, I think I understood Flipkart Online bumper Sale model. Sale defective product at cheaper rate, enjoy the profit and let the customer run after service centre to correct it. But, Flipkart, do remember that not all customers take it lying down. I have all the documents in my favors. We will meet in the court in the coming days.",
            "date": "06 Jul 2015",
            "name": "sajal mandal",
            "stars": "1 star"
        },
        {
            "comment": "Overall phone is good Decent battery backup, nice feel when in hand. Performance is good and doesnt show any lag. Camera is good, clarity is also good.No heating. Ear phones are pathetic, cheap. Phone is costly as compared to other phones. Only buy if you have any particular reason for this phone(for me it was my sis as she really liked the design, so i had to buy for her).There are plenty of other handsets which are far better than this in every aspect.",
            "date": "06 Jul 2015",
            "name": "ADITYA BUGALIA",
            "stars": "3 stars"
        },
        {
            "comment": "Over al its a value for money product but at the end of the time its not that great as compared to the prdoduct available in the same price range.",
            "date": "06 Jul 2015",
            "name": "rkr vivek",
            "stars": "3 stars"
        },
        {
            "comment": "I have to say it was a very bad experience for me with this mobile. Didn't last even 6 months. When went to Service center, I am getting told that mobile has a liquid damage. The small litmus paper inside the mobile turns red is the indication of liquid damage as per company(Not sure how it happened since mobile was never exposed to water). I will say mobile is very much susceptible to liquid damage which is not repaired by Motorola. Mother board for the mobile is completely damaged which costs around 8000 to 9000 Rs. hence no point in replacing the new motherboard for the mobile. Mobile started flickering after the 4 months from started and in the sixth month it stopped working. Definitely won't recommend this phone to any of my friend, relative or colleague of mine. 1 star for this mobile.",
            "date": "06 Jul 2015",
            "name": "Sagar Shedge",
            "stars": "1 star"
        },
        {
            "comment": "Its good phone but some of negative points are there 1. when you take photo or video outdoor (heavy sunlight) then the phone getting heat high and hanging. 2. dual sim dial pad not provided and message apps also not friendly like samsung or other phone. 3. 3G connecting issue is there after lollipop installation and im using a apps to select 3G.",
            "date": "05 Jul 2015",
            "name": "Agathees",
            "stars": "4 stars"
        },
        {
            "comment": "good decent camera useful. no bloatware. fast.bought it for my father in law .who is extremely satisfied with it",
            "date": "05 Jul 2015",
            "name": "kaushik chakra...",
            "stars": "5 stars"
        },
        {
            "comment": "sr i purchase the moto G(2nd Generation) mobile through flipkart online services the phone cost mrp is Rs 99,999 but paid to you 10,999 Rs through cash on delivery it is tooo cost",
            "date": "05 Jul 2015",
            "name": "keshetty Anjaneyulu",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased moto g 2 before 20 days it giving me internet issue i used 3 different sim in this phone but i am getting this problem again and again many times it give 3g speed many time 2g and lots of time internet never work when i complained to replacement then they rejected the request..... if you thinking they will replace then don't think that",
            "date": "05 Jul 2015",
            "name": "Pramod vaid",
            "stars": "1 star"
        },
        {
            "comment": "MOTO G 2ND IS THE BEST PHONE BUT FLIP KART'S DELIVERY PROCESS IS VERY POOR. I DONT LIKE THIS. CUSTOMER PROBLEMS ARE NOT CLOSED BY CRE.",
            "date": "05 Jul 2015",
            "name": "NILANCHAL MUNI",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone option for under 15k. Runs clean, near stock android with no lag, and receives latest software updates just after the nexus devices. I would recommend this to anyone looking for a mobile phone with a sub 20k budget",
            "date": "05 Jul 2015",
            "name": "Dhruvesh Kanakia",
            "stars": "5 stars"
        },
        {
            "comment": "There are many good phones in the market than this one at the particular 11k price range........dont go for this....battery not even lasts for a day and it hangs a lot....go for lenovo A6000plus or lenovo K3 note......which are far better than this phone and at less price than the moto g2....... Thinking to return the moto g2.......overall.....not a good value for money phone",
            "date": "05 Jul 2015",
            "name": "sandesh amman",
            "stars": "3 stars"
        },
        {
            "comment": "My second android phone and the better one. Recorded video and captured snaps looks awesome. Nice performance and good battery back up. Above nice experience with flipkart and the seller. Awesome.",
            "date": "05 Jul 2015",
            "name": "Rama Krishna Hati",
            "stars": "5 stars"
        },
        {
            "comment": "Fantastic mobile , everything is Good i am happy with Moto & Flipkart............................................................",
            "date": "05 Jul 2015",
            "name": "Amit Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Go for it. UI is superb. Brightness is too good even if we set the brightness level low. Games are also running fine. I am not having hanging issue. But the limitation is high graphics games will make the mobile to perform low, but i hope with this price Motorolla has given a superbly fine product.",
            "date": "05 Jul 2015",
            "name": "Shankar Panda",
            "stars": "5 stars"
        },
        {
            "comment": "Getting slow day by day :( bad choice.. Heating problem. U need to restart mobile verry frequently. cant play song for long time it will be hang and battery getting drained in 4-5 hrs some time",
            "date": "05 Jul 2015",
            "name": "Ankit Modi",
            "stars": "2 stars"
        },
        {
            "comment": "Moto g2 doesnt need words to explain its qualityor anything. Excellent phone Superb performance. Thanks to flipkart",
            "date": "05 Jul 2015",
            "name": "Ravindra Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "This stuff is so damn cool... I m totally satisfied with the product... Best phone under 11K !!! Strongly Recommended !!! Just go for it !!!",
            "date": "05 Jul 2015",
            "name": "Anita Tikariha",
            "stars": "5 stars"
        },
        {
            "comment": "Over heating and short battery life all most 4 to 5 hours. Already using 3 similar hand-sets in my family but this time it was quite diss-appointing, Software and applications are working smooth . But axes of over heating of product is reducing the life of battery. The battery depletes very fast and has to be recharged every few hours even if the phone is not in use and all applications are closed. Its so hot as it can be used for iron a cloth ......",
            "date": "05 Jul 2015",
            "name": "Ankit Khanna",
            "stars": "2 stars"
        },
        {
            "comment": "awesome phone !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "04 Jul 2015",
            "name": "29786",
            "stars": "5 stars"
        },
        {
            "comment": "With in three months battery will over heat while inserting for the charging the color display will changed",
            "date": "04 Jul 2015",
            "name": "Revathy Senthil K...",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Buy . satisfied with the product. Only the speakers and sound quality could have been made better.Hope the inbuilt battery lasts long ( at least 3 years)",
            "date": "04 Jul 2015",
            "name": "AMIT KUMAR",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 is such a very good model. it is very handy & very easy to use Smart phone. Camera quality is very good & all fetures is very nice. I m happy to use it.",
            "date": "04 Jul 2015",
            "name": "yuvraj shinde",
            "stars": "1 star"
        },
        {
            "comment": "Even fully charged fine shows 0% battery. It shows exact battery level after mobile is switched of and started again. it drains very fast while browsing and watching videos.",
            "date": "04 Jul 2015",
            "name": "rahul",
            "stars": "1 star"
        },
        {
            "comment": "I bought Moto G 2nd Gen XT1068 Smartphone which was shown 10999/- online in the flipkart but the actual MRP is 9,999/- on the box of that product.",
            "date": "04 Jul 2015",
            "name": "Prashanth",
            "stars": "1 star"
        },
        {
            "comment": "I'm writing this review after personally using Samsung Galaxy Grand, Sony Xperia C, and the iPad. My intent behind buying this phone was just to have a decent phone capable of performing regular functions nicely, and with ease. I didn't want any extra-ordinarily spec'd phone, which might have heating issues, poor battery life, and low call quality, etc. So, I decided to settle for this. And, to my surprise, I'm not let down by my decision of buying the Moto G2. On papers, the specs might not seem to fancy when compared with similarly priced phones from other brands but, this phone is a GEM IN HANDS. Here's what I have to say: First and foremost, the look and feel of this device (obviously without any sort of protection) is amazing, and it feels great to hold this device in hand. Secondly, the User Interface is simple and elegant, with no nonsensical customizations from the manufacturer. Thirdly, The sound quality, call quality, touch and everything else is simply amazing. Also, the phone has a lot of RAM to spare despite having too many apps installed and running in the background. So, not a concern at all. The only point where it lacks slightly is the battery backup, which could have been better. But, considering the performance of today's phones, I'll definitely say that it's at par, or only better.",
            "date": "04 Jul 2015",
            "name": "Shubham Mittal",
            "stars": "4 stars"
        },
        {
            "comment": "There is some lag in opening and closing the apps. The phone that i recieved has a problem with the speaker, so i have logged a return for this but not sure whether they will replace it or not. The play store is crashing while updating the applications. Some times the display gets blank. A very bad experience. Another issue i found with this order. Flipkart charged me 10999 for this phone but the box of the phone states 9999. I have sent an email to flipkart support team regarding this, not sure what action will they take. Very much disappointed with flipkart.",
            "date": "04 Jul 2015",
            "name": "Karan Kapoor",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2nd Gen is really a good phone with comparatively less costly. Camera clarity is impressive. Phone does not hang. People looking for Small and handy Mobile can go for this product. Only one drawback: Battery Charger given by Motorola is not good, does not fix to socket properly, I tried all types of sockets but it dose not fix properly.",
            "date": "04 Jul 2015",
            "name": "Shrikant Shitole",
            "stars": "5 stars"
        },
        {
            "comment": "I have recently purchase this product,2-3 days its worked fine. but after that I am not able to here voice during the call, every time I need to restart my phone then its start working fine for next 2-3 calls. I have registered complain for return and I got call from seller, He has checked device with smart check and he updated me to update latest software. I did same from service center. but still I am facing same problem. So I think sellers are selling defective stock which was return in past by other customers.",
            "date": "04 Jul 2015",
            "name": "Chandrakant Ka...",
            "stars": "1 star"
        },
        {
            "comment": "Undoubted the best buy in the market now..Unmatched quality and price with loads of feature . Additional discount at Flipkart makes the purchase merrier.",
            "date": "04 Jul 2015",
            "name": "Sambit Panda",
            "stars": "5 stars"
        }
    ]
}
