{
    "filpkart": [
        {
            "comment": "I am excited with fast service i ordered on 14th of march 2015 @ 10:40 am i received mobile on 16th of march @9:am only what a service of FLIPKART fast service... I surely tell that the handset is awesome the camera quality is superb, music quality also very good,its very easy to work with 5.0.0 upgraded software we can easily operate by single hand with 5\" screen... the menu and background theme also very descent..... we can easily watch hd movies with 2 front speakers... today i am going buy another mobile FLIPKART U r awesome.....",
            "date": "17 Mar 2015",
            "name": "Ram Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "good performance,good battery backup I like this mobile------------------------------------------------------------------------------------------------------------------------",
            "date": "17 Mar 2015",
            "name": "FIROJ SHIKALGAR",
            "stars": "5 stars"
        },
        {
            "comment": "Sometimes i faced network drop in moto g 2, whereas my Sony Xperia could get me clear network. Call application hangs often. Not suitable for emergency. :(",
            "date": "17 Mar 2015",
            "name": "Satheesh Kumar S",
            "stars": "3 stars"
        },
        {
            "comment": "This is a tested model in the market already & yes its blockbuster...I have nothing to add more. I purchased it to gift it to someone close. Yes its a super HIT",
            "date": "17 Mar 2015",
            "name": "Suman Pal",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen) is not a good phone, this phone releases more radiation when compared to any other moto series phones.",
            "date": "17 Mar 2015",
            "name": "Venkat D",
            "stars": "1 star"
        },
        {
            "comment": "battery backup too low .But charge the battery he take 3 to 4 hrs over all moto g experience is good",
            "date": "17 Mar 2015",
            "name": "Hemant Mohite",
            "stars": "1 star"
        },
        {
            "comment": "I had purchased it last november and am using from that time but it seems something wrong witth it because it became warmer while charging and also hang up some times on using multiple application some times.",
            "date": "17 Mar 2015",
            "name": "Anurag Dubey",
            "stars": "2 stars"
        },
        {
            "comment": "Good phone,but there is some basic problem which need to update 1. As Micro Sim,need to Cut your original sim,then its difficult to put back your sim and have a fear for demage your port also. 2. Also required Removal battary in case of demage. 3.Not have a proper cover for safety. 4. Need any insurance plan associated with it. Instead of this phone is good,best processor,WiFi clears show if any problem in Network,disappointed with Lollipop view is not good as 4.4. version . As now I am new user so I could not use this phone more....",
            "date": "16 Mar 2015",
            "name": "Rakesh Tiwari",
            "stars": "4 stars"
        },
        {
            "comment": "Got the phone 2 days back and already asked for a replacement. Phone is good, maybe got a defective piece. 90% of the time not able to answer calls as the person calling gets the message \"cannot be reached at the moment, currently out of coverage area..\" Am using the same provider and I am with the person who I gifted the phone to. Poor battery. Poor Speakers. Waiting for the replacement.",
            "date": "16 Mar 2015",
            "name": "Maxwell Grenville",
            "stars": "1 star"
        },
        {
            "comment": "I'm a big fan of Motorola and using Motorola phones since 8 years. I currently own a Motorola droid maxx and order this phone for my brother but mostly i use this phone and I'm using this phone since 3 months and the experience is amazing. The phone also gets android lollipop update which is amazing.build quality is awesome as always and moto is known for their build quality. Camera is fantastic and sound output by the speaker is great.overall I'm total satisfied with the phones.",
            "date": "16 Mar 2015",
            "name": "kuldeep choudhary",
            "stars": "5 stars"
        },
        {
            "comment": "Upgraded my Moto G 2nd gen to lollipop ... it turned out to be a disaster ...many applications stopped working .. battery drains without doing anything ..after upgrade , i can feel considerable lags while operating the mobile ... i'm going to throw this off in a bin and never ever go for android upgrade ...",
            "date": "16 Mar 2015",
            "name": "AK",
            "stars": "1 star"
        },
        {
            "comment": "Mobile is very good when compared to Moto E. This mobile is excellent and Latest mobiles in Motorola is very good. Pls do need service as soon as possible",
            "date": "16 Mar 2015",
            "name": "Venkatesh Bandaru",
            "stars": "4 stars"
        },
        {
            "comment": "Buy this smartphone willingly and then countdown will start after a few months of its use as you use its features one by one according to your requirement. The smartphone software is completely lacking efficient and proper working of phone. Beware ! I am writing the review after using it for few months. Such an annoying phone. Lost my money completely. Only 2 star i'm giving for its hardware.",
            "date": "16 Mar 2015",
            "name": "Vidhan Tiwari",
            "stars": "2 stars"
        },
        {
            "comment": "very Good product value for money, better performance no complaints, display, net connectivity and screen resolution and all futures are good.",
            "date": "16 Mar 2015",
            "name": "achari anupoju",
            "stars": "5 stars"
        },
        {
            "comment": "phone is very slow waste smart phone and waste service and waste money...................................",
            "date": "16 Mar 2015",
            "name": "Praveen Kumar",
            "stars": "1 star"
        },
        {
            "comment": "The phone is pretty good, especially with the awesome specs at a decent price. Battery life is pretty good too( I haven't used my phone for gaming ). The camera is awesome with great picture quality. It is pretty sturdy too, and the guerilla glass does justice to it's name. If you require an above average phone at a reasonable price, then buy this phone",
            "date": "16 Mar 2015",
            "name": "Avi Marathe",
            "stars": "5 stars"
        },
        {
            "comment": "Best Mobile...It's WORTH the money. No lags. High data rate. Superb quality... very good product.... Thank you Flipkart..",
            "date": "16 Mar 2015",
            "name": "Ram Manohar",
            "stars": "5 stars"
        },
        {
            "comment": "Using after 6 months or more .... I have not faced any issues at all. Not going into specs and all since you get what you pay for ! Works for light usage , battery stays for a day with 3G on and light usage. Dont just expect to play very high graphic intensive games , this is a general mobile for general people , not geeks !!",
            "date": "16 Mar 2015",
            "name": "Dwaipayan Bhat...",
            "stars": "4 stars"
        },
        {
            "comment": "I was excited on receiving the Motorola much awaited MOTO G2, and was pleased with the use of the product. However After six months of use I was let down and was much disappointed as the phone refused to charge and my heart was melting as I saw the battery go dead. I have lost all my precious data and photos. Much disappointed I read that this is a common problem with the product and all the advised solutions did not help me with my phone.",
            "date": "16 Mar 2015",
            "name": "Sharon Gomes",
            "stars": "2 stars"
        },
        {
            "comment": "i bought it in dec. 2014 for 11750 so its quite good for me. you all know features and specs. so if available around 10K it would be awesome deal.",
            "date": "16 Mar 2015",
            "name": "piyush tiwari",
            "stars": "4 stars"
        },
        {
            "comment": "I had gifted this mobile for my wife, she is very happy by using this mobile. Nice design, good battery backup",
            "date": "16 Mar 2015",
            "name": "Krissri",
            "stars": "4 stars"
        },
        {
            "comment": "Best Mobile...It's WORTH the money. No lags. High data rate. Superb quality... very good product.... Thank you Flipkart..",
            "date": "16 Mar 2015",
            "name": "Pramod R Nadig",
            "stars": "5 stars"
        },
        {
            "comment": "its a good product .......nd now its coming with d lolipop update..... battery backup improved with d update ....love it ..",
            "date": "16 Mar 2015",
            "name": "Kumar Atul Yad...",
            "stars": "4 stars"
        },
        {
            "comment": "Good overall performance but very bad battery backup...After charging for almost 4-5 hours the battery drains very quickly...!!! The new Lenovo A6000 is a much better option than this phone. Giving features does not make sense if the battery backup is that bad. Would definitely not recommend this to a friend of mine. MOTO seriously needs to work on the battery drain issue... Flipkart should know this is hurting their customers...and their hard earned money too.",
            "date": "16 Mar 2015",
            "name": "Pradip Singh",
            "stars": "3 stars"
        },
        {
            "comment": "Nice phone in this range!! M waiting for next gen. of this series with updates!! Some of friends also got lolipop update.",
            "date": "16 Mar 2015",
            "name": "sandeep jinagal",
            "stars": "5 stars"
        },
        {
            "comment": "It's WORTH the money. No lags. High data rate. Superb quality and rendering of graphics. All in all 4.5*",
            "date": "16 Mar 2015",
            "name": "Ankit Chand",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone and not at all satisfied with its features and performance 1. You cannot set ringtone other than default. It picks up mp3 songs from your memory card however when you choose same to be ringtone it does not work. I tried multiple ways like copying into ringtones etc none worked. 2. It hung few times 3. I got replaced product which was worse than original. I even doubt if it was new. It had multiple issue with hanging, abrupt behavior like mixing menus and home screen images etc. I finally returned and waiting for refund.",
            "date": "16 Mar 2015",
            "name": "Girish Bapat",
            "stars": "2 stars"
        },
        {
            "comment": "good phone have fast processor nice picture quality. Screen touch is very sensitive very slim look stylish, best camera, fantastic speaker but sound quality in head phone is not up to the mark.",
            "date": "16 Mar 2015",
            "name": "AKSAHY KADU",
            "stars": "5 stars"
        },
        {
            "comment": "really nice product and worth for money and good performance the extra ordinary camera it has pls go for it",
            "date": "16 Mar 2015",
            "name": "Nidhin",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone in this range. Best part is its optimized to work smooth. Battery back is awesome. The interface nver lags and makes it so smooth as if we are using iphone.",
            "date": "16 Mar 2015",
            "name": "Sudhir Choudhary",
            "stars": "5 stars"
        },
        {
            "comment": "Horrible service network. Took more than 1 month to service the phone under warranty. had to buy another phone due to this poor service facility. Will not recommend Motorola to any one. Giri",
            "date": "16 Mar 2015",
            "name": "Giri v",
            "stars": "1 star"
        },
        {
            "comment": "I have been using this phone since some time now. Very good camera and good sound due to front speakers. Performance is very good. Got 4.4.4 android when it came and now got a free upgrade to android 5 lollipop. New OS is better and very smooth. Internal 16GB memory works for me. I have put additional 16 GB MicroSD. Dual sim good but not dual active standby. Only one SIM active at a time. Phone is robust and can work with multiple applications without crashing.",
            "date": "16 Mar 2015",
            "name": "Saumil Purani",
            "stars": "4 stars"
        },
        {
            "comment": "I got Moto G2 2 days ago, however, I notice that charging phone takes around 5hrs. Is it normal. I guess it should be around 3hrs. Please advise what is normal charging time ? Rest the phone is awesome.!!!",
            "date": "16 Mar 2015",
            "name": "Shriram Salunke",
            "stars": "4 stars"
        },
        {
            "comment": "I got moto g2 on 2nd march and after 10-12 days only I got below defects : 1. a big one is some time battery % is not showing correctly like if it got 100 % charged but even after 3-5 hours battery % shows 100 that can not be correct. and after restart it drains drastically. 2. some times while starting app, half of the screen shows black and it comes to normal if I minimize and maximize it once again. 3. some times light does not get on for incoming call. 4. Call quality is not so good, sound volume fluctuates during call. All these defects and not constant but it happens occasionally for now not sure about future. I will be going to replace and hope will get a new one without any defect.",
            "date": "16 Mar 2015",
            "name": "Ram Janam Ray",
            "stars": "2 stars"
        },
        {
            "comment": "comparison to rate is high features are average......................................................",
            "date": "16 Mar 2015",
            "name": "Thangella vija...",
            "stars": "3 stars"
        },
        {
            "comment": "I love this mobile and feels like a piece of rock in hand.i accidentally dropped it 2 to 3 times but still working with some minor scratches.nice Motorola :)",
            "date": "16 Mar 2015",
            "name": "V,Raghuram Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I have switched from a Lumia 720 to this phone and though the Lumia was worth 18k at the time I bought i,t it was worth it. Specially the pictures that I was able to take from my 720 were unbelievable so the 18k were well spent keeping in mind the fluidity of Windows Phone OS. The 720 is now outdated but still works as smooth as any phone but I had to get a phone which had better specs, was fluid and could take decent photos if not better. And after reading hundreds of reviews and watching around 20-30 videos I had to pick up this phone. Never was a fan of customized android. Coming to the Moto G. 1. The stabilty of stock android and lollipop which came preinstalled is amazing. I have faced minor hiccups only when I have alot of apps open in the background and multitaking between heavy apps. Still the issues are rare and the phone is a charm when it comes to fluidity. -1 2. Battery is almost the same as 720 which had 2000 Mah, where as here its 100 more. You cant expect an android to give you 2 days like my Windows Phone but I am okay which the backup that lollipop provides. Goes easily for a full day on normal use, charging speed is lower but gets full in 4 hours. -1 3. Build is smooth and the phone in no way looks cheap and has a rubber feel in the black model. Though gripping it can be uneasy as it as thin edges and a 5 inch is a big size anyway. It all depends on how carefully you hold it.- 0.5 4. The photos taken were decent in day light and the speed was good in capturing. In low light the pictures could have been better. Frankly I already knew this model was not meant to take best photos. -0.5 5. I missed the ability to double tap to wake which is present on WP. and also the people Hub which includes smart linking of social contacts with phone number thus providing social feeds for each contact. That also meant the persons Facebook picture gets auto added to the contact profile. I did find the sync.me app to do this. 6. Applications and games running absolutely fine and you can multitask without issues. Resuming is fast if you don't have huge games installed. Smooth keeping in mind it has only 1 Gb ram. - 1 I will add an additional star for the price of the product keeping in mind the brand and the fact that lollipop came installed and without any hiccups or bugs. A must get under 15K INR if you like stock android.",
            "date": "16 Mar 2015",
            "name": "Vidyarth Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "16 Mar 2015",
            "name": "Ankit Srivastava",
            "stars": "5 stars"
        },
        {
            "comment": "one of the worst phone i have ever seen , have brought 3 moths back , no even scratch on the phone , suddenly it was not charging .. went to CC they said mother board needs to replaced... suggested to family and friends to go a head with this product around 8 phone has same issue ... man its scrap phone ... china sets are far better than this....",
            "date": "15 Mar 2015",
            "name": "anand k",
            "stars": "1 star"
        },
        {
            "comment": "i am using this phone from past 12 days till date i have encountered several mini problems but after buying other phones in same range i think this phone is the best in under 15k i will write some cons about this product :- 1.Heats up a little maybe it is a drawback of lollipop 2.I am not able to buffer online videos from MX PLAYER on any other app even with great internet connection.",
            "date": "15 Mar 2015",
            "name": "Ashish Malgawa",
            "stars": "5 stars"
        },
        {
            "comment": "No issue at all..delivered on next day ....perfectly working. 2nd generation is far far better than any other phone in this range.Photo quality is really cool..",
            "date": "15 Mar 2015",
            "name": "Nilesh",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is a refurbished one,but sold in the name of a new one.I trusted flipkart for the genunity of the products but its broken by this device.I have asked for replacement but it was not done.Kindly do not buy anything over flipkart.Its all waste of money.As its compulsory to give a rating and there is no rating less than one im giving it one.Thats also waste.",
            "date": "15 Mar 2015",
            "name": "ranjith",
            "stars": "1 star"
        },
        {
            "comment": "Finally I found the mobile which I used for gaming and taking good picture anytime anywhere.....I have recommended it to my other friends....who also get it from flipkart",
            "date": "15 Mar 2015",
            "name": "Jitendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Best of the Phone are..... 1) Camera- The slow motion feature is awesome. 2) Music Sound 3) graphics .....and more BADS.... Only battery.......not that bad.......one-and-half to two days easily on normal use... but still could have been a little better.",
            "date": "15 Mar 2015",
            "name": "Hardeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "overall good mobile with cost, but one can put little more money (1-2K) and get same features better sony mobile where battery life is good. Very bad battery backup, motorola must work on it. also if battery goes bad, then its attached to body can replace battery!",
            "date": "15 Mar 2015",
            "name": "Rahul Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "It is one of the best phone available with this price and it also updated to Android lollipop 5.01 which make me fan of it.Go for it..",
            "date": "15 Mar 2015",
            "name": "deepesh gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I was satisfied with the mobile phone but days passes headset quality was poor. I was not satisfied with the performance of the headset. Please do the needful",
            "date": "15 Mar 2015",
            "name": "Rajagopal",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G (2nd Gen) by Motorola is surely a value for money as it guarantees up to date software updates along with useful Motorola apps that help you to transfer contents from your old phone to your brand new Moto G. 16GB space along with Micro USB slot is good enough for any user. I would recommend any buyer looking for a phone in this range should go for Moto G or HTC Desire 616.",
            "date": "15 Mar 2015",
            "name": "Swapnil Dey",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2nd gen is really superb mobile me using it past 5 months.... still there is no problems.......really worthy to buy.... look also sexy.....camera awesome,sound clarity is good..... Internal memory is unbeatable....... even 20,22 thousands soney,samsung mobile cant give this specification...... i bored of samsung,i got fear at first choosing motrola but now i can say this mobile is 100 times better than soney and samsung.... There is no hanging problem but many costly mobiles having this problem.... even my brothers Black berry mobile can't beat the camera clarity of moto g2 but battery last only one day only......but remaining all are perfect we have put 2,3 hours charge that's enough......",
            "date": "15 Mar 2015",
            "name": "abdul rahman",
            "stars": "4 stars"
        },
        {
            "comment": "budget phone ............less money more benefits............. surely you sure but it..... using from 1 month and there is no problem!!!!!!!!!!",
            "date": "14 Mar 2015",
            "name": "hrushikesh pardhi",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is a pleasure to use, given the price tag. It lags a little but otherwise it's good. Better not install too many apps as it's bound to slow down the handset.",
            "date": "14 Mar 2015",
            "name": "Anubhaw",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is unique .....compared to any one that my wife had used earlier (it was her bday gift). External features such as the screen, the overall built, speakers ....simply great! And Flipkart delivered it in less than 14 hours.........! Super experience!! And the best was yet to come.....! the OS got upgraded to Lollipop :) This was a great decision ....aptly supported by Motorola and Flipkart!",
            "date": "14 Mar 2015",
            "name": "Rahul Chogle",
            "stars": "5 stars"
        },
        {
            "comment": "Everything is better except Battery. Battery is not running more than 4 Hrs.. All other features are good.",
            "date": "14 Mar 2015",
            "name": "Ghanshyam N Saini",
            "stars": "3 stars"
        },
        {
            "comment": "its a perfect smart phn decent look that to at a normal price. plenty of features. good camera quality with hd video recording. just one design problem around the speakers u'll find dere is space in which dust particles find their way in. otherwise its a perfect phn.",
            "date": "14 Mar 2015",
            "name": "Akshita Jain",
            "stars": "4 stars"
        },
        {
            "comment": "I dont write reviews until I use the product for couple of months and get knowledge of what the product is. Here are the pros and cons of the MOTO G 2nd Generation. Initial order, I got the phone which got switched off and never turned on in one day. I reported to flipkart and got the replacement for the same. New one is working properly. Pros: 1. Front and back camera quality (both for photo and video) excellent. 2. speed increases after lollipop update. 3. notifications are fine after lollipop udpate. 4. speakers sound is good. 5. battery backup is good if not using any internet. Cons: 1. Little big that we cannot hold with single hand and operate. While with moto E we can. 2. Network problem. Internet 3G services doesn't work properly. It requires huge signal area to get 3G internet. Whereas my samsung galaxy tab 2 able to receive 3G signals at the same place. 3. Charging the phone takes a lot of time. I figured that the problem is with the charger because when I use the samsung's charger for this phone it charges very quickly. 4. speaker quality on high volume is not good. 5. sometimes playing games like subway surfer degrades the performance for sometime. 6. RAM is not enough for this phone. atleast 2GB should be there. 7. battery drains quickly on continuous usage of internet less than 12 hrs. For any other information kindly comment I will get back to you.",
            "date": "14 Mar 2015",
            "name": "Vaseem Mohammed",
            "stars": "4 stars"
        },
        {
            "comment": "The phone given by Flipkart is defective. The screen has two dead pixels and they are not willing to replace it. I am fed up with the policy. Why do they give replacement of 30 days when the customer has to take all the trouble. I would have given -5 for delivery",
            "date": "14 Mar 2015",
            "name": "Siddharth Jain",
            "stars": "1 star"
        },
        {
            "comment": "When i ordered Moto G at the first place there was a buzzing sound in speakers when on call or playing music. I called flipkart for the replacement and requested for a better handset this time. The replaced set i got was even more faulty, problem with speakers persisted, screen went into the blink mode like a disco light. It kept on hanging quite often without any heavy app downloaded and minimal usage.",
            "date": "14 Mar 2015",
            "name": "Yukti Garg",
            "stars": "1 star"
        },
        {
            "comment": "Love my new MotoG phone that I got from Flipkart. One of teh best phones that I have ever used. Almost as sturdy as old nokia phones in terms of basic call/msg functionality and more smart & fast that Samsung smart phone that I owned before. Moto is the way to go in smart phone space - love it! Biggest Advantage of MotoG after 8 months of using the phone: It's agile & fast & exteremly reliable. Good voice & smart functionalities. I would give an arm & a leg as they say to get a good performance smart mobile after I was bugged by my 'slow as snail samsung' that used to hang every now and then to the extent that I was afraid the set will be of no use even in emergencies that it'll take about 2-3mins for me to even do simplest stuff like make a call or send an sms! After Samsung experience, MotoG is like a dream. I love the set for basics & 'smarts' too! Small dsiadvantage: To prewarn those of us who are going to get their 1st ever Moto, wanted to add a word of warning on what I initially missed on my MotoiG i.e. those simple built in samsung apps like File Manager, Voice Recorder (even the Weather Widget on 'desktop' in fact:-) etc on MotoG which I had got used to on my previous 'slower than snail Samsung' set. Found these apps easily downloadable from Playstore (File Manager app, Super Voice Recorder app, The Weather Channel etc) so that issue was solved in a month. Can appreciate the pure android packaging of Motorola however probably one of the reasons for it's speed & reliability so this was a petty issue in final reckoning. Verdict: Will surely recommend MotoG smart phone to my friends (it was recommended to e by a gadget guru friend in the first place when I was battling with the slllooowww past samsung mobile)",
            "date": "14 Mar 2015",
            "name": "Deepthy A",
            "stars": "5 stars"
        },
        {
            "comment": "Great Product... Value for money... (Y)",
            "date": "14 Mar 2015",
            "name": "ANOOP R S",
            "stars": "4 stars"
        },
        {
            "comment": "This was my 1st online purchase and im happy with it, Timely delivery, neat packing.. A very Good device. :)",
            "date": "14 Mar 2015",
            "name": "Kishore Yadhav",
            "stars": "5 stars"
        },
        {
            "comment": "The best part is that it have all the thing that you need in a smartphone at this price. By bringing external storage and guaranteed update they made it more favourable. They battery life is also good. The camera is also nice as compared to moto G 1st generation and the rest you will know after buying this phone.",
            "date": "13 Mar 2015",
            "name": "Satya Chaurasia",
            "stars": "4 stars"
        },
        {
            "comment": "Since many have already written long good reviews, I won't go back into it. I would simply say its the best phone in",
            "date": "13 Mar 2015",
            "name": "Parimal",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this mobile on jan 14 th of 2015 and i got this mobile on jan 16 th. I am happy for the fast delivery but the movement i used this mobile for couple of days the display is not working i dont what happened. I didn't expect this from MOTO G 2 mobile.May be i got the defected piece which was given by Filpkart. After that i gave my mobile to service center which is in rajaji nagar,bangalore some what close to my location.They told me that phone is dead. I raised a question for the reason because i used this mobile for just couple of days. They said \" we don't know about that we will send this moto g 2 to another Moto service center and it will take 15 to 20 business days. I don't why they asked that much days.Finally i collected my mobile on march 12th.Now i tried to charge my mobile but it is not charging. See how bad it is which is delivered by FILPKART. After that i called filpkart executive they again told to visit service center. Please don't purchase this mobile from filpkart.There is no guarantee on this MOTO G 2 in flipkart.Very very very bad product which i got from FILPKART.",
            "date": "13 Mar 2015",
            "name": "Gopi Kanikanti",
            "stars": "1 star"
        },
        {
            "comment": "Ordered Moto G on the 8th of this month, got it delivered today. Well from where I stay, Siliguri, West Bengal, I'd say the delivery was pretty much on the clock. And now the initial impressions on the device itself after thoroughly using it for around 7-8 hrs, the phone delivers what it promises, Class, sturdiness, latest OS (Lollipop), camera features, battery backup (haven't tested the battery thou).But, let's see how Moto G performs against equally strong contenders in the market and within this price range. But overall, feel somewhat confident that this device's gonna last for a very long time in my kind of hands. FLIPKART'S AWESOME BTW!!!.. :)",
            "date": "13 Mar 2015",
            "name": "Manish Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd is totally a cool phone with a very considerable cost. And it also comes with latest lolipop vrsion. Everyone should go for it.",
            "date": "13 Mar 2015",
            "name": "Camellia Bakshi",
            "stars": "5 stars"
        },
        {
            "comment": "I am using moto g 2 since 13thfeb2015 (birthday) I am happy by this smart phone its screen quality camera quality sound everything is best and enjoying lollipop but its battery disappoints me otherwise best phone in my hand",
            "date": "13 Mar 2015",
            "name": "Gajendra singh rawal",
            "stars": "4 stars"
        },
        {
            "comment": "Product is really good with an excellent camera and battery back up, we are using it for the last 5 months..Thanks to flipkart.",
            "date": "13 Mar 2015",
            "name": "Prem Roy",
            "stars": "4 stars"
        },
        {
            "comment": "The product is awwsome. Once you use moto device, I bat you will be fan. First device was facing heating issue, which got replaced one within a one day. UI - Best Corning gorilla glass - You would not prefer using any other device without CGG Android updates - Instant, received with inbuilt Lollypop in replaced cell Battery - With normal apps like whatsapp, gmail, fb with wifi connection can easiliy go for one day Music - I am not fan, but I guess it is pretty good Camera - Awwsome clearity. Service from Flipkart is really appreciable along with customer support, delivery, return policy, offers!",
            "date": "13 Mar 2015",
            "name": "Karimkhan",
            "stars": "5 stars"
        },
        {
            "comment": "In my life this device unforgettable for me. i love it so much. this is super best device for me.In the low price very great device. -touch is super -it's look as a luxury device -it is so comfortable -camera is great -sound is good....",
            "date": "13 Mar 2015",
            "name": "Yash Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "That mobile design and sound good but more then problem include this mobile... call speaker not clearly... camera not good, big problem heating issues ... 5 min Internet used heating .... Camera= 6/10 Sound= 9/10 Call Quality =6/10 Performance =7/10 Battery= 7/10 Display=8/10 Thanks....",
            "date": "13 Mar 2015",
            "name": "Gowtham M",
            "stars": "2 stars"
        },
        {
            "comment": "After ordering this phone I was panicking a bit since there are a lot of reviews complaining of problems. It seemed like a luck of draw that I would receive a not-so-problematic device. I almost cancelled my order but then thought, meh. It was delivered within 24 hours to me, that is clearly a plus point for flipkart. Not for the phone (all those people out there who rate a product low because flipkart messed up your delivery). I have to say the first night I used it, it seemed like that I received a defective piece, with poor earphone volume, poor speaker volume and a really bad battery. And the metal strip almost burned my ear. If that had gone for two-three more days, I would have just returned the damn thing. However, it's been almost 10 days now and the battery is a powerhouse, I have to say. I'm getting a ~14-15 hours battery backup on an all-time-3G, all-syncs-on, ~1 hour web browsing and IM. And it stays at a working temperature of 30-35 C. The screen performs unexpectedly well in even very bright sunlight. As far as that goes, I'm having almost the same experience as my previous lumia 720 (which used to give me battery backup of ~20-22 hours though. Eh, well!) As of now, I am having no issues with calling (both cellular and voip) although the sound system could've been made a bit more better. But it works, no static, no unexpected drops, no so-called hissing noise. The camera is okay. I didn't expect the front camera to be good but it actually turned out to be really good. However, although it's true for almost any phone, cameras in Nokia Lumia work better even when they are of less resolution. My lumia 720's 6.7MP worked better than this one's 8MP. But don't let a not-so-good camera stop you from buying this. I'm not going to state the obvious android issues and advantages. I don't do heavy gaming or anything, so I don't know whether the RAM is enough. My opinion: If you want to stick to ~12-14k, buy this one. Otherwise shell out a few more bucks and get a One Plus One.",
            "date": "13 Mar 2015",
            "name": "Sachin Goel",
            "stars": "4 stars"
        },
        {
            "comment": "My selection was good, till date product working good. I am satisfied with this product as compare what I have expend. Flipkart service was good from purchase to delivery of the products.",
            "date": "13 Mar 2015",
            "name": "Sandeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Just superb... No comnents. Camara is very good n clear. Front cam is great. Battery backup is okay.. Not up to the mark. Display is very sensitive. I suggest you to go for moto g 2.",
            "date": "13 Mar 2015",
            "name": "Akshay Shriyan",
            "stars": "5 stars"
        },
        {
            "comment": "Rocket fast Delivery from flipkart. Touch is not working properly when phone kept on ground/table/Desk/... Touch not working properly for phone edges.... Subwaysurf game getting struck while playing... Some times phone hangs for about 2 to 3 sec to make a call..... Audio clarity is poor when speaker is on.... Apart from these everything is fine. Compared to samsung and other phones it is the best phone.....",
            "date": "13 Mar 2015",
            "name": "Srikanth Gade",
            "stars": "4 stars"
        },
        {
            "comment": "If you are looking for a budget phone, with a nice camera and touch, this is the phone to go for. Enough memory and good screen size!",
            "date": "13 Mar 2015",
            "name": "Nishant Goyal",
            "stars": "5 stars"
        },
        {
            "comment": "It is a nice smart phone in terms of usage and its looks. But the Specs are not upto other mobiles like Micromax, Lenovo,Redmi etc.., for the price of 13K, which is making to think twice to go for this.Shelling out 13K for this mobile is not worth , yeah but for a normal users, with good and grand look , it is Good. Gamers and Internet freakers have to carry the USB charger all the way wherever you go, Battery dies all the time and runs out of power. Maximum of google applications like Google , HangoutGmail App etc are consuming more battery , wherein , we cannot uninstall those Apps as well, Which is a sad part again. *******OVERALL SIMPLY GOOD SMART PHONE WITH GRAND LOOK AND MEDIUM SPECS**********",
            "date": "13 Mar 2015",
            "name": "Muthukumar",
            "stars": "3 stars"
        },
        {
            "comment": "Charged 50 per in night and switched off in the morning.It takes 5 to 6 hours to full charge and in max 3 hours it will be switch off.It's very frustrating.I wish Flipkart will help me to out from this ASAP.",
            "date": "13 Mar 2015",
            "name": "Bhavik Shah",
            "stars": "2 stars"
        },
        {
            "comment": "This phn was working fine. due to manufacturer defalt mother board crashes while I put on charging After 4 months of purchasing.at service center I got a information that there liquid in side handset even this is written on website we can recive calls in rain..... Service center asking me to pay 8000.00 to rectify my handset ........in service center I came to know there was 19 more phn with the same problem came in last 20days......",
            "date": "13 Mar 2015",
            "name": "Simranjeet Singh",
            "stars": "1 star"
        },
        {
            "comment": "Offers all the features of a smartphone retailing in the upper range of 30Ks. Faced no performance issues yet, using it for almost a month now.",
            "date": "12 Mar 2015",
            "name": "Rohit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "nice phone under 15000 range. All the features are best and the screen resolution is also perfect...",
            "date": "12 Mar 2015",
            "name": "Arnish Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Product is good,excellent display,touch,colors,upgraded to Lollypop. Only Cons- Battery backup should be increased.",
            "date": "12 Mar 2015",
            "name": "Ujjwal",
            "stars": "5 stars"
        },
        {
            "comment": "Airtel offer for 3G data for 2 months is fake. this is just to attract. Later on they say it has been expired. its till 31 Dec. 2014. such a blunder. i wish to give 0",
            "date": "12 Mar 2015",
            "name": "Manish",
            "stars": "1 star"
        },
        {
            "comment": "worst battery backup and camera clarity. two much time taken to battery charge. not user friendly.........................................................................................................................",
            "date": "12 Mar 2015",
            "name": "ravi",
            "stars": "1 star"
        },
        {
            "comment": "This is a worth full product to buy. I am using it with great pleasure. one can have almost every good feature in it. Pros- >Screen- its too good. the quality, pixel density >camera- easy to capture, only touching on screen(good for selfie), easy to access picture gallery. easy to use options,focus & zoom >navigation & using map is easy, supports local language map Cons- >>Don't upgrade to Lollypop (5.0), it will perform slow, also updating google apps is deleting my menu background & unable to change it again. >>No inbuilt file explorer, problem in accessing files(documents,downloaded files) except these, this is a good product to buy in this range.",
            "date": "12 Mar 2015",
            "name": "ARIJIT MAHATO",
            "stars": "5 stars"
        },
        {
            "comment": "Hello to everyone.... I am writing this review after using this product for about 2 months. I got to know about this product from one of my cousin.I was interested in buying zenfone..But after seeing and hearing about this product, I felt like having a go to Moto G2. Ordered this product through flipkart and am very much satisfied @ their service. Though I got a defective product @ first, flipkart provided me a replacement. (both the times I received the product within 2 days of order). Now coming to the phone, its absolutely superb. As guaranteed, my phone got upgraded to Android L. Its camera,stereo,touch etc everything is fine. This product gives good feature and its worth for the money. The only con I find it right now is that the battery performance is bit average. Charger provided takes lot of time for charging. Also, if the data cable had been provided it would have been better. So I suggest new buyers to give a try for this product.",
            "date": "12 Mar 2015",
            "name": "rakesh karkera",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased moto G 2nd generation on 10.09.14 order ID OD40910041688 from flip kart. But on 27.02.15 the display of this phone was with full of distortion . I contacted flipkart and Yerrasura Mayusha of flipkart advised me to contact the service center . I reported to them promptly on the same day but they denied to repair the phone under warranty and demanded Rs 6495/-. I intimated this problem to flipkart also and they took the matter but later they also confirmed that motorola is not ready to give warranty. I had a chat with Vurri Balraj of Motorola who asked to forward the screen shot. I a forwarded the same along with invoice raised by flipkart. My claim is that the reason of malfunctioning is certainly not due to any mishandling as the phone has not got a single scratch on its body which is ample prove that phone has been handled very carefully. they allotted me Customer Reference number :150309-009128 and Motorola E-Mail Team member Arunjyothi had a talk. She intimated that she is forwarding the case to higher level so that they might help in any possible way. But they send me a mail on 11.03.15 that they have not heard from me concerning my request for support in the 48 hours since they sent you a response. Consequently, they have changed the status of my question to Solved. This is the way motorola is cheating customer. Pl do not but any motortola product if you want to live peacefully",
            "date": "12 Mar 2015",
            "name": "GUNJAN SINHA",
            "stars": "1 star"
        },
        {
            "comment": "Before getting this phone i desire to get the phone more nearer to Google but should be below 20k. So, i found this and made the order and here is my product. I am using this phone from last one and half month. You get everything in this phone what a true Android can offer, talking about product specification, camera, which is better than Sony but one point less than Apple, good video recording similar to Sony best smartphone, better screen resolution relative to any other smartphone except Iphone. NO problem of mobile hang, But the time when you upgrade the Phone to Lollypop, the phone become unresponsive several times, phone battery backup lowers and the mobile internet dead and conjures on some occasions and even if you have to made important calls the phone love to be in unresponsive mode. So buyers are requested to not to upgrade to Lollypop, and also be apprised that i have not downloaded anything on my phone neither i have watched any porn or AV sites which could make phone unresponsive. Although, despite of above cons, still phone is extremely good in this price segment.",
            "date": "12 Mar 2015",
            "name": "Dhruv Aggarwal",
            "stars": "3 stars"
        },
        {
            "comment": "Brilliant phone, amazing performance in the last 4 months of usage, should reduce the price as redmi made the competition really tough! pros* Good cam- back and front both Good build quality Latest android 5 Cons* i didn't find any :D",
            "date": "12 Mar 2015",
            "name": "Ankit Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "I am very disappointed with Moto G2 battery backup. After full charge it lasts hardly for 5-6 hours only and on standby it lasts for 12-14 hours only. Seems to be a 1000mah battery only. During 1st month its performance was ok but then after it degraded. Do not buy this phone if you want a long battery life. Rest everything like Camera, Performance, Sound, Display quality etc. are good.",
            "date": "12 Mar 2015",
            "name": "Gaurav Agrawal",
            "stars": "4 stars"
        },
        {
            "comment": "* Nice Mobile * Camera OK * Performance Ok * Battery is not OK. * It is taking 3 and half hours to get full charge.",
            "date": "12 Mar 2015",
            "name": "Sathish Jes",
            "stars": "3 stars"
        },
        {
            "comment": "Overall, I liked this phone for its value for money and bought it about 2 months back. I have seen many friends buy the same phone and having a jolly time with it. I guess it boils down to luck, or is it lack of quality control, but anyway the fact of the matter is the display conked off just like that. It just stopped displaying anything except some red and blue lines. So, here is the thing. I looked up the nearest authorized service center in Bangalore (thats where I live), one \"Pramanik Mobile Service Zone\" in Jayanagar. The guys there told me I have to replace my display. Ok, I thought it is a matter of few days, if not few hours. To my utter shock, even after waiting for 2 weeks, no one called up. So, I contacted the service center and I was told there was scarcity of parts! I called up Motorola customer care and they assured me the phone would be repaired in a week. Naturally, when I did not get any update at the end of the 3rd week, I was pretty upset. I sent a complaint to motorola customer care again (contacting the service center was useless as they kept saying there were no parts), and again I got an assurance that the issue has been raised to \"priority 1\" and someone would contact me within 24 hours to resolve the issue. Guess what, no one contacted (which, by this time, I have come to expect from Motorola). After one more heated mail to Motorola and after 24 days of first giving my phone, I finally got a call from the service center that the phone is repaired!! Moral of the story: Buying Motorola gives you value for money, but pray nothing goes wrong because the service is shit!",
            "date": "12 Mar 2015",
            "name": "Khuman",
            "stars": "2 stars"
        },
        {
            "comment": "Nice phone, Hats off for quick delivery, Product found in good condition. ......................................................................................................",
            "date": "12 Mar 2015",
            "name": "Sudhir Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is by far the best phone in this price bracket. The satisfaction I've had from it is unparalleled in a lot of ways. However with the latest software update its gotten sloppy and a bit slow. But I suppose that it is only a matter of time until Google gets that worked out. Another point that I would like to bring out is the fact that I had had to get this phone replaced twice before I got a piece that I could use properly. The first one had some performance issues (this is was before I updated to lollipop), and the second one had display problems. Getting it exchanged once was a pain, not to mention doing it another time. Although getting to the piece I am currently using was extremely harrowing to say the least, I am satisfied with what I ended up with after it all to say the least. So kudos to Motorola! Keep up the good work! P.S: Thank you for upping the camera a notch. It has become much better now.",
            "date": "12 Mar 2015",
            "name": "Cherian Thomas",
            "stars": "4 stars"
        },
        {
            "comment": "Features are good for the price, but These Moto series have a Delicate body. In the second drop from a very minimal height, my screen got cracked and touch is not working. A near by service guy showed how PATHETIC Moto Series build is. These new series E,G, G2 are are poorly build. If u try to bend very little you can see touch points on screen, even if you didn't do that. Thousands of Moto Series has gone for screen change. People, please go for a mobile with good build and not these new Moto Series.",
            "date": "12 Mar 2015",
            "name": "Venkatesh MA",
            "stars": "2 stars"
        },
        {
            "comment": "phone is good but should have a usb cable and good headset kindly improve the battery otherwise its awesome phone",
            "date": "12 Mar 2015",
            "name": "dhiraj chaudhary",
            "stars": "4 stars"
        },
        {
            "comment": "Great product recommended to buy the product from flipkart.... i have gifted this to my uncle and in his age he is really happy to use the phone",
            "date": "12 Mar 2015",
            "name": "Syed Wasim Akram",
            "stars": "5 stars"
        },
        {
            "comment": "ITs a very good phone, value for money. Has all the features required for today's time. Only disappointment is the audio clarity when put on speaker. I hope this is taken care of in the future models or if upgrade apps can help, then i would give 5 on 5 for this phone.",
            "date": "12 Mar 2015",
            "name": "Asha kiran",
            "stars": "4 stars"
        },
        {
            "comment": "overall performance was good until it was running on android kitkat 4.4.44. but as i upgraded it to lollipop 5.0.2, some functions does not work properly.",
            "date": "12 Mar 2015",
            "name": "shubham tyagi",
            "stars": "4 stars"
        },
        {
            "comment": "bad battery and battery life 10% the sim signal is not comeing west product bad battery and battery life 10% the sim signal is not comeing west product bad battery and battery life 10% the sim signal is not comeing west product bad battery and battery life 10% the sim signal is not comeing west product",
            "date": "12 Mar 2015",
            "name": "DHARAVATH ANIL",
            "stars": "1 star"
        },
        {
            "comment": "BATTERY PERFORMANCE IS REALLY TOO POOR. DRAINS WITHIN 12 TO 14 HRS IN A VERY NORMAL USE. .................. ....................... ............................. ...........................",
            "date": "11 Mar 2015",
            "name": "NAVEEN KUMAR M",
            "stars": "2 stars"
        },
        {
            "comment": "awsome phone , nice camera, value for money, sound is good, using it since 5 months,,,no problem till now, upgraded automatically...must buy...",
            "date": "11 Mar 2015",
            "name": "atul",
            "stars": "5 stars"
        },
        {
            "comment": "my phone came with a preinstalled lollipop v5.0.2, previously i had used a windows phone and have used iOS, this phone made my first android experience to be awesome. If u buy a moto original cover (little high priced though) with it, it makes ur experience even better.",
            "date": "11 Mar 2015",
            "name": "Madhavan",
            "stars": "5 stars"
        },
        {
            "comment": "1st time bad experiences from flipkart, got damaged handset, even not working for signal min. made return request ,,, waiting for update and it will take 10 days almost.",
            "date": "11 Mar 2015",
            "name": "rammilan kushwaha",
            "stars": "1 star"
        },
        {
            "comment": "Like everyone i read many review abt d phone before purchase..i njoy it now so After Using Moto G2nd..for a month..here the point about d phone 1. Easily upgradable to Android 5.0.2 lollipop..i got it..awesome graphics..never update in samsung cell 2. Awesome camera quality..both rear n front..easy zoom..get excellent shot in flash light . 3. great gaming experience.. 4. No cheap hang bang like to happen in Samsung n other phone.. 5. Good screen resolution,,,better performer than expected.. some -ve are 1. Low Battery size 2000mah..which last hardly 15hr using data connection.. 2. it takes much time to get fully charged..3.30hrs",
            "date": "11 Mar 2015",
            "name": "Aamir Khan",
            "stars": "5 stars"
        },
        {
            "comment": "This is not the first Moto G i bought, I bought one for myself (on launch day) and I bought one for my mom since i was impressed with the device. The build quality of this piece was great compared to mine, which now suffers from a very receded power button (which is incredibly hard to press). It's amazing for its price (though better phones have been launched in this range since). Lollipop has improved its performance. One thing I wish Motorola could provide, is the level of service which they provide in the US. Getting a replacement after 30 days from Motorola (due to manufacturing defects/problems which started appearing after 30 days) is nearly impossible, and the service centre is near useless. Calls to Moto and Flipkart about this are also useless. I am now left to use the phone with the power button hanging by a thread and with no hope of it getting fixed. All in all, if you are lucky enough to get a good sturdy piece, then the experience is amazing.",
            "date": "11 Mar 2015",
            "name": "Shashank KR",
            "stars": "4 stars"
        },
        {
            "comment": "Guys, Please check sales package provided by flipkart before buying. I do not receive USB cable along with my product. If you complaint flipkart about the same they say \"It is not mentioned in the sales package provided by the brand\". I asked them if you cannot provide USB cable, replace my charger with detachable USB cable charger but as expected only apologies you can get. Nobody will be there to help you. Plz plz plz check the package carefully before buying. About Product: No doubt the product is good except battery (Not recommended for intense user).",
            "date": "11 Mar 2015",
            "name": "Antriksh",
            "stars": "1 star"
        },
        {
            "comment": "Very much Impressed by the Service rendered by flipkart. Moto G 2 is a must have device in this segment.Very Elegant and User friendly,Power Packed Device.",
            "date": "11 Mar 2015",
            "name": "sridhar r",
            "stars": "5 stars"
        },
        {
            "comment": "nice product for ever.its look like stylish and slim. camera was awesome..Voice quality is very good. But i'm worried about only the signal catching. my Samsung and iphone is showing up good signal strength. Found one issue after the factory default reset. the keyboard is not working as expected. but after a reboot everything works perfect.",
            "date": "11 Mar 2015",
            "name": "MANOHAR REDDY...",
            "stars": "4 stars"
        },
        {
            "comment": "If your talking on mobile lets say even for half hour, the upper half part gets heated up very quickly and it feels clearly that the device is heated.",
            "date": "11 Mar 2015",
            "name": "Manas Jain",
            "stars": "2 stars"
        },
        {
            "comment": "I have bought a MOTO G 2 Gen, tha day before yesterday. Got upgraded to Android Lollipop & tried a Airtel Offer of two months 1GB free scheme showing at time of purchase. SIM got activated today morning, while asking for 3G settings on phone from Airtel, SMS received that Phone is not compatible to use 3G Services. Please remove that Airtel Offer also, which is disastrous one, because neither retailer know who will configure this scheme nor Airtel Customer care.",
            "date": "11 Mar 2015",
            "name": "Rajeev Sharma",
            "stars": "1 star"
        },
        {
            "comment": "the phone is nice and for 13000 rs, i think you'll get this much only. still you can see other phones of this price range that almost are of same specifications. i think there should be a improvement in the processor and RAM department over the last generation moto G. If you are loking foward to buy this device i would say that you should wait for the other devices to come in the market as they are going to be launched around april-may 2015, or maybe motorola launches third gen moto G",
            "date": "11 Mar 2015",
            "name": "mehul kapoor",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product...with great service as the status was ( to be Delivered by by Thu, 12th Mar....but i have received by by Mon, 9th Mar)...it was amazing to see so early product delivered with good service...",
            "date": "11 Mar 2015",
            "name": "Viju",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone at this price I have ever used. The 5 inch screen is awesome and it can be updated to Android 5.0(Lollipop) easily from the system updates settings by downloading an update of about 400 MB. The Lollipop experience is so smooth and cute. The phone has a very good camera at both front and back and the performance is also good. It is very slim and looks very cool and stylish. I just love every Moto whether it is E,G,X or Turbo.",
            "date": "11 Mar 2015",
            "name": "Nikhil Chaudhary",
            "stars": "5 stars"
        },
        {
            "comment": "Enjoying this, but No video calling what is use of front camera with out video calling. build quality was good, but if we 3g the battery consuption is high.",
            "date": "11 Mar 2015",
            "name": "Kishore Chowdary",
            "stars": "4 stars"
        },
        {
            "comment": "First of all thanks flipkart for delivered this product well before the standard date. I got my phone with pre installed Android 5.0, as date of import was in Feb 2015 only, the phone runs very smooth and have no lag in it. It is the best phone in the range of 16k as compared with HTC, SONY or SAMSUNG.",
            "date": "11 Mar 2015",
            "name": "Sandeep Nanda",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing product by moto at best range and as usual quick delivery by WS. best product in this rang. Pro- 1) android 5.0 2) front camera is great",
            "date": "11 Mar 2015",
            "name": "Pratap Gaikwad",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone .. it was working fine , but after updating Latest Android Lollipop , my Internet is not working now. I went twice to the Vodafone Gallery near my place but they say you need to go Motorola Centre in Mumbai. Someone please me with the nearest service Centre in Mumbai. This mobile is okay.",
            "date": "11 Mar 2015",
            "name": "Shishir I",
            "stars": "3 stars"
        },
        {
            "comment": "Got this phone ~2 weeks back for my wife as she wanted a 5'' screen phone within 10-15k. After playing with it for a week I did not feel it as fast, fluidic as my current & previous windows phones in similar price range. Playing Games on this is not a good experience, temple run & subway surf hangs a lot or gets closed automatically anytime. Thus, I'm rating this phone as an average phone. Camera is ok, not v-good for low lighting. I was using HTC 8x for around 2 years and very happy with it, specially with gaming & camera in low light, but lost it few days back. After checking performance of my wive's phone (moto G2), I still want to stick with Windows phone, so went with Lumia 1320 for 13.5k (same price as of moto G2)",
            "date": "11 Mar 2015",
            "name": "Manoj Pandey",
            "stars": "3 stars"
        },
        {
            "comment": "Phone was ok for the forst few weeks. Later on, it started hanging and sometimes it does not even display incoming call and simply shows that there is a missed call. Sometimes, even though I click on Call button, nothing happens.",
            "date": "11 Mar 2015",
            "name": "Deepthi",
            "stars": "1 star"
        },
        {
            "comment": "i ordered it and it came within two days. great flipcart the phone is much better than all other samsung mobile. still learning how to use it to the optimum. excellent features. will review it after using it",
            "date": "11 Mar 2015",
            "name": "B VAIDYANATHAN",
            "stars": "4 stars"
        },
        {
            "comment": "Overall its a good product. But Glass is getting damaged even it falls from 1-2 feet. And glass damage will not be covered under warranty period.",
            "date": "11 Mar 2015",
            "name": "Maitrey Patel",
            "stars": "3 stars"
        },
        {
            "comment": "Its sweet after the lolipop update but it has started lagging because of lolipop though it is buttery smooth... If you want it for daily use its good battery backup is good and boy! the speakers are awesome i cant say that they can beat htc's speakers but its truly a great expirience having front facing stereo speakers Overall Smooth experience",
            "date": "11 Mar 2015",
            "name": "Kartik Naidu",
            "stars": "5 stars"
        },
        {
            "comment": "Good camera quality, slim and compatible but Very poor battery performance. At the same charging time is too long to get full battery charged.",
            "date": "11 Mar 2015",
            "name": "Leo Jack",
            "stars": "3 stars"
        },
        {
            "comment": "Felt if price was little less at around 10000/-, looks like Lenovo A6000 will give a competition for Moto G2.",
            "date": "11 Mar 2015",
            "name": "Santhosh Kumar GP",
            "stars": "4 stars"
        },
        {
            "comment": "Very Nice Mobile on Specs. Only drawback is Battery Drains Faster. Hardly Lasts for a day under Normal Usage, other wise phone is very good.",
            "date": "11 Mar 2015",
            "name": "Srigopal Jakhotia",
            "stars": "5 stars"
        },
        {
            "comment": "My phone came with the built with 4.4.4. Recently I upgraded my phone to Android L. It has been consuming a lot of the phone's RAM and causes continuous app crashes. Not sure about the phones that came built in with Android L.",
            "date": "11 Mar 2015",
            "name": "Mahalakshmee B...",
            "stars": "1 star"
        },
        {
            "comment": "good and average phone . battery backup - 5/10 quality 5/10. android 5.02 latest - 10/10 camera 6/10 GOOD AND FAST PROCESSOR - NO LAG CALL QUALITY TOP NOTCH WITH NOISE CANCELLING",
            "date": "11 Mar 2015",
            "name": "rajiv gupta",
            "stars": "3 stars"
        },
        {
            "comment": "THIS DEVICE HAS GOOD FEAUTURES..BUT HAS LOTS OF PROBLEMS INTERNALLY BECAUSE I HAD A GOT A DEFECTIVE DEVICE & NOW GOT REPLACED...INITIALLY I GOT A ECHO PROBLEM FROM THE RECEIVER SIDE WHEN I CALL TO SOMEONE ..BUT NOW GOT REPLACED....",
            "date": "11 Mar 2015",
            "name": "Swarnesh Rao",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone and found that while making calls it has some buzzing noise in the earpiece of the phone. I tried different operator's sim cards to call but the problem remained with all the sim cards. I have placed an replacement request to flipkart. Not sure if they will replace it with a new phone or a refurbished one... :/ Hoping that flipkart replace it asap",
            "date": "10 Mar 2015",
            "name": "Himanshu",
            "stars": "1 star"
        },
        {
            "comment": "except camera and lolipop update nothing is cool about this phone.",
            "date": "10 Mar 2015",
            "name": "PARTHA SARATHI...",
            "stars": "2 stars"
        },
        {
            "comment": "i Was Using last six months nice....but android 5.0 is not Good.................,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,",
            "date": "10 Mar 2015",
            "name": "Praveen Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "It's hard to get features this great in a sub-12k smartphone, but the Moto G (2nd Gen) does it all, and then some. After the Lollipop update, the phone works even better, with battery life extended by hours. Everything is spiffy, clean and quick, just what I need for an everyday phone. It helps that the design is pretty sturdy and can take a beating (not that I recommend that). After three months of use, I am yet to see unsightly scratches on the screen. And no, I do not use a protective film or case of any kind. Overall, a great, everyday phone that has and does everything you need.",
            "date": "10 Mar 2015",
            "name": "Gary Wright",
            "stars": "4 stars"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "10 Mar 2015",
            "name": "Allen Y",
            "stars": "5 stars"
        },
        {
            "comment": "It is an outstanding phone wrt. the price. Much better performance at Kitkat, but a bit frustrated after i upgraded to Android Lollipop. The battery life is reduced by 1 full day (in Kitkat - battery life was 2-2.5 days, in Lollipop - 1 day max). Also after Lollipop, the phone seems to have become slow.",
            "date": "10 Mar 2015",
            "name": "Arnab Ganguly",
            "stars": "4 stars"
        },
        {
            "comment": "This is my personal review have not read other reviewers comment. Excellent service by Flipkart, got it delivered in one day (without availing the 90 rs/- service :-) ) If you are a user who just goes about using the phone for chatting, FB, regular calls, and music. This is the best buy. But, this phone surprised me with its HD display and the video rendering capability. I played videos using youtube, mostly 1080p videos, they looked awesome on this display. You will love to watch movies from this phone for sure. This phone is upgrade-able to Android Lollypop version, once this upgrade is done, you will like the phone even better. Lollypop's UI is brilliant!! Headphones are good to make calls, but lacks the effect that you would be expecting while listening to music and watching movies.",
            "date": "10 Mar 2015",
            "name": "Gunashekar S",
            "stars": "4 stars"
        },
        {
            "comment": "flipkart service awesum.............. good phone, tuch not fine camera is too good and all feature is to good bt batery is not good....",
            "date": "10 Mar 2015",
            "name": "Prabhakar Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Moto g2 is said to be water resistent, i just slipped it in water accidentally, and took it back immediately. but it got repaired and i spent 5k bucks to make it work. all fake promises by moto :P",
            "date": "10 Mar 2015",
            "name": "Bhargavi Sridharan",
            "stars": "3 stars"
        },
        {
            "comment": "Really the best phone in this price range. Camera is awesome... got the OS upgraded on very next day after buying this. Very satisfied. Baught a pair for me and wife :) Cheers to flipkart..",
            "date": "10 Mar 2015",
            "name": "Mahendra Rajput",
            "stars": "5 stars"
        },
        {
            "comment": "it is very easy to shop and the money also pay easy and the flipkart is the best and tracking is very fast and shipping also very very fast so flipkart is the best",
            "date": "10 Mar 2015",
            "name": "ABILASH GEDI",
            "stars": "2 stars"
        },
        {
            "comment": "Awesome product from Motorola...verry happy for buying valued product from Google's house...Always 5Star for Moto",
            "date": "10 Mar 2015",
            "name": "Ashutosh Khande",
            "stars": "5 stars"
        },
        {
            "comment": "Great Mobile!!!! Worth for Money.................................................................................................................................................",
            "date": "10 Mar 2015",
            "name": "Nevin Jose",
            "stars": "5 stars"
        },
        {
            "comment": "Phone was good and it's battery life was really good before lollipop update and after lollipop update battery is draining fast",
            "date": "10 Mar 2015",
            "name": "Latha",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone with great features. Loved it after upgrading to lollipop. Nice display and camera. Battery also is sufficient for 1 day net usage. Best buy phone in this range",
            "date": "10 Mar 2015",
            "name": "Pritam Kaushik",
            "stars": "5 stars"
        },
        {
            "comment": "took this phone after so much researched But now i can see the hell in earth itself thone phone is heating imediatly charge will come down from 9o% to 10% if you restart again it will come up Ringtone will phone what ever phone decides Pleas dont go for this",
            "date": "10 Mar 2015",
            "name": "vamsi",
            "stars": "1 star"
        },
        {
            "comment": "Gr8 Phone. Camera is amazing. The performance of phone is much improved camred to first gen Moto G. I have used 1st gen Moto G. Worth for money and Flipkart service is amazing and Flipkart is rocking....",
            "date": "10 Mar 2015",
            "name": "Srinivas Karna...",
            "stars": "5 stars"
        },
        {
            "comment": "Been using it for 6 months. Got lolliipop update in a month. Interfce is quite smooth and does not lag.",
            "date": "10 Mar 2015",
            "name": "Arun Kamath",
            "stars": "4 stars"
        },
        {
            "comment": "Its good in all the aspects. from the past 8 months am using this phone, till date i didnt face any problem",
            "date": "10 Mar 2015",
            "name": "suman singidi",
            "stars": "4 stars"
        },
        {
            "comment": "beast phone... no regret... delivered in perfect 24 hours of order.... Simply Awesome.. best points- Water-Resistant, 16GB Internal, if u having Battery draining problem than just reset ur Phone... everything will be just Fine... only one negative point... 1 GB Ram... but Overall Awesome Phone...",
            "date": "10 Mar 2015",
            "name": "Chaitanya Kenkre",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased Moto G couple of days back. Read through user reviews and decided to go for this product. As many insisted earlier, it is DEFINITELY VALUE FOR MONEY product. Not to forget the service from Flipkart. On time delivery! Outstanding service!!",
            "date": "10 Mar 2015",
            "name": "Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased this phone after a long market research. I found that, its really good with the following +ve things: 1. Good battery life. 16 to 17 hr on 3g . 2. good touch and voice calls. 3. easy to handle and good space of 16 gb. -ve points: 1. battery is getting used more with games. 2. In case of moving , when network getting fluctuate, the network getting getting disconnect. Then manually require to set it on and Off.",
            "date": "10 Mar 2015",
            "name": "FAKHARUDDIN AN...",
            "stars": "4 stars"
        },
        {
            "comment": "Everything good about this product and is most valuable as compared to its competiters with aggresive price tag...! Good value for money :)",
            "date": "10 Mar 2015",
            "name": "Dr. Sanjay Tha...",
            "stars": "4 stars"
        },
        {
            "comment": "One of the best phones within in price point in terms of dual sim etc. Love the design and the battery life is also good. If this is within your budget, you will not regret it.",
            "date": "10 Mar 2015",
            "name": "Peter",
            "stars": "5 stars"
        },
        {
            "comment": "The MotoG2 nice phone with good features such as gorilla glass ,android 5 full loaded and flip-kart is the only correct place to order your MOTOG2. But according to me Exchange offer should be provided by flip-kart for buying any smartphone so we can easily replace our old phone...",
            "date": "10 Mar 2015",
            "name": "Vikram Pawar",
            "stars": "4 stars"
        },
        {
            "comment": "This is good product but I am facing issue like its getting hanged for some times and heating issue is there when used for internet surfing. still I am giving it 4 points as other qualities are very good like camera, sound etc",
            "date": "10 Mar 2015",
            "name": "Harshal",
            "stars": "4 stars"
        },
        {
            "comment": "Good Fone in its segment !! i have faced problem with the touch screen & then i got an replacement @ the earliest, great service bt FK...",
            "date": "10 Mar 2015",
            "name": "Sanjeevi Sanjeevi",
            "stars": "5 stars"
        },
        {
            "comment": "delivery: got the product delivered very fast. packgaing: it was sad to see that product was not packaged in flipkart cardboard packaging but in simple polyethene-flipkart-bag, so it was only company packaging to save it. would have been better if it was packaged in more protective packaging, though mine was not damaged. product: as usual moto-g is good. 2 points deducted for not good packaging.",
            "date": "09 Mar 2015",
            "name": "nishant",
            "stars": "3 stars"
        },
        {
            "comment": "right from the beginning it is giving so much of trouble as it is not giving proper signal, and main important thing is not even hearing the incoming voice calls and getting heating as soon as fast",
            "date": "09 Mar 2015",
            "name": "lavakusa",
            "stars": "2 stars"
        },
        {
            "comment": "The best thing about Flipkart is they always deliver on/before time. So far the products ordered through Flipkart are delivered to me before the date claimed when ordering.",
            "date": "09 Mar 2015",
            "name": "Roopz",
            "stars": "5 stars"
        },
        {
            "comment": "Battery drains out quickly and comprised of only 851 MB RAM, i was disappointed with the approximate 1 GB RAM. Asus Zenfone is far better than Moto G 2nd Gen in all aspects like Camera, RAM, Standby Battery and runs smoothly than Moto G 2nd Gen.",
            "date": "09 Mar 2015",
            "name": "Francis",
            "stars": "2 stars"
        },
        {
            "comment": "Good Camera..Nice to handle...Glad to have G2 in hand...Hope to buy next one for my hubby...Hope to buy next one for my hubby...",
            "date": "09 Mar 2015",
            "name": "Balakrishnan S...",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is looking super and its really worth for the money we spent camera and battery backup was super",
            "date": "09 Mar 2015",
            "name": "Ramarao Talluri",
            "stars": "5 stars"
        },
        {
            "comment": "i buy this phone and after 1 month updating into lolipop it is giving problem. prolems 1-it hangs when call comes 2-it hangs when we try to pick the call 3-it doenst allow to call but doesnt hang 4-internet problem is more than we think 5-battery problem insted of this you should buy micromax YURECA",
            "date": "09 Mar 2015",
            "name": "Mahesh Bothe",
            "stars": "3 stars"
        },
        {
            "comment": "It's manufactured from \"CHINA\" for that reason only i hate this product. Most complicated to use this phone. Camera wise Ok. Battery wise worst. I thought that its imported from USA or JAPAN. When compare to this \"HONER HOLLY\" from Hawuai is 1000 times more.Same product manufactured from JAPAN....Long Lasting Battery all are awesome. I'm going to return back.",
            "date": "09 Mar 2015",
            "name": "singerSHREE",
            "stars": "1 star"
        },
        {
            "comment": "I m using this phone from the past one month all i noticed is:- pros:- display camera sound quality lag free budget phone cos:- battery lasts only 6 hours max does'nt have common things like note,file manager,screenshot etc........... conclusion:- if you are ok with the battery thing then this is the best phone in the sector to buy just go for it!!!!!!!!!",
            "date": "09 Mar 2015",
            "name": "Aryan Pandey",
            "stars": "4 stars"
        },
        {
            "comment": "i have bought 3 pieces for myself and relatives and it is the best smart phone i have used i am now becoming fan of motorola company for making this product and THANK YOU FLIPKART (esp. WS RETAIL) for bringing this product in india (esp. online and that too on your website so that each indian can buy it easily) flipkart services are greatly respected esp. flipkart advantage retailers",
            "date": "09 Mar 2015",
            "name": "deepak kachave",
            "stars": "5 stars"
        },
        {
            "comment": "too expansive for college student who dnt do jobs and phone is nice very good deleviry by flipkart musyt give cobnsession on online payments at least 20% discount from sbi debit card, phone is nice but brust out when cabloe of dg connected to the p[hone so make it like it can be connected to dg , reduce the cost as much as possible !!!!!!!!!!!!!!!!!!!! phone is nice and out of reach of student pocket",
            "date": "09 Mar 2015",
            "name": "DATTA LOKHANDE",
            "stars": "5 stars"
        },
        {
            "comment": "Hi I am Ramesh don't buy products from flipkart. I had very bad experience with flipkart service. I order moto 2nd gen mobile on Jan 1st 2015, got defect piece i compalinet 4 to 5 times about this issue but no one respond properly from flipkart and Motorola service center. I spend 13k but no value for that plz don't buy any product from flipkart.",
            "date": "09 Mar 2015",
            "name": "Ramesh Babu Ch...",
            "stars": "1 star"
        },
        {
            "comment": "Bought moto g2 before 3 months. All these days it was working fine. But since last 2 days touch is not working completely. Called Motorola support and did all the clear cache, recovery, factory reset, etc via boot menu. Still no success. Finally had sent the device to service center and waiting for hardware checkup and repair.",
            "date": "09 Mar 2015",
            "name": "Krish",
            "stars": "2 stars"
        },
        {
            "comment": "Following are the issues i got in the brand new piece which was delivered a week back: - Cable is not provided(cannot connect to laptop) - After camera click, photos were not stored in SD card. - Cannot see File Manager/SD folder on device - After charger is disconnected, still I can see charging symbol. - Battery shows 100%, after the use(shows in correct) - After receiving call, getting some disturbing voice. - Some notifications are still seen, after read and removed(ex: Female for English:India) When i applied a RETURN piece, they are diverting to a link to troubleshoot the issue. I don't know how a cable missing issue should be troubleshooted :( Can one confirm are the above issues can be troubleshooted?",
            "date": "09 Mar 2015",
            "name": "Swetha",
            "stars": "1 star"
        },
        {
            "comment": "the phone is wonderful. Good design easy to use. The battery however is pretty average. If u r planning to play games on this device, be prepared to carry portable charger. Rest everything is wonderful.",
            "date": "09 Mar 2015",
            "name": "Monish Shah",
            "stars": "4 stars"
        },
        {
            "comment": "I have received a defective piece. I bought MOTO G2 on 8th Dec and this Product works NO more. The phone does not switch on or off, its stuck and is not working. All my data is in the phone and I am not able to retrieve it too. Its not even 3 months from me buying the phone. Never expected it from Flipkart. I will now have to go to the service showroom and get it replaced. Single service centre for the whole of BANGALORE!! Wonder what those pepole have to say for the loss occured to me. Would not even give a single star for this.!!!! Highly disappointed!!",
            "date": "09 Mar 2015",
            "name": "Shruthi K S",
            "stars": "1 star"
        },
        {
            "comment": "best ever there is no alternate of this phone under 20000.every thing is nice in this phone there is not a single issu in this phone.",
            "date": "09 Mar 2015",
            "name": "arunesh ojha",
            "stars": "5 stars"
        },
        {
            "comment": "A best budget mobile... nice performance & picture quality.... sound quality also good... only headphone is bit low quality...i think Motorola have to give a quality headset with this beast. No lagging in games. No problem with internet. Both Sim slots are 3G.",
            "date": "09 Mar 2015",
            "name": "Sandipan Paul",
            "stars": "5 stars"
        },
        {
            "comment": "Nice mobile with good battery back up and RAM.NIce display and looks slim and sleek in great range value for money Appreciated service through Flipkart",
            "date": "09 Mar 2015",
            "name": "Venkat Krishna",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent phone with excellent speed excellent battery backup and screen resolution. Had delivery on time with good packaging with all the accessories.",
            "date": "09 Mar 2015",
            "name": "LPU",
            "stars": "5 stars"
        },
        {
            "comment": "No Battery backup Mobile heating problem i wont suggest this phone to friends. .........................................................................................................",
            "date": "09 Mar 2015",
            "name": "Chandra Sekhar M",
            "stars": "3 stars"
        },
        {
            "comment": "Its work well with kitkat,But after updated with lolipop performance lags a bit and battery problem increase.Otherwise Camera is superb and Design and Build quality is good.Waiting for 5.1 update and i hope all problems will be corrected.",
            "date": "09 Mar 2015",
            "name": "bharath infi",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased Moto G December and later i have updated OS from KITKAT to LOLLIPOP. Than it has stopped switch on my mobile. Battery performance is average and it needs to get charge for every 3-4 hours.",
            "date": "09 Mar 2015",
            "name": "Raja Reddy Gaddam",
            "stars": "1 star"
        },
        {
            "comment": "nice phone at this price. was in dual mind to buy whether Mi3 or this. Finally made up on this as i was the user of Moto razr. the phone is excellent and i see the price is not reduced till now like i-phone.. :P thanks to moto for good phone, and flipkart for wholesale price with exclusive dealership.",
            "date": "09 Mar 2015",
            "name": "Deepak N R",
            "stars": "5 stars"
        },
        {
            "comment": "pros- -big screen -dual speakers -8mp and 2mp camera -latest android cons- -720p screen sometimes looks like blurryness in the pictures... it should be 1080p or amolead.. many other brands are giving 1080p screen in this price range (10-15000rs) -no 4g , no nfc , no wireless charging , and the big one.. it dont have 5 multitouch screen -rear and front camera are good but not up to the mark...if u want a crystal clear camera go for some other brand.. because camera is just ok types -looking& feels like cheap chinese phone... dont have any metal body or something luxury types in the phone -if u r doing heavy multitasking or heavy gaming... it hangs and heat alot -if u r power user like me... the phone not even give u a full day backup.... u have to charge twice in a day if u can adjust with those cons... u can buy this phone.. its a decent phone",
            "date": "09 Mar 2015",
            "name": "Nishant Kashyap",
            "stars": "3 stars"
        },
        {
            "comment": "Its really a nice phone, app is running fast, No hanging problem. Rare camera Picture Quality is awesome, front camera is not good. Battery heat up problem is there.",
            "date": "09 Mar 2015",
            "name": "Tanmay Bagchi",
            "stars": "4 stars"
        },
        {
            "comment": "i would say that it is the best phone in between 10k and 13k because i have one . i am giving this review because of i forced by the moto G2 to do it .Its a gorgeous looking ,very good build quality phone.within in 24 hours flipkart delivered it. color contrast and brightness in my moto g is far better.and Last what i Love the most is its dual STEREO SPEAKERS which is at the front produce a clear sound. Its sound quality is exceptional . That's all .Frankly go for the moto G2 for after sale services also. The only con in this phone is the very average battery life. Overall very much satisfied with this phone for a price and one can buy on demand and not wait for your lucky chance every Thursday.",
            "date": "09 Mar 2015",
            "name": "Babai Mandal",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered on 3rd march(2015) and got it on 6th march(they said march 10 as delivery date),so high speed delivery.. 1.Phone already got Lollipop update so no need to worry about kitkat to lollipop update. 2.Battery life normal getting one day,has to charge again at night. 3.Butter smooth touch screen,(use screen guard)any way we will use it. 4.Feel some lag but its lollipop's common lag,they may fix it soon. 5.There is no,only 3g/2g option,but you can set it by other way,not a problem. SO why choose MOTO G2 because,i saw every one have samsung and micromax,that's all..be different.",
            "date": "09 Mar 2015",
            "name": "ABIN S",
            "stars": "5 stars"
        },
        {
            "comment": "this phone is a quality phone with the latest android os. i am writing this review after a usage of 4 to 5 months. batery is ok on heavy usage rest all is on top worth buying the moto g 2 gen",
            "date": "09 Mar 2015",
            "name": "ashmaraj mokashi",
            "stars": "5 stars"
        },
        {
            "comment": "pros 1.good battery life, 2.nice performance, 3.great build quality, cons 1.After lollipop update there has been some hanging problems,just for few seconds,but my phone memory was full at that time. 2.white color gets dirty often,opt for black AFTER ALL A GREAT MOBILE IN ALL TERMS FOR THE PRICE",
            "date": "09 Mar 2015",
            "name": "PRABHAKARAN",
            "stars": "4 stars"
        },
        {
            "comment": "Great built , better performance.. Nice device :) Better than Zenfone coz it has a better battery life and Lolipop is butter smooth :)",
            "date": "09 Mar 2015",
            "name": "Renganathan K",
            "stars": "4 stars"
        },
        {
            "comment": "I am Satisfied with the product and have no complaints at this point of time. Being using from last 6 months with out any complaints.",
            "date": "09 Mar 2015",
            "name": "Rama",
            "stars": "4 stars"
        },
        {
            "comment": "Best among its class, with all the toughness, still with the power pack performance. Far better than all the near by competitors.. And yes Thanks to Flipkart for bringing some exclusive deals and exchange offer for this product.",
            "date": "08 Mar 2015",
            "name": "Chirag Salla",
            "stars": "5 stars"
        },
        {
            "comment": "its good value for money.the only problem is battery life.it has to be recharged in the middle of the day .on the whole not a bad buy",
            "date": "08 Mar 2015",
            "name": "hyderabadi",
            "stars": "3 stars"
        },
        {
            "comment": "I've bought the Moto 2nd Gen from flipkart in Exchange offer with my old phone and discounted of 2000Rs. The new moto g 2nd gen has the problem in Speakers so I called to Customer Care of flipkart and replace. Today is the day of replacement and I got the problem in New piece also!!!!!! The new replaced phone has the malfunctioning in Sim2 slot, the card doesn't fit in sim2 slot, the sim1 slot is perfectly working. So I called again at customer service, Damn good impressed with the customer satisfaction. They promise to give me my money back and return my phone. I am waiting now because they told within 3 days and money I would get in 5 days so...May be I'll back after 5 days....",
            "date": "08 Mar 2015",
            "name": "Jay Patel",
            "stars": "3 stars"
        },
        {
            "comment": "Value for money.. Inbuilt camera features, user do not need to adjust the mode manually. good touch quality. very good sound quality.........................................................................................................",
            "date": "08 Mar 2015",
            "name": "Jyotirmoy1366",
            "stars": "5 stars"
        },
        {
            "comment": "No need to take the review for buying this product. It is great device. Also 5.0 is now available in this device.",
            "date": "08 Mar 2015",
            "name": "Parth Adroja",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product of this value. I am using this product from last 4 month good battery backup, good sound.",
            "date": "08 Mar 2015",
            "name": "Chandrashekhar",
            "stars": "5 stars"
        },
        {
            "comment": "After upgrading to lolipop the mobile is not at all ringging for incoming calls .With out testing why u guys release the lolipop upgrade. Are you playing with people ? Nonsence mobile in Flipkart. Please read it and post in priority place.",
            "date": "08 Mar 2015",
            "name": "Kumar",
            "stars": "1 star"
        },
        {
            "comment": "My first Smartfone catering all my needs. Battery life is upto the expectations completes full 24hrs in one charging with all multimedia tasking. Never hangs and keeps itself upto date once i came to my home WIFI. its a great buy, Its built is rough and tough as my first mobile which was also motorola in the year 2006. I got it during offer period replacing my nokia 5300 for 2K and 1K cashback, so all in all i got it at Rs 9899.",
            "date": "08 Mar 2015",
            "name": "A A QURESHI",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone in Dec 2014 and in 1st week of March its display seems to be gone but the phone is working since I am able to hear calls and mail notifications. I have asked flipkart to replace this model or give me the buyback. Lets see how soon they contact me back. It might be the issue with only model otherwise I bought Moto g only due to its value for money, specs, gorilla glass, expandable memory and speedy android updates.",
            "date": "08 Mar 2015",
            "name": "Bharat Bhagat",
            "stars": "2 stars"
        },
        {
            "comment": "I had ordered moto g 2nd gen after reading all the reviews on flipkart and finally made up my mind to go for it, as I have been literally bored of Samsung touchwiz so for me this was a breathe of fresh air, but I was disappointed big time. Got the phone on time and in good packaging moreover I got instant lollipop update as soon as I booted the device. After updating to 5.0 lollipop my phone started to hang and battery drained like anything even after switching off all battery hogging toggles. Call reception was bad on both airtel and idea, frequent call drops and many times the other party could not hear my voice. Screen is not great as in resolution, if watched for long it strains your eyes. Last but not least battery charging took around 4 hrs which I think is too much to wait. There can be a possibility that I got a defective product but even the replaced piece was bad so I guess its about quality issue as two phones cannot be bad without reasons. I was completely dissatisfied with this phone. As for others buy it only if ur tired of the regular Samsung UI. I have written my review based on my own experience and I dont intend to offend anyone.",
            "date": "07 Mar 2015",
            "name": "Kabir chhabria",
            "stars": "1 star"
        },
        {
            "comment": "I feel this is the worst phone ever. I will tell you why. 1) After full charge, battery gets drained in 30 minutes. 2) Call end problem (read about it on google). You cant make. receive calls if your wifi is connected. 3) really really slow RAM. Worst performance. I have put request to return this product within a week of usage. Lets see how flipkart helps in this.",
            "date": "07 Mar 2015",
            "name": "Vineet Bhatia",
            "stars": "1 star"
        },
        {
            "comment": "This have only weight issue but this phone is awesome.Do not update it via Android lollipop because it have many issue with this phone.",
            "date": "07 Mar 2015",
            "name": "Lokesh",
            "stars": "5 stars"
        },
        {
            "comment": "its not working proprly when it is charging..frquently it will struck while using...sometmes my phne is taking 30% charging jst 4r 1hr.initial phnes of moto are good but now it is worst....",
            "date": "07 Mar 2015",
            "name": "shyam sunder",
            "stars": "1 star"
        },
        {
            "comment": "I have bought this product via flipcark in September, 2014. Its worth for cost regarding its performance, speed, brightness, clarity of photos, everything is perfect and light in weight, hence very handy",
            "date": "07 Mar 2015",
            "name": "M.A. THOUSIF KHAN",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best mobile for this(10 - 13k) price range.. If u compare this phone with yureka, definitely Moto G wins. How? Simple: Compare the Display of two mobiles hands on, definitely u'll get clarity about display. You will definitely see bluish screen on yureka where as in Moto G2 the display is clear, vivid and buttery smooth. Advantage of Moto G2: Less bugs where as Yureka has houseful of bugs. Android Stock ROM (No problem of updates) Sturdy built and shining look. ( yureka has a bad quality plastic and chinese phone look) P.S: I'm a owner of both Yureka and Moto G2, E, G1.",
            "date": "07 Mar 2015",
            "name": "Pradeep S",
            "stars": "5 stars"
        },
        {
            "comment": "excellent look, goos speeed , big display...... and worth for buying, camera clearlity is awesome.....",
            "date": "07 Mar 2015",
            "name": "priyesh",
            "stars": "5 stars"
        },
        {
            "comment": "Hello people! I bought this phone a weeks back and have tested the phone in all forms. I was using MMX before, the built quality of this Moto G2 is awesome. Its looks a fabulous to hold it in hand, it feels very easy to handle it, it doesn't slips from hand. Camera quality and battery performance remains the same as my previous phone, its average i would say. The upgraded lollipop gives this phone an extra added advantage to this phone. I would recommend Motorola to put up a 13MP camera to their next gen of moto. Overall the phone is good, i would recommend this phone for those who wants durable and budget phone and for people who wants latest software.",
            "date": "07 Mar 2015",
            "name": "akshay kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Nice mobile device after a long time from Motorola. Wonderful display and battery backup. Good sound clarity and ease of use.",
            "date": "07 Mar 2015",
            "name": "Kandharaj Johnson",
            "stars": "4 stars"
        },
        {
            "comment": "Its the best buy in the price segment. Flipkart Delivery is beyond your expectation, always delivers before their committed time. I have ordered two of this phone so far but havent got their Airtle offer activated, despite numerous calls, multiple emails and constant followups. So DOnt believe the 3G offer, they shuttle you between Flipkart and Airtel customercare, without any success.",
            "date": "07 Mar 2015",
            "name": "Asif Anwar",
            "stars": "4 stars"
        },
        {
            "comment": "very-very mast phone and exprience with flipkart specially for this product is awesom. I have been using Moto G 2gen from the last one and a half month and I must say this phone and moto comp. truly worth this price infact for me 15k is also not a big deal because none of the brand is providing Lollipop android at this price, which is again a big revolution in mobile phone industry. Truly an awesome gadget made by Moto Org. Love this Only suggestion - Need to work on design - best of luck and Thanks",
            "date": "07 Mar 2015",
            "name": "Hunny Shakya",
            "stars": "5 stars"
        },
        {
            "comment": "iam facing many problems in moto service on 31jan i handover my device to service center till now i didn't get my device",
            "date": "07 Mar 2015",
            "name": "Abdullabaig",
            "stars": "1 star"
        },
        {
            "comment": "Good Product.No issue about Performance but Look wise poor like un branded phone...that to white color",
            "date": "07 Mar 2015",
            "name": "K V N Kishore kis...",
            "stars": "3 stars"
        },
        {
            "comment": "Good Product and will suggest some one to buy this product. I got this during exchangve and Bank offer. got for very reasonal price. Thanks Flipkart",
            "date": "07 Mar 2015",
            "name": "Muralidhar Kan...",
            "stars": "5 stars"
        },
        {
            "comment": "This is a combo of style and efficiency. Even the battery life is really good. Camera clarity ( both primary and secondary ) is awesum. Sound quality both on the cell phone and handsfree is loud and clear. Money went spent.",
            "date": "07 Mar 2015",
            "name": "Duke G",
            "stars": "5 stars"
        },
        {
            "comment": "hello if u are planning to buy this phone,surely go for it, one of the best on earth,its an success of motorola company,great looks,beauty camera clearity,great multitasking,lollypop works awesome gives you a out of the world feeling,also corning gorillaaa best hardware in the phone,display was good,but lacking on charged not getting as erlier. you can surely go for moto g2.",
            "date": "07 Mar 2015",
            "name": "shaikh tausif",
            "stars": "5 stars"
        },
        {
            "comment": "I AM USING THIS PRODUCT MORE THAN 6 MONTHS NOW. VERY GOOD PHONE VALUE FOR MONEY NICE QUALITY PLASTICS USED BETTER THAN MI3",
            "date": "06 Mar 2015",
            "name": "vivek chaudhary",
            "stars": "4 stars"
        },
        {
            "comment": "Good product. Paid Rs. 90/- extra for next day delivery. On time delivery. Pros: 1. Loudspeakers are gr8. 2. Displays looks perfect with any viewing angle. 3. 8MP Camera works gr8. 4. 5\" HD 720p Screen. Cons: 1. Battery life could have been improved as the mobile comes with a dual sim, battery drains fast on 3G network. 2. There is no data cable along with the product. Micromax data cables didn't support. Sony data cable works fine for connecting phone to PC. 3. Stock earphones is too big. Go for a SoundMagic earphones. They work perfect. Overall satisfied with the product and the delivery.",
            "date": "06 Mar 2015",
            "name": "Ashish Shetti",
            "stars": "4 stars"
        },
        {
            "comment": "After two months of buying this device i am facing battery issues....suddenly the battery level drops to 1-2%..and then it remains there for hours....",
            "date": "06 Mar 2015",
            "name": "Vivek Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart Experience: Quick delivery and great packaging. This phone is totally worth its price. Display is gorgeous and the addition of expandable storage is a plus.",
            "date": "06 Mar 2015",
            "name": "Solomon",
            "stars": "5 stars"
        },
        {
            "comment": "thiz is my 4 motog 2.....love the touch camera is just ausm ausm and ausm cons:less network connectivity average battery life",
            "date": "06 Mar 2015",
            "name": "Manas Shukla",
            "stars": "4 stars"
        },
        {
            "comment": "Found a problem in the phone, when switched off for 12 hours battery gets automatically drained off. Otherwise phone is awsome.",
            "date": "06 Mar 2015",
            "name": "Yogesh Kalbande",
            "stars": "4 stars"
        },
        {
            "comment": "I would say that it is the best phone in between 10k and 13k because i have one. It is very good build quality phone.within in 24 hours flipkart delivered it",
            "date": "06 Mar 2015",
            "name": "Srinath",
            "stars": "4 stars"
        },
        {
            "comment": "Go for it. Best mid range phone in town. And 10/10 Customer service from Moto. The only drawback is the ear phones. They are like cheap roadside ones.",
            "date": "06 Mar 2015",
            "name": "Alecx",
            "stars": "4 stars"
        },
        {
            "comment": "6 months had passed ,my phone has not hanged single tym",
            "date": "05 Mar 2015",
            "name": "Gurtej Partap",
            "stars": "4 stars"
        },
        {
            "comment": "i get my device on 2-March-2015 i love my device before i get get, but i am facing battery issue in my device i want replacement but flipkart disapprove my request 1st day- i am charge my device 100%, after stay out of the room for 2hr. it get on 92% without touching it. wtf then on night i place my device on 55% but in morning it's on 42% i ma shocked Why flipkart do this to me please flipkat do me a favour replace my device or give me suggestion BUT phone is awesome no doubt",
            "date": "05 Mar 2015",
            "name": "Anushkar Dev",
            "stars": "5 stars"
        },
        {
            "comment": "I've been using this phone for about a month now and it's simply awesome! Great interface, superb cameras and long-lasting battery. It's value for money!",
            "date": "05 Mar 2015",
            "name": "Ramya Hegde",
            "stars": "5 stars"
        },
        {
            "comment": "You wouldn't ideally want to buy this. Been only over a month and the performance is really bad. Applications open and close down at their will. I don't even have too many apps installed. The phone crashes and hangs very frequently (almost for every 5 minutes that you use) I bought this because of positive feedback but that doesn't seem to be the case. Don't know if the product I've received is not good enough or the phone in general is crappy. The former seems to be a possibility. All in all - quite disappointed with the product Flipkart!! I think there's now a compromise between price and quality finally.",
            "date": "05 Mar 2015",
            "name": "Saptak Bose",
            "stars": "1 star"
        },
        {
            "comment": "i buy moto g 2 nd gen ...15 day ago ..today my phone down in under the water in bathroom.. so my phone is not work no display no power on ...plz help me ...",
            "date": "05 Mar 2015",
            "name": "kaushik",
            "stars": "1 star"
        },
        {
            "comment": "does not break even when falls down from a running bike. good display quality at cheaper rate. easy upgradation to lollipop.",
            "date": "05 Mar 2015",
            "name": "Baskar venkat",
            "stars": "5 stars"
        },
        {
            "comment": "Before 3 months I have purchased a MotoG 2 Gen, First its dual sim network selection is not working properly. Even Under full signal area, My phone signal completely down and showing no tower. after now its speaker totally in poor condition. It is unable to hear anything while on call. Its has no authorized service centers in our area.",
            "date": "05 Mar 2015",
            "name": "ARUN C",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2nd gen is just awesome.every aspect of this phone is best.after using this Phone from last week i Can say it's just easily can Beat S5. Flipkart have the great service as Usual. Avery Big thanks to the entire FlipKart Team. Ws Retail ..I all ways Appreciate your service delivery commitment. Yup that's true that i always Pay extra 90 rs for priority delivery how ever it's worth. Their is one more suggestion To Flipkart Team You should provide your few customers free priority delivery service, it's not more but make your customer happier. Most of all It's great deal for me once again from Flipkart. FOR BUYERS MOTO G 2ND GEN..JUST GO FOR IT. DON'T HESITATE.U CAN TRUST FLIPKART & MOTOROLA AS WELL. Always remember that Motorola is pioneer in the cellular technology as well. so their product is always best & reliable. THANK YOU ONCE AGAIN FLIPKART TEAM.",
            "date": "05 Mar 2015",
            "name": "Sanjitkumar Biswas",
            "stars": "5 stars"
        },
        {
            "comment": "Had a motoG (1st gen) which was very good in all aspects but unfortunately got stolen and hence went again for the same mobile but motoG (2nd gen) I must say one thing, this mobile is no less than any NEXUS series mobile from Google. It runs on stock Android, hence no bloatware Gets updates just after the NEXUS mobiles get them, hence Cool Has expandable memory, which the NEXUS series don't Has a decent battery life which is quite comparable with a NEXUS (About a Day with Heavy usage) Even looks like the newly launched NEXUS 6 ;-) (Just a little small though) At this price and specs this mobile is a overall good performer and is too good to own one! Happy to have it yet again!",
            "date": "05 Mar 2015",
            "name": "Dr. Rakshith G...",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is working fine till date. It has been 4 months I bought the phone. the camera is good and the best thing is it has expandable unlike Moto G 1st Gen.",
            "date": "05 Mar 2015",
            "name": "Anupriya Bhagat",
            "stars": "4 stars"
        },
        {
            "comment": "Nothing to say for this smartphone..excellent handling grip...if anyone planning to buying go for it...specification as mentioned as it is....battery will go for a full day with using internet plus calling.. So finally, i am very happy with Moto G (2nd Gen) also getting future andriod updates hopefully on my moto g (2nd gen) from Motorola...",
            "date": "05 Mar 2015",
            "name": "Azim Landge",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased 3 moto G2 from flipkart and all of them were not delivered on time, that's acceptable as I resude in Roorkee, Haridwar. But after I updated my phones to lollipop all of them started hanging, now one of them stopped working and I have to take it to the service center.",
            "date": "05 Mar 2015",
            "name": "Kush",
            "stars": "1 star"
        },
        {
            "comment": "Totally waste of money..phone started hanging after 1 week and screen goes on/off anytime. I bought this phone after MOTO G 1st generation success news but this 2nd generation series is very bad and has technical fault in his software as my 2-3 friends has also bought this after my recommendation, and they have also faced the same issue. So guys pls don't go for this phone otherwise you would regret your purchased. Flipkart should stop selling this defective product.",
            "date": "05 Mar 2015",
            "name": "Rahul",
            "stars": "1 star"
        },
        {
            "comment": "Writing review after using for 6 months. Pros: Slow-Mo video recording is awesome Camera Quality is good. Decent Battery Dual Sim phone with all features in my budget Cons: Over Heating",
            "date": "05 Mar 2015",
            "name": "krishna pradyumna",
            "stars": "5 stars"
        },
        {
            "comment": "Good product. Premium look. Good camera quality. Stereo speakers. Great viewing angle. Only drawback is it started to lag after getting upgraded to android lollypop.",
            "date": "05 Mar 2015",
            "name": "Mohammad Jamalludeen",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased this phone one month back, its value for money. Great features and apps. Camera (both front and back) are awsome, gives clear sharp picture. Moto Assist is Dammmmmmm Goood!!!! Loved it. Importantly as soon as I started using this phoen I got upgrade to Lolipop 5.02 which is just great. Till now phone didint gave me any problem (even though it fall from my hand once :( ). Battery backup is good, with two sim cards and 3G, Location service and WIFI eabled and mix usage it lasts almost 16-18 hours which is quite good.",
            "date": "05 Mar 2015",
            "name": "Nikhil Bhandari",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone in that range, u can enjoy the everything in this phone, camera quality is beyond awsm, even the front one is up to the mark.. High end games are playing smooth... excellent phone ,must buy",
            "date": "05 Mar 2015",
            "name": "vishal kushwah",
            "stars": "5 stars"
        },
        {
            "comment": "no complaints at all. delivery was pretty fast too - in just 4-5 days I got the phone. I used cash on delivery, which was also done without any hassles. Overall, perfect shopping.",
            "date": "05 Mar 2015",
            "name": "Vishal S.",
            "stars": "5 stars"
        },
        {
            "comment": "mobile is good but the quality of charger and earphones are not worthy. In fact the charger was not working after one week of purchase.",
            "date": "04 Mar 2015",
            "name": "suhas",
            "stars": "4 stars"
        },
        {
            "comment": "Im used a lot of mobiles, but this Moto G Performance is Good, Good Battery Life, its 1GB Ram but its support all Games in Perfect Graphics, have n't seen this performance in mobile Moto G is Just Great. You can buy it",
            "date": "04 Mar 2015",
            "name": "Bhuvani Dharan",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is Just awesome... I have Used I phone...and am Currently with A note 2...bought this Moto G 2 gen for an additional need...and MAN!! I AM NOT DISAPPOINTED!!...This is AWESOME...guys don't think twice..go for it...and trust Flipkart.. service is genuinely GOOOOOD!",
            "date": "04 Mar 2015",
            "name": "shovankb",
            "stars": "5 stars"
        },
        {
            "comment": "I first of all thank flipkart for delivering it only in a single day. And the phone is literally amazing with its features. Camera is really awsome.!!! Loved the phone veryyyy much.",
            "date": "04 Mar 2015",
            "name": "Niranjan Challa",
            "stars": "5 stars"
        },
        {
            "comment": "recently I bought one, inspite Of sparing use with no video playback the battery was found fully drained within three hours.",
            "date": "04 Mar 2015",
            "name": "Shanmugam Rath...",
            "stars": "3 stars"
        },
        {
            "comment": "Very dissatisfied with the product and services from Flipkart. The battery backup is very low, less than 4 hrs with minimum usage and the speaker is giving some sound all time even when phone not in use. Also I requested the flipkart representative to resolve this issue and return of this product but i Didnt received any call. Very Dissatisfied with Flipkart. I would suggest not to buy this phone and not to buy any electronic item from Flipkart.",
            "date": "04 Mar 2015",
            "name": "Hitendra Jain",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased moto g2 Second time. Previous handse is very good and good performance. But in the second new one, i have purchased i faced heating issue and Some problem on Speaker. I analyse myself this second new handset, Speaker quality is not good comparison to Sepetember month imported moto g 2 handset. So i complained to flikart, he suggested me approx four time troubleshooting steps. and also visit a motorola engg. for the product testing. When he found in front of me faulty product. Flikart Repalced this handset and i got new one. i hope this second new one working fine as per previous new handset.",
            "date": "04 Mar 2015",
            "name": "ABHINAV GUPTA",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this phone since last month. phone is awesome. Camera quality is so nice........... Battery is good Phone is also available in andriod lolipop version.",
            "date": "04 Mar 2015",
            "name": "Vinay Mishra",
            "stars": "4 stars"
        },
        {
            "comment": "I am a new user to buy electronics product from FLIPKART. I ordered Moto G on 25th Feb at 7 pm & i noticed they deliver the mobile around 2nd March. But got the mobile on 27th Feb at 10 am. Very good service from flipkart. But the problem is when i put a sim on the sim slot, both of the sim slot does not work. Then i called to the flipkart customer care and they promise to replace the mobile. I also mention that the behavior of customer care executive is very good. They replaced the mobile on next day (1st march). Verdict: Flipkart is very good & there service is also very good. But the problem is the vendor who sell the product with Flipkart, they are no so good. Like \"WS Retail\". Flipkart Service 5 out of 5. Vendor (WS Retail) 1 out of 5.",
            "date": "04 Mar 2015",
            "name": "ANIMESH CHAKRA...",
            "stars": "2 stars"
        },
        {
            "comment": "good time delivery.but corrugated box would have been more better.i also ordered moto shell which got good quality corrugaated box.",
            "date": "04 Mar 2015",
            "name": "vivek mahodaya",
            "stars": "5 stars"
        },
        {
            "comment": "I HAVE ORDERED ON 25/2/15 AND RECEIVED ON 03/03/15 THRO FLIPCART. SET WAS NICELY PACKED. MOBILE WAS IN GOOD CONDITION. ONLY BATTERY DOOR I HAVE NOT UNDERSTOOD. WHY THE DATA CABLE HAS NOT SUPPLIED, I COULD NOT UNDERSTOOD. SET IS NICELY WORKING.",
            "date": "04 Mar 2015",
            "name": "BASANT KUMAR P...",
            "stars": "5 stars"
        },
        {
            "comment": "Got this phone for my Dad, impressed with the package at such an affordable price. Easily the best phone at this price range and its much better than most andriod phones around. Looks pretty & performs well.",
            "date": "04 Mar 2015",
            "name": "Nachiket Sreed...",
            "stars": "4 stars"
        },
        {
            "comment": "Battery is ok. Some I feel is hanging sometimes. If you play game and call comes you canot answer or reject the call. Speaker quality is not gud. Headfone can be made which must fit with ear. Why they dont provide USB charger.",
            "date": "04 Mar 2015",
            "name": "Vivek Gorai",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome mobile with great features.. worth for money.. good battery backup.. User friendly... Rear camera is pretty good and even front camera is decent ..",
            "date": "04 Mar 2015",
            "name": "Ananda Ubrangala",
            "stars": "5 stars"
        },
        {
            "comment": "Gifted to my Dad...works fine for all day too activities and little bit of gaming too. Flipkart service was also good.",
            "date": "04 Mar 2015",
            "name": "Prashant",
            "stars": "5 stars"
        },
        {
            "comment": "This piece is perfect for me its like worth for money Good Quality Best Performance Good Camera In Low Light and in night also i love moto G2 :):):)",
            "date": "04 Mar 2015",
            "name": "Naresh Vaghela",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone in september and iam facing over heating and hanging problems since i bought this phone.i thought its normal but after 1 month i realised that my phone is defective.I dont know what to do now. i aproached service center but they dont have any knowledge of the problem. at present after seeing the reviews from many customers i realised that motog 2 is completely a flop model from motorola.I expect refund from motorola.If they want to survive in india.I try one more time by approaching the service center.if the issue is not solved and if i didnt get any positive response from them. I am deciding to file a police complaint against them.",
            "date": "04 Mar 2015",
            "name": "vijay reddy",
            "stars": "1 star"
        },
        {
            "comment": "I've been using this phone for three months now, and I can't complain :) The battery life has reduced because of the new lollipop update but still have to charge only once a day so its fine. Love the camera, display and the overall experience.",
            "date": "04 Mar 2015",
            "name": "Minoti Desai",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Mobile at this price range... Battery could have been better. Good for normal users... Flipkart Service was fantastic... My Mobile had a display crack.. Called Flipkart... Got replacement next day!!! No questions asked.... Great!!!!!!!!!!",
            "date": "04 Mar 2015",
            "name": "SASHI MANOHAR",
            "stars": "5 stars"
        },
        {
            "comment": "Touch is very sensitive gorilla touch ,good batery backup,camera clarity is good and video clarity is good .................................... Finally it is very very good mobile in my life............................................................................",
            "date": "04 Mar 2015",
            "name": "BHANAGARI NARE...",
            "stars": "5 stars"
        },
        {
            "comment": "Camera quality best in class. Even I would suggest you Moto G if your budget is up to 20k. Nexus5 is the only phone which is better than Moto G. Believe me U won't find such camera in Sony(C3 too)..Nokia..LG..htc...and all....",
            "date": "04 Mar 2015",
            "name": "Prajjaval Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "hi all, i have this product. its good and worth buying. moto g 2 is average phone with average budget........i am satisfied with it. but some of my frnds have trouble with moto's products...",
            "date": "04 Mar 2015",
            "name": "anjlee",
            "stars": "4 stars"
        },
        {
            "comment": "Great Buy :) Damn good phone... looks wise : it wont make you feel you are handling 13000 rs phone.. I upgraded to LOLIPOP and it is damn good... no phone will provide latest upgrade atleast at this price.. ordered on 1st and recieved on 3rd fastest delivery on standard delivery...",
            "date": "04 Mar 2015",
            "name": "Hatim Bhagat",
            "stars": "5 stars"
        },
        {
            "comment": "Worst Battery in this phone. discharge in only 4-5 hrs. Display also not good compare to other phone.",
            "date": "04 Mar 2015",
            "name": "Ankit Kumar",
            "stars": "1 star"
        },
        {
            "comment": "1.i bought moto g2 nothing is difference in this phone comparing to other android phone 2. apps lock not working 3. phone was hanging 4. internal storage is motion 16gb but only 12.79gb available in phone 5. ram motion 1gb but 898mb available in phone 6. the pre installed apps is waste 7. video player and games not installed in this phone the hole thing you don't invest 13k to this phone",
            "date": "04 Mar 2015",
            "name": "Ramachandiran",
            "stars": "1 star"
        },
        {
            "comment": "Good battery backup, super fast speed. picture and video quality is awesome. Nice mobile Loved it. I am using it from 2 months, no problem till now",
            "date": "04 Mar 2015",
            "name": "Shashi Singh",
            "stars": "5 stars"
        },
        {
            "comment": "It is a great phone at this price. I was using galaxys2 before this which i bought for 32k. Moto g is better in clarity, easy to upgrade & speed.",
            "date": "04 Mar 2015",
            "name": "Jeyakar Vaiz",
            "stars": "5 stars"
        },
        {
            "comment": "Very Premium Features........ Easy To Handling.......... Easy To Set On hand... WoW Sound Quality... Hd Picture Quality... Full UpGraduation Sofware.... and More..........................",
            "date": "04 Mar 2015",
            "name": "BISWAJIT BARMAN",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Mobile......All Rounder..!! As It covered all my shots pics videos all the way in marriage on 17th Jan 2015.. Its a good storage Phone..for all pics clicked and videos made. No need of Laptop to save all the time..",
            "date": "04 Mar 2015",
            "name": "gourav kumar g...",
            "stars": "4 stars"
        },
        {
            "comment": "The product delivery was well before time (in 3 days); which was surprising. The phone is excellent as expected. Brilliant HD screen and super quick Android Lollipop came pre-installed. Charger and Headphones included. Headphone build quality is passable. It did not fit me well. Phone setup was a breeze. Moto Migrate helped me import call logs, pictures from my old android phone. No complaints!! (There are a few odds and ends; which are a part of every smartphone today but nothing which will be a major deal breaker)",
            "date": "04 Mar 2015",
            "name": "Bharat Bangera",
            "stars": "4 stars"
        },
        {
            "comment": "Appreciate your good work,the product got delivered in 12 hours. Good Job guys. This should be the level that needs to be set on Flipkart",
            "date": "03 Mar 2015",
            "name": "Tapas Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone also got Lollipop update.... OK battery life Good display....Build is also nice.... Price is also nominal.",
            "date": "03 Mar 2015",
            "name": "Dipanjan Ghosh",
            "stars": "4 stars"
        },
        {
            "comment": "worst phone do not buy this . i recommend to buy note 4 its an awesome smartphone or if you want to stick to moto then go for Moto maxx beast",
            "date": "03 Mar 2015",
            "name": "Sandeep Chawla",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this mobile 1 month back and took some time before writing this review. It has been a fabulous performing mobile till date. There is definitely a frame which i miss when trying to play high end games. Music performance is outstanding and camera clarity is to the mark. Things that could be better: RAM could have been 2GB",
            "date": "03 Mar 2015",
            "name": "Rajesh Argade",
            "stars": "4 stars"
        },
        {
            "comment": "this is an awesome phone which i bought from flipkart.its a good value for money. but one thing Acessories are pretty cheap .charger is not good it gets heaten up like anything.",
            "date": "03 Mar 2015",
            "name": "naveen kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I accidentally dropped my phone while texting. The phone fell from appx 30cms height flat on the floor. The glass/screen shattered. i was impressed with testing videos of Gorilla glass but in reality i was very disappointed with the glass. I doubt if it is a original Corning Gorilla Glass 3. I'm very disappointed. I went to Moto Service center they said they would charge me 6000 for the replacement of screen which is half the price of the phone. So THINK before you BUY. I've used other company phones like HTC One V, Samsung S3 which i dropped many times but they never broke. Moto fell for the first time and it broke. So Think before you Buy.",
            "date": "03 Mar 2015",
            "name": "Sai",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g2 last month for some days it was working fine and after 25 days i faced a issue that my mobile is not charging and placed a retuen request .but the technical team suggested me to update Lolipop. after updating Lollipop also i am facing the same issue ...",
            "date": "03 Mar 2015",
            "name": "Manovenkatesh V",
            "stars": "1 star"
        },
        {
            "comment": "I would recommend this seller and item very highly. Excellent product delivered with prompted and courteous service. Keep up the good work! I'm very much satisfied.",
            "date": "03 Mar 2015",
            "name": "Jawahar Nagarajan",
            "stars": "5 stars"
        },
        {
            "comment": "this is a cool mobile nice features real fast and smooth i suggesst that phone is worth buying you should buy it its lolipop update came in january thats so fast wow i love this phone thank you",
            "date": "03 Mar 2015",
            "name": "Abizer Khambati",
            "stars": "5 stars"
        },
        {
            "comment": "This phone was amazing,, but after Android 5.0 update,which is a forced update. And it become laggy and slow :( go with windows, atleast you can be sure of that it wont lag",
            "date": "03 Mar 2015",
            "name": "Naman",
            "stars": "3 stars"
        },
        {
            "comment": "Oooooo. Moto g fastest phone for the reasonable price.after instaling for 10 apps phone is fast.So best choice for below 13000 range.",
            "date": "03 Mar 2015",
            "name": "Dinesh babu",
            "stars": "5 stars"
        },
        {
            "comment": "The Moto G (2nd Gen) is an upgrade to the earlier 1st Gen model with a larger screen size and some minor tweaks in the hardware specs. The primary camera has been upgraded from 5MP to 8MP while the secondary is upgraded from 1.3MP to 2MP. The rest of the specs are the same as compared to the Moto G 1st Gen. Overall the build quality is great and the phone is very comfortable in one hand as well. The camera pictures are crisp and clear if you compare it with the other phones in the same range. The phone came with the Android 4.4.4 kitkat which has now been upgraded to the 5.0.2 Lollipop. The stock android performance is impeccable and runs smooth. Battery life is decent with the 2700mAh battery. Certainly my pick for the range of under 15k phones. 2 thumbs up for Flipkart and its lightning speed delivery!!!",
            "date": "03 Mar 2015",
            "name": "rohan .pandit",
            "stars": "4 stars"
        },
        {
            "comment": "there is problem with caling option.sometimes it will hang an we need to switch of an switch on,,,,,, otherwise pfone is gud with gud camera quality",
            "date": "03 Mar 2015",
            "name": "vajra",
            "stars": "4 stars"
        },
        {
            "comment": "even though i'm facing few issues with the phone.. nonetheless it is the best smartphone I have used till now and i have used plenty.. And thank you Flipkart.. you deliver what you promise :) I hope you replace my device soon!!",
            "date": "03 Mar 2015",
            "name": "Nikki",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone for price! I have compared this phone with many other phones... rear camera is pretty good but front is also just awesome! I have compared front cam of moto g 2014 with iphone 5, xperia z and note 3's front camera... there was not a big difference so if you are buying phone for camera than this is good option! and this phone has got nice stereo speakers which is surely gonna impress you! Here are some features of this phone which is enough to give you reason why you should buy this phone! - very nice display and speakers - different design, miles batter than samsung's almost same designed phones. - battery life is also okay, it's not that good. - waterproof layer coated! - phone doesn't gets hanged even when you are using more applications at once. If your budget is below 20,000. Then I strongly recommend you this phone!",
            "date": "03 Mar 2015",
            "name": "Yash",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is superb and it is very good one has more features. And this is best in the price of 13k. It is good to use. Pixel density of this screen is very good. Which has 16 GB internal storage and also has expandable memory slot. This mobile has only 1 GB RAM only but mobile has good processing. The screen is 5\"Inch and it is very good. It has good processor of Quad core. It has good camera clarity which has 8MP, photos quality is very good. front camera is also good and has good clarity. But headset is same for all moto devices that is draw back for this one. Remaining all are good and I recommend to buy this.",
            "date": "03 Mar 2015",
            "name": "Yuga",
            "stars": "5 stars"
        },
        {
            "comment": "Pros : 1.) All necessary/practical specifications included 2.) pure Android . no junk apps 3.) Excellent Build Quality 4.) Comfortable Handling - I don't like phablets No Cons at all.. for me Extremely satisfied with this product.",
            "date": "03 Mar 2015",
            "name": "Vidit Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "prons: budget phone camera quality good sound good touch good cons: battery charging speed very very slow lags in lollipop handgrip not convenient",
            "date": "03 Mar 2015",
            "name": "Anurag Goyal",
            "stars": "3 stars"
        },
        {
            "comment": "I m using this phone from last 7 months it is exelent in feachers. i time my phone fallen in water but nothing heppend to it. I sugeest this phone to my frends they are also using this phone and it is working exelently.",
            "date": "03 Mar 2015",
            "name": "Sachin Kamboj",
            "stars": "5 stars"
        },
        {
            "comment": "i bought it and its display got damaged after 35 days due to a small key.no response from flipkart and moto care asks for 7000 rupees.and now phone stopped working. its nothing like gorilla glass 3 on it..company is making fool",
            "date": "03 Mar 2015",
            "name": "SHubham",
            "stars": "1 star"
        },
        {
            "comment": "Moto G is a nice product......... Its working satisfactorily...... No as such issue.......... Anyone can buy confidently...........",
            "date": "03 Mar 2015",
            "name": "Sabyasachi Das...",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this at 11799 and it is worth it. You can upgrade to Lollipop. The phone do not freeze if you use more applications. The Ram should have been to 2 GB but it is fine with 1 GB as well.",
            "date": "03 Mar 2015",
            "name": "Raj Piche",
            "stars": "4 stars"
        },
        {
            "comment": "My friends told me to bought this phone.Its really nice phone i have no complain with it and as usual awesome delivery by the Flipkart.",
            "date": "03 Mar 2015",
            "name": "Megha",
            "stars": "5 stars"
        },
        {
            "comment": "Good product a lot have been changed from earlier version, value for money and that too with your offer it makes real good one.",
            "date": "02 Mar 2015",
            "name": "Santhosh Kumar S",
            "stars": "5 stars"
        },
        {
            "comment": "excellent for hard core gaming and rough use with great specs and a trustworthy brand....what all u need at this price??battery is good and camera works fine in daylight..also running on android L now.....3 months passed till now not a single issue with it...",
            "date": "02 Mar 2015",
            "name": "lalit S.",
            "stars": "5 stars"
        },
        {
            "comment": "Perfect size, good looking, nice features and good performance. Also updated to the latest version of Android. Would have been unbeatable with 2GB RAM.",
            "date": "02 Mar 2015",
            "name": "Pradip Taran",
            "stars": "4 stars"
        },
        {
            "comment": "good but loipop update 5.02 is not good...................................................................................................................................................",
            "date": "02 Mar 2015",
            "name": "SORABH JAIN",
            "stars": "5 stars"
        },
        {
            "comment": "Though I bought this for my mom I used the device for 10 days as a means to review it for myself after having read all the expert reviews. The white piece is preety good. My friend bought the black piece that looks like a nexus device. So regarding looks it looks good in hands and good to hold. Though I dropped it once on a bus I scared to pick it up as I was expecting a broken screen but there was something for its protection, yes it was the Moto Flip cover. The flip cover looks too good with the phone. I'm saying it again it's too good. Regarding performance I was bit disappointed with the multitasking. 1GB RAM is seriously not enough. Make it 1.5GB and increase the price by 3k the phone will be still selling like garama garam pakodas in winter. Camera- download google camera and use it I am telling you, you are gona be surprised with the qualities of the photos even with the 2MP. I clicked all my farewell photos with it and the photos were much better than my Sony cybershot's 14MP camera. I will say it's a google phone that keeps you updated with time. Battery is pathetic with 3G data on but google works good with 2G data you have your whatsapp, google updates, Email and it lasts a day. That's it!",
            "date": "02 Mar 2015",
            "name": "Dipankar Moral",
            "stars": "4 stars"
        },
        {
            "comment": "Hi friends this phon is a good and quality is good because we know that MOTOROLA but this phone battery life is not good.",
            "date": "02 Mar 2015",
            "name": "SATYA YADAV",
            "stars": "4 stars"
        },
        {
            "comment": "using motog2 from 1 week...very good flipkart service...best standard handset within 13k...latest lolipop android....overall function of the phone is exelent...in love with motog2...",
            "date": "02 Mar 2015",
            "name": "debjit bhowmick",
            "stars": "5 stars"
        },
        {
            "comment": "I am rating this phone 5* so that everyone get to see the cons. I purchased this phone from flipkart with one day delivery option. The delivery was fine. I experienced the following issues... The phone came with Lollipop Version. here i am writing a genuine review guys seriously i have faced these problems. The phone has been restarting randomly. Lot of hotness can be found on screen when you keep it in pocket even with 15 minutes of calling. Phone hanged at times closing all apps and returning to home screen. You dont know, to which SIM a person is calling you ( 1st SIM or 2nd SIM ) You can't message an unknown number from the call log directly. you have to remember the number in your mind and type in message box to send message. No call blocking facility. The UI is not good at all, why should i install launchers?? UI lags in response. Calling & Messaging takes a lot of time to connect to other person even when using 3G. Flipkart people will tell to factory reset the phone so that it will come into good condition, but it din't. Flipkart dont want to refund my money, they just want to give replacement. I am highly upset with the device. One can go with Lumia 730 in this range which is quite fast and silky smooth OS.",
            "date": "02 Mar 2015",
            "name": "BARATH VUTUKURI",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Gen) Product is good. Delivered original product that i brought (Moto G (2nd Gen)). Delivered in on time",
            "date": "02 Mar 2015",
            "name": "Nandhakumar R",
            "stars": "4 stars"
        },
        {
            "comment": "Pros Good camera Fair Battery Life Good processing speed Great build quality Good sound quality Cons Third Rate accessories lags sometimes while playing sub.surfer unnecessory costly backcover",
            "date": "02 Mar 2015",
            "name": "Nutan%20 Paliwal",
            "stars": "4 stars"
        },
        {
            "comment": "Yes Im using this product and my dream phone.................................................................",
            "date": "02 Mar 2015",
            "name": "Mahesh B N",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone. I bought it with a 32GB SD card. The migrate application which comes along pre-installed makes it easy to pull the contacts from the older phone through Bluetooth. The older phone in this case was Nokia Lumia 510.",
            "date": "02 Mar 2015",
            "name": "Rajesh Nagarajan",
            "stars": "5 stars"
        },
        {
            "comment": "I like the moto g 2nd gen phone coz it as a lot of features and great for the price does most of the things what big big brand phones can do AWESOME YAAR...ONE OF THE BEST MOBILE.... CAMERA AWESOME, BATTERY LIFE AWESOME...",
            "date": "02 Mar 2015",
            "name": "Ashish Sonawane",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is good and it works really awesome. For the price I paid it works really well and we are happy with the product. The best part was it was delivered within less than a day.",
            "date": "02 Mar 2015",
            "name": "pallavi reddy",
            "stars": "5 stars"
        },
        {
            "comment": "i want to purchase moto g phone and avail discount offered by hdfc or kotak mahindra as i will place prepaid order",
            "date": "02 Mar 2015",
            "name": "Bushra Khan",
            "stars": "5 stars"
        },
        {
            "comment": "Only 2 phones within 15k that is so perfect. the other being Asus Zenfone. Cons- has a 1 gb RAM compared to Asus's 2 gb With lollipop upgrade- battery performance increases significantly very stable stock android system no network issue Camera is surprisingly good Well built and comfortable in hand Very satisfied,, nearly 6 months in use",
            "date": "02 Mar 2015",
            "name": "Neel Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone at this price. Solid built, ergonomic design, good camera, loud stereophonic sound, strong vibrate mode, latest stock Android. Only downside is a bit heavy to carry.",
            "date": "02 Mar 2015",
            "name": "SAUDAS DEY",
            "stars": "5 stars"
        },
        {
            "comment": "Its actually Second Generation phone. Awsome pricing with good brand value, same cofiguration with other brands. The best part is its Moto-Google phone where Android updates are avalable first as compared to other brands. My phone upgraded to Lollipop and i feel like i am using LG Nexus 5 which comes with double the cost.",
            "date": "02 Mar 2015",
            "name": "Lalit Tyagi",
            "stars": "5 stars"
        },
        {
            "comment": "My review is after using phone more than 3 months Positive -> Got Lollipop upgrade -> Good for gaming -> Performance is good for gaming once game is started -> If you are doing some work on phone and if some one calls you, then it will let your work continue as calling will take upper screen part to receive or decline the call. Negative -> You cant get option to transfer files via wifi-direct but phone have wifi direct -> After using more than three months it will starting working slow -> Apps will pop-up after 3-5 seconds after you tap it -> Apps will also take time to open. -> Receiving notification on screen and will take time to disappear from it -> If you swipe that on screen notification then it will also get removed from notification bar -> You cant manage the notification bar tool -> Dont have in-built SBeam or NFC as its now on all phones at this price.",
            "date": "02 Mar 2015",
            "name": "Syed Roz Raza",
            "stars": "4 stars"
        },
        {
            "comment": "Product & features are very good but internal memory should be at least 32GB in this price also it has to come along with flip cover.",
            "date": "02 Mar 2015",
            "name": "Mannu",
            "stars": "4 stars"
        },
        {
            "comment": "Good product.... ( shine through. But its equally important, references to other retailers. My Purchases always better, interested in the pros and cons of the product.)",
            "date": "02 Mar 2015",
            "name": "Amiya Samanta",
            "stars": "3 stars"
        },
        {
            "comment": "After using blackberry,samsung note, S4, S5, iPhone 4S, i thought of buying a budget phone. After doing a lot of research i zeroed down on Moto G2. A lot of things was going on in my mind while the product had not been delivered. I was thinking if i had taken the right decision...will it feel cheap...how will be it's performance...and a lot of other things. I received the phone next day (thanks to flipkart for the 1 day guarantee service). As soon as I opened the box and took it in my hands...i was like waaaaaaw.....amazing... A well built phone...sturdy...nice grip...curvy edges... Now it was time to test the phone. I simply downloaded all the applications that i used on my other phones and started using all of them...switching between them was flawless...the phone didn't lagged even for once. Front camera is too good for making video calls...it captures every details and the video looks realistic on the receiving device. Playing videos...you will feel like if you are watching it on a LED...display is very clear...and sound quality is also very good, much louder and still clear than my iPhone and samsungs (thanks to the dual front speakers). I rarely use the phone for taking photos so camera is not a concern for me...but after seeing some of the shots i captured...it seemed very good...specially autofocus is very good. The camera features panorama mode continuous shots (just keep tapping). You also get to capture 720p HD video and 720p slow motion video. Battery backup is also very good...I am using it since 9 am today and doing all sort of things(played games, watched videos, made video calls, browsing, listening songs online,checked mails) and still i am having 30% battery left. I ordered this along with original Moto flip cover and 32GB Class 10 sandisk ultra memory card. With the flip cover the phone looks much beautiful than naked...;p. Along with the 32GB memory card this has become a beast in terms of storage (combined u will get massive 42 GB for ur use.) I was reading other user's review also and some of them had mentioned that charger is getting hot like a rock...but i haven't felt it yet...It's been continuously plugged in since friday night charging my other phones as well...i will suggest they better check there electrical connections (use with extension boards which removes spike) In simple words i will say...just go for it...you will love it",
            "date": "01 Mar 2015",
            "name": "VIVEK KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "Was working fine with Jelly bean, but with Lollipop update it's gone slow and hangs up occasionally.Better to go for RedMi Note or Yureka",
            "date": "01 Mar 2015",
            "name": "Ali",
            "stars": "3 stars"
        },
        {
            "comment": "Pros: * Awesome value for money. * Excellent \"retina-class\" high-PPI IPS LCD display. * Front-facing camera. * Flashlight. * GPS and compass. * Dual-SIM. * MicroSD card. * Excellent magnetic flip shell cover available. * Upgradeable to Lollipop. Practically pure undiluted Nexus-like pure Android. Cons: * Slow shipping by FlipKart - Package took 7 days from Bangalore to Pala (Kerala). No option for faster shipment. Poor package tracking.",
            "date": "01 Mar 2015",
            "name": "Mathew K J",
            "stars": "4 stars"
        },
        {
            "comment": "after lot of confusions, i took this.just 1 day back.following are drawbacks wat i expnced 1.Head Phone sound quality not up to the mark 2.More weight 3.no installed games 4.no USB cable 5.rcving calls-confusing smetimes 6.headphone-pain in ear will update after somedays",
            "date": "01 Mar 2015",
            "name": "Gururaj Kulkarni",
            "stars": "3 stars"
        },
        {
            "comment": "unlike any other android phone the battery back is the only problem i face in this mobile. very good picture quality and nice experience with the phone",
            "date": "01 Mar 2015",
            "name": "Prabakar Soubr...",
            "stars": "4 stars"
        },
        {
            "comment": "a good phone value for price but hangs and creates problem sometime while conecting external usb drives",
            "date": "01 Mar 2015",
            "name": "nitigya sharma",
            "stars": "4 stars"
        },
        {
            "comment": "my phone is working fine but charger has stopped charging, i tried connecting to other mobile phone also they are not charging as well and i have used other charger on my phone then only my phone is getting charged. please help",
            "date": "01 Mar 2015",
            "name": "ishan gandhi",
            "stars": "3 stars"
        },
        {
            "comment": "I got this phone last year in the month of October. Till now its working great, no lag no hang no slowness. A perfect phone for this price range. Happy to get the 5.0.2 update, animation is relay good and the battery backup is great now.",
            "date": "01 Mar 2015",
            "name": "Biraj Lenka",
            "stars": "5 stars"
        },
        {
            "comment": "I am writing this review after using this phone for about 3 months......Flipkart the best in delivering the phone on time and exceeding the expectations....and about the phone ...its just bang for your buck....now its seem that there few options in the market but you will not get the quality as Moto G2 is .....",
            "date": "01 Mar 2015",
            "name": "PULIKANTI TARUN",
            "stars": "5 stars"
        },
        {
            "comment": "excellent no issues .....but the update(lollipop) which i have got is very buggy but no worries i think we may get an another update ( android 5.1)",
            "date": "01 Mar 2015",
            "name": "y venkatesh ve...",
            "stars": "4 stars"
        },
        {
            "comment": "good product.. not getting hang as of now but be aware i got news from fellow users after getting new update its getting too much hang..",
            "date": "01 Mar 2015",
            "name": "harry",
            "stars": "4 stars"
        },
        {
            "comment": "its not upto but its ok no battery backup lolipop is waste kitkat is better than lolipop but flipkart is good side i got a hangout problem flipkart has been replaced with in 2-5 days",
            "date": "01 Mar 2015",
            "name": "Teja Sai",
            "stars": "3 stars"
        },
        {
            "comment": "This is the most amazing product ever and it is awesome value for money. In 13k an smartphone all such features and amazing camera quality and amazing loud sound quality is a huge benefit.",
            "date": "01 Mar 2015",
            "name": "AMIT SHARMA",
            "stars": "5 stars"
        },
        {
            "comment": "this is good! \"value for money\" bole to ek dum killler. that phone is awsome tabadtod but problem some apps are not support in lolypop version.....",
            "date": "01 Mar 2015",
            "name": "shailendra bhagat",
            "stars": "5 stars"
        },
        {
            "comment": "The MOTO G phone is a very smart, performance-oriented phone, with which you can accomplish any work that buying a 20-30K would have done for you. Great in looks, the MOTO G offers you a very distinct benefit, the Android Lollipop Upgrade which will make jealous to any other user, who understands technology. Everything working great on the phone. No need to expand memory unless you use your phone for watching movies!!! The only thing that I found less is the RAM(1 GB). With 16GB internal you can install almost anything everything in the Playstore, but the RAM limits the usage... Overall Suggestion based on Experience: BUY!! :) ;)",
            "date": "01 Mar 2015",
            "name": "Sarvajeet Halder",
            "stars": "5 stars"
        },
        {
            "comment": "Got my phone within 15 hours...wow..!!! I am just concerned about the battery issues. However news is that it has been improved after lollipop update.. If it really is this is pure awesomeness under 15k.. Go for it.. Blindly",
            "date": "01 Mar 2015",
            "name": "Sandeep Singh",
            "stars": "4 stars"
        },
        {
            "comment": "If you are looking to buy an android phone with 15k budget this must be your choice. I love everything about product. Things i don't like : Earphone is of cheap quality have not use them for single use. Battery life seems to be an issue. If i am using 3g continuously i may have to charge phone for 2 time or may be 3 times. This is only thing which looks irritating to me. One last thing is the charging. Charging phone taking so much time min. 3 hour to get full charge. Due to all this i will be able to give 3 stars only. If you can overcome all this issue then this is perfect. I love it.",
            "date": "01 Mar 2015",
            "name": "Kamal singh",
            "stars": "3 stars"
        },
        {
            "comment": "this a really very nice mobile, i waited for while before writing the review its been months still i had no issue with this phone, absolutely fine just tht a price range should have been 9k or 10k... would suggest to go for it bcoz its a really tough piece for the rough users like me... mostly fallout of hands and get damaged.. better then samsung mobiles..!!! ONLY PROB WITH FLIPKART THEY DON'T PROVIDE ANY SPECIAL OFFERS TO INDIVIDUAL CUSTOMERS..",
            "date": "01 Mar 2015",
            "name": "harish kumar",
            "stars": "5 stars"
        },
        {
            "comment": "given the price, it is undoubtedly the best choice !!! Apart from the the given specifications, it gives the pure android experience, nice fluidic navigation between screens without any jag, and flipkart, ordered this on the 1st big billion day and got the delivery within 4 days",
            "date": "01 Mar 2015",
            "name": "anirudh bharadwaj",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this mobile,very nice product in terms of performance no lag even after 5.02 lollipop update.i am mentioning it deliberately because i found few negative reviews about this product. this is my request to all users that do factory reset after lollipop update otherwise u'll be facing problem. don't download battery saver or speed booster ect .kind of apps.they good for nothing. CONS: NO CONS but Audio quality could have been more pleasant. Last i would like to suggest that don't waste ur valuable time in comparisons and reading reviews as i have already wasted mine.Lolzzzzz...... at last, u gonna find this product incomparable.seriously.....",
            "date": "01 Mar 2015",
            "name": "Abhishek Kesarwani",
            "stars": "5 stars"
        },
        {
            "comment": "delivered me a defective product and now giving all silly excuses not to replace it They are simply telling everything is fine and no replacement will be done FOOLED BYU THESE PEOPLE Replacement warrant is all a FOOL process....be careful..",
            "date": "01 Mar 2015",
            "name": "aditya gupta",
            "stars": "1 star"
        },
        {
            "comment": "Highley disappointed with the product as first i got the defected set and after replacement with in a day there is some issue with battery ..",
            "date": "28 Feb 2015",
            "name": "sahil gulati",
            "stars": "2 stars"
        },
        {
            "comment": "i love this site,nice job by flipkart, i brought MOTO G2 its working awesome,and your 1 day home delivery was also good thank you awesome job..keep it up 5 star",
            "date": "28 Feb 2015",
            "name": "Chandu Parmar",
            "stars": "5 stars"
        },
        {
            "comment": "I found only two cons:- 1) Battery backup is not upto the expectation. 2) During the call , even if the speaker mode is turned off, the voice is too high. Otherwise its a good phone i got it in Rs 11749, So, i am satisfied and will recommend to others",
            "date": "28 Feb 2015",
            "name": "Mohit",
            "stars": "4 stars"
        },
        {
            "comment": "I have received my Moto G 2nd Generation in 3 days as normal delivery without paying extras. Great Service from Flipkart !!! I love the product. Thanks Flipkart",
            "date": "28 Feb 2015",
            "name": "Manoj Atri",
            "stars": "5 stars"
        },
        {
            "comment": "In my opinion this is best mobile available in this price range, works so smoothly and with Motorola support and help. I did not find it difficult to use as This was my first smart phone, Battery life is superb, delivery from flip-kart was excellent, got it before the stipulated date, and next day the operating system was upgraded to lollipop seamlessly, and I got this under old phone exchange scheme so it was all the more helpful, flip kart should bundle more phones with this exchange scheme",
            "date": "28 Feb 2015",
            "name": "Pervez F Bhathena",
            "stars": "5 stars"
        },
        {
            "comment": "moto g2 is 100 times better than moto g and also prize is in our medium range its speed is also better than other phone........ its primary camera is also better according to other 8 mp camera phones",
            "date": "28 Feb 2015",
            "name": "krishna patil",
            "stars": "5 stars"
        },
        {
            "comment": "mobile is super updated to lolipop no laging problem draw backs;camera and battery life i am facing some heating issue",
            "date": "28 Feb 2015",
            "name": "nagarjuna",
            "stars": "4 stars"
        },
        {
            "comment": "camera clarity super in and net speed is ok but more applications installed then mobile will be structed",
            "date": "28 Feb 2015",
            "name": "khaleel",
            "stars": "5 stars"
        },
        {
            "comment": "Took it as a gift for my wife. It's a very nice phone with all the features. Updated it to android lollipop. One thing that could be worked upon is the thickness of the phone. Even though it's a little thick phone it sits in the hand very well. Over all very satisfied with the device.",
            "date": "28 Feb 2015",
            "name": "Ankush Agarwal",
            "stars": "5 stars"
        },
        {
            "comment": "i have been using this for a month now...its flawless!!..with the Lollipop upgrade its even better.. trust me when i say it can defeat any phone in appearance,performance and overall experience which cost 5k more.... UI feels like butter,multitasking is easy,does not heat up much when playing games.. in short BUY IT!!",
            "date": "28 Feb 2015",
            "name": "Ayan Chakravarty",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Good Sound quality when play music through phone inbuilt speaker. Look wise average. Performance wise good. Camera quality is good in outdoor (not average in indoor). Cons: Accessories not Good (bad ear phone) Battery charging take 3-4 hour to full charge Charger is 550 mA should 1 A Battery should be 3000 mAh No Data Cable. Ram should be min 1.5 GB Non Removable Battery",
            "date": "27 Feb 2015",
            "name": "Vivek Kumar",
            "stars": "3 stars"
        },
        {
            "comment": "Bought this phone 3 months ago.. This phone has awesome features.. recently upgraded to android lollipop.. It is fully loaded with all the possible features that a person desires in a smartphone.. Worth every penny spent on it..",
            "date": "27 Feb 2015",
            "name": "amrit vohra",
            "stars": "5 stars"
        },
        {
            "comment": "Moto g2 is good but there are lot of other branded companies that offers you MUCH more for that same price. But comming to Moto g2 the mobile doesnt give you a cheap feel. back panels are of very good quality. And after having updated to lollipop 5.0.2 the battery is draining like water. The battery doesnt even last 6 hours. overall a good mobile phone but battery is very low.",
            "date": "27 Feb 2015",
            "name": "Derrick Dsouza",
            "stars": "5 stars"
        },
        {
            "comment": "Full marks to product quality, features and price. The touch is very good good and responsive. This phone is equipped with every smartphone feature in this price range. Shipping was also too fast as it delivered to me within 24 hours.",
            "date": "27 Feb 2015",
            "name": "Rahul Bakshi",
            "stars": "5 stars"
        },
        {
            "comment": "Updated to Lolipop!!! Camera just superb especially the 2MP front camera which is far better than that of Samsung Galaxy Grand Prime's 5MP front camera. Battery backup is just awesome but it tents to vary...sometimes i get like 12-15hrs and sometimes 30 hrs. Display and Built Quality is nice! One down is that there is no battery percentage shower..so we have to download apps for that.And also to set a ringtone other than the default is difficult.It wont get set.At last i had to copy my ringtones from my sdcard onto the phone memory to get this thing setted up. RAM also i have like 300MB free. Audio is in damn good quality through the 3.5m jack.Front facing speakers are also a plus and loud too. One thing about Moto G2 is that there is something wrong in some of this products recieved...sometimes customer get an awsm moto g2 or sometimes bad ones too...so its just basically luck and am LUCKY!!",
            "date": "27 Feb 2015",
            "name": "Renju Aravind",
            "stars": "5 stars"
        },
        {
            "comment": "It is a nice phone with the support features in terms of processor speed and application wise. The screen size which is bigger from the previous version is a perfect one for any view of applications or checking the mails or even browsing through Chrome in mobile. The pixels of the camera might have been little bit higher side considering the competitive products have 13 MP & 5 MP primary and secondary camera. One disadvantage with the produce is that it does not have the data cord to connect with the laptop. This may not a much important thing. But if it is available in that format it'd be good. Overall experience with the phone is excellent. Worth for the price.",
            "date": "27 Feb 2015",
            "name": "Subhash S N",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is overall good, only two disadvantages according to me are its battery is pathetic and the display is too delicate. don't even dare dropping your phone on ground you will have to pay 7.5k extra for the original display",
            "date": "27 Feb 2015",
            "name": "Sachin Sane",
            "stars": "3 stars"
        },
        {
            "comment": "I bought this phone for my wife. She had a HTC One X before. Compared to the HTC camera, the quality of the image is grainy when I transfer the photos to a laptop. It looks OK on the phone's screen though. Also it does not have image stabilization which creates a bad image with even a small shake. I loved the earlier HTC phone's camera. HTC have the best camera even better than the iPhone in my opinion. Also the phone's call volume is too low even at its maximum volume and I would not say it is very clear. Quality on the other ends seems to be fine. I have an iPhone 4 and its call quality is far better and crystal clear given its noise cancellation features. The phone's screen also does not instantly turn on / off when I move it to be ear when taking / completing the call - guess it could be due to the proximity sensor lag and the bigger size.",
            "date": "27 Feb 2015",
            "name": "Ganesh Natarajan",
            "stars": "3 stars"
        },
        {
            "comment": "Very good phone, would recommend to people for such product & offer. Thank you very much for such offer and product.",
            "date": "27 Feb 2015",
            "name": "Arjun Sabale",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this phone on the day of it's launching.. after a long experience with MOTO G2 i can say this phone is great in its budget rang...",
            "date": "27 Feb 2015",
            "name": "ANIL SAINI",
            "stars": "5 stars"
        },
        {
            "comment": "Good phone, good feature, good image, good video. Overall very good device for regular usage. Got Lolipop upgrade over the air. Seamless upgrade. Does not come with many applications, not even file manager, need to get it from play store (with lot of ads though). Does not support many Indian languages such as Gujarati, hence you cannot see whatsapp messages in local languages.",
            "date": "27 Feb 2015",
            "name": "Bharat Thakarar",
            "stars": "4 stars"
        },
        {
            "comment": "Very worse experience with Moto & Flipkart I had very disappointing experience with Moto G2. I faced the issues of earphone jack & call hearing just after one month after purchase. When visited to Service center I came to know that IMEI number is wrong on bill so I request for new bill. It took around 3-4 days. Again I have given to service center & its motherboard issue hence they kept for 15-17 days. Just after 2 days using my phone switched off automatically. I’m not able to start so contacted call center & they says its again a motherboard issue. I really disappointed with Moto after sales service & low quality product. I advised to all buyer please please don’t buy this any Moto phone & please check product IMEI number after delivery from Flipkart.",
            "date": "27 Feb 2015",
            "name": "Sachin Raut",
            "stars": "1 star"
        },
        {
            "comment": "FOR THIS PRICE , GO FOR IT. Good picture quality, great dual sound,latest Lollipop received, average battery life,USB OTG support, notification light, dual sim, memory card slot, ..... etc. overall good phone.",
            "date": "27 Feb 2015",
            "name": "DEVIDAS",
            "stars": "5 stars"
        },
        {
            "comment": "1.) I ordered these moto g 2nd gen with that ordered moto g2 flip cover. on 26th feb 2015 i received the parcel from blue dart courier services and given total amount for the parcel 14k. 2.) and opened that Flipkart parcel in front of them , and saw there are phone charger, head set, and royal blue flip cover. But OMG where is the phone. there was every thing except that phone. 3.) Immediately I called flipkart and they assured me that they will replace the order and I will get my phone, and they are regret about the inconvenience. 4.) What a bull shit .....I may get my phone , But my question is why should these happened with a company like flipkart ?. they should protect these kind of incidences. 5.) I completely breakdown. but still I trust flipkart they will resolve my issue and I will get the phone. I may rethink before next purchase. .",
            "date": "27 Feb 2015",
            "name": "Debajit Pal Ch...",
            "stars": "1 star"
        },
        {
            "comment": "best phone at this price range. good camera sound quality is best but after upgrade android its goes hang",
            "date": "27 Feb 2015",
            "name": "Deepak Jangra",
            "stars": "5 stars"
        },
        {
            "comment": "Highly recommended ! Received product with quality on time.Effortless offer in flipkart. Worth a buy. Quality product. Nice experience.",
            "date": "27 Feb 2015",
            "name": "Ram M Krrish",
            "stars": "5 stars"
        },
        {
            "comment": "Its just amazing. The only difficult part is to find a case for it! Love the display, the touch, the android. The sound and everything else. 2 sim amazing!",
            "date": "27 Feb 2015",
            "name": "Shopper007",
            "stars": "5 stars"
        },
        {
            "comment": "First of all thanks to flipkart for sending the phone the very next day of order u ppl are always speed as rocket. Phone is awesome and its gud at that range of price. The phone came with android kitakat version and had converted into Android 5 lollipop which is very good camera is gud at both the sides selfies with 2 MP and 8 MP Back 5 inches display front speakera are clear and loud micro sd slot expand upto 32 gb i took 16 gb is enough for me to hear the songs but headphones are very bad no clarity not to fit to your ears i request to change the headset and the bateery performance is ok i.e neither good nor bad overall awesome phone at the best price",
            "date": "27 Feb 2015",
            "name": "Shanthan Puli",
            "stars": "4 stars"
        },
        {
            "comment": "very nice phone go for it . very nice display very nice front speakers mixed usage of 24hrs battery life gud camera pure android experience android lollipop5.0.2 is awesome premium feel",
            "date": "26 Feb 2015",
            "name": "Vinoth Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "First of all thanks to flipkart for their service! The first phone that I got had a defect and i requested for replacement and got it replaced in a day. I'm really impressed. Pros of the phone: Nice screen. inbuilt 16gb extendable upto 32gb amazing 8 mp cam Lollipop update Free flipcover :) Cons: Battery should have been a bit more better, 2070 mAH for 5\" screen is bad. Hardly stays for a day. My advice: If you r a travelling kind of person then the battery is not that great. Will surely have to carry a powerbank with you. But other than that the phone is just amazing!!! Go for it!! Cheers!",
            "date": "26 Feb 2015",
            "name": "Joseph!",
            "stars": "4 stars"
        },
        {
            "comment": "Sir , I had received an used handset with scratch over plastic screen guard . my request to change this handset with original one immediately.Otherwise I loose my faith from Flipkart",
            "date": "26 Feb 2015",
            "name": "M C PANT",
            "stars": "1 star"
        },
        {
            "comment": "The new lollipop white UI does not look as decent as that of android Kitkat... But overall the performance is good.. 5 Stars for the touch screen quality..",
            "date": "26 Feb 2015",
            "name": "Ráví Sähá",
            "stars": "5 stars"
        },
        {
            "comment": "this is the best phone i have come across ever. Pros:- Awesome Speakers Lollipop 16 gb Beats even galaxy s5 Cons:- Nothing",
            "date": "26 Feb 2015",
            "name": "Rahul Jose",
            "stars": "5 stars"
        },
        {
            "comment": "Timely delivery Perfect Handset and very impressive way of online shoping after comparing I liked it very much delivered content as expected and shown online",
            "date": "26 Feb 2015",
            "name": "gajanan pandit",
            "stars": "5 stars"
        },
        {
            "comment": "Good product from Motorola this mobile camera is very good that the pics which i take from this mobile are very good since mobile cams which i used",
            "date": "26 Feb 2015",
            "name": "vijay varma",
            "stars": "5 stars"
        },
        {
            "comment": "BEST phone ..... with great system updates (android lollipop) . good audio . lightweighted . i LOVE this mobile.",
            "date": "26 Feb 2015",
            "name": "sammy",
            "stars": "5 stars"
        },
        {
            "comment": "I'm using this mobile for the last 5 months now. The mobile is simply marvelous at this price. Very good camera quality, internet speed, apps required for daily purposes. OS is fast, battery life is ok. What else does one expects from a mobile at this price range!!",
            "date": "26 Feb 2015",
            "name": "Hemant Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Order the mobile And get it on hand one day before the expected delivery date. Delivery - ***** (5/5) Packing - ***** (5/5)",
            "date": "26 Feb 2015",
            "name": "Saddam Hussain",
            "stars": "5 stars"
        },
        {
            "comment": "Need improvement in battery. It lasts for 5 to 6 hours if we use 3G. nothing else problem in the handset.",
            "date": "26 Feb 2015",
            "name": "Murali Mohan",
            "stars": "4 stars"
        },
        {
            "comment": "I am not much aware of phones. but as a matter of experience i felt this phone to be upto the mark and satisfactory for the price paid. till now i felt no problem(even no crashing) and works smoothly and fast. lollipop update is awesome.",
            "date": "26 Feb 2015",
            "name": "Ram Narayanan",
            "stars": "4 stars"
        },
        {
            "comment": "Good budget phone. good display. battery not good - does not last full day for average use. My phone had slowed down a bit after using it for 4 months.",
            "date": "26 Feb 2015",
            "name": "Sandeep Mamdapur",
            "stars": "4 stars"
        },
        {
            "comment": "Moto u rockrz...got lollipop n gud phn in 13k nt vry fast 1gb ram..bt gud camera quality n new feature is slow motion camera...new addition..",
            "date": "26 Feb 2015",
            "name": "SOUVIK CHAKRAB...",
            "stars": "5 stars"
        },
        {
            "comment": "This is a great product from Motorola.....i am loving it. Fast processor, great screen and superb battery backup. what else can you ask for ?? Value for money.",
            "date": "26 Feb 2015",
            "name": "Akhilesh Giri",
            "stars": "4 stars"
        },
        {
            "comment": "Perfect at this price... No one can beat Moto G... Great phone... feels like a 20K one.. Pixels are a little less than 1st Gen.. But, overall great experience....",
            "date": "25 Feb 2015",
            "name": "Manhar",
            "stars": "5 stars"
        },
        {
            "comment": "Good product although I am having my fair share of issues because of Android Lollipop upgrade. It freezes but not for long. It only froze once for a really long time. It causes me trouble and it's just been 45-50 days but I feel this is more because of the Android Lollipop upgrade. Otherwise not a very bad phone in the range. Good camera. Battery is just okay. Finger print magnet though. Good display. About sound, it was good then after a while the sound just breaks, causes lot of disturbance when playing on loudspeaker.",
            "date": "25 Feb 2015",
            "name": "Jahnavi Ganguly",
            "stars": "3 stars"
        },
        {
            "comment": "I would recommend not to Buy any products from Flipkart. They are cheaters. I bought a new phone in December. One of the Sim slots is not working. Its not showing the signals. I regret the day I decided to buy a phone from Flipkart. The return period is over now. I have gifted it to my Wife. She started using after one or more months but one of the sim slots is not working fine. I don't understand what is the problem and what to do with it. I am really disappointed.",
            "date": "25 Feb 2015",
            "name": "Gaurav Srivastava",
            "stars": "1 star"
        },
        {
            "comment": "Had kept the mobile in my jeans pocket, just stooped a little to pick up something and the screen cracked. Though this phone is in warranty, this cracked screen costs 7k to replace at the authorised service centre at Andheri (East). Thoroughly dissatisfied with the quality of the product which breaks so easily and also very expensive to get a replacement. Another problem, since I did not have a choice i gave it for repairs, the period to get the replacement is 15 days!!! This is because the Service centre does not have enough stock and requested me to publish everywhere that Motorola sends them enough stock so that they can service easily",
            "date": "25 Feb 2015",
            "name": "Haresh Motwani",
            "stars": "1 star"
        },
        {
            "comment": "Thanks to Flip kart for sending me the right product at the right time as per the order placed.....keep up service congrats....... God speed....",
            "date": "25 Feb 2015",
            "name": "Raja Nadar",
            "stars": "5 stars"
        },
        {
            "comment": "this is my 3 Rd moto g2 in my family one for my brother one for me and one for my cousin.This is an amazing product .Excellent camera.superb voice.great display and in terms of software now it runs on android lollipop 5.0.2.it amaze me every moment.an extremely good phone at this price range.Dont think about it .just go for it. thumbs up for motorola.",
            "date": "25 Feb 2015",
            "name": "BIYAS MUHAMMED",
            "stars": "5 stars"
        },
        {
            "comment": "I like this mobile very much. I am using this more than 4 months. only con is subway surfers lags somewhat. But after getting 5.1 update it is also fixed. Bit some times the mobiles becomes slow",
            "date": "25 Feb 2015",
            "name": "Nithin Chakrav...",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G is doing good since i am using this for the past 5 months. Processor is good, Front Camara peformance is little compromising.but overall it is a good one from Motorola and value for the money. I suggest user can go for it.",
            "date": "25 Feb 2015",
            "name": "Vijayakumar Go...",
            "stars": "4 stars"
        },
        {
            "comment": "Phone works really slow after Lollipop update and after that if you download apps it gets worst even the apps are crashing now. And when you try to return the phone it only gives option for replacement. I dont want replacement as I am going to get the same product so I want my money back.",
            "date": "25 Feb 2015",
            "name": "Anjum Ilahi Sh...",
            "stars": "2 stars"
        },
        {
            "comment": "Overall product is ok..but front he provided two openings for speakers...it doesn't looks good, why they made built in battery don't know, i feel adequate, performance wise excellent",
            "date": "25 Feb 2015",
            "name": "Pradeepkumar acharya",
            "stars": "5 stars"
        },
        {
            "comment": "charge is the main pbl,otherwise everythng is good....................................................................................................",
            "date": "25 Feb 2015",
            "name": "charge problem",
            "stars": "4 stars"
        },
        {
            "comment": "At this price i think this is the best mobile u can get ...................battery is a little problem other than that the only word for this mobile is awesome.......................:) go for it",
            "date": "25 Feb 2015",
            "name": "Nalin Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is perfect. After used phone for two days, I updated it to Lollipop. I love the interface, and lollipop works perfect on this phone.",
            "date": "25 Feb 2015",
            "name": "Sagar Dewang",
            "stars": "5 stars"
        },
        {
            "comment": "worst battery backup not even a single day after full charge. Phone hang after upgrade to Android 5 lollipop version.",
            "date": "25 Feb 2015",
            "name": "nikhil kumar",
            "stars": "1 star"
        },
        {
            "comment": "Phone is working fine but bad earphone and it has not been replaced by seller. First time I have bad experience this time with seller..",
            "date": "25 Feb 2015",
            "name": "Dinesh Kumar Saini",
            "stars": "1 star"
        },
        {
            "comment": "This is a brilliant phone at this price segment complete with all the features that a moden smartphone has. the only drawback that I found was customisable ringtones cannot be set.To me its not that big an issue as most of the times my phone is in a silent mode. ROI is more than 100%.Most of the reviews in other sites complained about the battery performance but for me its quite good as per the current operating statistics of smartphone batteries. Definitely a 5-Star!!!",
            "date": "25 Feb 2015",
            "name": "soumyadip basu",
            "stars": "5 stars"
        },
        {
            "comment": "after updating lollipop having may issue,before it was fine ......camera is good music player not like Sony but cost wise its ok",
            "date": "24 Feb 2015",
            "name": "aravind kumar",
            "stars": "4 stars"
        },
        {
            "comment": "worth its price but battery doesnt go well.... it comes 4 hours atmost when i on my mobile data, worst battery performance , dont buy this phone when u want mobile with long standby ,go for it if u want to use for casual purpose",
            "date": "24 Feb 2015",
            "name": "bilva vyshnav",
            "stars": "4 stars"
        },
        {
            "comment": "Device is good. Better in every major aspects as compared to its competitors. We can get cheaper phones with similar configurations, but you need to put the durability and performance part aside while buying such phones and for sure you will regret it later. Better buy this one from MOTOROLA",
            "date": "24 Feb 2015",
            "name": "Rakhu singh",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased this item in September and now I need to do charging in every 2 hours.It is getting discharged.Worst experience.Will not recommend this item to anyone.",
            "date": "24 Feb 2015",
            "name": "Swati Gupta",
            "stars": "1 star"
        },
        {
            "comment": "no 1 phone at this price similar of other brands.there are no heating problem.there are no speaker problem.the dual speakers have very good sound quality.camara result is very nice.you can take cool selfies using front camara.its 2mp but result like 5mp.and back camara 8mp is also very good.display is so nice and corning with gorrila glass.but there is 1 day battery life.very nice phone.",
            "date": "24 Feb 2015",
            "name": "kp",
            "stars": "5 stars"
        },
        {
            "comment": "After all my research and patience ,I finally bought this phone and its a fantastic deal ,over all it is one of the best phone in market as looking on brand and features but still one thing i noticed which i didn't like is the location of sensor.After long use the sensor heats up combining with the speaker and irritates while a phone call is active.",
            "date": "24 Feb 2015",
            "name": "Shashank Dhavan",
            "stars": "5 stars"
        },
        {
            "comment": "Its good in performance but thickness is more than to compare to other smartphones,,,,,,,,,, Thank u Abhishek A.K",
            "date": "24 Feb 2015",
            "name": "Abhishek A.K",
            "stars": "3 stars"
        },
        {
            "comment": "nice cell ................................................................................................................................................................................................",
            "date": "24 Feb 2015",
            "name": "nitin videkar",
            "stars": "5 stars"
        },
        {
            "comment": "Go ahead with Moto G... Genuine phone with USA technology rather use any CHINESE manufacturing at lower cost.",
            "date": "24 Feb 2015",
            "name": "Vikram Kanyal",
            "stars": "5 stars"
        },
        {
            "comment": "This ph is very good set others of them....Because its price so cheap....Overall I am satisfy for this mobile set....... Only one thing I am not satisfied the charging backup of this pH...",
            "date": "24 Feb 2015",
            "name": "SAHEB HALDER",
            "stars": "5 stars"
        },
        {
            "comment": "using this cellphone from last five months . . bought it on kitkat but now it is on lollipop 5.0.2, works smoothly . . . multitasking is easy n friendly . . nice battery backup , improved after lollipop! screen on Time of 5.5hr+ nice screen size is also great . . earlier i used mot g 1st gen . then i upgraded to 2nd gen . pixel density was little better in 1st gen. sound quality on stereo speakers is also nice . . in starting the sound was cracking . but after playback of 50hrs, they are soft and clearer . i was confused with this fone and grand 2 . . but i found this better as for fastest android updates . . grand 2 is still on kitkat. camera is also awesome on this phone.",
            "date": "24 Feb 2015",
            "name": "Alok Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "It was nice experience again with motorola and flipkart. flipkart once delivered faulty product but they replaced it within 5 days. Product is awesome with so many advanced features with lollipop update. Lollipop update works very well, Experiencing awesomeness. ***Design material and plastic quality is not good. that's why I'm giving it 4 stars. Faster delivery by flipkart.",
            "date": "24 Feb 2015",
            "name": "Om Yadav",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is amazing. The Moto Assist feature is very good as it lets you transfer all the data in your phone including Call Logs, Gallery etc to the new phone almost immediately. The phone is in the second day of its use and it has been extensively used on day one yet the battery holds up for more than 24hours of Whatsapp, Facebook and emails. The front camera is very good and the LED flash very handy. Overall a very good phone int he budget given.",
            "date": "24 Feb 2015",
            "name": "Achuthan Chari",
            "stars": "5 stars"
        },
        {
            "comment": "Really no words!! its worthy more than the price. Nice graphics, lag free gaming, updated to LP. 100% satisfied.",
            "date": "24 Feb 2015",
            "name": "Ani",
            "stars": "5 stars"
        },
        {
            "comment": "The performance was acceptable and all was well for 30 days. I upgraded to lollipop. But kitkat is good while compared with lollipop.",
            "date": "24 Feb 2015",
            "name": "Viswam Mamilla",
            "stars": "5 stars"
        },
        {
            "comment": "After upgrade of the android version lollipop its not working properly. Just buying after one month the mobile is hanging. Shifting of one app to another is taking a long time. Its been the same with many of my friends. I want to ask is it possible to get the previous android version kit kat in our mobiles? The delivery of flipkart was good and we got in time.",
            "date": "24 Feb 2015",
            "name": "A Ravindra Seshu",
            "stars": "1 star"
        },
        {
            "comment": "I don't want to comment on the product Moto G (Gen 2) as you all already know about it as an excellent phone at this price. I would have given 5 ratings if Flipkart had delivered the product in good condition at first time however when I received it for the first time, it had a dark blue spot on top left corner of the screen which can easily be visible in the light color background. I requested the replacement and as I mentioned Flipkart is best in its services, they have replaced my phone with the new one using fast delivery services. Thanks to FLipkart.",
            "date": "24 Feb 2015",
            "name": "Vivek Tamrakar",
            "stars": "4 stars"
        },
        {
            "comment": "This won't be a phone that you fall hard and fast for. It won't sweep you off your feet, nor will it dazzle you with a slew of whizbang features. That's just fine, though. Because none of that changes the fact that the Moto G is still the best budget smartphone you can buy today. Using the thing isn't as revelatory an experience as firing up the new Moto X was, but Motorola's long list of seemingly modest improvements",
            "date": "24 Feb 2015",
            "name": "Satish kevin",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart service for maintenance is POOR, no warranty for Liquid/physical damage which other wise provided for these kind of expensive phone. They will not hesitate to embarrass their customer when you got to exchange the product with the other one. Pathetic policies will raise your blood into head, hope you dont stuck by buying from flipkart.",
            "date": "24 Feb 2015",
            "name": "Aashish Malik",
            "stars": "1 star"
        },
        {
            "comment": "Phone performance was good. But i got a phone with cracked display..but i got it replaced from flipkart soon.. now the replaced phone is showing much issues than the previous one. it gets over heated just after taking 5 snaps and also battery backup is poor. The previous one didnt have that prob. Flipkart also rejected the return request for this phone",
            "date": "24 Feb 2015",
            "name": "Aravindp",
            "stars": "1 star"
        },
        {
            "comment": "its delivery is like a rocket speed only take 2 days to reach kerala and its a very nice mobile from motorola",
            "date": "24 Feb 2015",
            "name": "Shaji V",
            "stars": "5 stars"
        },
        {
            "comment": "Usage : Not for games , general apps . Pros : Really fast , nice battery ( I am surprise it lasted for 3 days - with lite use) . Lollipo installed (this is awesome) , The motorola team is kept by Google R&D after its takeover (not handed to Lenovo) so expected to have fastest update later on as well . Absolutely no heating. Cons: Covers are damn expensive ( gun without bullet), no nice music player , headphone are not great. Lookout for market ,Samsung is gaining in with its price cut. Motorola is likely to do the same. See if you can wait for it.",
            "date": "24 Feb 2015",
            "name": "Shatri",
            "stars": "5 stars"
        },
        {
            "comment": "Looks ...nice Performance ...very good Battery...Last a day with internet on for whole day Price ...A bit overpriced..should be around 10000...",
            "date": "24 Feb 2015",
            "name": "Devendra",
            "stars": "4 stars"
        },
        {
            "comment": "This smartphone is superb ... and feels soooo good in hands and also makes you updated with every version like it has got the lollipop version camera is super good when using Google camera app ... sound quality awesome becoz of the front speakers best buy smartphone",
            "date": "24 Feb 2015",
            "name": "Sumit Kumar Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "looks good super performance but getting slow day by day",
            "date": "23 Feb 2015",
            "name": "Mohan R moha s...",
            "stars": "2 stars"
        },
        {
            "comment": "In Pricing also cheaper,Very Fast Phone & Equal Apple.In this price any phones not equal Moto G (2nd Gen)",
            "date": "23 Feb 2015",
            "name": "G.Earanna",
            "stars": "5 stars"
        },
        {
            "comment": "I will not go in details about the phone. but i must say it is a superb phone and that too at this price. I had a little doubt when buying this phone. No doubt Motorola is a brand name. But since it looses it existence from last so many years. But, Motorola again proved that\"better late than never\".",
            "date": "23 Feb 2015",
            "name": "Robin",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased this phone for my mom, who's migrating from a Windows Phone (Lumia 725). Moto G is a pretty neat device, and the Lollipop update was very fast (less than 5 minutes to download and another 10-odd minutes to install). The phone holds up very well against Lollipop, the touch is pretty responsive and the display is genuinely nice. The stock Anroid with next to nothing third-party apps helps the phone significantly compared to other devices available in this price range. My only fear -- and piece of criticism -- is the back cover. It's a task to open the back panel and insert the memory and sim cards, even though the manual says \"don't be afraid to use a little muscle\" All in all, you've a happy customer.",
            "date": "23 Feb 2015",
            "name": "Chetan Kapoor",
            "stars": "4 stars"
        },
        {
            "comment": "This product is very good considering its price. The overall performance is smooth, touch is awesome and so as the looks. Another good point is Camera. If you are looking for a smartphone from a reliable brand within 15k , this is your best bet.",
            "date": "23 Feb 2015",
            "name": "Sayantan Bhatt...",
            "stars": "5 stars"
        },
        {
            "comment": "was in the market for a mobile and i shortlisted this one pros big screen, good cameras front and rear , latest android updates , price cons battery life is not that good ( but its the prob wid all smatphones ) sometimes processor and ram are not enough wen ur doing heavy multi tasking all in all i will recomend this to evryone whois in market for a phone within the range of 15 k",
            "date": "23 Feb 2015",
            "name": "Sujay Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "I have brought this phone on valentines day! The phone specs are great. I got the phone with the lollippop updated. Few issues I see: The battery gets heated up with minimal usage of browsing or music or watching videos on youtube. The phone screen gets blinked off in between any other activity. Like in mid of texting, the screen blinks off all of a sudden.I learnt that after a power restart, it works fine temporarily. But not sure of permanent solution. In mid of texting, when I got calls, I was not able to answer them, but after restart, it worked fine. The phone freezes at times. Not sure why this happens. Charging takes quite a long time.",
            "date": "23 Feb 2015",
            "name": "SRICHANDANA Y",
            "stars": "2 stars"
        },
        {
            "comment": "Mobile is awesome in the given price band. no issues with screen battery life is goood and handy white color is best for this model screen is awesome",
            "date": "23 Feb 2015",
            "name": "Shreehari",
            "stars": "4 stars"
        },
        {
            "comment": "its been just 5 months and my phones charger has stopped working properly. Whenever any phone is connected to the charger, random applications start opening on phones screen.",
            "date": "23 Feb 2015",
            "name": "rahul",
            "stars": "1 star"
        },
        {
            "comment": "i am using this mobile gently for one month and now am getting noise disturbance in both call and loudspeakers..i am really disappointed with this mobile now.",
            "date": "23 Feb 2015",
            "name": "marimuthu",
            "stars": "1 star"
        },
        {
            "comment": "Nice product at this price range...But it's speaker is not good.it cracks at high volume...sometimes, app closes itself...and music player turn off itself...",
            "date": "23 Feb 2015",
            "name": "Praveenkumar S",
            "stars": "5 stars"
        },
        {
            "comment": "whn i buy dis phone the OS was kitkat.It was awesome and the processor is super fast...i loved both the hardware and the software,also the buit quality....the camera in dis is phone is sooo cool...everythg was perfect...till i update my phone with new lollypop...After updating my phone it looks queit good .The appearance is good after that when i start using my phone the real problem has started....The phone become tooo slow...befor updating the multi tasking is quit decent.bt aftr updating my phone it is hanging all the time....and the main problem is i cant even make a call....the call log is too slow...to much hang..and if i make a call it wil start hanging and its very much annoying. The update have too much bugs,apps are crashing all the time,update hit the performace of the phone. Now the performace is too bad and finally about the battery consumption, update is drink the charge of the battery due to the new animation style and othr things... Over all the lollypop update made a Great phone into a worst piece of plastic nd metal",
            "date": "23 Feb 2015",
            "name": "mohamed rafi",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the G2 based upon other's review here at flipkart.com plus my experience with a Motorola Razor (many years ago). My BB Curve 9220 was malfunctioning so I decided to switch over to Moto G2. While it's Android base provides a lot of cool features and apps, I am not happy with it's performance as a phone; it's primary function. Compared to my user experience with BB 9220: (a) it takes longer to complete calls, (annoying) (b) call drops are frequent, (very annoying), (c) it needs to be recharged* every day if you have Mobile Data ON (d) upgrade to Android 5.0.2 has worsened my user experience. *my calling pattern is light. In retrospect, I should have gotten the BB 9220 repaired for Rs. 450 and saved myself Rs. 12549. Spend your hard earned money on other worthwhile things.",
            "date": "23 Feb 2015",
            "name": "Arun Khan",
            "stars": "1 star"
        },
        {
            "comment": "The moto G improves on what its preessor lacked;a micro SD card slot,beautiful 5\" inch display and 8MP camera . Pros -5\" display -front speakers are loud n clear -no network or call drops -8MP camera takes amazing pictures when HDR mode is on -micro SD slot up to 32gb Con's -there were no con's in the device whatsoever but the charger shipped with this phone heats up like a molten rock. And battery performance is average",
            "date": "23 Feb 2015",
            "name": "mashooq s jain",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Fantastic s/w & hardware Latest OS updates from google Cons: A little poor battery performance All in all a fantastic phone",
            "date": "23 Feb 2015",
            "name": "Nishant",
            "stars": "4 stars"
        },
        {
            "comment": "battery standby time is very less (Not even a day) Display issue (showing multiple screens and images at times)",
            "date": "23 Feb 2015",
            "name": "Arun Ramji",
            "stars": "2 stars"
        },
        {
            "comment": "so many people have asked me if its a moto x. its a very pleasant phone. the update made the phone to lag a bit. theres not a lot of issues to complain about except for the battery. you will not get a full day on an average use. but the feel of the phone, the clarity, the sound, all top notch! motorola is making the game very difficult for its competitors.",
            "date": "23 Feb 2015",
            "name": "sachith vijay",
            "stars": "4 stars"
        },
        {
            "comment": "This phone does a bit of everything. Pros: very fast excellent UI, fluid speakers are good enough. Pocketable and fits in one hand easily. Looks excellent Cons: Camera not up to the mark. lil bulky and fat. takes 5 hrs to charge Batterylife not as expected. last only from morning to evening. after updating to Android L the battery back up has improved very much. 1 and half days now. 1 gb ram runs smoothly without lag. Moto rocks when i comes to soft ware tweaks. all in all good VFM product.. go for it without any second thought... I did... :-)",
            "date": "23 Feb 2015",
            "name": "Raju Malgari",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is a good handset. But the charger is faulty. I have to charge the handset using my htc charger, since the charger shipped with MotoG does not work. It does not charge the mobile at all.",
            "date": "23 Feb 2015",
            "name": "Arnab Das",
            "stars": "1 star"
        },
        {
            "comment": "The Moto G2 is a good cell phone but the battery does not last long. I feel it same as Samsung in terms of battery back up. Battery should last longer. It drops fastly once you browse internet even for 15 minutes.",
            "date": "23 Feb 2015",
            "name": "Diwakar Labh",
            "stars": "3 stars"
        },
        {
            "comment": "its been almost 6 month i am using this phone no issues so far , and flipkart services aloso good..........................................................................................................",
            "date": "23 Feb 2015",
            "name": "Amit",
            "stars": "5 stars"
        },
        {
            "comment": "First thing is that flipkart already upgraded my Motorola moto g 2nd gen to Android Lollipop 5.0.2 . It's android version is not KitKat 4.4.4. But KitKat was Far better than Lollipop.",
            "date": "23 Feb 2015",
            "name": "Gurkanwal Singh",
            "stars": "5 stars"
        },
        {
            "comment": "i am writting this review after using this phone for more then 6-8 months and i can say it has satisfied me fully. only android phone that draws my attention. its main usp us that it comes with almost no bloatware no adwares and just pure android exp. about the hardware, the display screen is best used inside out in sun its tough to read or to use it conveniently, Lumia phones scores in that big time. otherwise a good phone, recommended for pure android experience and good value for ur well earned money. dont go for other cheap phones and have this instead.",
            "date": "23 Feb 2015",
            "name": "Ashutosh Shilu",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this smartphone since last four months, till now no hanging problem, camera, speed, screen sharpness all is excellent.every thing OK ,paisa vasul phone...",
            "date": "23 Feb 2015",
            "name": "Vinay Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "replaced touch screen due to touch un-responsiveness and now there is blue smog on my replaced screen.",
            "date": "23 Feb 2015",
            "name": "kasim khan",
            "stars": "1 star"
        },
        {
            "comment": "Hello Reader / Prospective buyer, I got the product with 4.4.2 Android Kitkat out of the box and now have upgraded to Android 5.0 Lollipop. So here's my review. Pros: Excellent working interface, no lag whatsoever, with fantastic video output and playback. The camera is truly beautiful, considering the price tag. The update to Android 5.0 lollipop was also seamless absolutely hassle-free. Decent battery backup, considering you are just using the device for phone, watsapp and some occasional video purposes. It can last without any problem for atleast 24 hours on a single charge. Cons: There was no USB cable in the box, which was a surprise!! Guys please include one. Hope the review helps.",
            "date": "22 Feb 2015",
            "name": "Jaideep Ganguly",
            "stars": "4 stars"
        },
        {
            "comment": "I got this phone before one week.. First of all i would like to thank flipkart for the excellent service and delivery. About the phone it has all the features which i wanted and it is amazing for such a price.",
            "date": "22 Feb 2015",
            "name": "Burhanudeen Syed",
            "stars": "4 stars"
        },
        {
            "comment": "Phone working nice featues are great but battery backup is WORST. Always bothering about cell charging. if motorola provide any replacement offer i will change it immediately. Hope they will provide exchange offer.",
            "date": "22 Feb 2015",
            "name": "Kamal Hussain...",
            "stars": "3 stars"
        },
        {
            "comment": "Battery is the only issue here,it takes quite long time to full charge on the battery.As per comparison to asus its far better also better than microsoft 535,look wise sexy black beauty.If you have around 12 k budget go for it or less than 10 k go for microsoft",
            "date": "22 Feb 2015",
            "name": "Mayukh Mallick",
            "stars": "5 stars"
        },
        {
            "comment": "Got a MOTO-G-2nd Gen today from flipkart with Lollipop preinstalled, is this normal? or did i just got a refirbished phone? Cuz yesterday a friend of mine got the same device, however with Kitkat installed..I want to know whether i got a new device or the flipkart is deceiving its customer by handing out refurbished phones.",
            "date": "22 Feb 2015",
            "name": "Talha Jilani",
            "stars": "1 star"
        },
        {
            "comment": "Phone is not Bad.But the call recording feature is not exists in this mobile and other thing is with out internet it will be difficult to get the gallery photos from the internal memory.Except this two things phone is good for calls,chatting,social networking,camera quality and video recroding functionalites.",
            "date": "22 Feb 2015",
            "name": "Kola Balaji",
            "stars": "3 stars"
        },
        {
            "comment": "I VERY RECENTLY BOUGHT moto g. IT HAS BEEN A DISAPPOINTING EXPERIENCE. THE BATTERY GETS DISCHARGED IN A DAYS TIME DESPITE OF BEING VERY LITTLE USE. Whats App DOES NOT WORK. I DON'T KNOW WHOM TO TURN TO FOR HELP. I AM VERY DISAPPOINTED. WISH I HAD BOUGHT IT FROM THE STORE WHO WOULD HAVE ATTENDED TO MY PROBLEM. IN FUTURE I SHALL THINK MANY TIMES BEFORE I BUY ANY PRODUCT ON LINE.",
            "date": "22 Feb 2015",
            "name": "V K BERI",
            "stars": "1 star"
        },
        {
            "comment": "Ordered moto g 2nd gen from flipkart. Recd product with in 48 hours. nice service. MOto g 2nd gen gives nice exoerience on touch quality. I am facing occassional problems during charging . Also mob gets heated after prolongeed use for games or calling. overall nice experience,.",
            "date": "22 Feb 2015",
            "name": "p sheth",
            "stars": "4 stars"
        },
        {
            "comment": "Decent phone, nice display, good to hold, good sound clarity, great camera with slow motion video. Lots of memory. With lolipop update its really good. except the performance lags at times with more apps installed. and also higher Sar value,",
            "date": "22 Feb 2015",
            "name": "Pramood Sarathy",
            "stars": "4 stars"
        },
        {
            "comment": "Well, finally I got my Moto G 2nd Gen. After a lot of confusion between some really good phones within the same range made it even more difficult to choose this one. Flipkart delivered the product in a day as promised in good packaging. There are a lot of videos over the internet which tell that Moto G first variant is far better than this one in terms of build quality, display and sound, I negate these claims. The display ppi might be less than moto g 1st gen, it's still awesome in this one and the colors look bright and natural. Just loving it. Specs are already good and the feeling of Stock Android is just brilliant. I still did not upgraded it to Android L as I want to play with kitkat for sometime, but an upgrade to Android L would be better for sure as the new android version has performance upgrades as it has new 64-bit compiler. Camera is great for this price (8 MP), still not as good as lumia 730, but its too good for a normal user. The performance of the phone is awesome and even installing so many apps, no issue in the usage. Its been one day, and due to heavy usage, the phone lasted for 16 hours, with 14 % still remaining. I had ordered a Black Moto G and surprisingly, I got white ear phones and charger which I expected to be in black colors. The sad part is, no usb cable is provided along with the phone. Will update more soon after using it for a few more days.",
            "date": "22 Feb 2015",
            "name": "Shival Srivastav",
            "stars": "4 stars"
        },
        {
            "comment": "this pone can give you such elegant features that you get in some of the very expensive phones. the look touch feel is really classy, above expectation! but dude, camera needs to be improved significantly! Do get original Moto cover! must!",
            "date": "22 Feb 2015",
            "name": "Aditya Joshi",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered this on 19 feb and surprisingly got it within two days . Flipkart is best ! About the phone you all know :D",
            "date": "22 Feb 2015",
            "name": "Rahul Verma",
            "stars": "5 stars"
        },
        {
            "comment": "All the features in one device for a lower price . simply awesome!! no problem since the last 3 months",
            "date": "22 Feb 2015",
            "name": "Avinash Mulki",
            "stars": "4 stars"
        },
        {
            "comment": "good strong processing power & stereo speakers, everything works build quality is satisfactory only, did not like the power and volume rocker made of very poor quality metal/alloy nothing exciting about the phone sadly",
            "date": "22 Feb 2015",
            "name": "dk",
            "stars": "3 stars"
        },
        {
            "comment": "Seriously A Sexiest phone at this price range. Can definitely buy this if you need a Mid-Range phone. Even Flipkart's service is Cool! I bought it in EMI plan. I don't know how to express!! At this price range, out off all Smartphones, This is The Best ever!!!",
            "date": "22 Feb 2015",
            "name": "P Pandu",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered this item and got it within 1 day. Awesome product. I am really so very happy. It was a gift for my brother. He is very happy after getting it. Only bad thing about the product is it won't come with USB or data cable. You have to buy one seperately, otherwise it's just amazing!! 5 star for the product and the seller.",
            "date": "22 Feb 2015",
            "name": "Sayantani Ch",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Flipkart!! It was a nice experience buying my Moto G2 with Flipkart. You guys are the best, but the Airtel 2 months 3G net offer that you have mentioned is not been given by the Airtel. They gave me that offer for the first month and when i asked about the second month they refused to give me the offer saying that i am not eligible for that offer. They blame flipkart for not giving the offer in the second month. Can you guys do some thing about this please.",
            "date": "22 Feb 2015",
            "name": "Mahesh P",
            "stars": "5 stars"
        },
        {
            "comment": "amazing delivery. This is my first Android phone after my iphone, so im still exploring the device. Coming to the delivery, flipkart does a very decent job they delivered the phone on the next day. Camera: Does a decent job in indoor and outdoor. Voice quality is very good. But i'm worried about only the signal catching. my Samsung and iphone is showing up good signal strength. Found one issue after the factory default reset. the keyboard is not working as expected. but after a reboot everything works perfect. The wall charging unit provided by Moto is heating like anything. so im using another wall charger.",
            "date": "22 Feb 2015",
            "name": "ABIN THOMAS",
            "stars": "4 stars"
        },
        {
            "comment": "Shall post more review after proper usage in a week. Here are my reviews 1. 5 inch easy to handle with Single hand 2. Cameras (Front and Back) and Stereo impressed me 3. Zero Lag. 4. Brilliant Display 5, OS- Waiting for Android L update 6. Expandable memory - Additional advantage 7. Battery Life is longer than Moto g. Finally 2 words \"Simply SUPERB\"",
            "date": "22 Feb 2015",
            "name": "ABIN THOMAS",
            "stars": "4 stars"
        },
        {
            "comment": "It was laggy but after the lollipop update its fast. Camera is very good. Only problem is that is get scratch. Did Not expect from gorilla glass.",
            "date": "22 Feb 2015",
            "name": "Subham Singh",
            "stars": "5 stars"
        },
        {
            "comment": "i ordered it because i wanted a budget phone.but after a v long wait flipkart has sent a defective piece which made me completely dissatisfied.the basic function of the phone that is speaker was defective n whenever i made or receive call i cudnt hear.it was completly mood off for me as the very moment i got it i felt it to throw back as i cudnt hear.when i just wanted 2 return,flipkart dint agree for that n askd for replacement.n the hell of formalities start now for replacement.the effort i took to replace was just un imaginable because flipkart never responded on time nor agreed for return n made to wait whenever i called.if at all there is no return then flipkart please dont sell defective ones or dont mention it for return.after long long time without a phone ,returning this n waiting patiently that atleast the 2nd one must not b defective ,lastly i got another piece .so for this trouble i would have rated zero star but 3 stars go 2 ths as rt nw m using this n satisfied bcz its worth at ths rate.i just hope i shdnt get any problem in future.n guys wanna let u know few more things that is the charger just gets heated up soon n also the screen touch stopped responding once.the other thing which i dint like is one cant peronalize ringtones in this.e have to download a file manager .battery is overall good.it drains fast when we use camera.n the only irritating feature is auto predictive text while msgng.guys plz help me out if u know how to disable it because i dnt find any such option.rest of the features r good .so before buying just make sure of defective pieces bcz not only me some of frnds too had few techinical issues.",
            "date": "22 Feb 2015",
            "name": "Dr.Humera Naaz",
            "stars": "3 stars"
        },
        {
            "comment": "I just wanted to know if SanDisk MicroSD Card 32 GB Class 10 Ultra works in this particular model or do we have to go with the normal (non-ultra model)? Please clarify.",
            "date": "22 Feb 2015",
            "name": "Sattwik Sahoo",
            "stars": "5 stars"
        },
        {
            "comment": "Amazing phone to buy really it is Exceptional phone at Exceptional price.Awesome camera amazing sound quality fast processor for playing heavy graphic games HD display to watch movies.Ultimate feather touch.And the main thing is it has dual speakers in front which is best in playing games and watching movies.Unbelievable phone at unbelievable price.Most amazing thing now ANDROID LOLIPOP 5.0.1 is available in this phone.Wowww you can't get phone like this at this price.And MOTO is U.S. company its not Chinese.This phone can compete iphone 6 and I think its better then iphone 6.",
            "date": "22 Feb 2015",
            "name": "Nikhil Sachdeva",
            "stars": "5 stars"
        },
        {
            "comment": "in less price compare to other ....................................................................................................................................................................................................................................................",
            "date": "22 Feb 2015",
            "name": "ashwin kashyap",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart Service awesome as usual. Earphones, received defective since day 1. Most of the times the phone doesn't detect earphones and sounds still play on loudspeaker after connecting them. Even if you manage to somehow adjust it to work, just touch the pin or even the cable and BAM!!! Gone again! Will have to go through the pains of going to the Customer Care and get them replaced I suppose. The phone worked just fine with KitKat though shortcuts not so wisely chosen I'd say. And then came the biggest nightmare, Android L. It will be better than KitKat in future may be. But right now, its JUST NOT READY. Google should not have released it if it wasn't ready. So full of bugs, shortcuts and usage-wise dumber than ever. Here's a list of bugs or things I didn't like. The list is by no means exhaustive ;) There is NO \"Silent Mode\" it seems. The moment you turn the volume down, it will vibrate no matter what you settings are. It has a notification panel like usual, but still shows new notifications as popups at the top and couldn't find a way to disable it. If you want to toggle mobile data, you have to at least make 4 touches. Tried a few apps for shortcuts but the data toggle didn't seem to work. Google Now launcher simply looks \"UGLY\". The notification pull down is refreshing with a whole new transparent look but the moment you open app drawer, its got this white background with ugly big icons as if you've installed Windows on PC but forgot to install Video drivers. Weird! Battery graph makes it more difficult to understand how long it has been since last charge. When you press on the \"Phone\" icon, it takes considerable time to open up. Even if it doesn't, place a call from there to the last number or from Recents menu you'll notice a clear delay. Long touch the power button and the only option you get is Power Off. Not even restart, or sound profiles or anything. And it doesn't even ask for confirmation when you touch Power Off. Many animations are not smooth and clearly lag. For instance, the one when you close the app drawer. Lockscreen shortcuts cannot be customized anymore. It gives only 2 shortcuts by default, camera and phone. Now, a few icons and apps they've really changed to suit the new material design concept but the default sms app still has the same old icon which feels like the odd man out ;-) There are many more bugs which I couldn't think of while typing this review. In short, Android L is UNFINISHED. Yes, I did try factory reset too. Still no bugs solved. In fact, doesn't even ask for code or anything during factory reset also. So basically anyone who gets hold of my device can reset my phone. Wow! So useful! I personally didn't even like the new look much. I prefer the good old KitKat, but that's something which really depends on individual tastes.",
            "date": "22 Feb 2015",
            "name": "Ankur Jain",
            "stars": "1 star"
        },
        {
            "comment": "The Best Budget Phone @Rs.13000. No comments in any aspect .........................................................................",
            "date": "22 Feb 2015",
            "name": "Manikanta",
            "stars": "4 stars"
        },
        {
            "comment": "Guys firstly the screen resolution is very bad. Colors look faded. Secondly the screen glass is brittle. My phone fell from 3 feet height and the screen cracked. And shocking thing is that the screen replacement costs Rs. 7000 which is unbelievable. Plus you need to deposit the phone in service center for 20 days for getting screen replacement. Plz avoid this phone.",
            "date": "21 Feb 2015",
            "name": "Rajiv Nagpal",
            "stars": "2 stars"
        },
        {
            "comment": "although the performance of this phone rocks on but there a fake thing about this phone it isn't \"water resistant\"....!!!!! mine got wet due to water the other hour i visited service center and they are refusing to repair my ,mobile and if i wish ill need 6k or more to get it repaired.... never expected such a creepy service moto n will never recommend it to anyone from now onwards minimum one star or else i would have given it only a quatre star and that for just its looks... :(",
            "date": "21 Feb 2015",
            "name": "akshay jaiswal",
            "stars": "1 star"
        },
        {
            "comment": "Spec wise its great and as good as my old nexus 4., Once device got stuck in Bootup logo, need to clear userdata and do a facotry reset myself., works fine since then..",
            "date": "21 Feb 2015",
            "name": "Devaraj Rangasamy",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone in this price range. I have been using this phone for 5 months now, never faced any problem so far.",
            "date": "21 Feb 2015",
            "name": "Mrinal Utkarsh",
            "stars": "5 stars"
        },
        {
            "comment": "Wow! Superb product with affordable price from motorola. Feels like handling a high end phone... Don't think very much to buy this phone.. This mobile satisfies you a lot...",
            "date": "21 Feb 2015",
            "name": "Dinesh Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "8 MP is good but primary 2MP is avg. 12Gb+ 32Gb(external) + Otg(USB) features are good I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest Adv. Con's Some times phone heats up like a molten rock. And battery performance is average Overall very much satisfied with this phone for a price of Rs 12,999/-",
            "date": "21 Feb 2015",
            "name": "palak ariwala",
            "stars": "4 stars"
        },
        {
            "comment": "About the product: Its good in 13k. But most of the things you have to do is by third party app. If you need any help Go to- Motorola.in-contact us-support and there you can chat online to the assistant of motorola. Lollipop is awesome with 2 or 3 difficulties. If you want to share via wifi direct then you need a third party app. About the Seller: It was good to deal with WS Retail cause I blindly trust on this seller :) But due to some mistake I got the defective piece and its about the battery. Today I got the replacement product. Hope It will work fine in future.",
            "date": "21 Feb 2015",
            "name": "HARSH GAHLOT",
            "stars": "3 stars"
        },
        {
            "comment": "Everybody knows about this product so nothing much to say about the product. Also people will come and buy the mobile after lot of analysis so not writing much. Look at your budget if it matches go for this.",
            "date": "21 Feb 2015",
            "name": "Asheej T K",
            "stars": "5 stars"
        },
        {
            "comment": "battery cannot be removed, no usb cable, battery is not so immpressive, rest is ok battery cannot be removed, no usb cable, battery is not so immpressive, rest is ok",
            "date": "21 Feb 2015",
            "name": "bharath k",
            "stars": "3 stars"
        },
        {
            "comment": "A phone this good for such a price is rare...I had bought this phone 6 months ago and it still rocks doesn't lag at all load it with apps but it won't lag besides this the performance of the phone is amazing be it the gaming,the camera both front and rear, the speakers are really epic in fact anything is cool.the phone doesn't heat that much no how demanding the games are beside that the design of the phone the weight the display is almost so perfect its like a mini nexus 5 and with the lollipop update now available the phone even looks and feels different an powerful",
            "date": "21 Feb 2015",
            "name": "Bikiran",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I purchased MOTO 2G on 21st Jan 2015, when iam using mobile by accidently felt it in water suddenly i took out side and removed the water after 2 hours phone got switched off . and when i went to service center they said Board has gove so you have to pay Rs.7000/-. So i lost 13K in 1 month and comany said 1 year guarantee and now they are saying for phusical no guarantee. I Used Sony, Samsung and Nokia Never got disappointment like this earelier.",
            "date": "21 Feb 2015",
            "name": "Venu Gopal",
            "stars": "1 star"
        },
        {
            "comment": "i am happy to buy this mble. good quality and awesome performance... fast delivery... mobile finishing is damn gud.... and handy adaptable design.. display resolution is excellent experience... camera is better but not good... but its worth price....",
            "date": "21 Feb 2015",
            "name": "Malik Samy",
            "stars": "5 stars"
        },
        {
            "comment": "my faulty product pickup was done on 5th Feb, and refund status is showing successful from 9th Feb 2015, but still i have not got refund amount",
            "date": "21 Feb 2015",
            "name": "Nitin Kadam",
            "stars": "1 star"
        },
        {
            "comment": "Have bought 6 units over the last 4 months time. The units are good, delivery was prompt. Only one unit was defective, which flipkart replaced in 48hrs of booking for replacement. Good specs at the least price. for those who have limited budget this is the model..Grab it",
            "date": "21 Feb 2015",
            "name": "Sredhar",
            "stars": "4 stars"
        },
        {
            "comment": "trust me guys.... buying dis moto gen 2... ... is wastage of money... ... cons.. 1. battery backup is poor. 2.take 2-3 hr for full charged. 3.flash light is not good. 4.camera pic.quality is average.",
            "date": "21 Feb 2015",
            "name": "amarjeet singh...",
            "stars": "1 star"
        },
        {
            "comment": "Ordered moto g2 white & received in black, screen guard also tampered. now they say they will replace.......just waiting.....will write annother review if all ends well",
            "date": "21 Feb 2015",
            "name": "ANUJ BHARDWAJ",
            "stars": "1 star"
        },
        {
            "comment": "i like this phone very much. I got this by exchanging the old phone. and also 3g plan for two months.......................................................................",
            "date": "21 Feb 2015",
            "name": "Mahendra Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Must purchase if you are looking for Latest android updates, bcoz other smartphones in this range are better but wont get latest updates. Pros : Camera is best. Lollipop Update makes it better Super Capacitive touch screen Cons : Doesnt have a Full HD display Music output is just loud with no beats.",
            "date": "21 Feb 2015",
            "name": "Shekhar S K",
            "stars": "4 stars"
        },
        {
            "comment": "good one in this range video quality also awesome with 8mp good one for replacement i m using moto g nice one product after all a long time i like this set",
            "date": "21 Feb 2015",
            "name": "Naveen Prakash",
            "stars": "4 stars"
        },
        {
            "comment": "Using since past 4 month, great product gives u every thing u expect form a mid range device, But there are some bugs which need to be fixed in Lollipop update",
            "date": "21 Feb 2015",
            "name": "Dilip Varma",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product before 2 months Dec 2014. Now In that dual sim slot 1 is not working . I went to Authorised Motorola Service Centre, They have not responded properly . They said This product was not under warranty so need to pay Rs.1800/-. Such a worst Service Centre i have never even seen .",
            "date": "21 Feb 2015",
            "name": "R.PRABHAGARAN",
            "stars": "1 star"
        },
        {
            "comment": "Over all.. its the best with the screen size and price.. gr8 design.........................................",
            "date": "21 Feb 2015",
            "name": "Zachariah Varg...",
            "stars": "5 stars"
        },
        {
            "comment": "It is worth its price with all quality hardware. Much juice for whole day work. Qualcomm chipset for more than average user. Sharp Display. Looks Glossy. Wonderful sound output with clear notes and specific bass. Camera does wonders in daylight but decent in dim or diffused light. Good phone with timely updates. It also looks a qulity product when used. Quality seekers can go for it.",
            "date": "21 Feb 2015",
            "name": "Shashank Tripathi",
            "stars": "4 stars"
        },
        {
            "comment": "My Experience with the phone so far has been neutral after much hyped reviews and youtube videos. 1.The product arrived in 2 days flat which is the best thing and saved me 90 bux for a faster delivery which would also taken the same time for delivery as per my pin-code. 2.The phones looks are nice and is it bit bulky than what expected. 3.The side buttons on the right are so plasticky that gives a bad look I expected chrome ones which would have given edge of style. 4.Android Lollipop isn't that good and I guess there is a flaw in it when at times it storing names on the address book shoots with an msg and also when u try to put the phone on silent via pressing the power buttons till silent doesn't appear on bottom,it doesn't show so that's a flaw. 5.The Battery of the phone is biggest disappointing factor and takes 4 long hours to charge which will put my previous phones to shame and drains fast as well with a normal use,so moto does need to work hard on a faster charging battery.Cant degrade to KitKat as Motorola tech support said. 6.So far I haven't noticed any hangs and lockouts but I hope so the thing runs smooth. 7.Snap on back-cover give the phone a style check as you can dress the phone based on your colours of choice.But they are a bit pricey where as you can get the same for half price locally but he build quality is very flimsy on both.",
            "date": "20 Feb 2015",
            "name": "Shayak Munshi",
            "stars": "3 stars"
        },
        {
            "comment": "I received Moto G2 on 11th Feb,2015. I am facing lot of issues with the phone and flipkart service. I have listed few of the critical phone issues below: 1) Hanging display: Once few apps were automatically updated and after some time, i was not able to see any of the apps opened i.e., always homescreen is displayed when i open an app. 2) When i receive calls while walking, mobile display is not coming up. So i cant even pick the call. 3) Mobile network/Wifi connectivity both works only for some time. Most of the times, data connectivity is lost. 4) Phone automatically restarts! I decided to return the mobile but in flipkart when i select reason for return, webpage not at all loaded! I sent mail to customer care. Hope i will get some response. I am a hardware/software test engineer and my fate i got such a defective product :( :( :(",
            "date": "20 Feb 2015",
            "name": "Suganya Krishnan",
            "stars": "1 star"
        },
        {
            "comment": "Good phone totally nice the big issue is SIM Slot... The SIM Slot Cutting Micro SIM is not locked this the big issue... With out cutting network provided Micro sim perfectly locked... after so many times trying with Cutting Micro sim the slot is totaly fail permanently.. after fail sim slot the sim removing is totaly big project.. Am tested my Moto G 1st generation Cutting Sim and non cutting Sim locked..perfctly Am replaced 30 days warranty but the issue is sam Now my one sim slot is permanently failled.. THIS VERY BUG ISSUE FROM MOTOROLA MOTO G (2nd) Genaration",
            "date": "20 Feb 2015",
            "name": "P A REDDY",
            "stars": "1 star"
        },
        {
            "comment": "as long as it works it is good. when it fails it is hell to get it repaired. I gave my phone for repair to one of the authorised service centre. it is over 15 days now and I have no idea when can i get it back. getting through to the service centre is another nightmare",
            "date": "20 Feb 2015",
            "name": "chandar Natarajan",
            "stars": "1 star"
        },
        {
            "comment": "without battery backup wot to review, with wifi 100% battery coming hardly 5hrs without using wot to say",
            "date": "20 Feb 2015",
            "name": "Roshan Sinha",
            "stars": "1 star"
        },
        {
            "comment": "hello, First of all there are a lot of reviews here that i feel are bullshit and dont tell the true story about the device. I have been using moto g 2nd gen for about nearly 5 months now. Here's what i feel about it. PROS 1. The best thing that separates it from other phones is that moto g2 provides stock android(pure android) just like the nexus. That's what is responsible for smooth performance. Its already got the lollipop update before other phones. 2. Snapdragon 400 with adreno 305 gpu is superior compared to octacore meditek processors as their gpu isn't powerful enough. The gaming is very good on moto g 2nd gen, i played asphalt 8 at high resolution and COD strike team without any lag. 3.Display is sharp . its a 720p display , good for watching movies and other tasks too 4. Front camera is excellent. the pics are of great quality 5.the design of the phone is stylish and ergonomic , its easy to use one handed despite large 5 inch screen. CONS 1. battery life is average , you gotta plug the charger before the day ends. Although after lollipop update there is slight improvement in battery life. I feel battery life is good for people with medium to less usage. 2. Rear cam of 8MP is average too. Its good for indoor shots and close up shots but not outside or distant shots or landscape etc. the level of detail is not satisfactory 3. Front cam is not wide enough to include more people but picture quality is good. 4. No 1080 video recording 5. 1gb ram is good for day to day tasks and gaming too but if you open too many apps and when u swtich between apps , the content or the app will reload . thats the drawback of 1 gb ram but still its good enough for maximum users i suppose 6. The front speakers are not good. not much loud , and at full volume the audio distorts a lot 7. Gorilla glass 3 is not un breakable , my screen broke after falling from my hands so use ur phone carefully. PS- Lollipop update brings great visuals to android but it has some bugs which will hopefully be fixed in next update",
            "date": "20 Feb 2015",
            "name": "Kanishk Dwivedi",
            "stars": "4 stars"
        },
        {
            "comment": "works fine initially but hangs a lot after some use even if minimum apps are are installed the phone hangs if you dial or recv a call.. had a lot of trouble with wi-fi connection also had to completely reest the device coz it was not connecting to somme selectted wi fi networks",
            "date": "20 Feb 2015",
            "name": "RISHABH THUKRAL",
            "stars": "1 star"
        },
        {
            "comment": "With a bigger screen, much better speakers and improved camera, the new Moto G2 is a great budget smartphone. The lack of support for 4G will be a deal-breaker for some, though. It isn't without its rivals, but if you're specifically looking for a budget dual-SIM Android phone, it's a good choice.",
            "date": "20 Feb 2015",
            "name": "Syed Ahmed Salman",
            "stars": "5 stars"
        },
        {
            "comment": "I am using Moto G(2nd Gen) since last 4 months. It's performance is superb. Excellent Camera.16 GB internal memory is very useful. Memory extention upto 32 GB allows enough capacity to store pictures,movie recordings etc. you can download a large number of games etc due to 16 GB internal memory. I am really extremely happy using Moto G(2nd Gen). I strongly recommend to select this Smart phone.",
            "date": "20 Feb 2015",
            "name": "B. K. Datta -...",
            "stars": "5 stars"
        },
        {
            "comment": "I don't buy phones often neither do I talk about it as I feel there are better things to talk about. Prior to owning Moto G I bought the Moto E to \"taste\" vanilla android and it was such a fulfilling experience that I finally bought the G as well. This is sec gen and so it is BIG (for me, coming from E) Apps and everything looks way better than this than E. Both front and rear camera is decent enough for a 13k phone. I exchanged my old Lumia 525 and got the G for 10k. Sweet deal imo :) This phone is fast, you will love the big screen, battery is okay, don't go only by mah, there is more to what the manufacturer claims always! Lasts me 15 hours with average usage. I am keeping the E as back up phone and will use this as primary. G came with Lollypop. I am facing navigation/GPS locking issues with G but it is a known issue with Lollypop not Moto G. Unfortunately the Sim slot 1 on my G went kaput so FK is shipping me a new one. I should get it by tomorrow evening. All in all a very good \"best of all worlds\" phone for 13k.",
            "date": "20 Feb 2015",
            "name": "Mohit Preet",
            "stars": "5 stars"
        },
        {
            "comment": "So far so good and all that I have read in other reviews. Battery last me for a full data even when the data is switched on",
            "date": "20 Feb 2015",
            "name": "Sreepriya J",
            "stars": "4 stars"
        }
    ]
}
