{
    "filpkart": [
        {
            "comment": "Nice phone to have in the segment...Only problem which I found was that, the ear phone quality is not at all good. Moto needs to work a lot on there earphones.",
            "date": "04 Jul 2015",
            "name": "Rohit Raturi",
            "stars": "4 stars"
        },
        {
            "comment": "i bought the mobile for 9000/- with flipkart app offer...and the mobile delivered in 2 days... i give 4 points for its delivery speed and customer support. but when i used it ... it hanged a lot and i was very unhappy with the touch sensitivity ... den i did factory reset..and the mobile is functioning very good.",
            "date": "04 Jul 2015",
            "name": "S mahapatra",
            "stars": "4 stars"
        },
        {
            "comment": "A much hyped phone from Motorola. I was happy with the initial touch & feel. But as soon as I started installing the bare essential Apps, the phone's processing speed reduced drastically. It has only been a week & the Apps take a lot of time to load...even making phone calls looks to be painful task with the wait due to the slow speed. The Moto E which is much cheaper than the Moto G has a better & much faster processing speed. I would not recommend this product at all.",
            "date": "04 Jul 2015",
            "name": "Mohammed Lokha...",
            "stars": "2 stars"
        },
        {
            "comment": "What made flipkart different from other etailers was its customer service. I afraid it is no more the same. First they confirm and then deny shamelessly. What a downfall. Putting on hold all the future purchases from Flipkart.",
            "date": "04 Jul 2015",
            "name": "Aravind Shah",
            "stars": "1 star"
        },
        {
            "comment": "Flipkarts selling the g2 for 10,999 while the phones mrp is only 9,999. Mrp is maximum retail price, which is determined by the manufacture. Selling goods above its mrp is illegal, at-least in India. Wonder how many such products have gone unnoticed ! Was a loyal customer till date, feeling cheated now !",
            "date": "04 Jul 2015",
            "name": "JIJO THOMAS JOHN",
            "stars": "1 star"
        },
        {
            "comment": "I am writing this review after using Moto G gen 2 for over 210 days and evaluating it on every parameters including battery life , performance , build quality, sound quality , camera quality etc. Initially when I got this product it was working on Kitkat 4.4.4 and at that time the battery backup and performance of this phone was pretty good. The multitasking was too good and fluent. Phone doesn’t lags while playing games (but it heats).with moderate use of 3G , Wifi the juice lasts upto 15 hrs . But after updating my phone to lollipop 5.0.2 . the performance of my device started decreasing and so as the battery life. Many apps which was crashing every now &then was fixed by subsequent updates . But the performance parameter of the phone goes on decreasing, phone lags and become unresponsive (and then for a moment you think 1Gb ram is not sufficient). The front shooter of the device is ok for all your videos calls and selfie but the images from the rear shooter are quite dull and lacks smoothness .The dual firing speakers provide decent sound quality and are quite loud. But the chrome bars used in speakers attract and traps dirt and dust .Battery performance goes on decreasing day by day ,now after 7 months my battery last only for 6 hours with wifi and 3G on whereas it takes 4 hours to charge using motorola charger .Overall design Quality is good and ergonomic ,this phone can be well operated by single hand . I would recommend not to waste money in this phone because there are lots of cheaper and better options are available in the market with 4G , and 2GB ram options .",
            "date": "04 Jul 2015",
            "name": "Shubham Nema",
            "stars": "3 stars"
        },
        {
            "comment": "please do not purchase from flipkart .... in my mobile microphone is not working properly.... i returned this mobile but filpkart cancelled my REQUEST without any action.....",
            "date": "04 Jul 2015",
            "name": "Deepak Rudrawal",
            "stars": "1 star"
        },
        {
            "comment": "i have been facing problem with my motto g 2nd gen since the day i bought it threw flipkart and these guys are not paying attention to it i have raised several complaints for it no one from flipkart resolved it yet...i will suggest all my friends not to buy anything from flipkart as these guys are fraud..they are not exchanging my phone evenafter they checked that the problem is there is a problem i am going to advertise this on all social websites that (FLIPKART IS A BIG TIME FRAUD)...",
            "date": "03 Jul 2015",
            "name": "NITIN YADAV",
            "stars": "1 star"
        },
        {
            "comment": "at this price it is a best buy. processor good ,camera excellent,music too good.overall it is a good phone in this range only problem is its repair.its too costly and parts r not available.",
            "date": "03 Jul 2015",
            "name": "sahil ck",
            "stars": "4 stars"
        },
        {
            "comment": "bakwas mobile......dont buy it go for windows mobile..............................................................................................................",
            "date": "03 Jul 2015",
            "name": "ajjubhaii",
            "stars": "1 star"
        },
        {
            "comment": "good packing and good to use. compare to other products flipkart is dong only good as moto mobiles. i know flipkart dong some malfunction.",
            "date": "03 Jul 2015",
            "name": "PRIYA",
            "stars": "4 stars"
        },
        {
            "comment": "I think if u want a quality product and brand u should go for it. First of all about Camera, Back Camera is fine but front camera can be seen as OK. Otherwise it works fine but hangs if u have too much application opened at the same time. If u r looking for brand and quality u should go for it.",
            "date": "03 Jul 2015",
            "name": "Raj Kothari",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G ( 2nd Gen. ) is an EXCELLENT phone. I like it very much :D Design quality 10 / 10 Audio quality 9 / 10 Display quality 9 / 10 ( very nice and smooth display ) Performance 8 / 10 ( Excellent for daily use. ) Battery backup - 8 / 10 ( I'm impressed with battery backup ) Suggestions : 1. Need 2Gb of ram 2. 3200 mAh Battery It's Pretty Good Phone. :)",
            "date": "03 Jul 2015",
            "name": "Rajveer Grewal",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the Moto G 2nd Generation delivered in July 2015. The price charges to me was Rs. 10,999 whereas the MRP mentioned on the website is Rs. 9,999. This is gross negiligence on part of Flipkart. They are importing the product at Rs. 9,999 so that they have to pay less duty and charging the buyers Rs. 10,999. To all buyers, please be aware.",
            "date": "03 Jul 2015",
            "name": "Tarandeep Singh",
            "stars": "1 star"
        },
        {
            "comment": "It is good and always recommended by me. But as per the usage, I realized it is heavy, outdated and hangs a lot. Hang is a reason of android used roughly. So wont blame it.But should do something about the the weight. L is more complex as per feedback from my big brother using it too. Though I find it comfortable.",
            "date": "03 Jul 2015",
            "name": "Pankaj Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "Contrary to most reviews that I read, it has no defects and never lags. Camera is better than expected. Already working on lollipop, Motorola is known for its quick upgrades. Overall, the best phone I found in the 10-15k range.",
            "date": "03 Jul 2015",
            "name": "Anushka",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Need product related, like down lode application of Auto call recorder but other person call voice not recorded , my friend also purchased same mobile that will working fine and at the time of charging mobile can be heated, Mobile also discharged frequently , we r thinking that soft ware problem , Regards , Murali",
            "date": "03 Jul 2015",
            "name": "Murali",
            "stars": "3 stars"
        },
        {
            "comment": "Its good performance is much better than the earlier version the only con is battery doesnt last longer in this device",
            "date": "03 Jul 2015",
            "name": "Sobir Hussain",
            "stars": "2 stars"
        },
        {
            "comment": "its one of the best product of moto so far...its realtively as good as any other expensive smartphone. camera quality is good...good touch screen and overall its a value for money.",
            "date": "03 Jul 2015",
            "name": "SOHAIL",
            "stars": "5 stars"
        },
        {
            "comment": "Just Awesome Phone. This is the second time i am buying this phone.First it was for me and now it is for one of my family member.That time it was delivered before time as i was eagerly waiting for this phone. This time it delivered in time and with proper package.Loved it. Flipkart is just awesome.",
            "date": "02 Jul 2015",
            "name": "sandeep kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "The camera is super awesome and so is the display ,it had lollipop version pre installed while the description said it had KitKat.....the sound quality wasn't up to the mark and the phone doesn't have a pre installed file manager.....USB cable isn't included in the product...sometimes the phone lags when the music player is on the screen is rotated...overall its a nice phone...... :)",
            "date": "02 Jul 2015",
            "name": "Ritick Goenka",
            "stars": "4 stars"
        },
        {
            "comment": "i cant use me buy for my friends and he gg he call his camera was gg n also app gg support with out lagg n also gorila glass",
            "date": "02 Jul 2015",
            "name": "Vishal Pawar",
            "stars": "5 stars"
        },
        {
            "comment": "Its just the right phone to buy at this price. Its been six months now that My Dad is using this phone and he has never complained even once with respect to the features this phone comes with. It sounds and Captures moment as it should, has got stereo speakers in front and has got one of the best cameras amongst the similar priced phones. All in all a good buy, I recommend It !",
            "date": "02 Jul 2015",
            "name": "Kapil",
            "stars": "5 stars"
        },
        {
            "comment": "Bought it for my father. It's his first smart phone. The phone works great, and hasn't shown any signs of slowing down in the past 6 months. Recommended, especially for the price.",
            "date": "02 Jul 2015",
            "name": "Aditya Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Nothing to complaint, everything is fine camera,display,speed,speakers,etc... But little laggy after lollipop update.",
            "date": "02 Jul 2015",
            "name": "Deena dayalan",
            "stars": "5 stars"
        },
        {
            "comment": "Upgraded from Moto E to Moto g2, fully satisfied with the quality and experiance. The plain andriod GUI is the interface i like best. Good sound quality. fast and easy to hold.",
            "date": "02 Jul 2015",
            "name": "Gaurav Verma",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this product five days later stoped using it as it burned my face while talking on it and it stopped working and heated up and the proximity sensor also conked off ,have registered a complaint with flipkart,hopefully will return it to them as soon as possible.",
            "date": "02 Jul 2015",
            "name": "Abdul Moniem M...",
            "stars": "1 star"
        },
        {
            "comment": "I have received Moto G2 on 1st July as a replacement. Placed replacement order because of battery issue and screen issue. I am not satisfied with the performance of it. CONS: Screen issue; it shows vertical dotted lines when opening phone in sunlight which i does not see in friends moto g2 phone . It is difficult to use it in sunlight . Battery backup very poor. Reduced to 40% in half an hour. Performance is very poor. Sound automatically increased while playing games ,",
            "date": "02 Jul 2015",
            "name": "Hari",
            "stars": "1 star"
        },
        {
            "comment": "This is my first android phone. Very happy with the delivery time. Delivered within a day. Quality of the product is very good. But Unhappy with the packaging.",
            "date": "02 Jul 2015",
            "name": "Rakesh Nayak",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this product a month ago for my sister and now I am seeing MOTO G (2nd gen) everywhere around me. The most advantageous thing about Motorola is you get the latest android version. So here are some Pros and Cons of Moto G (2nd Gen) Pros: 1. Expandable Memory: which is best according to me because my Moto X doesn't have this feature 2.Corning Gorilla Glass 3 : but not as durable as Moto X screen is delicate 3 Camera :8 MP Rear Camera 2 MP Front Camera which is feasible according to the price 4. •1.2 Ghz Qualcomm Quad Core Processor which is an essential thing Cons: Display: It has IPS LED display but when you see the screen from the side it goes greenish this doesn't happen to OLED display Sometimes phone gets heated due to multiprocessing One of my friend got faulty battery indicator , after charging the phone to 100% within 5-10 minutes it goes down to 75% but issue got fixed by Motorola. In conclusion the phone is worth buying for the price range of 10-15k !!!!",
            "date": "02 Jul 2015",
            "name": "diehardgamer",
            "stars": "4 stars"
        },
        {
            "comment": "The phone is good in all aspects. Performs flawless but the battery does not last half a day on 3G. Also on 2G the battery life is not more than 8 hours if sparingly used.",
            "date": "02 Jul 2015",
            "name": "Nitin Raj",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, In mobile Charging there is some problem. when we will Charged battery show within 2 min 100% charging.",
            "date": "02 Jul 2015",
            "name": "Pratibha Wagh",
            "stars": "1 star"
        },
        {
            "comment": "Ordered the phone @ 9:30PM and opted for fast delivery and i got the phone by next day 2:00 PM. But I found a problem in the Phone speakers, whenever i play a song or video rattling sound is coming and reported to same to Flipkart. Call Center told me that their technical department will call at 2:47PM next and actually call came exactly on time and after explaining my problem with in next 18hrs I got a phone replacement. And the new piece is working excellent. Super fast delivery and super customer care.",
            "date": "02 Jul 2015",
            "name": "Ram",
            "stars": "5 stars"
        },
        {
            "comment": "This is just a quick review. The phone is awesome and offers good value for money. I have used the 1st gen phone for over a year and till date with multiple apps running there is no lag or battery drain as such. Summarizing - it's a great phone for this price. Superb display, good camera, decent battery and storage space. It should easily serve for 2 years with zero complaints. I had ordered 2 pieces and found that 1 of it had a crack in the display. Thanks for a quick replacement from WSRetail. Got the replacement within 2 days.",
            "date": "02 Jul 2015",
            "name": "Sunil Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Very nice phone at this price. One issue: Phone hangs a little when trying to switch between multiple apps. Nice battery backup.",
            "date": "02 Jul 2015",
            "name": "Rahul",
            "stars": "4 stars"
        },
        {
            "comment": "The device has latest features but its battery back up is poor also it gets hang. Memory is good i.e. 16 GB.",
            "date": "02 Jul 2015",
            "name": "Bhawana Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Used handset recd...when box opened the handset appeared used one...was missing plastic flaps usualy covered on camera lenses..also handset is malfunctioning...volume buttons are jam...overall i do not expect such practice from Flipkart....Guys pls make sure the handsets are un-used at the time of unpacking or else you will have to go through tough exchange process",
            "date": "02 Jul 2015",
            "name": "Anil Parmar",
            "stars": "1 star"
        },
        {
            "comment": "I have been facing battery draining very quickly since day one. Today, I charged 100% and I get to see 1% battery left over just after five minutes. I don't use games or any other heavy apps to play. Nor i was using internet. I was total shocking to find this issue. Can i return or have replacement?",
            "date": "02 Jul 2015",
            "name": "Poornima Krish...",
            "stars": "1 star"
        },
        {
            "comment": "Hello Team, MRP Showing on BOX is 9999 then why it is listed as 10999 in FLipkart. and on top of it you have given me 2000 rupess discount for my old phone. I am more concerned if MRP is 9999 as per BOX then why it is priced at 10999 in flipkart.",
            "date": "02 Jul 2015",
            "name": "Manish",
            "stars": "1 star"
        },
        {
            "comment": "its an awesome phone and never hangs even if its internal memory is full. lolipop experience is also awesome. (y)",
            "date": "01 Jul 2015",
            "name": "shubham khatri",
            "stars": "5 stars"
        },
        {
            "comment": "Hey guys i am having the same problem too.I am not able to hear the voice of d person on the other side...I had taken it to moto care also...If any one has a solution please do help...",
            "date": "01 Jul 2015",
            "name": "SelvaGomathi",
            "stars": "1 star"
        },
        {
            "comment": "Moto G (2nd Generation) is a well priced phone. It has sufficient features for a regular user with enough memory. It has good processing speed but the Interface is a bit of a let down...!!!! All in all its a good phone. As for the the FLIPKART service, its awesome as always. The best part about flipkart is their courteous Customer Service, even when you are returning or exchanging the product...!!! Way to go Flipkart...!!!",
            "date": "01 Jul 2015",
            "name": "Anish Kohli",
            "stars": "4 stars"
        },
        {
            "comment": "Using this mobile im happy no lagging that much and all.. but like to say in lollipop (L5) need file manager default in android os in next update version. and update to all moto g2 user in software update manually",
            "date": "01 Jul 2015",
            "name": "Shri Gireesh",
            "stars": "4 stars"
        },
        {
            "comment": "within 2 months the phone is getting hanged.Facing issues with caller tone also..at times the phone does not ring whenever i get calls..so have to switch off and on the phone..had lot of expectations from MOTO G2-but disappointed..May be i will have to go for a replacement soon.",
            "date": "01 Jul 2015",
            "name": "ROMAN JAMWAL",
            "stars": "3 stars"
        },
        {
            "comment": "After a long research, i decide to buy MOTO Gen 2. i got this mobile through app and get incredible discount. The usage for was excellent. I rate this mobile 9 out 10 for its solid look and performance.",
            "date": "01 Jul 2015",
            "name": "Kovalan Jayamu...",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this product on 22nd June 2015 and with no surprise Flipkart delivered this phone to me on 24th. The phone had vibration and noise on receiver speaker. I returned the product and received a new piece in no time. But unfortunately I had the same problem with new piece also. I predicted that the lot itself might have this issue and raised a return request again. To my surprise, customer care advisor asked me to go to service centre of motorola. Man why should I carry your non-working device to service centre for repair? Then this guy asked me to reset the device and rejected my request of return. Although my device is performing better after factory reset but my question is, when we are ordering a fresh device then why do we need to troubleshoot any problems? Highly disappointed.",
            "date": "01 Jul 2015",
            "name": "Pankaj Agrawal",
            "stars": "2 stars"
        },
        {
            "comment": "Overall this Moto G is a good mobile with good features. I only feel they should improve on the battery, it doesn't last more than a day.",
            "date": "01 Jul 2015",
            "name": "Virendra Prasad",
            "stars": "4 stars"
        },
        {
            "comment": "best fone thnks flipkart for quick delivry ,kindly help me for my complain of Samsung s4 that i recently purchase from u",
            "date": "01 Jul 2015",
            "name": "Abhishek Bhardwaj",
            "stars": "5 stars"
        },
        {
            "comment": "This phone functions up to the mark and all that, but if you are expecting any kind of after sales support and service from motorola, forget it. I mean just forget it. Motorola will raise hands when you go to them for any problems regarding your phone. And Wow, they don't cover physical damages at all under warrant, then seriously, what is the warranty even for? I will tell you to please reconsider your choice and buy some phone other than any motorola and somewhere other than flipkart.",
            "date": "01 Jul 2015",
            "name": "Pranav Buddhadev",
            "stars": "1 star"
        },
        {
            "comment": "* This is the best phone in this budget * Both camera qualities are very good * Screen size is nice * No hanging problem * But charger and earphone are not up to the mark * It takes upto 3.5 hours to charge the phone",
            "date": "01 Jul 2015",
            "name": "Priti",
            "stars": "4 stars"
        },
        {
            "comment": "pros- 1- VG camera quality both day n night. 2- sound quality good 3- rigid body Cons- 1- no 3g video call (hv to use 3rd party app) 2- data cable not provided 3- file manager is not in menu( have to download from play store)",
            "date": "01 Jul 2015",
            "name": "vinu parida",
            "stars": "3 stars"
        },
        {
            "comment": "i purchased Moto G2 20 days before and i noticed the battery is fully charged and its getting drain within 6hrs and its taking more than 2hrs to recharge the battery and its slowly charging and its getting heat",
            "date": "01 Jul 2015",
            "name": "Vijay",
            "stars": "3 stars"
        },
        {
            "comment": "The phone was replaced atleast 2 times first time the the SIM card slot doens't work and flipkart support is such a horrible experience to deal with... They ask to reset the phone for HW problem!!! The technical team can only call at their predefined time and if you miss 1-2 times then thats it... you need fix another appointment with them. Even meeting PM may be easier than talking to Flipkart technical support people. Even after telling the proper address they ship to wrong address and comes back and tell you have given wrong address. Finally after a hell lot of struggle they gave a new phone which is to my surprise the speaker doesn't work!!! Again the same round of dealing with tech support. Finally requested for refund. All this took more than a month since there was stock shortage during the time. Along with the phone I purchased a flip cover too, now when I asked why don't you take it since this is of no use for me and refund money since you have given non working product, Flipkart people are very adamant that they can't do anything and you deal with it!!! Flipkart is not going to help customers and its going to be history soon I think...",
            "date": "01 Jul 2015",
            "name": "Abhimanyu CS",
            "stars": "2 stars"
        },
        {
            "comment": "The back feels perfect, phone size and weight is just right, and it's just flat on the front. Evidence that great design doesn't have to cost a fortune, in fact it should save cost. THIS REVIEW IS FOR A NEUTRAL PERSON WHO IS CONFUSED FOR WHICH MOBILE TO CHOSE in the midrange segment. PROS: 1) Its Motorola 2) Screen is bright and vivid 3) Best stock android phone under Rs 15000 4) Camera in daylight 5) Nice grip 6) Speakers somewhat CONS: 1) Camera in night 2) Speakers give cracking noise at maximum volume level 3) Requires too much time for charging",
            "date": "01 Jul 2015",
            "name": "Priyanshu",
            "stars": "4 stars"
        },
        {
            "comment": "This was the 3rd motorola in the family. Great phone. Love stock andriod. cut a star because of the average camera(by today's smartphone standard) and not so great battery life.",
            "date": "01 Jul 2015",
            "name": "Rushabh Shah",
            "stars": "4 stars"
        },
        {
            "comment": "good Best For Money.can Improve Batery its draing fast but enough for daily usage.yet the buyer are satisfied by the speed and look",
            "date": "30 Jun 2015",
            "name": "VenKi",
            "stars": "4 stars"
        },
        {
            "comment": "Standard Mobile ,no need to change the mobile often .I guess this is the one of the best mobile i bought.",
            "date": "30 Jun 2015",
            "name": "Prabhu Guruswamy",
            "stars": "5 stars"
        },
        {
            "comment": "I bought the phone 6 months ago. It was working fine until last month when it's having network issues. It loses cellular network signal very often and even the 2G/3G GPRS signal. I use Airtel network and from last 10 years or so havent had a problem with my phones not catching cellular network (I was using Nokia primarily and Xolo for few months). I have had few of my friends having similar issues as well. Excruciatingly annoying when i want to make a call or receive an important message and network isnt there. What's the point of having good specs when the phone does't catch the cellular network required for phone call, message / internet browsing. I suggest to go for other phones with good connectivity. There are loads of models available in market at the same price with same or better specs / features and connectivity.",
            "date": "30 Jun 2015",
            "name": "Dilip B",
            "stars": "1 star"
        },
        {
            "comment": "Phone rocks... just the battery isn't enough.... lolipop rocks... everything else is good but the battery life.",
            "date": "30 Jun 2015",
            "name": "Kuldeep Pathak",
            "stars": "4 stars"
        },
        {
            "comment": "But the battery life. I love my Moto g2 to the core, very user friendly great GUI awesome experience. The only problem is that the battery life. Its more like dead. If Lenovo has a GUI like Moto I would definitely prefer Lenovo. The radiation emitted is a bit high than Lenovo and as iv said dead battery life. Still I recommend to buy this mob. You can definitely get an awesome experience. Worth the money (except battery)",
            "date": "30 Jun 2015",
            "name": "Nithilan Dhand...",
            "stars": "5 stars"
        },
        {
            "comment": "After using iPhone 4 almost for 3-4 years I decided to go for android, but I don't want to spend lots of money on fancy phone like, Samsung and Sony which has good issue and users are crying after spending 20k+. I bought this Moto G2 for my wife almost a year back and I was impressed with Moto G2 performance in terms of camera quality (surely its batter then iPhone), battery, app updates etc. Trust me i spend almost a month to found a good android phone which is under 15k which comes with a established brands and also comes with internal memory of 16 GB or more. It has a decent processor, good display and an good camera in class. The biggest drop back I found that Moto doesn't provide USB cable to connect with system. That we need to buy from separately. I used this phone for almost a month and I feel it is perfect replacement of iPhone (some feature I still miss in android). Its really a value for money and must to have phone under 11k.",
            "date": "30 Jun 2015",
            "name": "Ankit Patni",
            "stars": "5 stars"
        },
        {
            "comment": "Writing this review after 3 months of use. Poor battery backup. Numerous mini problems Heats up quickly Much better phones available in 10k.",
            "date": "30 Jun 2015",
            "name": "Anirudha Maha...",
            "stars": "3 stars"
        },
        {
            "comment": "bought third Moto G 2 and it had some voice coming when writing a text message. Got the product replaced. Today received the New product and it is not making any irritating rattening voice on typing message. This is a good product but please check all features when you receive the product. Thanks",
            "date": "30 Jun 2015",
            "name": "gayatri sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Hi Friends, This is the 1st time i am writing a review, because i faced headache problem with this mobile. Even i talked for 1 or 2 mins. i got headache. Even after replaces the mobile. The mobile features are good but it is hanging many times and the main thing is the SAR value is very high and its not at all good for your health. take care about SAR when you choose any mobile. I am not saying all have same problem, but take care of your health. Thanks...",
            "date": "30 Jun 2015",
            "name": "Kishore Challa",
            "stars": "2 stars"
        },
        {
            "comment": "I am using that product but i am not at all satisfied with the product and i think this is not Genuine",
            "date": "30 Jun 2015",
            "name": "Gyandeep Singh",
            "stars": "1 star"
        },
        {
            "comment": "1st Gen of 'Moto G' bought the legacy back. By their 2nd gen Motorola is slowly grabbing the Eyeballs in-regards to competitive pricing yet qualitative hardware config., compares to SAMSUNG,HTC & SONY, which are dominating the Indian market for no reason. Pros: Every Single Feature. Cons: Slow Charging. Note: Flipkart always amuse me through their delivery & return policies.Got this in matter of less than 24hrs.",
            "date": "30 Jun 2015",
            "name": "Satya Sankar N...",
            "stars": "4 stars"
        },
        {
            "comment": "Guys I am writing this review after 1 month of usage of the phone. Believe me its an amazing product. At first I was hesitant to buy it just because of the after sales service coz Motorola doesn't have direct presence in India. But found that they have pretty good number of service centres in my city atleast. As far as the product is concerned, it works very well with great display and features. I also got Android lollipop pre-loaded on the phone. I sometimes feel that a 2GB RAM would have been an icing on the cake but nevertheless it works fantastically. I have also downloaded a few heavy games and they also run fine except that the phone responds a little slower but only for a few seconds. Overall highly satisfied. Had there been an option of 4.5 stars, I would have marked it the same.",
            "date": "30 Jun 2015",
            "name": "Ankit Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone about a month ago, its very good looking and stylish. performance wise its good, camera is also good. touch is excellent, the best thing is display, its display is very bright,sharp and clear. I don't have any issues with the phone, I have almost 150 apps installed in my phone, everything is working very nicely. This is a best buy choice if the budget is Rs. 10000, definitely go for it if you want best in this budget.",
            "date": "30 Jun 2015",
            "name": "Vinay Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "I BOUGHT 3 PIECES OF MOTO G2 ITS A GOOD PRODUCT BUT ONE OF THEM START GETTING HANG TOUCH IS NOT WORKING.. :(",
            "date": "30 Jun 2015",
            "name": "PATHAK",
            "stars": "1 star"
        },
        {
            "comment": "Learn to run differnet troubleshooting apps available in google play before you purchase a mobile from Flipkart. Otherwise you will be in trouble. I received a faulty device from Flipkart and to get replacement from flipkart is a nightmare. I will never prefer flipkart for purchase because of this, this is the third time I am getting faulty device from flipkart and go for replacement.",
            "date": "30 Jun 2015",
            "name": "RENJITH KS",
            "stars": "1 star"
        },
        {
            "comment": "Excellent phone at its price. but few things experienced are even after clearing all apps from the background, there's always some random app that shows up. and the battery dries up easily.. Twice a day have to recharge.. But the functioning and the remaining are really working well",
            "date": "30 Jun 2015",
            "name": "sindhusha",
            "stars": "4 stars"
        },
        {
            "comment": "I had very bad exp with this phone, SIM2 is not working. Flipkart delivery to Agra was very pathetic. It took almost 15 days to reach there ..now for replacement they are saying me to send the phone through courier as they dont have pickup facility.",
            "date": "30 Jun 2015",
            "name": "Gaurav Agarwal",
            "stars": "1 star"
        },
        {
            "comment": "every time it get hanged, made a big mistake, mot e was better product than this, Using from last 6 month, every time get hanged.",
            "date": "30 Jun 2015",
            "name": "Manjula Neelagiri",
            "stars": "2 stars"
        },
        {
            "comment": "Not happy with this product. too slow. very bad network reception. fixed battery again a problem. I am using since last 2 months. Not a good product",
            "date": "30 Jun 2015",
            "name": "Balkar Singh",
            "stars": "1 star"
        },
        {
            "comment": "Packing is very good. Inbuilt battery(Can not change) is the only one problem. Camera clarity is not bad. Others are good. I like this product.",
            "date": "30 Jun 2015",
            "name": "ALBIN ANTONY",
            "stars": "4 stars"
        },
        {
            "comment": "I had been using a Samsung Galaxy S2 for the past two and a half years and the phone was giving me any number os problems, including a very poor battery life. I had to permanently lug a portable charger around! Ordered Moto G2 on Flipkart; pleasantly surprised to have it delivered in two days (not counting the Sunday in between). As of now, I am happy with the way with the product looks, the efficient performance and the long battery life. I use a lot of apps on the phone, including a fair number of business apps. It's too quick to do a full review, but the phone functions well without a lag even when switching between different programs. I like the fact that Moto has not fiddled much with the Android OS, which translates to a much smoother functioning and user experience. I have been using the phone non-stop since I received it, and as of now, I am very happy with the product. I can do a detailed review a month later. Looks wise, the screen is pretty big; I would have preferred it to be sleeker though. I bought the white version and I will be buying a couple of Moto back covers soon to change the look as and when I get bored.",
            "date": "30 Jun 2015",
            "name": "Sumi Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered this phone on 20th-June and pay extra money for fast delivery. The phone was delivered on 21st-June. From very first day, neither the Mic nor the speaker was working. Even the second sim slot was not functional. I raised the return request very same day. The return request was rejected twice for no reason. After constant follow-ups and running pillar to post the return request was approved yesterday. It is mentioned that the replacement will be delivered on 6th-July So after paying the full money and extra bucks for fast delivery, I am left with no functional phone for 16 days. I am not sure what if the replacement phone also not works. This agonizing experience with Flipkart has shattered my faith this brand name. Seems we as a customer are just money payers holding no value for Flipkart. I can say that this was my last shopping on Flipkart and in future I will refrain from dealing with Flipkart. Now that there are better and bigger Brands providing better services and customer satisfaction, I will go for them to avoid any such painful experience. I felt Like CHEATED by Flipkart....!!!!!",
            "date": "30 Jun 2015",
            "name": "Atul kumar Cha...",
            "stars": "1 star"
        },
        {
            "comment": "I loved the phone in all aspects, in terms of performance, battery back up, camera. The biggest problem with the phone was however the battery/ charging point. The phone suddenly stopped taking charge and after the battery was discharged It became useless. I had no option but to ask for a replacement from flipkart which I got within 4 days. Its a different matter that I had difficulties to make the Cust. Service Reps understand that the phone had crashed and was not charging. I used the new phone for about a week or so and lo and behold it had the same problem. I promptly returned and asked for my money back was was done within 2 days. I would still love to get the phone but with the battery issue sorted! Moto are you listening!!!!!",
            "date": "29 Jun 2015",
            "name": "TRILOCHAN PANI...",
            "stars": "1 star"
        },
        {
            "comment": "Camera is nice Screen quality is good Can play heavy games without any lag Battery is average But when you update it to lollipop 5.0.2 the performance decreases , the phone be lcames laggy.",
            "date": "29 Jun 2015",
            "name": "Divit Lakra",
            "stars": "3 stars"
        },
        {
            "comment": "What I Found: - - Battery drains quickly. - Camera is not up to the mark (iPhone is much better even with 8MP) - Smooth Running - Battery drains quickly. - Scared about other reviews, screen might break if you drop the phone, Although i am confused with Gorilla Glass 3, it should never break, isn't it? - Battery drains quickly. - Phone heats when first run - Battery takes ages to charge but drains quickly You must be wondering why I have repeated the same thing few times. Because i wanted to effing highlight the main problem of this phone....!!!!!!!!!!!!",
            "date": "29 Jun 2015",
            "name": "Jop Diengdoh",
            "stars": "2 stars"
        },
        {
            "comment": "There are a lot more phones with greater specs and are cheaper. But great looks and performance. Thumbs up. Great phone overall",
            "date": "29 Jun 2015",
            "name": "Sumeet Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "Good phone and features in 10000 k range phone brand quality product. Everthing ok camera also take good picture than other phone for this range.",
            "date": "29 Jun 2015",
            "name": "sandeep kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Hello Friends, I will suggest you to please don't go with this particular vendor. as he doesn't care of your problem, I had an issue that the touch screen was not working fine also back button always take 2click on 1 click. and this vendor denies changing/replacing my phone. Please consider the same. Thanks, Abhishek",
            "date": "29 Jun 2015",
            "name": "Abhishek Saxena",
            "stars": "1 star"
        },
        {
            "comment": "i am fully Satisfied with moto g2 in this prices... this is a very good mobile & camera quality is too good..",
            "date": "29 Jun 2015",
            "name": "Shrichand Pareek",
            "stars": "4 stars"
        },
        {
            "comment": "Nice phone with decent camera and good display in comparision to SAMSUNG and Others. Front camera is OK.. Good for mid range buying Battey backup is good.. In my choice good phone.....",
            "date": "29 Jun 2015",
            "name": "Aditya Nayak",
            "stars": "4 stars"
        },
        {
            "comment": "Two Months Over till now no issues.delivery also fast thanks to ekart lollipop working good without any issues",
            "date": "29 Jun 2015",
            "name": "BALAJI_pvgd",
            "stars": "4 stars"
        },
        {
            "comment": "Speakers is very worst and when I've requested Flipkart for Refund/Replacement, Worst Customer Service I've seen. Very vulgar response from the Executive who called me.",
            "date": "29 Jun 2015",
            "name": "Manidhar Uriti",
            "stars": "1 star"
        },
        {
            "comment": "This is very good Budget phone, I have a problem on my phone as the SIM card comes out very often. I need to open the back cover and push it in every time I see network issue. Given rating 3 for the problem I have. Not sure this is the same for all the devices.",
            "date": "29 Jun 2015",
            "name": "Haris Jebaraj",
            "stars": "3 stars"
        },
        {
            "comment": "with all excitement, i gifted a moto g 2 gen phone, to the dismal the battery is draining with very low usage of phone and its features. the phone has no internet connection be it, wifi, 2g, 3g, despite of basic usage, the battery drains like anything. most disappointing experience.",
            "date": "29 Jun 2015",
            "name": "prasanna",
            "stars": "2 stars"
        },
        {
            "comment": "best mobile phone in this price range its camera preety good ,display, bttery back up is fine one drawback of this phone is during calls other person behind u can easily hear voice of another person who is on the call",
            "date": "29 Jun 2015",
            "name": "Youma SMITH",
            "stars": "4 stars"
        },
        {
            "comment": "Its has only 2000mh battery which is lower than the version 1... not at all suitable for smartphones. It don't even lasts 10 hrs with minimal usage. If you get more calls then, its has to be always kept plugged in. With this phone you get 0.5A charger which takes 6-8 hrs to fully charge the phone. what is like in this phone is just the slim look and the latest version. Waste of money!",
            "date": "29 Jun 2015",
            "name": "Suraj Sharma",
            "stars": "2 stars"
        },
        {
            "comment": "I taken this mobile last 30 days back from flipkart it's working good and good camera and performance is good .. but charging time taken approximately 3-4 hrs",
            "date": "29 Jun 2015",
            "name": "Raghavendra reddy",
            "stars": "4 stars"
        },
        {
            "comment": "i can say its quality is good with good brand name but its little expensive those who don't care of brand please go for honor 4x, or asus zenphone 2 or even mi4i are with good specifications .",
            "date": "29 Jun 2015",
            "name": "Praveen Begari",
            "stars": "3 stars"
        },
        {
            "comment": "Ordered the product on 23/062015 at 20.26hrs and received the same on 25/06/2015 at 11.00 hrs with good packing. Display quality is fine. Previously I have used Xolo Mobile, compare to xolo in all aspects I very much satisfied with this one. Browsing speed is very fast. Worth for money.",
            "date": "29 Jun 2015",
            "name": "MURALI.G",
            "stars": "5 stars"
        },
        {
            "comment": "After three months of usage I found this phone to be bad in performance. PRO: Stereo Speakers CON: Poor Battery Life, doesn't last for more than 24 hrs for average use and no crazy apps installed. The OS itself is drawing heavily from battery. Battery Extension is a humbug. When enabled, it Buggy software Heats up fast during call or data usage Sometimes phone rings but doesn't let to answer call (swiping does nothing) Sometimes clicking on contact in dialer does nothing, this piece of crap doesn't let to make call till a reboot is done Bootup screen is 200% bright and lasts for a cool 2 minutes strains eye when restarting at lowlight areas. It takes more than 5 minutes to restart and get the dialler app launching. Sometimes Google Maps icon keep rotating, calibrating compass doesn't help. Bugs Bugs Bugs",
            "date": "29 Jun 2015",
            "name": "Balaji",
            "stars": "2 stars"
        },
        {
            "comment": "dear users, phone works 6 months without any problem, then it will trouble u a lot. Mother board crashed, hangs frequently, switch off frequently, irritating product, moto g2",
            "date": "29 Jun 2015",
            "name": "santhosh kumar",
            "stars": "1 star"
        },
        {
            "comment": "AWESOME PHONE ... ................................................................................FOR THIS PRICE RANGE",
            "date": "29 Jun 2015",
            "name": "Sharavnan Kv",
            "stars": "5 stars"
        },
        {
            "comment": "Worth @8999. No BIG issues after 1 week of usage. Very little heating after continuous usage. Overall good.",
            "date": "29 Jun 2015",
            "name": "Justin Antony",
            "stars": "5 stars"
        },
        {
            "comment": "As expected again good job by flipkart..... I'm very happy with the service, Product packing & performance as expected.",
            "date": "29 Jun 2015",
            "name": "Afroz Pasha",
            "stars": "5 stars"
        },
        {
            "comment": "If you think Moto G was a great launch and in 2nd generation they provide something extra..answer is yes they do. Camera quality has improved, screen size has increased, looks better. But performance has gone down. Terrible earphones and charger. Phone hangs all the time. If you think you are getting better product in less price, they are fooling us.",
            "date": "29 Jun 2015",
            "name": "Ratnesh Pandey",
            "stars": "2 stars"
        },
        {
            "comment": "I have 2*Moto G 1st Gen, 1*Moto G 2nd gen, 1* Moto X 1st gen and 1*Moto X 2nd gen phones - all purchased thru Flipkart. Across phones, including Moto G 2nd gen, the perpetual problem is that despite the claims of a Gorilla 3 screen, all the screens are extremely fragile. The replacement of screens is prohibitively expensive (E.g. Moto X 1st gen screen replacement is Rs 12,540/-). Worst part is that their service centers are NOIT Motorola dedicated ones - they use shared service centers that also cater to many Cheap Chinese brands. If you wrote to the company, no one cares, you call them, no one listens! NOT really a value for money phone. No point buying a phone and repenting in 1 month. ANYONE AT MOTOROLA LISTENING? (NB: If I hear from Motorola, I'll update this positively. In past, I even made a SVP from Motorola USA to write to Indian execs but no one cared to respond!)",
            "date": "29 Jun 2015",
            "name": "V Shekhar Avasthy",
            "stars": "1 star"
        },
        {
            "comment": "Bought this for my dad, who is using a smartfone for the first time. He absolutely loves the fone. He was fond of listening to music on the fone and this fone does it well with good speakers and loud sound. Good enough battery life and clear screen. All in all well worth the price.",
            "date": "29 Jun 2015",
            "name": "Prince Moses",
            "stars": "4 stars"
        },
        {
            "comment": "A wonderful phone. No heating issues. Battery is Okay- stands for 1 day. Pictures clarity is really good. Thx moto.",
            "date": "29 Jun 2015",
            "name": "Hari Haran",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone....good package......from flip kart..i prefer speed post other than private couriers.....................................................................",
            "date": "29 Jun 2015",
            "name": "shaiju",
            "stars": "5 stars"
        },
        {
            "comment": "Good mobile fast speed good features. Good mobile fast speed good features Good mobile fast speed good features",
            "date": "29 Jun 2015",
            "name": "Nahid A Khan",
            "stars": "5 stars"
        },
        {
            "comment": "High Definition clarity, Too Smooth running without hanging issues, Moto g have good features...........................!",
            "date": "28 Jun 2015",
            "name": "Ashish Aggarwal",
            "stars": "5 stars"
        },
        {
            "comment": "It was a great phone for the price at 11000. I wish it had 4g lte . i had hangs when cache more than 1gb.it performed otherwise fast . since i am student with full i run a weekend without the need for more power. the camera was Ok . I wish it had 13mp camera. stock android manages apps perfecctly even with one gb ram and front camera was great. there were little overheating issues. But i would condier the android one range of smartphones which have constant updates and same specs except the back camera..",
            "date": "28 Jun 2015",
            "name": "Krishnamurthi...",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Phone as Compared to others.....good camera.........touch is superb...........and Sofware functionalty is also very good.........but one cons resolution is much as 1920 under this price.........overall good and Sound also should improve.................",
            "date": "28 Jun 2015",
            "name": "Akash Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "receive the defective product, and for return its lenghty process. they install some app to my mobile and took almost 45 mins to rectify the problem. when i opened the box at the time only there is some finger prints and dust on the screen. Day by Day flipkart loosing their Value.",
            "date": "28 Jun 2015",
            "name": "SunilKumar SA",
            "stars": "1 star"
        },
        {
            "comment": "This is good phone but the headphone provided by Motorola is pathetic. some times phone get stuck while unlocking.",
            "date": "28 Jun 2015",
            "name": "Ritesh Nehate",
            "stars": "3 stars"
        },
        {
            "comment": "Awesome phone This is my first smart phone and i love to use, thanks to fliupkart to for fast delivery",
            "date": "28 Jun 2015",
            "name": "Aaditya Dahariya",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought this product 3 months back and visited the service center 2 times for various issues, screen and touch. It worked very fine for the first week then the screen problem started immediately after the flipkart warranty period ended. The response form the flipkart is very poor and asked me to visit near service center which is 30kms from my place. From them i started making rounds around the service center with various problems. I can suggest good mobiles are available in market other than this where they can have more service centers near to their home. unfortunately now also I am using the same moble as i am not able to spend more money on buying other worst mobile on flipkart. Go for other than moto if you are staying in Andhra pradesh ot telangana.",
            "date": "28 Jun 2015",
            "name": "Vamsi Krishna",
            "stars": "1 star"
        },
        {
            "comment": "i thought flipkart delivers good products within one month phone display not seen for no reason it has gone bad i dont know what to do,whom to complain ,where to get it ready,on line products it is difficult in such situations, i spent 11000 rs on it but within a month gone bad i cannot see anything on the screen,i dont know, i would like to check with consumer court,for no reason it has gone bad so i want justice",
            "date": "28 Jun 2015",
            "name": "lavanya basireddy",
            "stars": "1 star"
        },
        {
            "comment": "Product is not working properly and flipkart is violating the billing instructions on credit cards. No response after contacting the customer. hence it is better not buy in flipkart. Rambabu",
            "date": "28 Jun 2015",
            "name": "Ram Babu",
            "stars": "2 stars"
        },
        {
            "comment": "It is very Bad experence with flipcart...since i calll lot of time to customer care there is no appericiate reply from customer care .....my product was faluty and i lock my complaint but till now i am not getting any solution from flipcart....i am old customer ....but not resolve complai yet.....................",
            "date": "28 Jun 2015",
            "name": "Nikhil Chaudhary",
            "stars": "1 star"
        },
        {
            "comment": "The first phone I received the sim 1 wasnt working. Just received a replacement and the buttons are shaky and very much inside and it's difficult to operate. Looks like Motorola is selling refurbished products as new ones. I want a refund. Guys, please don't buy.",
            "date": "28 Jun 2015",
            "name": "Bala Muruga",
            "stars": "1 star"
        },
        {
            "comment": "Very unsatisfied with the battery backup. Phone takes around 2.5 hours to full charge and get drains quicker than it if you browse over internet and use apps. I have to turn off the data connectivity to save battery, what is the point of having smart phone if you cannot use internet and apps continuously and compromise due to bad battery backup? Earlier I owned Motorola Milestone that was a remarkable product by Motorola, that is the reason I had gone for Motorola product once again but Moto G2 is a big disappointment.",
            "date": "28 Jun 2015",
            "name": "Pawanjit Singh...",
            "stars": "1 star"
        },
        {
            "comment": "Delivery was on time. Phone worked well for few days but then it stared giving problem. There is a display problem within 1.5 month. Poor Voice quality. Will not recommend to buy this phone.",
            "date": "28 Jun 2015",
            "name": "Ankit",
            "stars": "1 star"
        },
        {
            "comment": "Overall a good smart phone with good battery life compare to samsung mobiles. Photo quality even in night is very good but selfi is o.k. not best in....",
            "date": "28 Jun 2015",
            "name": "Alok Kumar Jindal",
            "stars": "5 stars"
        },
        {
            "comment": "Have purchased a week ago and looks awesome till now. got this product in 6200 and in this price range it is best phone. Got phone in 3 days through Flipkart delivery. Looks so far so good.",
            "date": "28 Jun 2015",
            "name": "Saurabh Dadhich",
            "stars": "5 stars"
        },
        {
            "comment": "I got Moto g2 yesterday, it worked yesterday but from today morning it does not respond and freezes. Asked For replacement still no reply. Please Solve This Flipkart",
            "date": "28 Jun 2015",
            "name": "Deepak Choksi",
            "stars": "2 stars"
        },
        {
            "comment": "GREAT PRODUCT....NO ANY COMPLAINS ..CHEER UP ...I FILL FULL SATISFACTION WITH MOTO G ..........................................",
            "date": "28 Jun 2015",
            "name": "VINOD VANKAR",
            "stars": "5 stars"
        },
        {
            "comment": "Battery started draining after 4 months of use, Not getting any support from service center. Tried to escalate this, No one is helping on this. Zero marks for performance",
            "date": "28 Jun 2015",
            "name": "Mukul Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Writing this review after thoroughly using the mobile. Excellent display Never Lags Battery back up can be slightly down side",
            "date": "28 Jun 2015",
            "name": "Ashish Kothawale",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this product from last 7 months. Its a good phone. Cons: 1 The battery backup is low and not great specially after lollipop upgrade 2. no usb cable Flipkart :super fast awesome service. one extra star for your service",
            "date": "27 Jun 2015",
            "name": "Annesha Sarkar",
            "stars": "5 stars"
        },
        {
            "comment": "I have used both this and its predecessor and other than some minor tweeks in the camera, screen, launcher etc its practically the same phone.. The Moto G(2014) I bought was Android 5.0.2 Lollipop out of the box, so that is sweet gift... And by the way.. the stock headset that comes with it is absolutely rubbish..",
            "date": "27 Jun 2015",
            "name": "Aadithyan Jr",
            "stars": "5 stars"
        },
        {
            "comment": "best phone among 11k.. and thanks to flipkart to delivered within 2 days only! r u want to pure android experience then blindly buy it.",
            "date": "27 Jun 2015",
            "name": "Dipanjan Polley",
            "stars": "4 stars"
        },
        {
            "comment": "I recently purchased the phone, as usual Delivery was excellent, the phone is good, smooth, no lag, I used for a week, did not notice any hang. But the real issue the Battery, it takes very long time to get fully charged, and battery is finished within 6-7 hours",
            "date": "27 Jun 2015",
            "name": "Bhajan Biswas",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using this mobile phone since 2 months ago. This mobile is excellent in performance,display,sound. Camera quality is good. But at present according to price this phone is not up to the mark because you can get more features with less price from other mobiles like Lenovo a6000 plus,lenovo a 7000, Huawei Honor etc. But one think you should keep in mind that is this phone does not launch along with above mentioned model. If you want to compromise with features according to price then this the best choice. Also I want to mention here that Moto G(2nd Gen) design and quality is very nice. But there is little bit disadvantage is there that is the battery is not powerful of this phone.",
            "date": "27 Jun 2015",
            "name": "Subhankar Ghosh",
            "stars": "5 stars"
        },
        {
            "comment": "I got some issues on the phone. Touch is not good and its not working some times, calls are automatically hang up, incoming callers hearing their voice 2 times, battery is not good, other applications are opening automatically,sometimes charger is not connecting, calls are automatically disconnecting. I need replacement or return my money on this product. And finally i am not satisfied with the product.",
            "date": "27 Jun 2015",
            "name": "Ravi",
            "stars": "1 star"
        },
        {
            "comment": "Used this product last 4 months. Good phone, feature rich & good price. On time delivery by Flipkart. Happy with this product.",
            "date": "27 Jun 2015",
            "name": "Jai Shanker",
            "stars": "4 stars"
        },
        {
            "comment": "I am using this product from last 8 months. This is an amazing phone with crystal clear camera which has beaten the camera of my Note 2 (same 8MP/2MP). Battery and UI run smoothly. It never heats up or it rarely hang (only once after the update to 5.1). It almost runs every high end games. In short Water Resistance dual speakers obviously the cameras are the USP of this phone. I have three of them running like a butter ;)",
            "date": "27 Jun 2015",
            "name": "Naveen Ganer",
            "stars": "5 stars"
        },
        {
            "comment": "BOught this phone with a lot of expectation. Was working fine for a month but ever since then there has been battery problem, touch problem",
            "date": "27 Jun 2015",
            "name": "Akshit Sood",
            "stars": "2 stars"
        },
        {
            "comment": "Good phone in this price range and have it .... awesome display, descent battery, good processor perfo...",
            "date": "27 Jun 2015",
            "name": "Balachandran C V",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this product but it started showing problems within 2-3 months. Will not recommend it to any one.",
            "date": "27 Jun 2015",
            "name": "pkn",
            "stars": "1 star"
        },
        {
            "comment": "Best Product & Packing is good.I Like this delivery.I already bought the HTC Desire C Model Previous Year in this Seller via Flipkart.Very Nice...",
            "date": "27 Jun 2015",
            "name": "Manimaran Shan...",
            "stars": "5 stars"
        },
        {
            "comment": "how can we copy files from pc without data cable? Please send data cable. dude......................................................................................................................................",
            "date": "27 Jun 2015",
            "name": "Vidhyasagar Allu",
            "stars": "1 star"
        },
        {
            "comment": "Hai Friends This Mobile is very nice, i can also use mobile I can sugest you also purcase this Mobile MOTOG2",
            "date": "27 Jun 2015",
            "name": "ganapathi reddy",
            "stars": "4 stars"
        },
        {
            "comment": "200% satisfied with the product.Full of advantages. U cant imagine another mobile for this rock bottom price with such a awesome specs. Using the phone for past 5 months & within this 5 months time I bought another 2 Moto-G (for my Dad & Sis). Bought this in 3 different prices: Feb 2015 - Rs.13000 Mar 2015 - Rs.10000 (incl of Flipkart App big day discount and 10% discount on AXIS card) June 2015 - Rs.9000 (incl of Flipkart App big day discount and 10% discount on SBI card) Pros: Not to be listed. I see tonnes of Pros in this Phone. Some which haven't been mentioned by other reviewers I would like to share it: 1. Service is very good. If your product is within warranty you are 100% secured with zero penny wasted. 2. Accessories are damn cheap (ex: Charger - Rs.350, Earphones - Rs.250) Cons: 1. If phone switched off with dry battery, it takes minimum 15 mins to gain 1% battery. Total charging time to gain full battery is also too too slow (but battery back up is very good compared to other smartphones with 16M colors) Verdict: GO GO GO..!!!!!! Buy this and enjoy rest of your time..!!!! WSRetail and Flipkart Rocks in their service by prompt delivery..!!!!!",
            "date": "27 Jun 2015",
            "name": "Vasanth Gm",
            "stars": "5 stars"
        },
        {
            "comment": "The phone went upto 55 degree celcius I replaced the phone within a weak after i purchased it but even the replacement phone sometime heats too much... so if you are a so moto G fan then wait for Moto G3",
            "date": "27 Jun 2015",
            "name": "Kaushik Verma",
            "stars": "2 stars"
        },
        {
            "comment": "I purchase Moto G (2nd Generation). But it did not suit me accordingly so returned it to Flipkart. Now my findings are: Cons: 1- Battery percentage not displayed in status bar. 2- To enable mobile data we have to click simultaneously 3 times from toggle quick settings to settings. 3 - Issue with battery. Takes too much time to charge, almost 4 hours. 4 - Battery drops down inconsistently. Again reverts to old percentage on restart. 5 - Many bugs on software. 6 - Snapdragon 400 is old nowadays. Snapdragon 410 on other phones such as Lenovo A6000, Lenovo A6000 Plus, Xiaomi Redmi 2, Honor 4X works much better. 7- Heats up sometimes a little on gaming and video calling. 8 - No \"clear all\" function in task switcher. Pros 1 - Amazing built quality 2 - OS updates. The best feature of all. 3 - Brand Name. 4 - Excellent customer support and service center. Go for this device if the above cons suits you. About Flipkart. Excellent service. Very prompt and fast delivery. Awesome packaging. VERY easy returns. Super excellent customer service. Always purchase from Flipkart. They are the best. Don't look elsewhere...",
            "date": "27 Jun 2015",
            "name": "AVIK GHOSH",
            "stars": "3 stars"
        },
        {
            "comment": "display is gone after 6 months of use . now have to take it to service center for repair . i went by moto brand name but looks like this also has problem",
            "date": "27 Jun 2015",
            "name": "Naveen Gowda",
            "stars": "1 star"
        },
        {
            "comment": "I got replacement. But from the time I switched on the mobile I was not asked the initial settings which I was asked with the first mobile I got. Now my sim slot 2 is not working.",
            "date": "27 Jun 2015",
            "name": "Revathi L",
            "stars": "1 star"
        },
        {
            "comment": "the piece is good.touch is perfect.but there is a slightly hanging.last but not least it isgood bsed on its price.",
            "date": "27 Jun 2015",
            "name": "sudheer devala...",
            "stars": "4 stars"
        },
        {
            "comment": "Hi , I have bought this phone recently, everything is fine with it, but the accessories(headset and charger) looks like worst than basic chinese accessories. Headset is not useful, cant hear voice clearly. Charger, hard to insert looks like it end up in damaging the phone shortly.Nothing big about this phone. Reducing the rating due to improper handling of complaint by technical team.",
            "date": "27 Jun 2015",
            "name": "Rajagopal S",
            "stars": "1 star"
        },
        {
            "comment": "Excellent Service, Good seller.....Mobile is Value for Money. Been downloading lot of App's working Smoothly. Feel...Touch...Look's are all good.",
            "date": "27 Jun 2015",
            "name": "Nasir Mirab",
            "stars": "5 stars"
        },
        {
            "comment": "AMAZING..................... SIMPLY AMAZING GOOD PERFORMENCE, BATTERY IS DECENT, CAMERA GOOD, NO HEATING ISSUE..............",
            "date": "26 Jun 2015",
            "name": "RAM",
            "stars": "4 stars"
        },
        {
            "comment": "great experience till date........................................................................................................................................................................................",
            "date": "26 Jun 2015",
            "name": "ankita rana",
            "stars": "5 stars"
        },
        {
            "comment": "I found in my mob..sometime When I got call then I am hearing the voice to another person who is on call.",
            "date": "26 Jun 2015",
            "name": "Rajnikant Bhagat",
            "stars": "4 stars"
        },
        {
            "comment": "bought this one for my younger brother.. and it works better than my overrated asus zenfone 5. it can handle games better than zenfone 5 although it has got 1 GB ram",
            "date": "26 Jun 2015",
            "name": "Dheeraj Patil",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased the phone from Flipkart on 23rd June 2015. The SIM cards do not get detected. They need micro sims for MOTG. Tried using 4-5 different sim cards however the sims do not get detected. It is really disappointing when FLIPKART pushes a product under the flipkart advantage scheme stating the products and sellers are verified. Is this the kind of products that will be sold. I have asked for replacement of the same. Will keep you updated.",
            "date": "26 Jun 2015",
            "name": "Jeevan DSouza",
            "stars": "1 star"
        },
        {
            "comment": "I buy it in exchange offer. No doubt Moto-G is one of the best phone. Got product in good packaging, delivered within the time time frame. I am using it , found no problem at all.",
            "date": "26 Jun 2015",
            "name": "Sunil Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "It was not good frm the first the whenever my net connection is ending its performing worst dont know what was the prblem when i gave it to service center they made it even worse....",
            "date": "26 Jun 2015",
            "name": "Tanupriya Biswas",
            "stars": "1 star"
        },
        {
            "comment": "after 9 months of usage, i am satisfied with this mobile great display super audio good camera nice voice clarity good gaming experience some times laggy if u install more apps..",
            "date": "26 Jun 2015",
            "name": "Narender Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought Moto G2 (22-24 Jun offer sale) and a couple in the past, for the first time seeing a dead pixel in the new one received today. Not sure this issue is because of OFFER PRICE, to decide on return tomorrow.",
            "date": "26 Jun 2015",
            "name": "Balasubramanian",
            "stars": "2 stars"
        },
        {
            "comment": "I got this phone 2 weeks ago and I tell you it is the best phone that you can get. It has features of mobile phones which are above 30k. No lag problems. No heating problem. Just an ideal phone to get. Only a minor problem that is the power of battery, it drains very quickly. But overall, a fantastic phone to get. Please don't hesitate to buy. Just go for it guys!! And yes, flipkart has also offered me a very good service. I am glad to get this phone. Moto G2",
            "date": "26 Jun 2015",
            "name": "Akshat Baldia",
            "stars": "4 stars"
        },
        {
            "comment": "excellent experience with this phone in all departments. if ram and camera could have improved then it would be a gem.",
            "date": "26 Jun 2015",
            "name": "Purna Patra",
            "stars": "4 stars"
        },
        {
            "comment": "It is just a day since my purchase of Moto G so my review is purely based on this one day usage. I had wanted a phone with a decent camera, decent display under 10000. Thanks to the 3 day offer by flipkart on June 22-24, I got my hands on this phone for just 7000 in exchange offer. So far the phone has satisfied all my needs. The packing by Flipkart was good and neat and my phone was delivered without any defect or mistake. Good things about Moto G: 1. The display is good and classy. Doesn't look cheap at all. Gives a premium look 2. The performance of the phone is good under normal usage. Apps open quickly without any lag. I have not played any games yet so can't comment on the performance with respect to games 3. Automatic brightness is available which is a good thing. We don't have to adjust the brightness every time. Sunlight viewing is also comfortable. I did not find any issues with it. 4. The build quality matched my expectations. It looks similar to Nexus series of phones( i compared my phone with the nexus phones that my colleagues had, and found no difference in the build quality) 5. The battery is not draining on standby. I left the phone at 65% when I went to bed, and the next morning the charge was 64%. This was impressive. The battery also lasts for upto one and half days on moderate usage( whatsapp - 1-2 hours, checking facebook 2-3 times a day, browsing internet for 1 hour, voice calls- 1 hour, video play back - 1 hour, using camera for 15-20 min ) 6. The front stereo speakers are really good and it impressed me a lot. I liked listening to few songs on the speakers 7. The camera clarity was good. The HDR mode makes the photos look brighter and clearer. There was no shutter lag. 8. 16 GB memory 9. Corning Gorilla Glass 3 Things I didn't like about Moto G: 1. The headphones that come in box are not good. They are below average 2. The call quality could have been better. Though i kept the call volume at maximum, i still had trouble listening to the voice on the other side. The voice is not clear on calls. 3. No file manager app. I don't mind the cons that much. Overall, i love the phone. I would recommend this phone to anyone looking for a budget phone with good quality. Full 5 stars for the phone",
            "date": "26 Jun 2015",
            "name": "Rohisha Thulas...",
            "stars": "5 stars"
        },
        {
            "comment": "I've ordered Moto G (2nd Generation) with in a day grantee delivery. They delivered defective phone on time. When I generate return request, they sent engineer for repair the phone.......!!!!!!!!!!. Well..... After 3 days their engineer check the phone and update as defective. Finally they are agree to replacement with in next 15 days. This is their fastest delivery..........?????????? Mere Gift ki to wat...............lagadi. THIS IS THIRD TIME DOING THIS KIND OF PRODUCT & SERVICES BY FLIPKART. So users be careful..........before gifting someone from flipkart.",
            "date": "26 Jun 2015",
            "name": "SK",
            "stars": "1 star"
        },
        {
            "comment": "In just 2 months this phone's both Sim Slots gets defected i tried with Motorola Service center onto his address but there were no such service center (laxmi nagar) i found. After selling their product their motive is completed but the customer's satisfaction is not in their business i guess.. my first experienced of Motorlola is very bad....... my first experienced of online eletronic (mobile phone) product with flipkart is also very bad.....",
            "date": "26 Jun 2015",
            "name": "sundeep negi",
            "stars": "2 stars"
        },
        {
            "comment": "Value for money ... Enjoyable Lollipop .. Ergonomic design the best one .. Superb Grip ... Handy for one hand use ... Superb Camera ...",
            "date": "26 Jun 2015",
            "name": "Vishal Patel",
            "stars": "5 stars"
        },
        {
            "comment": "Great phone android lollipop is just awesome and MOTO G brilliant phone. Nice look , accessories. give 5 to 5 star also flipkart deliver very fast in just two days.",
            "date": "26 Jun 2015",
            "name": "Nisarg Shukla",
            "stars": "5 stars"
        },
        {
            "comment": "Good to buy for this price but the only draw back is inbuild battery ... sometime it got hang cant able to restart easily .....",
            "date": "26 Jun 2015",
            "name": "Selvam R",
            "stars": "3 stars"
        },
        {
            "comment": "Battery draining very fast, If i play games or browse any thing battery draining too fast. Charging takes more than 2 hours. Other features are okay",
            "date": "26 Jun 2015",
            "name": "Abhilash",
            "stars": "2 stars"
        },
        {
            "comment": "The Phone is great But The service is Just the worst i have came across to. . It has been 18 days till now i haven't received my phone back from service center. They say the case has been escalated to higher authority, priority team. to a higher level concern person but i haven't received my phone. Do not Invest you time and Money in Motorola It is Titanic. This company will fail again in near future.",
            "date": "26 Jun 2015",
            "name": "Aman Kr",
            "stars": "1 star"
        },
        {
            "comment": "Would not suggest anybody to buy this product as battery backup is very less. Apart from that everything else is good.",
            "date": "26 Jun 2015",
            "name": "Hris",
            "stars": "1 star"
        },
        {
            "comment": "It hangs often. Did flash once but still the same. Have to send it to manufacturer only :( Please do not buy mobile phones through online shopping. It hurts when the phone doesn't work",
            "date": "26 Jun 2015",
            "name": "Worst phone",
            "stars": "1 star"
        },
        {
            "comment": "Cracks if u put in jeans. Even service center people suggested not to put in pockets . I dont know where the hell we can put.. Doesnt understand the meaning of Gorilla glass",
            "date": "26 Jun 2015",
            "name": "Krishna",
            "stars": "1 star"
        },
        {
            "comment": "Don't buy this Product. There is some issues to this device such as 1) Daily early in the morning display is not working.Every time want restart the Phone. 2) Bottom of device hardware get heat after the restarting the device. 3) If phone is restart then so many application already in open condition. 4) Last and most IMP- If i going to lock a screen then dispaly is permantatly off after have restart the phone again and again",
            "date": "26 Jun 2015",
            "name": "Prasad Jagdale",
            "stars": "1 star"
        },
        {
            "comment": "please dont go offer and price.... it a very third classs mobile ...after one month my mobile goint to little hang and suddenly totally dead..... dont buy this mobiloe",
            "date": "26 Jun 2015",
            "name": "jeetendra kumar",
            "stars": "1 star"
        },
        {
            "comment": "My charger point was broken no service warranty covers that. I have just used for only 3 months bad impression.",
            "date": "26 Jun 2015",
            "name": "Chandra Sekhar Jo...",
            "stars": "2 stars"
        },
        {
            "comment": "Had ordered thinking the best product from motorola.Voice and sound is not clear. It feels like using a cheap china made phone",
            "date": "26 Jun 2015",
            "name": "ABHIJEET SINGH",
            "stars": "1 star"
        },
        {
            "comment": "My phone is in service for the past 50 days and till now i have not received any response. My work order no. is GWI/MG/15/00088. I advice nobody to buy any motorola phone because of its poor service.",
            "date": "25 Jun 2015",
            "name": "gaurab baruah",
            "stars": "1 star"
        },
        {
            "comment": "I have purchased a month ago and it looks so great i am loving it. i also Moto E 2nd. Moto E2nd initially have heating problem but later it is solved. With experience i see the new gets heated faster, and then after using couple of months heating problem have come down. I love Moto Brand mobiles(:-",
            "date": "25 Jun 2015",
            "name": "Bhasker M",
            "stars": "5 stars"
        },
        {
            "comment": "FANTASTIC HANDSET IN MID RANGE, BEST BATTERY BACK UP, FLEXIBILITY TO MOVE APPS TO SD CARD, BEST FEATURES, EXCELLENT SPEED",
            "date": "25 Jun 2015",
            "name": "YOGESH SALVI",
            "stars": "5 stars"
        },
        {
            "comment": "This product met the \"WIFE\" approval standard She loves it and cant find fault with it. I do not need any other certificate :)",
            "date": "25 Jun 2015",
            "name": "Rakesh Singh",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G GEN 2 is a rock solid android phone. Its comes with a 5 inch IPS LCD screen. With 16GB internal storage with 32GB upexpandable memory. Performance of the phone is awesome with Stock android. recently I got 5.1 update and its too fast and stable as well. Best part of this phone is its camera its produces awesome photographs both in daylight and on low light condition. I will recommend others to buy the phone.",
            "date": "25 Jun 2015",
            "name": "Amartya Biswas",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G (2nd Generation) is the most reasonable android at such cost. I have purchased at Rs 10,000 with offer having 2 GB airtel data, but I didn't get that offer but still Flipkart service is awesome.",
            "date": "25 Jun 2015",
            "name": "Nitin",
            "stars": "5 stars"
        },
        {
            "comment": "the battery is faulty, the phone gets heated up when u start playing any games.. overall good. so its ur lookout whether to buy or not... camera is very good.... nw its cheap so no harm in buying... bt there are more mobiles in market with more features for same price...:P",
            "date": "25 Jun 2015",
            "name": "reena",
            "stars": "3 stars"
        },
        {
            "comment": "nICE .........................................................................................................................................................................................................",
            "date": "25 Jun 2015",
            "name": "sUKHI",
            "stars": "4 stars"
        },
        {
            "comment": "since lollipop update my phone got struck often....other than that the performance are good...specs shows 16gb internal but we can only use 12GB!!",
            "date": "25 Jun 2015",
            "name": "Prasanna kummar",
            "stars": "4 stars"
        },
        {
            "comment": "First of all i am surprised that Motorola have not provided any of its address in India at its website, I have purchased Moto G2 in April 2015 with a faulty sim card slot, but when i went to service center for repair/replace they are saying that it was done forcefully and i will be charged extra for the same, i agreed to him and have given the handset for repair. But till date my handset is lying with the service center only. Motorola office is telling that they have sent the parts and the handset is repaired but till date i have not received back my handset. The customer care executive gives false assurance every week and they often disconnect the call by keeping in hold. I am totally dissatisfied by the service.",
            "date": "25 Jun 2015",
            "name": "PARAS DIDWANIA",
            "stars": "1 star"
        },
        {
            "comment": "battery back up is so poor, hangs sometimes except this, phone is good, display quality is good, cameras are good,",
            "date": "25 Jun 2015",
            "name": "Ali Murtza",
            "stars": "3 stars"
        },
        {
            "comment": "my phone worked well for first 6 month but suddenly i stated facing charging issue...it take long hours to charge but short hours to discharge..... however motorola claims that they are getting complains regarding it and will fix them soon... However they were agreed to fix my charging issue.",
            "date": "25 Jun 2015",
            "name": "manish",
            "stars": "3 stars"
        },
        {
            "comment": "over all the best phone in the android market i love the phone i guess you'll also like it......hangs sometimes please provide any solution please.",
            "date": "25 Jun 2015",
            "name": "good phone",
            "stars": "5 stars"
        },
        {
            "comment": "I am using it from january 19th 2015 . Till then the problem I faced is that it laggs a bit . It gets heated up very much when net is running and when I am attending a call simuatneously. The battery life is normal though its not giving according to expectation. The pictures shot by its camera is good but when its copied to PC and seen , gives not good quality of pics as compared to samsung android phones. Just after 1 month of using the phone it got heated up in such an extent that it was giving me a smell of burning PCB. Recently I have reported a problem that sometime when a call is comming I cant pick it up as the touck to receive a call is not working . Overall the experience is average .",
            "date": "25 Jun 2015",
            "name": "Suman",
            "stars": "3 stars"
        },
        {
            "comment": "First send the used phone and after exchange second phone was defective. Now I am stuck with the phone whose touch screen is not working. and FLIPKART IS NOT RETURNING THE DEFECTIVE PRODUCT. FORCING ME TO KEEP THE SAME PRODUCT. NEVER SHOP FROM FLIPKART.",
            "date": "25 Jun 2015",
            "name": "SONIYA AGARWAL",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2nd Gen is Good mobile With updated configuration for Low price flipkart delivery is very fast i get that mobile very fast within 48 hours at free of cost",
            "date": "25 Jun 2015",
            "name": "PRASAD POOJARY",
            "stars": "4 stars"
        },
        {
            "comment": "Nice for the price.......................................................................................................................................................",
            "date": "25 Jun 2015",
            "name": "Darshan",
            "stars": "4 stars"
        },
        {
            "comment": "Cannot express my disappointment and frustration with Flipkart the and product quality. Got the phone exchanged once and the second time is no better. inspite of calling the custmer care since a month (soon after the delivery) for n number of time, finally they saying my service period is breached because its over a month. and since a month did all the troubleshooting and smart check steps as i was told to do. And they cannot do anything !! are they kidding ! Such bad service never expected. Looting the customers. WORST experience in online shopping. Dont Go for this Phone Especially from flipkart.",
            "date": "25 Jun 2015",
            "name": "Tanvi MAkwana",
            "stars": "1 star"
        },
        {
            "comment": "Go for it,..with eyes closed....Its camera is superb,you get photos of great quality like photos of 13 MP camera.Only i thing i didnot like is its battery back up..but that also doesn't give u any problem u can work with the mobile for whole day if you charge it once in the morning.You can play awesome games like ASPHAL* 8,and many other games. \"If you are looking for a phone with awesome features ,this is the one.....\"\"",
            "date": "25 Jun 2015",
            "name": "SHEKAR SHASTRY",
            "stars": "5 stars"
        },
        {
            "comment": "bought this phone on 10the Jan 2015,after 6 months of usage I am facing some problem while unlocking the phone.In Pune we have only pathetic service centre near \"narayan peth\". This guys always gives you some lame reason why they have not repaired my phone everyday.My phone is still with them. Guys please be cautious while you take your phone to these service centre ,One the very first they will tell you to come next without asking you about the problem in the phone,they will keep your phone . I am really pissed off from the service of Motorola. I am happy with the performance of my phone but service centre suckss !! Please Motorola at least show some respect to customers..",
            "date": "25 Jun 2015",
            "name": "Rishabh Shukla",
            "stars": "3 stars"
        },
        {
            "comment": "i just ordered a MOTO G 2nd GEN (white) in FLIPKART i got it within 2 days the mobile is very nice and good working but i could not insert the SIM 2 on SIM card slot because the slot is too tight and could not insert the sim card in any angle i just book a return order that i need a new piece i got a call on 4:15pm they asked me what's the problem on your phone i told them that i could not insert SIM 2 on SIM 2 slot. FLIPKART accept the problem and gave me a new piece within 2 days now the mobile is very nice and i don't have any problem on my mobile i very much thanks to FLIPKART to solve my problem friends i suggest flipkart is the best website to buy product in online with full hope THANK YOU FLIPKART",
            "date": "25 Jun 2015",
            "name": "HAROON RASHIDH",
            "stars": "5 stars"
        },
        {
            "comment": "this is ymmy in use. and this 1 gp ram = 2 gb ram. 2 fatest and too smooth opertion. worth to bye go for it",
            "date": "25 Jun 2015",
            "name": "d kumar",
            "stars": "5 stars"
        },
        {
            "comment": "after i upgraded to latest android, now after 4 months from buying date it is working very slow, touch is unresponsive many times, i have to restart my mobile, contacts application is shit, many times i am not able to call back, or call at all, i have to restart the mobile",
            "date": "25 Jun 2015",
            "name": "Ratnesh Chandak",
            "stars": "3 stars"
        },
        {
            "comment": "- Delivered a damaged phone - Made us return the item by making the shipment amount from our hand - Fake replacement policy - Didn't replaced the item. - After 100 follow ups, compelling me to cancel item and asking fresh order. PLEASE AVOID FLIPKART and THIS SELLER Want to give a 0 star",
            "date": "25 Jun 2015",
            "name": "Sreejith Murali",
            "stars": "1 star"
        },
        {
            "comment": "A very good deal from the house of moto but i have a little complaint with flipkart why you guys are reducing its price each and every months :) it feels bad for those who have already bought it 2-3 months back",
            "date": "25 Jun 2015",
            "name": "rohit bhattach...",
            "stars": "5 stars"
        },
        {
            "comment": "I've ordered 3 days ago one Moto G2 which order number is OD003165845572912200. This cell irritating me and customer care executive too. how to install the smart check app while my cell is not working properly its stuck on white screen. please I want my money back in account. Very disappointed.",
            "date": "25 Jun 2015",
            "name": "krunal mate",
            "stars": "1 star"
        },
        {
            "comment": "Thank you Flipkart for your awesome service got the phone within 24hrs. Do doubt this phone is Awesome in this price range (got it in 9K on Flipkart App). Camera quality is good, no lag, nice look, battery is also good for normal usage, display quality is also good, in short this phone will not disappoint you in any way. Also got this phone with lollypop updated without any issue while operating. Manufactured date May 2015 so not to very that this phone is old & all. Solid build quality and very nice to hold in one hand.",
            "date": "25 Jun 2015",
            "name": "Abhishek Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "i had ordered moto g2 on 23rd , i received the mobile on 24th morning it self.The mobile is very nice with android lollypop",
            "date": "24 Jun 2015",
            "name": "damodar Reddy",
            "stars": "1 star"
        },
        {
            "comment": "This mobile's glass display is vulnerable to break if it falls. My mobile had fallen accidentally and replacing the display costs Rs.4500/- which is close to 40% of the product value. This is a delicate product unlike Samsung(even if it falls still works) and go for this only if it is handled like baby ! It is not worth spending on flip covers for this mobile.",
            "date": "24 Jun 2015",
            "name": "Ekantharajan AC",
            "stars": "1 star"
        },
        {
            "comment": "maine jab mobile liya tha to tab dauble data offer tha , jo mujhe one month mila uske baad maine airtel custumer ko bhi bhut call kiya kuch solution nhi hua...jo flipkart se maine moblie liye hai to yeah to mujhe data de .nhi to apna mobile refund le lo mujhe nhi hai ab trust flipkart pr.",
            "date": "24 Jun 2015",
            "name": "Naresh kumar",
            "stars": "1 star"
        },
        {
            "comment": "Earlier I have purchased a Micromax A Nitro 311 but requested for refund/replacement due to the lag in every specification. So given negative rating for that and badly reviewed. After refusal from ws-retail seller, I have sold that phone to my friend on a cheaper orice. Now I after purchasing this Moto G2, given this as a gift to wife, and she is totally happy with this. Phone is working as per it's specification. I hear good points everyday from her that she is enjoying her gift. Finally, Hats-off flipkart this time. Expect this only with Flipkart and their sellers like ws-retail. KEEP IT UP :)",
            "date": "24 Jun 2015",
            "name": "Saurabh Verma",
            "stars": "5 stars"
        },
        {
            "comment": "Battry back up is too low... even fully charged battry is providing only 5 to 6 hours. am using this cell from last 12 days.",
            "date": "24 Jun 2015",
            "name": "Krishnamurthy S",
            "stars": "3 stars"
        },
        {
            "comment": "I think company should provide better charger, it takes 4- 5 hours to get fully charge as charger output is 550mA.",
            "date": "24 Jun 2015",
            "name": "Vimlesh Maurya",
            "stars": "3 stars"
        },
        {
            "comment": "VERY GOOD SERVICE BY FLIPKART, TOOK IT 3 MONTHS AGO CAMERA CLARITY IS NICE , BUT CHARGER GETS HEATED UP QUICKLY, NICE PHONE FOR 10K",
            "date": "24 Jun 2015",
            "name": "Abhishek abhi",
            "stars": "4 stars"
        },
        {
            "comment": "moto g 2 gen is an awsome phone.. i m impressed with all of its features in such less pocket.........i concern battery as a issue, which is not actually bad but do not level up wih all of its other features.......blindly add it to your cart n buy it.........gr8 expirence!!!!!!",
            "date": "24 Jun 2015",
            "name": "yash vishwakarma",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered Moto G 2nd gen via flipkart and i should blame myself for doing so. Day by day it is getting worse. It doesn't fetch the network properly and so many other problems. Nowadays battery backup also not good.I wouldn't recommend anybody to buy this worst ever phone.",
            "date": "24 Jun 2015",
            "name": "Jay",
            "stars": "1 star"
        },
        {
            "comment": "Never buy any Motorola product in India. I bought Moto G2 three months ago and it starts heating up while keep it on for charging. I gave my phone for repair to authorised Motorola Service Centre. They kept it for more than 2 weeks and returned it as it is without repairing my phone since they couldn't find any solution. I missed couple of important calls during this 2 week period. My phone was under warranty but when i called Toll-free Customer Care, they refused to replace my phone.",
            "date": "24 Jun 2015",
            "name": "Rachit Rawat",
            "stars": "1 star"
        },
        {
            "comment": "The phone seemed to work well for first couple of weeks. After that a major part of touchscreen is not responding, phone hanging and other software glitches. Have requested return. Surprised to know about the torturous return policy at flip kart. One customer service representative informs me that unless the diagnostic app is installed, no replacement possible. I try my best to them understand that because the phone's touchscreen is not working properly i am unable to install the app. Finally another customer service representative informs that it need to be taken to nearest flip kart repair center. After the certification from the technical service center the phone may be replaced. So i need to take the phone to the service center,get report from them, scan and email the report to flip kart. Why so much troubles for customers already suffering a loss of their time, money and the inconvenience caused by a defective productive? By the called motorola mobility service center, which recommended me a replacement. Its the flip kart that is causing problems! Buyers beware!!",
            "date": "24 Jun 2015",
            "name": "Siddharth Mandal",
            "stars": "1 star"
        },
        {
            "comment": "I ordered this product on 3rd June and received it on 6th June. Well packed and including all accessories the most amazing part is that it was already updated with android L out of the box. The phone is amazing it does not get heated up and can last for 2 days with minimal use on battery.",
            "date": "24 Jun 2015",
            "name": "Abhilash",
            "stars": "5 stars"
        },
        {
            "comment": "Worth!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Buying the mobile..Good speed. It would suit all people who prefer best smart phone in this rate",
            "date": "24 Jun 2015",
            "name": "Rajashree Racks",
            "stars": "4 stars"
        },
        {
            "comment": "Just go for this phone. Pure android with performance devoid of crapware. Toppings of future android update. :) Dont be fooled by low specs its just what the doctor advised. Now up for bargain.",
            "date": "24 Jun 2015",
            "name": "Ram Chandra Soren",
            "stars": "5 stars"
        },
        {
            "comment": "Hi all no words to say about my moto everything is good, Camera quality more than a mobile and awesome auto-focus feature i love it ....................",
            "date": "23 Jun 2015",
            "name": "Sunil Kumar Sa...",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product, worth the money...",
            "date": "23 Jun 2015",
            "name": "Rahul Sollapure",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone 2 weeks back. I notice that the device gets heated up quickly. Also the battrey drains quickly.",
            "date": "23 Jun 2015",
            "name": "Ganesh",
            "stars": "3 stars"
        },
        {
            "comment": "good phone for daily use comes with lolipop and applications are running smoothly. those front stereo speakers are very good for listening music.",
            "date": "23 Jun 2015",
            "name": "Ajesh Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "Its awesome phone with latest software from google.... no lag... battery is little concern, however its not a big deal...",
            "date": "23 Jun 2015",
            "name": "Kiran Anchuri",
            "stars": "5 stars"
        },
        {
            "comment": "camera quality could be better.. otherwise a very decent phone for the price.. sometimes sim error message is displayed..",
            "date": "23 Jun 2015",
            "name": "Anand",
            "stars": "3 stars"
        },
        {
            "comment": "the moto g is good phone in this price range. working smooth on lollypop. bettary back up good. excellent pic quality thums up moto",
            "date": "23 Jun 2015",
            "name": "Karamveer Behmni",
            "stars": "4 stars"
        },
        {
            "comment": "Ok, so the phone is quite good, lags sometimes but you can fix that with clean master (download from playstore) anyway lollipop takes a lot of battery, you may know but i have used the moto e (1st gen) for 1 year, and 4 months with lollipop, with 1990 mAh but still i dont get as bad battery life as this phone. this phone's battery life is pathetic..... it had come to a level of such frustration that i looked up this problem. the problem was the update of android 5.0.2, lollipop. in android 4.4, the battery lasted an entire day. so i suggest u download something as simple as nova launcher because google now and google app it self takes a lot of battery. a way temporary way to fix the problem is to go to recovery mode and clear the cache partition which you can look up on youtube or yahoo answers, anyway, all in all the phone is good but the battery drained this review, you can hardly use like a normal phoone. thanks - Kishor",
            "date": "23 Jun 2015",
            "name": "Kishor Chatterjee",
            "stars": "2 stars"
        },
        {
            "comment": "Its a good phone with some pros and cons.Price has dropped after I bought the phone. Its a great phone for the current price. Pros : Great Battery ,Any App runs on the phone without hanging , Screen resolution, Build of the phone and looks. Cons : Size and weight.Uncomfortable to carry in pocket.Takes really long time to charge. #3 star because of weight and old price",
            "date": "23 Jun 2015",
            "name": "Gan",
            "stars": "3 stars"
        },
        {
            "comment": "The RAM needs to be at least 1.5 GB or more. With 1 GB the phone get somewhat slow at multitasking. I hope the next generation comes with improved RAM.",
            "date": "23 Jun 2015",
            "name": "JAI GUPTA",
            "stars": "4 stars"
        },
        {
            "comment": "forget samsung and other brands this is pure clean android with butter smooth performance its simple and the speaker is its best asset",
            "date": "23 Jun 2015",
            "name": "Kush Lulla",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone in budget.... Great experince with it.... 1 star less due to small lagging sometimes in phone.....",
            "date": "23 Jun 2015",
            "name": "Jai Toshniwal",
            "stars": "4 stars"
        },
        {
            "comment": "I have received a faulty phone. The speaker and earpiece have a loud and constant noise that does not go. The customer service is useless. They are not returning ot exchanging the product as they are pushing for a remote solution. it has been 48 hrs there has been no response on that. I have been asked to install MBs of app on the go couple of times but still a waste. I am extremely disappointed on the quality of the product but more so by the quality of the customer complaint response. I am still awaiting for the issue to be resolved.",
            "date": "23 Jun 2015",
            "name": "Mohit Dhawan",
            "stars": "1 star"
        },
        {
            "comment": "nice camera,excellent graphics,good looks,very smart,but low battery life. in a nut shell the phone is brilliant package of amusement but for a short time.",
            "date": "23 Jun 2015",
            "name": "Kalpaj Banik",
            "stars": "4 stars"
        },
        {
            "comment": "Purchased this Product 3 weeks back .. and so far very happy with the performance with over all , my rating 9/10.. reason : compared to Xperia 13 MP camera ... MotoG 8 MP is good screen resolution and smoothness of mobile body is good , front camera is good . Overall.... no need to Purchase iphone6 flipkart delivery is amazing as always ... opt1 day delivery option (if needed) and you will get it in half day . i ordered this product on Sunday 10 AM and got the Product before 5 PM :)",
            "date": "23 Jun 2015",
            "name": "Naveen Chandel",
            "stars": "5 stars"
        },
        {
            "comment": "Hello All This mobile Purchase my friend, it is working good, & flipkart shipment delivery very good",
            "date": "23 Jun 2015",
            "name": "J.Logesan",
            "stars": "4 stars"
        },
        {
            "comment": "battery backup is very bad. I have purchaged the phone and its battery backup is only 2-3 hrs. Its earphone is not working. I have purchased it before 10 days ago. I wan to give this 0 rating product.",
            "date": "23 Jun 2015",
            "name": "alok gupta",
            "stars": "1 star"
        },
        {
            "comment": "Built Quality of this phone is good. Display Quality is Good. Battery backup is average but not BAD. Stock Android Rocks with this phone. Speaker and voice quality is awesome. Dual Sim Works perfect with this phone. Superb Network capturing even at the places where network is sporadic. No Heating problems at all, only thing is Motorola should increase the RAM of this mobile to at least 2 GB for advance users those usually use more applications and games. I know 1GB RAM is suffice the need of general users but new application those are coming now days requires more RAM to operate them seamlessly, else i would say Moto G stands apart from crowd, that's the reason behind its huge success. keep it up Motorola. Thanks Nishant R.",
            "date": "23 Jun 2015",
            "name": "Nishant Rapate",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is too good,nothing much to speak about the negative in terms of performance and camera quality....but the display sceen is not a quality one...it just broke when it fall from a 2.5 ft bed...which we did not expect.....",
            "date": "23 Jun 2015",
            "name": "Iceage1983",
            "stars": "3 stars"
        },
        {
            "comment": "Its a worth of money in 10,000, No other set is as good as Mot G in this price range. Go for it. It has 1 gb ram and does not hang also. Battey back up is also going good till now.",
            "date": "23 Jun 2015",
            "name": "Alam",
            "stars": "4 stars"
        },
        {
            "comment": "compared to moto G , G2 battery drains fast.. ( when they sized up everything , why dint they size up battery.. runs with same battery which powers MotoG :( )",
            "date": "23 Jun 2015",
            "name": "Mithun",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought moto g 2nd gen smartphone its delivered very quickly when i started using this phone from that time till now i am facing battery problem its giving only 2 hours backup only two times i have complained against this but they have cancelled my request without solving my problem....",
            "date": "22 Jun 2015",
            "name": "Prathap S L",
            "stars": "1 star"
        },
        {
            "comment": "Everything's quite good except for two things: battery tends to run out quickly and wifi connectivity issue",
            "date": "22 Jun 2015",
            "name": "kiran cv",
            "stars": "3 stars"
        },
        {
            "comment": "the best product from Motorola.i am using it from last 6 months ..i have gifted one more to my brother...he is also loving dis phone..i haven't got any problem till nw..i believe i wont have to face any in future...",
            "date": "22 Jun 2015",
            "name": "karthik kunal",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is comparatively slow - I have micromax of the same combination, which works better than Moto G2 The o/s is very slow and gets stuck very often you cant play games like temple run or race games without getting stuck i had to reset the mobile operating system twice within 2 months of purchase i would not recommend this product",
            "date": "22 Jun 2015",
            "name": "Murali N",
            "stars": "2 stars"
        },
        {
            "comment": "I have been using it for 8 months and the mobile is flawless. It has never hung even once and works perfectly fine. I have to recharge it everyday, but thats the case with all smartphones.",
            "date": "22 Jun 2015",
            "name": "Siva%20Rama Kr...",
            "stars": "5 stars"
        },
        {
            "comment": "backup is only 5hrs display is ok sound is also ok but bettry is only 5hrs after full charge backup is only 5hrs display is ok sound is also ok but bettry is only 5hrs after full charge",
            "date": "22 Jun 2015",
            "name": "Vikas Tyagi",
            "stars": "1 star"
        },
        {
            "comment": "My previous three smartphones have all been HTC Android devices. I decided to try the Moto G (2gen) after seeing Moto G and Moto X with friends. I had the following requirements: * Android Lollipop * Sufficient internal storage to let me install lots of apps (my previous phone had just 4 GB, which was not enough) * dual SIM I also wanted a phone, not a phablet. I would be very reluctant to go for a 5.5\" screen, for instance. The Moto G is great. Call quality, data connectivity, wifi reliability, are all very good. (My last phone, the HTC Desire 600, used to drop wifi randomly and repeatedly.) The 16 GB internal storage gives me more than 12 GB free after system software and bundled apps. This is more than enough for lots of apps. Unlike the 1gen device, this one has a MicroSD slot, which allows for a lot of the apps and data to be moved to the SD card. I don't get any HTC enhancements to the UI -- I get just stock Lollipop here. But I am finding it quite usable. Some things don't work as expected, but they are Lollipop problems. I should not dwell on them in a phone review. I also bought a Motorola flip cover for the phone, which replaces the back cover and fits on the body very well. I love this cover, because opening the flip-top switches on the screen without me having to hit the power button. Very nice touch. (I used to keep switching on the screen just to check the time, since my cellphone has been my watch for the last few years.) I will highly recommend this accessory. Have not used the supplied headset, so I can't comment on its quality. I have used the headset output with my Etymotic HF2 and ER4-PT IEMs and the sound quality is excellent -- it's all you can expect without a dedicated headphone amp. Adequate volume too. The Bluetooth pairing with my Plantronics Voyager Legend is very solid -- I don't find Bluetooth pairing drop-outs as I used to find occasionally with my HTC. I have done upto two hour-long tele-conferences using GoToMeeting and Skype using this phone and my Voyager Legend, with the phone online on 3G. It works well. Am not a gamer, so I can't comment on game performance. I find it hard to justify the price of an expensive HTC 826 after experiencing this phone.",
            "date": "22 Jun 2015",
            "name": "tcpip",
            "stars": "5 stars"
        },
        {
            "comment": "If you are looking for a good phone in budget then buy this one. i know that Moto g 3rd gen is coming but its price would be near 17,999 but this phone ,i.e., moto g2 is the best budget phone",
            "date": "22 Jun 2015",
            "name": "Rijul Radhu",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using it for the past 3 months. Do one thing at a time, it works well. Try doing multiple things at a time like browsing and suddenly try and open a whatsapp notification. It hangs. Handle it with care and it works fine.",
            "date": "22 Jun 2015",
            "name": "Vamsee",
            "stars": "3 stars"
        },
        {
            "comment": "I am using this phone since Dec 14 and it has been very good. I have no complaints. Battery is good, speed / performance has not deteriorated. I mostly use the phone for calling, some times as camera or music. I must say the camera is amazing, the pictures are awesome. Music is OK. Bluetooth connectivity with my car phone is instantaneous. Before I forget, motorola migrate is an excellent utility, it transferred all the data / apps / contacts et from my samsung note to moto g2, it was so convenient that I did not find a single inconvenience switching to a new phone. My recommendation, is go for it. Only down side I find is using the dual sim. When one sim is being used the other sim callers get out of coverage message. Other than this, all is good.",
            "date": "22 Jun 2015",
            "name": "Kiran",
            "stars": "5 stars"
        },
        {
            "comment": "Best Ever phone, with excellent display,super stereo sound,and brilliant sleek look. Just amazing phone. Go for it!!",
            "date": "22 Jun 2015",
            "name": "Hanif Abuvani",
            "stars": "5 stars"
        },
        {
            "comment": "A short and crisp review to make your decision. USPs: 1. Brand ( n thats it) 2. Y Shouldn't you buy : a. The gorilla glass as claimed shatters if it fall from a height of say 3 feet.The glass shattered within 2 weeks of buying and the replacement comes for 6-7k.(Was using a micromax earlier ,though it wasn't a gorilla glass but never broke even if fallen multiple time) b. Heating Issue. c. The accessory headphone will stop working if not handled with care. d. Service centres are not approachable over phone e. The battery doesn't lasts more than 8 hrs if fully charged. Rest every thing is fine.Even if you wish to purchase it you can but I suggest there are better phones available in this range.Why pay more for a high brand off quality product.",
            "date": "22 Jun 2015",
            "name": "ABHISHEK KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "Do you need any more reasons to buy????..................................................................................................................................................",
            "date": "22 Jun 2015",
            "name": "Ajeya Shetty",
            "stars": "5 stars"
        },
        {
            "comment": "I HAVE TAKEN 2ND GEN MOTO G. BUT VERY SORRY TO SAY THAT ITS BATTERY IS NOT UP TO MARK. I HAVE BOUGHT THIS CELL IN THE MONTH OF DEC 2014. ITS ONLY 6 MONTH HAS BEEN PASSED. AND AFTER 4 HOUR'S THIS PHONE IS OFF.",
            "date": "22 Jun 2015",
            "name": "SANDEEP SHARMA",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased this phone on Big Billion Day(Oct -14) with 10% Cashback. Its been 5-6 months, still I havent recieved any Cashback till now. Contacted Customer Care many times, but I havent recieved any calls from them. Just they replied message tellng we will inititate on Feb-15. Its been June-15 now, but never heard of any cashback. Waiting for them to call..",
            "date": "22 Jun 2015",
            "name": "Ajith Shanbhag",
            "stars": "2 stars"
        },
        {
            "comment": "low quality product and within a year you will find problem with charging usb port of the phone. need to improve quality. i think its better going for some other product better than this",
            "date": "22 Jun 2015",
            "name": "abhinand k p",
            "stars": "1 star"
        },
        {
            "comment": "Most of the times when I receive incoming call the phone hangs and I am unable to lift it but good thing is we have a workaround for this. By pressing the power button twice we can lift sometimes. For SIM issue, we need to restart the phone then only it detects the SIM. Battery is draining like anything. Not Preferable if you are looking for a good battery life. It drains in 5 hours.",
            "date": "22 Jun 2015",
            "name": "Hangs during i...",
            "stars": "2 stars"
        },
        {
            "comment": "Pros: Screen size Battery performance Internal memory Touch speed Lolipop update Cons: Head phones Ear phones need to plugin to play FM Finally I recommend this phone to a friend.",
            "date": "22 Jun 2015",
            "name": "Sagar Pudi",
            "stars": "5 stars"
        },
        {
            "comment": "All is good but battery backup is the worst. Not expected from a Moto G(2nd Generation) phone. ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
            "date": "22 Jun 2015",
            "name": "ARNAB KAR",
            "stars": "3 stars"
        },
        {
            "comment": "superb ....thumbs up......................................................................................................................................................",
            "date": "22 Jun 2015",
            "name": "Sunil Rajpoot",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is from Motorola which has a good come back and Delivery is on time, product is good and best at this price. Well satisfied with Flipkart.",
            "date": "21 Jun 2015",
            "name": "Gunjan",
            "stars": "4 stars"
        },
        {
            "comment": "flipkart service is ultimate. ordered the mobile at midnight 12:00 AM,before 10:00 AM i received the product. i am using this mobile it's performance is not up to the mark.if i install the apps it's getting hanged.",
            "date": "21 Jun 2015",
            "name": "harish",
            "stars": "3 stars"
        },
        {
            "comment": "I Presented This Phone to my sister ,She is very happy with the gift .But the disappointing thing is Video call option is not present in MotoG 2nd Gen",
            "date": "21 Jun 2015",
            "name": "Gagan",
            "stars": "5 stars"
        },
        {
            "comment": "This has whatever the phone has to have. Wonderful phone !! Just the battery had to be bigger Everything else is just wonderful",
            "date": "21 Jun 2015",
            "name": "Ashwini Kolvekar",
            "stars": "5 stars"
        },
        {
            "comment": "This phone has ideal features so just go for it. In this price range this is a best phone to have.This phone has ideal features so just go for it. In this price range this is a best phone to have.",
            "date": "21 Jun 2015",
            "name": "Aamir Shaikh",
            "stars": "5 stars"
        },
        {
            "comment": "PLS DONT BUY BCOZ BATTERY ISVERY POOR AND AFTER LOLIPOP UPDATION IT HANGSVERY OFTEN.ITS ORIGNAL CHARGER TAKES 4 HRS TO CHARGE THE PHONE",
            "date": "21 Jun 2015",
            "name": "varun kedia",
            "stars": "2 stars"
        },
        {
            "comment": "nice product from moto buy we are waiting for moto G3 and so dont buy moto g2 wait for moto g3 this one is not 4g so we whant 4g model",
            "date": "21 Jun 2015",
            "name": "Manne Gana Pranav",
            "stars": "4 stars"
        },
        {
            "comment": "This Mobile is the best mobile i have had till now. only a few glitches & complaints that i have are 1) Takes too long for Charging 2) Whilst Charging the Mobile if we play music. the Speakers stop working sometimes. Not everytime though. But Overall I am very Satisfied with the product ! :)",
            "date": "21 Jun 2015",
            "name": "Arshan Irani",
            "stars": "4 stars"
        },
        {
            "comment": "Rating after 5 months. Thanks to Flipkart, Delivered in much prior to due date. just in 2 days. Excellent phone,Every thing is excellent - Good Interface, Camera (Front or Back), Really HD Screen,Good Sound, 100% value for money phone. Only Cons is its battery - entire battery drain out in 3 hrs.",
            "date": "21 Jun 2015",
            "name": "Amit Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone for 11k and look at this problems speakers problem when you call someone you cant hear their voice when you hear music its all blurry and sometimes touch problem and also laggy pls i reqst dont buy this phone",
            "date": "21 Jun 2015",
            "name": "DInu",
            "stars": "1 star"
        },
        {
            "comment": "Phone is very good...good camera, no hanging and no much heating issue after a month's use. But 2050 mah battery drain bit fast...max a day time...except this its a very good fone...",
            "date": "20 Jun 2015",
            "name": "phinix jos",
            "stars": "4 stars"
        },
        {
            "comment": "i buy 3 moto g from flipkart. 1 for may sister (white), 1 for my Bhabi (black) and for my own use (black). my own mobile replace due to some error of its screen. flipkart replacement service is very well. only 1 day they replaced it. but very sadly say that battery stability not better every day cahrge it and other problem is ear phone become very hot when u use it 2 - 4 minutes continuesly-- very hot. other thing i feel that in my own phone a white or black spot (too small spot, when u see it very closely) arries in the screen.",
            "date": "20 Jun 2015",
            "name": "VIVEKANANDA BI...",
            "stars": "3 stars"
        },
        {
            "comment": "Purchased this handset with lots of hope but after receiving the handset and using it for couple of days then the problem start arising. The phone restarts automatically several times and without any warning or particular cause. Tried the online motorola help but they couldn't solve it and forwarded my issue to local authorized service center. Contacted flipkart and they did the same. After Visiting the service center and getting the phone serviced the problem still remains. The screen freezes at times, restarts automatically.",
            "date": "20 Jun 2015",
            "name": "Arpita Datta",
            "stars": "1 star"
        },
        {
            "comment": "Excellent Mobile with lots of Features Good camera quality supported android 5 but I notice many problem in this phone after upgrade to android 5 phone hangs many time slow performance eat ect",
            "date": "20 Jun 2015",
            "name": "Nivrit Gupta",
            "stars": "4 stars"
        },
        {
            "comment": "In this price range everything is above expectation with the trusted brand....Fully Satisfied after 6 months of use..",
            "date": "20 Jun 2015",
            "name": "Dr Anil Gour",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Phone, you can go for this if you are interested in Moto phones and really its good phone at this budget...",
            "date": "20 Jun 2015",
            "name": "Harish",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola has increased the screen size but not the battery capacity, due to which it doesn't lasts even a day with normal use.",
            "date": "20 Jun 2015",
            "name": "RAJ",
            "stars": "1 star"
        },
        {
            "comment": "I purchased it around 8999 Rs on APP day. And as usual flipkart delivered it in 2 days. Thumbs up for fats delivery. Phone is working fine and its good.",
            "date": "20 Jun 2015",
            "name": "mukesh waghadhare",
            "stars": "5 stars"
        },
        {
            "comment": "takes alot time for charging.. near 4 hours from 0% to 100%.. otherwise unbeatable phone at unbeatable price ..... happy to own it...:-)",
            "date": "20 Jun 2015",
            "name": "karan shishoo",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is very good. camera also superb, but the touch has stopped working after 5 months of regular use.",
            "date": "20 Jun 2015",
            "name": "Maharaj Saran",
            "stars": "1 star"
        },
        {
            "comment": "Hello there, I'm a 17 year old boy who bought this phone recently and so this is my honest review for this phone. There are many pros for this phone which you might've already seen in other reviews, so I'm gonna list some important cons about this phone.. . . 1). Battery - Honestly, this is the worst battery backup I've seen on any phone till date. But so they totally depend on one's usage. If you play some heavy games and play some music then browse for about an hour and then check Youtube you might get disappointed as you might've to charge it twice a day! But the same phone if my father uses he gets around 60% backup remaining after a full day usage. His usage is like, he frequently make or attend calls then if got some free time checks WhatsApp or Facebook, this is his full day usage! So, it might be or might not be a deal breaker for some. . . 2). Charger - Again, the battery takes too much time to charge with its default charger. It takes around 7-8 hours for me to charge it from 15% to 100% as the output is only 0.5 Amp. But if you change your charger having an Output of 1 Amp. then it'll charge in approximately 1 hour 30 minutes. But don't risk your phone by buying some Chinese charger, do buy some branded charger. And yes the charger does not have a detachable cable which could work as a Micro-USB cable for your PC. So, buy separately a Micro-USB cable. . . 3). Lollipop - This is not the problem with phone but with its Software. The UI is slightly sluggish. It does'nt mean it hangs a lot, you'll rarely see some lag on it. The latest update by Google which is installed on this phone is Lollipop v5.0.2. Users who bought this phone with Kitkat said the phone was buttery smooth before installing the Lollipop update. Even the issue with Battery Backup is because of Lollipop as Google officially said it and so Google released Lollipop 5.1 which have many improvements including battery backup. Motorola has confirmed the Lollipop 5.1 update for Moto G (2nd Generation) and other Moto phones but there is no official wording on release date. . . These are some important cons about this phone worth to be mentioned. But don't forget there are many pros as well which might be pleasing for many, like me! If you think that these cons are deal breaker for you then I'll suggest you to go for ASUS Zenfone 2 and if you don't have any problem with chinese brands, then do check Xiaomi Mi4i. Again they've their own cons so choose wisely!",
            "date": "20 Jun 2015",
            "name": "Ashish Vedula",
            "stars": "4 stars"
        },
        {
            "comment": "FAKE 30 days replacement I got a defective product and i raised the replacement request to flipkart, these guys simply reject the request without valid reason. Dont buy.. No option to put rating less than 1 star. Please enable atleast this request Flipkart. FAKE 30 days replacement",
            "date": "20 Jun 2015",
            "name": "Vinod Kumar",
            "stars": "1 star"
        },
        {
            "comment": "bought this phone on 10.06.2015 and had issues wuith the camera fro the very first day; called up the ustomer support and took seven days of conversation and finally they understood the problem i faced and replaced the product. please do not buy.....",
            "date": "20 Jun 2015",
            "name": "HIMANK PUGALIA",
            "stars": "2 stars"
        },
        {
            "comment": "I was excited to buy new Motorola Moto G(2nd gen).. the build quality of the phone s excellent and i loved all d specs in d phone.. the phone will definitely give good battery backup if u just dont play games much.. if u just use whatsapp n fb n such apps battery life ll be for abt 8hrs approximately.. if u play too much of games in dis phone. den m sure u will hate dis phone because of d bad battery back up.. other than dat d phone s awesome...",
            "date": "20 Jun 2015",
            "name": "Natrajan",
            "stars": "4 stars"
        },
        {
            "comment": "i booked a phone but next day price is very low around 1500 its vey badddddddddd i was not satisfy this sudden changes price all my family dissappointed",
            "date": "20 Jun 2015",
            "name": "shyam menam",
            "stars": "5 stars"
        },
        {
            "comment": "bought this phone on dec 2014 but now days the phone gets hanged and battery capacity has gone down would give suggestions improve ram to 2 GB and battery to atleast 2600 or 3000 Mah",
            "date": "20 Jun 2015",
            "name": "Pawandeep Singh T...",
            "stars": "4 stars"
        },
        {
            "comment": "So as I start my review if your looking to buy Mi 4i then please don't this is better one..!! This phone feels gr8 in your hand..!!! Its feels as if this phone is handcrafted only for you..!! Coming to the specs.. 1.2 ghz speed seems to be slow but trust me you can play high end games such as Asphalt 8 or soo.. battery draining fast is an issue..but as it says nothing is perfect in this world..!! Camera is too awesome..!! With 8mp and 2mp it captures super images.!!! Coming to Display....display is good but not best..!! Smudges are often on the screen Sound quality is brilliant with dual speaker front camera..!! The back cover feels really smooth and gr8 to hold it your hand..!! The best part of this phone is it comes with an expandable memory..!! Which is gr8 and that mi4i doesn't provide..!!! If your budget is between 10-12 you must blindly go for this..!!Even after sales-service is also fantastic..!! There is a pre- loaded app in every moto phone where we connect with the customer care..!! As this one is just made for you and would definitely impress you..!!! Review written after 3-4 months of use...!!",
            "date": "20 Jun 2015",
            "name": "Suyog Thengale",
            "stars": "5 stars"
        },
        {
            "comment": "Really awesome service. I got the product within the provided time. 100% genuine product. with good features.",
            "date": "20 Jun 2015",
            "name": "VIshal",
            "stars": "5 stars"
        },
        {
            "comment": "I ALSO BOUGHT THIS PHONE ON 21.01.2015.N FOR FEW DAYS IT WAS GOOD. THEN STARTS THE PROBLEM. IT TAKES TOO MUCH TIME FOR CHARGING AROUND 5 TO 6 HOURS FOR FULL CHARGE OF THE BATTERY. WHEN WE ARE TALKING ITS HEATS UP. IF WE KEEP IT THE BAG THEN ALSO ITS HEATS UP. NOW ITS WORKING VERY SLOW. TAKES TIME TO OPEN APPLICATIONS AND WHILE DIALING IT TAKES TIME. WHILE WATCHING VIDEOS THE SCREEN QUALITY VERY POOR. FORGET ABOUT HD QUALITY NORMAL QUALITY ALSO NOT THERE WHILE COMPARE TO OTHER PHONES. OVER ALL I AM NOT HAPPY WITH THIS PHONE. SINCE BOUGHT IT IN JANUARY 2015 ONLY LET ME USE IT FOR AT LEAST FOR ONE YEAR BEFORE GOING FOR ONE GOOD QUALITY PHONE",
            "date": "19 Jun 2015",
            "name": "Shridhar Uppoor",
            "stars": "3 stars"
        },
        {
            "comment": "THIS PHONE IS VERY GOOD BUT BATTREY IS VERY BAD AND NEGATTIVE FACTOR . MOTOROLA SHOULD THINK ABOUT THIS.",
            "date": "19 Jun 2015",
            "name": "Chandan Dubey",
            "stars": "5 stars"
        },
        {
            "comment": "The product is excellent one and time-tasted. RAM,Processor and CGIII display make it great, that too within 11K. The only common issue of battery which exists in all smartphones. Upon receipt of product we noticed hanging display problem.Upon complaint Flipkart immediately replaced it with new piece, thats working excellent.",
            "date": "19 Jun 2015",
            "name": "Ajit Kadethankar",
            "stars": "5 stars"
        },
        {
            "comment": "in 13k this is the best phone you can ever get. nice speed can do multi tasking with ease. the camera is very good. even the front camera is quite good for selfies. display wise, no need to spend extra mount on screen guards as it comes with gorilla glass. i dropped it once face down still got no scratch. i wud suggest juz blindly go for it.",
            "date": "19 Jun 2015",
            "name": "Shovan Saha",
            "stars": "5 stars"
        },
        {
            "comment": "I won't recommend Since MOTO G mobile was fell down in very less height(2.5 inches), screen crack down.after that I went to service centre screen cost is more(5000),I may purchase new mobile if I spent 5000,I just thrown this mobile into dustbin. Please think twice while choosing this mobile. Non sense and dabba screen....Oh my god waste of my valuable money by chosen this mobile.......",
            "date": "19 Jun 2015",
            "name": "Nagesh",
            "stars": "1 star"
        },
        {
            "comment": "awsome phone. I buyed it by january end, Its worthy for money..!!! Good quality and design, Nice front speaker, Smooth performance, BAttery 1 day only.... !!!!! MOTo: improve the battery standby my improve MAH .... Cons: Dust simply sit on the front face speakers., Battrey 1 day only.",
            "date": "19 Jun 2015",
            "name": "Prabu",
            "stars": "4 stars"
        },
        {
            "comment": "If you are looking for a safe and solid phone which conforms to the benchmark, here it is! No nonsense phone with good feel and display.",
            "date": "19 Jun 2015",
            "name": "Premankur",
            "stars": "4 stars"
        },
        {
            "comment": "Device having his own problem 1.Battery dry very quickly 2.Voice regularly showing a problem while making and receiving calls. 3.Flipkart return policy they are fooling people by smartchk application.they directly deny problem in device using this application. My device having a problem while making and receiving calls. I cannot hear any sounds,It has become very frequent.Every time I have to restart my phone to set it right and after a few hours the sound goes off again(Known issue for device). and i got reply from Flipkart \"smartchk not showing problem in device\" and suggested to visit nearest service center. THIS IS BIG BENEFIT OF ONLINE SHOPPING, YOU GET \"DEVICE ONLINE,NOT SERVICE\"",
            "date": "19 Jun 2015",
            "name": "Sandeep Ambule",
            "stars": "1 star"
        },
        {
            "comment": "Hi, I am srinivas,my phone is started working slow. Battery drain is very fast. Much heat is produced while camera is on. The phone got stuck while I was played it. Finally i had lost my phone in bus. is it possible to recover new one.?",
            "date": "19 Jun 2015",
            "name": "Srinivas Gembali",
            "stars": "1 star"
        },
        {
            "comment": "I used this phone last 2 months moto g2 is awesome for handling, stylish in look, it's operating system vry nice, & most of the good thing is it's dual stereo speake, nicce 3D sound. but there is only one issue in phone is it battery. Battery design by motorola is very bad it discharge with in 5-6 hr. use in ( 2 sim+ wi-fi+map+mail+etc. ) So I suggest for who buying new phone at the range between 11-15k. I suggest you go through the redmii MI4i. nice battery. 1.7ghz processor for gaming, 3110mah battery. 16 GB internal storage. compare to motorola i suggest mi4i is nice&budget phone. And I request Motorola please design the battery of mobile phone according to its performance & daily use of phone.",
            "date": "19 Jun 2015",
            "name": "Chandravijay Metkar",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone from last 15 days. Battery is good and look and feel is awesome. Camera is also good. I loved it. Thanks flipkart.",
            "date": "19 Jun 2015",
            "name": "Rasmi",
            "stars": "4 stars"
        },
        {
            "comment": "Mast phone hai!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!,",
            "date": "19 Jun 2015",
            "name": "aryan battish",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered Moto G2 on 16-June and on 19th the product is automatically returned and now they are saying that you have to order a new product.... this was the worst purchasing experience....",
            "date": "19 Jun 2015",
            "name": "anshul agarwal",
            "stars": "1 star"
        },
        {
            "comment": "pros: HD display HD camera everthing good worth of money cos: Slow downloading and installing app poor video quality",
            "date": "19 Jun 2015",
            "name": "SANTHOSH KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "VERY much software problem hang very much camera quality not good not looks like 8mp mobile network shows exclamatory sign otherwise ok",
            "date": "19 Jun 2015",
            "name": "NEWTON SAHA",
            "stars": "3 stars"
        },
        {
            "comment": "Camera Quality is Good.But it get stuck frequently.......I have installed only 2 or 3 apps in it even though it gets stuck....And Media player in moto G is not good....Songs can't be set as ringtone for that You need to download extra apps for a better Music player....",
            "date": "19 Jun 2015",
            "name": "ARCHANA",
            "stars": "3 stars"
        },
        {
            "comment": "Overall a great phone at it's price range. Great display. Excellent battery backup. Good Speaker sound. 8MP back camera is quite good at daylight. Not a good performer at night. 2MP front camera is good enough for selfie. I have a 16GB emory card which is full of movies. Phone memory is almost full. But still it doesn't hang/lag. But the major issue I observe is that there is no permanent setting for 2G only or 3G only network mode. Keep on switching a lot. Major issue with the high data users. Hope Moto will release an update to turn off any of the antenna as per user requirement. After fixing the issue I will update the stars to 5.",
            "date": "19 Jun 2015",
            "name": "Ritupan Hazarika",
            "stars": "4 stars"
        },
        {
            "comment": "The decision I made to move from Nokia to Motorola was in 2014 start. Being a big time fan of Nokia tried my best to hang with all Lumia series, got exhausted and decided to try on android with moto-g 1st gen. Quiet impressed with UI and playstore and repented for not being moved to android that long. This Moto G 2 generation is the 4th phone in my house from same moto family, since they are always reliable, less priced with high specs and very easy with UI. Good job moto, try to reduce your Moto X price, i would go for one of them lol :)",
            "date": "19 Jun 2015",
            "name": "Nandith Cherukat",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd Gen is very good cell phone now days in very lowest price which is provided by only & only on Exclusive Brand FLIPKART, which is good in working and excellent in performance. Thanks :)",
            "date": "19 Jun 2015",
            "name": "Saurabh Kohli",
            "stars": "5 stars"
        },
        {
            "comment": "I have received phone on schedule. I am very happy with the performance of the phone. I use my phone for official emails/gmail and other apps. I am happy with 1 gm ram. I suggest the phone to other buyers",
            "date": "19 Jun 2015",
            "name": "Kambala Ananda...",
            "stars": "5 stars"
        },
        {
            "comment": "Now a days flipkart very worest .4 days before only i bought moto g 2nd gen it was having lot of problems (Toooo much Heating, Battery Pack up also not gud & call senson also) afterthat i gave the replacement request till now im not getting my replacement mobile alredy 4 days over they don't responce me thats y nobody wont by the product on this web site...",
            "date": "19 Jun 2015",
            "name": "Karthick dev",
            "stars": "1 star"
        },
        {
            "comment": "I order it for my friend. I get the the day after tommorrow. So i was so impressed that how can filpkart give the fast delivery. The phone i receive is the best . MOTO IS THE BEST MOBILE COMPANY AFTER NOKIA FOR ITS QUALITY PRODUCT. MOBILE COMES WITH BLACK IS THE BEST. DISPLAY IS CLEAR BLACK. PERFORMANCE IS GREATE. NO COMPLENT ABOUT ANY ASPECT. WAITING FOR MOTO G(2015)",
            "date": "19 Jun 2015",
            "name": "Amrut Sarang",
            "stars": "5 stars"
        },
        {
            "comment": "Device Not functioning properly -WiFi is not working in my device. No Response or ownership when i contact Customer care & Customer care response is FlipKart is not suppose handle this issue & you need to go to MOTOROLA service center....Very Disatisfied",
            "date": "19 Jun 2015",
            "name": "Moto G (2nd Ge...",
            "stars": "1 star"
        },
        {
            "comment": "Product of MOTO is very good and nice to use. Worth to buy this product for the less budget. MOTO G wont hang since it has has good RAM capasity and also it is upgradable from KITKAT to LOLIPOP. but compare to LOLIPOP KITKAT is good for this product. if anyone will to buy the product please go for this",
            "date": "19 Jun 2015",
            "name": "AG",
            "stars": "5 stars"
        },
        {
            "comment": "In this mobile, i found only one cons which is battery backup. Battery backup is very poor. you have to always carry your charger OR power bank.",
            "date": "19 Jun 2015",
            "name": "Anurodh Shriva...",
            "stars": "4 stars"
        },
        {
            "comment": "interface and operating system are good but battery backup it bad (8hrs of intermediate usage) and gets really hot and stucks while playing high end games.",
            "date": "19 Jun 2015",
            "name": "Prithvi",
            "stars": "3 stars"
        },
        {
            "comment": "Dont think just go and get this moto G2. Coming to battery life, it is as average as all the smart phonee. But the speed is tremendous and this mobile is much better than samsung products",
            "date": "18 Jun 2015",
            "name": "Asarudeen Ibra...",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased the phone some times back and is working superbb..... Battery is good, UI is awesome and Android latest version is available which is running great with RAM..... we can run multiple application parallely with gud support.. So overall I like this phone so much and its worth buying :)",
            "date": "18 Jun 2015",
            "name": "Mohit Jain",
            "stars": "5 stars"
        },
        {
            "comment": "That's where company matters.excellent experience till now and outstanding customer care.best product.",
            "date": "18 Jun 2015",
            "name": "Ravi kant",
            "stars": "5 stars"
        },
        {
            "comment": "Guys, i have bought this phone only on suggestions of previous buyer...and i m fully satisfied with it.....",
            "date": "18 Jun 2015",
            "name": "KULDEEP SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "This product has problems with charging and its battery. Due to shortage of support centres its very difficult to get the issue resolved. Better to go for some other phone in this price range.",
            "date": "18 Jun 2015",
            "name": "Kushal",
            "stars": "1 star"
        },
        {
            "comment": "I hv used this ..it's ok .. and..... worth of money ......................................................................................................................................................... ............",
            "date": "18 Jun 2015",
            "name": "Anish Kuti",
            "stars": "4 stars"
        },
        {
            "comment": "If you really want a good android phone (under rs.15000) then look no further, Moto g 2nd gen is the right phone u r lookin at...:) You must have read the specs n features in the \"specifications\" section so i wont go over that. Just coz specs dont matter a lot. This is a ridiculously fast phone and that is because it runs stock android with just a few motorola additions. Overall it is a very good phone. As of now there is a bit competition in the market wih phones like Mi3, Mi4i, Asus Zenfone 5, Asus Zenfone 2, etc. but as per my thinking Moto G is a lot lot better than those. The feel in the hand is awesomeee :) The audio quality is the best at this price point via the front facing stereo speakers. I wished the speakers to be less wider and black in colour but still okk... I loved the slow motion recording from the rear 8 MP Camera and the camera shutter speed is also gud... Well i found out that the battery lasted quite well with heavy usage it gave me about 5 to 6 hours of battery backup. If you are a normal user then it will easily last you a full day (before 9 pm in night according to my test) but still its gud as u can plug in a charger at night..... Well thats all for this review if you found it helpful plz do hit the thumb up button below., it may help others.",
            "date": "18 Jun 2015",
            "name": "Nitish Nagar",
            "stars": "5 stars"
        },
        {
            "comment": "For 12999 its not worth it. its okay to buy for 7000 to 8000 Used for 5 months Cons: 1) RAM onlyyyyy 1 GB. Not GOODDD. Many apps get closed (Google Chrome,etc). 2) Takes 4 hrs to charge. 3) Battery of 2070 mAh not enough for 5 inch Screen. Hence Battery Sucks. 4) with Single Sim it works properly. But when i start using with Dual sim. Network comes and go every time. when i start internet in Sim1 than Sim2 Becomes emergency and vice-versa. 5) with 3G net it will drain in 3.5 hours and will take another 4 hours to full charge 6) Heats many times (FYI - never played single game or ran any heavy application) 7) Charge was getting heat up like a sun. than replaced it on Motorola Service center. But still its heating. 8) During call, its getting over heated. Pro: 1) Camera is Good. 2) Very smooth, never gets Hang 3) Light and Good Looking 4) On Stand by Battery is very Good (Kudos All batteries are Good at Stand By ) 5) Call quality is very good 6) Front speaker is one good idea. I liked it",
            "date": "18 Jun 2015",
            "name": "yash goshar",
            "stars": "3 stars"
        },
        {
            "comment": "primary camera can be better .otherwise overall good phone nic look gud screen.........................................................................",
            "date": "18 Jun 2015",
            "name": "shabd",
            "stars": "4 stars"
        },
        {
            "comment": "must have this using from the last 5 months didnt face any problem very good speed very good screen very useful navigator very clear screen good for sales persons",
            "date": "18 Jun 2015",
            "name": "Minakshi",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones.",
            "date": "18 Jun 2015",
            "name": "Dhamodaran G",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing mobile in the price range, smooth UI, decent cam and the best sound in price. Also all updates available",
            "date": "18 Jun 2015",
            "name": "Nilesh Tawari",
            "stars": "5 stars"
        },
        {
            "comment": "Dear all, This was my first purchase of smart phone and i chose Flipkart as they always ensure timely delivery of items wherever we are. I ordered this phone on 29th May 2015 and got exactly on 12th June 2015. I was worrying as my working place is near by a small village called Balipara in Assam but Flipkart did a wonderful job, and it surprised most of my colleagues as the place is away from town and we thought that the delivery would be time consuming. Though i have already Microsoft Lumia 630 phone, i was in dilemma to choose whether lumia or any android devices and finally selected moto g 2nd generation as very a few of my friends have been using the same and are satisfied with its performance. Just a week got over after its use i cannot give much points about it but some points would like to share so that new customers can easily select this smart phone. Positive: 1. Look and body 2. Connectivity 3. User friendly 4. Simple settings 5. Rich android experience 6. Trendy look 7. Easy to handle 8. Affordable price 9. Good memory 10. Rich video experience 11. Easy navigation and good wifi connectivity 12. Excellent games display. Negative: 1. The screen resolution needs to be improved under sun light as it is not up to the mark. 2. Bit heavy comparing with my Lumia phone. Purchase only through flipkart as the item is good and safe packing. Thanks & Regards, C.S.Shankar",
            "date": "18 Jun 2015",
            "name": "Shankar C%20S%20",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using the phone for over 2 months now. It seems really good phone. Its smooth, fast, crisp in display, did not face any problems so far (no heating, call drops). Battery seems on the lower side, but you can't get everything for this price.",
            "date": "18 Jun 2015",
            "name": "Prakash S",
            "stars": "5 stars"
        },
        {
            "comment": "So this was the product I thought was a game changer at least in terms of looks and performance and also UI design. But this also came to end when it dropped off my hand and suffered a lot of scratches on the corners of the screen. This phone says it has a corning glass but the build quality is really disappointing. have all four corners chipped now.",
            "date": "18 Jun 2015",
            "name": "Tushar Chadha",
            "stars": "3 stars"
        },
        {
            "comment": "Using more than a month Moto G 2gen is a good product. I will give 4 star because battery is only lasts for 1 day i.e on total using of 6 to 7 hours without playing 3d or racing game. Overall it is a good product in all aspect",
            "date": "18 Jun 2015",
            "name": "Aru",
            "stars": "4 stars"
        },
        {
            "comment": "totally got mad after receiving damaged mobile for 2 times,f**k off bloody flipkart and ur worst service",
            "date": "18 Jun 2015",
            "name": "pankaj singh",
            "stars": "1 star"
        },
        {
            "comment": "Sleek and reliable phone! Vivid screen, loud and clear audio speakers. Cons - 1. Very average battery life 2. Cheap earphones 3. Take a long time to fully charge Apart from it, it's a sexy beast packed with stock android.",
            "date": "18 Jun 2015",
            "name": "Akash Senapati",
            "stars": "4 stars"
        },
        {
            "comment": "1.SCREEN PPI AND COLOR VIVIDNESS COULD HAVE BEEN BETTER. 2. CAMERA NOT THAT TOP NOTCH BUT NOT COMPLAINABLE.-GOOD FOR THIS PRICE RANGE 3. FRONT SPEAKERS- MANY PEOPLE PRAISE ABOUT THE FRONT SPEAKERS , BUT IT REALLY IS NOT THAT LOUD, THIS IS MY 5 TH PHONE IN 3 YEARS AND SO I CAN EASILY FIND THE DIFFERENCE. 4. MUSIC AND SOUND OUTPUT QUALITY NOT GREAT BUT OK, EVEN WITH HEADPHONES. 5. FINGER PRINT MAGNET BACK COVER. 6. BACK PANEL LITTLE SLIPPERY. 7. FOR SOME HIGH END GAMES PROCESSOR HAS SOME LAG but the price up and down is always irritating",
            "date": "18 Jun 2015",
            "name": "SSK",
            "stars": "4 stars"
        },
        {
            "comment": "U are not going to get better mobile at this range. But i request motorolla to do some modification in its charger which is quite loose and usually get out of the plug very easily",
            "date": "18 Jun 2015",
            "name": "ashish anand",
            "stars": "3 stars"
        },
        {
            "comment": "the back cover is not perfect a 2 decade old company with loose back cover on its major selling product is little not satisfying. but overall great phone and very brilliant features. after buying this phone i do not know where my Digital camera is....",
            "date": "18 Jun 2015",
            "name": "Amit%20 Bansal",
            "stars": "4 stars"
        },
        {
            "comment": "I using this phone around 4 months its a great phone camera quality is good. But Buddy if U guys are interested in playing games and all that than don't go for it. its battery is not good.Expect Battery Everything is good & battery not Removable but no hang problem no screen problem.Very Very smooth touch .Over all its a nice phone.",
            "date": "18 Jun 2015",
            "name": "Arpit Vaish",
            "stars": "3 stars"
        },
        {
            "comment": "Good phone for those who do not play very heavy games on their phones. everything is very good. UI is very friendly. Touch is fair (fair beacause It sometimes does not respond when laid down on a flat surface. Works like a charm in hand. Might be due to tempered glass screen guard i have installed). Looks: 9/10 Performance:9/10 Weight: 6/10 UI: 10/10 Battery: 10/10",
            "date": "18 Jun 2015",
            "name": "Ravish Malik",
            "stars": "4 stars"
        },
        {
            "comment": "its one of most revolutionary phones.! top grade performance... not too much on sheet.. but real story is way apart.. using for 3 months.. not even a single hiccup.. superb battery.. 24 hours min with heavy usage.. :D lollipop is",
            "date": "18 Jun 2015",
            "name": "Romit",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone for 1.5 month and I am quite happy with its performance. I purchased this phone from flipkart (WS Retail) for 9899 Rs. It was special discount on that day. Thanks to flipkart for such an awesome discount and very quick delivery of phone within just 2-3 days. Pros: 1) Very nice look, Classic look 2) Speakers are good, Voice quality is better, Internet browsing speed is also good 3) Internal storage is 16 GB...SO no need of SD card. though you want it has a memory card slot also. Cons: 1) hanging issue sometimes...need to lock and unlock it to resolve issue or switch off. Overall a good smart phone in this budget by MOTOROLA.",
            "date": "18 Jun 2015",
            "name": "Deval Patel",
            "stars": "4 stars"
        },
        {
            "comment": "All moto products are good ans best priced .. I am using Moto X (1st gen) I was very happy with the product so i ordered Moto G for my wife excellent vis-a-vis her previous samsung mobile..",
            "date": "17 Jun 2015",
            "name": "Amit Shukla",
            "stars": "5 stars"
        },
        {
            "comment": "Delivery : Bang on delivery ! Flipkart proved again why they are one of the best. Got the phone within 2 days of ordering. Nice packing. Now discussing about the phone i would like to say that this is a honest review on the basis of 3 weeks of usage and what i have observed. Instead of giving pros and cons i would like to describe the features of the phone Camera : The asset of this product is the camera feature. 8 MP Camera provides good clarity. The example of a good picture was i took a snap of my laptop screen and each and every word of the mail open on the screen was easily and clearly viewable. Front camera is quite satisfactory and good for video calls if you are interested. There are extra features like HD quality image and manual focus Cons : There are not many edit features in the camera itself. Rating : 8.5/10 Battery : Many users are saying this is a big issue since the battery drains very quickly. No need to worry at all because if you handle the phone fruitfully and sensibly you will able to save a lot of battery(Refer to the different battery saving methods). Besides the phone itself provides a battery saver option in battery settings which saves a lot of energy. Cons : Heavy use may reduce battery life. If you are a fan of gaming dont go for it. Games drain the battery a lot. Browsing in 2G and some basic apps like Whatsapp, facebook and messenger will give you a minimum of 12-14 hours of backup provided you follow the battery saving instructions 6/10 Speed : Very good. Easy multitasking and the phone will provide the latest updated lolypop android which never causes any hang now. 7.5/10 Sound : Average. Only the basic Moto tune is loud else you to download custom ringtones. Speakers are good 7/10 Video : Excellent. I have seen videos and its showing without any lag and crystal clear resolution. 9/10 Additional Features(along with overall pros and cons) Look and fill : The phone is slim and very stylish. Its also hardy providing a gorilla glass screen which protects you from basic scratches. I have dropped my phone already two times and its safe till now :D However its good to a have a screen guard and back cover for safety 9/10 Pros 1. The biggest feature is the ready updates that are provided. 2. The phone is very user friendly and easy to handle 3. Camera is very good in respect to 8 mp Cons 1. Battery life in case you are a heavy user and a gamer (6 hours max) 2. The phone does not provide USB charger. You have to have a USB cable in case you want to transfers file and songs You can trust and go ahead :) Overall review - 8/10",
            "date": "17 Jun 2015",
            "name": "Aryya Khasnobis",
            "stars": "5 stars"
        },
        {
            "comment": "Thank you thank you thank you so so very much FLIPKART...been using Moto G since Jan'15...not a single complaint till now..",
            "date": "17 Jun 2015",
            "name": "Merlin",
            "stars": "5 stars"
        },
        {
            "comment": "got this product today, i.e. before standard delivery date, appreciated flipkart for that. product is ok , better if RAM is 2GB other than that everything is good value for money. . and accessories are below par. within a week after buying price slashed by 1000 rs price is not constant. prices are so much fluctuating so dont buy you will hurt by reducing price quite regularly.",
            "date": "17 Jun 2015",
            "name": "Avinash Holla",
            "stars": "1 star"
        },
        {
            "comment": "Bhai log simple si baat hai motorola is the first company who made mobile for us. & i trust them blindly.. This is my 4th moto n i love it. Pros: 1. Looks fab in hand 2. Durable Rugged n very strong build 3.Specs r gud as they priced Cons: Cant find any1",
            "date": "17 Jun 2015",
            "name": "Vivek Vishal",
            "stars": "5 stars"
        },
        {
            "comment": "what the hell u guys are not replacing it.........totally dissatisfied plz plz plz dont buy the product as they are now in a hurry to make it out of stock because moto g2 4g is coming.........................",
            "date": "17 Jun 2015",
            "name": "Nishit Singh Tomar",
            "stars": "1 star"
        },
        {
            "comment": "this is best mobile in its range ,,,,exluding battery problem......lollipop just drinks charging..... camera is awesome.. best selfie phone",
            "date": "17 Jun 2015",
            "name": "Vishwadeep Ingole",
            "stars": "4 stars"
        },
        {
            "comment": "over all good phone.................................................................................................................",
            "date": "17 Jun 2015",
            "name": "jeevan",
            "stars": "4 stars"
        },
        {
            "comment": "One of the best phones i have bought so far. So many people(friends and others) have already asked me to go for this beauty,but i was a little skeptical about buying it. But then somehow i got convince and bought it. 1. It was having offer at that time ,so i got a free genuine motog2 flip cover. 2. It's been 5 months since then and the phone is working like butter. Never got hung. NEVER!! 3.It had an issue of battery which only used to last 1 day on a single charge. But after the lollipop update it has become a little better. Still satisfactory but not so good. 4.Processor is too good`since it is quad core,and different apps works simultaneously without any lag. 5.You can play Asphalt(1.6gb) and minimize it at any time and do some other task and get back to the game later and it will all work very fine. Smooth!! 6.Camera is damn good. Front camera is just good. Lags if running on low storage. 7.Phone's storage is too good 12 gb for all your apps. Sound quality is good too. 8.STURDY!! Have fallen twice ,but nothing happens to the screen. 9. Last but not the least, for the price it is available now in the market is sure is a good offer for any buyer. You can update it to Lollipop as soon as you buy it.",
            "date": "17 Jun 2015",
            "name": "Anubhav",
            "stars": "5 stars"
        },
        {
            "comment": "Have been using this phone from last 2 months, works perfectly. The camera quality is better than most of the phones in this price range and sound quality is lot better that Lenovo",
            "date": "17 Jun 2015",
            "name": "Asif Khan",
            "stars": "5 stars"
        },
        {
            "comment": "The Build quality is great and the screen is gorgeous. It came with Lolipop pre loaded and the OS runs smooth. Camera & battery life - average. Its a great phone if your expectations are according to the price you are paying.",
            "date": "17 Jun 2015",
            "name": "Ashish Ranjan",
            "stars": "5 stars"
        },
        {
            "comment": "battery sucks waste phone, you nerd to keep charging 5hours per day better wait for moto g 3 gen it will be released in the month of aug and sep.",
            "date": "17 Jun 2015",
            "name": "moto g 2 sucks",
            "stars": "1 star"
        },
        {
            "comment": "nice phone in 11 k.........................................................................................................................................................................",
            "date": "17 Jun 2015",
            "name": "Himanshu Tyagi",
            "stars": "4 stars"
        },
        {
            "comment": "good for daily use but not for gaming and heavy multy tasking camerly is realy good bettry is ok ok type on gaming it will logt in 1.5 hour on 3g net is was lost in 3 hour",
            "date": "17 Jun 2015",
            "name": "hitesh khatana",
            "stars": "2 stars"
        },
        {
            "comment": "Bought it from flipkart. The reviews given really helped us in zeroing on the final product. The delivery was good and well in time.",
            "date": "17 Jun 2015",
            "name": "Bhaswati Das",
            "stars": "5 stars"
        },
        {
            "comment": "well I am using the phone for almost a month now and what I should say about this phone- well first of all it had plenty of room for improvement one is the charger has a fixed cable another is sorting in the Settings app is missing,The screen is a little hard to read in direct sunlight, but clarity and viewing angles are otherwise good. The good thing is calling is really better than any smartphone by any means. and camera is really good. All in all its a hard handy phone with average look One more thing black one is better looking than the white one,as i am using the later",
            "date": "16 Jun 2015",
            "name": "Suvadip Sain",
            "stars": "4 stars"
        },
        {
            "comment": "It is good , a decent screen , a decent resolution , prettry slim , and also light for what a others give in the same price.",
            "date": "16 Jun 2015",
            "name": "Kashyap",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Looks, faster processor, Android 5, Camera, Call facility, Apps store Cons: Battery life is not upto the mark, Default music apps",
            "date": "16 Jun 2015",
            "name": "Amit Kumar Cha...",
            "stars": "4 stars"
        },
        {
            "comment": "I PURCHASED MOTO G 2 FROM FLIPKART FIRST 2 TIMES I RECEIVED DEFECTIVE PRODUCTS LATER I REQUESTED FLIPKART REFUND MY MONEY BUT THEY JUST REPLACE THE PRODUCT . THIS VERY BAD EXPERIENCE WITH FLIPKART AND WS RETAIL",
            "date": "16 Jun 2015",
            "name": "MADHAVA M",
            "stars": "1 star"
        },
        {
            "comment": "I brought this mobile 5 months ago. Till now zero problems, high quality display, no hanging issues, no heating issues, high picture quality and overall it is an Exellent mobile. We became like Moto family. Iam using, my brother, father etc., all are using Moto G (2nd) mobiles.",
            "date": "16 Jun 2015",
            "name": "Raj",
            "stars": "5 stars"
        },
        {
            "comment": "Using from Last Weeks One of the Bets Handset Feeling Like Nexus Series Very Good Performance Super Smooth & Stable This Pones Looks Almost Premium Branded Phone",
            "date": "16 Jun 2015",
            "name": "Anand Suradkar",
            "stars": "5 stars"
        },
        {
            "comment": "motorlola moto g2 is really a excellent product in this price good experience,excellent seller delivary within time limit thanks",
            "date": "16 Jun 2015",
            "name": "SANTOSH PORWAL",
            "stars": "5 stars"
        },
        {
            "comment": "Very very bad battery life not even lasts for 6-8 hours on full charge, hangs a lot not worthy of the hype",
            "date": "16 Jun 2015",
            "name": "Hari Haran V",
            "stars": "2 stars"
        },
        {
            "comment": "6 month after using the phone... The phone performs well in all the aspects for a phone.. game updates all is good.. I dont play lot of game but played ASphalt Subway and many for few time no issue with he performance.. but when coming to Service From Motorola forgrt it.. the service is provided by B2X not from MOTOROLA directly.. my phone's screen stoped shwing up on a morning suddenly even if the phone was not even dropped from my hand. When gon to service center they said that the phone is damaged due to water took the phone in reairing room and after 5 min they come up with the issue as Chaging Slot is broken.. Last time i used my phone it was chrging but 5 min the phone is broken.. Got info that they will drop the detailed mail to motorola for same and if they get the permission they will repair it for free... but next day call came and they said it will took 7000 for the phone to be repaired.. What the f.. for a 11 k phone if the chaging slot is not working 7000k thank god no chip got damaged then they have been said for 15K.. Also contacted MOTOROLA for same but no response yet getting a new phone now but not MOTO this time for sure can take risk for 11 K again... If you are ready to go with the phone considering 30 day warrent only from flipkart go head.. Great phone remember no warrenty like thing from MOTOROLA..!!!",
            "date": "16 Jun 2015",
            "name": "Manish Kumar S...",
            "stars": "3 stars"
        },
        {
            "comment": "i purchase it but it is not working i call to CCE flipkart but product not return only repair by moto company. now i am not using it",
            "date": "16 Jun 2015",
            "name": "sandeep kumar",
            "stars": "1 star"
        },
        {
            "comment": "Good quality in this price..... Worth for the price...I could have waited until the offers comes..............................",
            "date": "16 Jun 2015",
            "name": "Priya",
            "stars": "4 stars"
        },
        {
            "comment": "I have not seen this kind of phone with such a poor quality of sound and the services provided by the Flipkart agents. They are unable to hear the voice and then say that its speaker is working quite well. How ridiculous? I suggest do not buy this phone if you value your hard earned money.",
            "date": "16 Jun 2015",
            "name": "Manish Dubey",
            "stars": "1 star"
        },
        {
            "comment": "this mobile is amazing one............ if you want to take any mobile give first preference for this. it is good in camera,android, and it is best in everything else",
            "date": "16 Jun 2015",
            "name": "chandra kanth",
            "stars": "5 stars"
        },
        {
            "comment": "I'm posting this review after using Moto G2 for two months now. Order booking process to delivery from Flipkart was on time as always (5 Stars to Flipkart). After an initial week of usage, this phone had started creating all sorts of issue possible in a mobile phone. List is below - 1. Display screen has gone permanently blurry 2. SD card is never readable on this device 3. Forgets to detect sim card too occassionally 4. Phone lags too much on multiple operations 5. And biggest of all problems is the Motorolla service centre (Thane west). This service centre handles multiple brands of phone (not a motorolla store). After explaining my problem the solution that I got was pathetic. Just to get this device checked which is under warranty, I have to pay 400 Rs. on top of that it will take about 12 days for them to get back with the reason for the problems. I consider this store as fraud, they will tell me false reasons about the cause. (I requested them to inspect in front of me, which they denied) Request everyone buying a phone is to first check Service centre availability and process. Most companies (Even international) nowadays launch cheap quality products in India without any service. I request Flipkart to help me with the return of this product to manufacturer if possible and exchange my device.",
            "date": "16 Jun 2015",
            "name": "Krunal Sharma",
            "stars": "1 star"
        },
        {
            "comment": "I have ordered this mobile Feb 2015, recently got problem with display module. Not working display, complete blank.",
            "date": "16 Jun 2015",
            "name": "Veerababu Dangudu...",
            "stars": "1 star"
        },
        {
            "comment": "Battery Back up issue. Automating call happen after disconnect of call. Touch Pad issue, not able to take call some time.",
            "date": "16 Jun 2015",
            "name": "Dipak Mohapatra",
            "stars": "1 star"
        },
        {
            "comment": "Placed an order on 30th of May, 2015. Got the product the next day by evening, due to the one day guarantee. So far so good! Got a sealed box from the delivery guy. Opened it up. Brand new-looking phone. Awesome. Turn it on, swipe the screen out of joy, see \"waves\" form at the middle of the screen, from top to bottom, in the center of the screen. Considered normal behaviour I assumed, so I let it slide. The three hardware buttons seemed to be working correctly as well. 15 days later, I did some research on the \"waves\" I saw on-screen on the first day, find out that it usually takes a LOT MORE force than what I applied for that to happen. That's strike one. Strike two, the volume down button already seems to be sinking into the body. What the hell? Normally unheard-of issue. Strike three would be the flicker when the phone is used at the lowest possible brightness level. Plain weird display, I suspect faulty. Also important is the fact that the display fails to register touch inputs at times, which is EXTREMELY worrying for a full-touch device. Thankfully I bought the phone from WS Retail, which has the Flipkart advantage guarantee, and it's only been about 2 weeks since I've been using this phone. Slightly disappointing, I've requested for a replacement a second time (First one was understandably cancelled since I failed to respond to calls the first time I noticed these issues.) Will update my experience as I go.",
            "date": "16 Jun 2015",
            "name": "Shubhanjan Sen",
            "stars": "3 stars"
        },
        {
            "comment": "Overall a good phone in 11k range. But so much hype created is complete truth regarding the phone. Look is ok not very slim or stylish like sony or xiomi phone. Better life in 12 hours in 3G, which is also not exceptionally good i feel. RAM performance i can really feel the difference from my 2GB Xiomi MI3, it will remind you 'ohh I am just 1 GB dont overburden me' whenever you start 3 more apps with facebook. Did not play games yet not much expectation.",
            "date": "16 Jun 2015",
            "name": "Joyeeta Chakra...",
            "stars": "3 stars"
        },
        {
            "comment": "this phone is just supeb ,its camera ,display,design wt not and newly installed lolipop is rocking on this device ............................keep in ur mind that its got inbuild battery with capacity of 2070 only ,,,which is quite disappointment from moto",
            "date": "16 Jun 2015",
            "name": "kumar spaniard",
            "stars": "5 stars"
        },
        {
            "comment": "Though its price decreased after one week of my purchase but I love this for what it is. All functionality are working perfect as well as its display and look and camera..All super.You can go for it.. Some problems : 1. Usual data cables doesn't work with it. 2. email apps is inbuilt coming with this device but it is not working at all for exchange server. Very bad..as I was a regular user of that in my previous samsung mobile.",
            "date": "16 Jun 2015",
            "name": "Amitesh Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "Dear Sir, my phone moto g 2 gen is cant be charge also not be start till morning please sir change my phone or replace this phone timel.",
            "date": "16 Jun 2015",
            "name": "RAVI KUMAR BAGWAN",
            "stars": "1 star"
        },
        {
            "comment": "Purchased it for a friend. As expected the product met on its quality. Note: It comes preloaded with Android-L, something thats not mentioned in the sales window",
            "date": "16 Jun 2015",
            "name": "Keshav",
            "stars": "4 stars"
        },
        {
            "comment": "This is one of the very few VFM products available in Mobile Phone world. You can buy this with your eyes closed if you are not much into the brand thing.",
            "date": "16 Jun 2015",
            "name": "Happy User",
            "stars": "5 stars"
        },
        {
            "comment": "Thanks to Motorola. This item lives up to the expectation of a common man. It is fast with its Quadro Core Snapdragon processor with 1GB ram. Out of 16GB internal memory we get 13GB for other applications to install. The camera is awesome, and i have installed 'Camera360 app' which makes good use of the camera. The battery drains in 24hrs once the mobile data is on and takes 4 to 5 hours to get it full charged. All together I am fully satisfied with the product.",
            "date": "15 Jun 2015",
            "name": "Jayeshkumar K",
            "stars": "4 stars"
        },
        {
            "comment": "Really this phone is very good as in quality and comfort. This phone was drop down 2 times on rough road but still there is not a single hardware error i got",
            "date": "15 Jun 2015",
            "name": "Subhakanta Panda",
            "stars": "5 stars"
        },
        {
            "comment": "It's been a long I was using samsung s3 and decided to switch to a another phone after few days of research and review Moto g2 gen was the perfect amongst all ... truly exeptional phone at exeptional price",
            "date": "15 Jun 2015",
            "name": "Amey Majalkar",
            "stars": "5 stars"
        },
        {
            "comment": "I have nexus5 and Samsung galaxy Y however this MOTOG 2nd gen was a bad experience for me because: 1) The display ran into problem and it was a horror story to get it serviced. The reason is simple - that there are only 3 service centres for Motorola mobile phones in Bangalore - time for any problem takes 2 months and the service quality is bad. I gave the phone for service to correct the faulty charging pin, but in return got a free problem of my touch screen not working intermittently. 2)The resolution of the phone is not upto the mark. 3)The touch screen is very fragile. A simple hit can cause the touch screen getting broken. So please check with your friends who has a moto phone before buying - on the quality, and service(of course poor quality, u simply walk in to one of their service center to see the long queues and the hassle)",
            "date": "15 Jun 2015",
            "name": "Naveen jacob",
            "stars": "1 star"
        },
        {
            "comment": "Its fast. Does not hang. Nice performance. Can handle multiple things easily. But worst part - Its OS is least user friendly. To access system folders u have to install apps from PlayStore. Its a big security hazzard. Incase u have used Samsung phones then dont go for Moto - u'll find the OS very tough and least customisations.",
            "date": "15 Jun 2015",
            "name": "Rajat Jhingan",
            "stars": "2 stars"
        },
        {
            "comment": "I Purchased this product on January2015 and after 4 months battery is draining very fast. i had visited service center in Marthahalli, Bangalore 2 times and they said its software issue and formatted the device, still I am facing the same issue They are not ready to replace battery even my warranty is not over. Again and again they reformat the device and given back to me. Also I have escalated issue to Motorola chat support and I got call from them and they had taken remote session of my phone and they said there is no problem in settings of the device.",
            "date": "15 Jun 2015",
            "name": "Arundas",
            "stars": "1 star"
        },
        {
            "comment": "1 GB RAM is equivalent to 512MB. Not recommended for the users who want to multitasking. Lot of lags while playing games and opening. Also the camera quality, touch is not that great. There are lot of other options available like Asus Zenphone 5 , Samsung Grand Prime which are being used in my family and are giving much better performance.",
            "date": "15 Jun 2015",
            "name": "Dipen Shah",
            "stars": "2 stars"
        },
        {
            "comment": "good.......... awesome product.... avg battery life..... go for asus zenfone 2 13000 vasul .............,............................ ... ...............................................................",
            "date": "15 Jun 2015",
            "name": "Chetan savalia",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I bought this phone on 06th May 2015 along with 2 of my friends. We ordered 3 phones in all. My friends received the phone on 10th May and I received on 09th May. My friends asked for an exchange on 15th May but my hand set was working fine. However, the phone stopped working on 14th June and I called the customer care on 15th June. They asked me to take it to the service center as no exchange was allowed. Please Please Please DO NOT BUY THIS PHONE.. SAVE MONEY AND SAVE TIME",
            "date": "15 Jun 2015",
            "name": "Umashankar Man...",
            "stars": "1 star"
        },
        {
            "comment": "Product is Awesome. No cons for this device, except Battery. Because the battery is 2070mAH, drains quickly. Not that bad when compared to the ASUS mobiles. ASUS battery backup is pathetic. Except battery backup, Everything is Awesome in this device. Hats off to the Designers. Thank you Flipkart for same day delivery.",
            "date": "15 Jun 2015",
            "name": "Rajendra Raji",
            "stars": "5 stars"
        },
        {
            "comment": "awesome buying experience.......just nw i bought ds phone and it fell down from my bed ds evening.....no scratches because of the matte finished back and luckily no scratches on d display too.... 1 edge is damaged but u couldnt even see it with naked eye......itz amazing....i like it....",
            "date": "14 Jun 2015",
            "name": "Muthu Kumaran",
            "stars": "5 stars"
        },
        {
            "comment": "Cons Battery drains very fast. App can only be saved in internal memory.It can not be moved into sd card. Front camera is average. Pros Rear Camera is very good.",
            "date": "14 Jun 2015",
            "name": "sandeep bal",
            "stars": "3 stars"
        },
        {
            "comment": "I had been keeping track of this phone for about 2 months before buying it. It's a very comfortable as well as good looking model. The size isn't too big, as some people may feel. It fits comfortably in my palm (Who knows, I have big hands). The touch is responsive and even though the 1 GB RAM seems less, it supports all apps and doesn't lag (I don't play too many games). The camera is excellent, though some heating problems are there on prolonged usage, but that is to be expected. The dual stereo speakers were a surprise. I expected one to be a speaker and another the receiver. Don't expect the speakers to play HD Audio. There's some static heard when the speaker mode is ON. The biggest drawback is the phone facility (IRONY). The loudspeaker and handset modes have almost same volume when full. Whether you need a phone for a short time before upgrading to a flagship model or you're buying it as someone's first mid-range phone, this is the best choice. At Rs. 10,999, it is the best option among it's peers. I use it and I'm happy.",
            "date": "14 Jun 2015",
            "name": "Shiva Praveen",
            "stars": "5 stars"
        },
        {
            "comment": "MOTOROLA is very old brand. it is very nice phone... i luv this sound but battery is 2030mah .. no problem i have powerbank ... but mobile is very good. standard brand...",
            "date": "14 Jun 2015",
            "name": "Ginny Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Okay.. so i ordered MOTO E 2nd gen.. after liking that phone so much i ordered qty. of 2 MOTO G 2nd gen... after few days.. i noticed.. there is a blue spot in the display of f MOTO E 2nd gen.. which means the product is defected so i requested for the replacement.. its been 20+ days they havnt contacted me and saying just install the smarchk app we will send you link blah blah.. i have contacted flipkart toll free no. thousands of time.. they just keep replying the same thing over and over again that technical department will call you tomorrow. now the 30days replacement is over and the tollfree guys are saying it is not possible now.. you have to contact motorola service centre.. but some of the guy told me that if you request for a return within the 30 days policy.. the product will be replace even after the policy expires. guys i am tired contacting them. IDK what to do now.. i just came here to let you guys know what flipkart is doing. the trust is gone flipkart now let me tell you about my moto G 2nd gen. I ordered 2 motog2nd gen.. one of them is defective as well.. it got battery issues... speakers do random noises... headset jack issue. black spot in display... i am getiing the same reply like above. GUYS I USED TO LOVE THIS SITE.. TRUST ME GUYS.. THEY'RE SELLING DEFECTIVE ITEMS.",
            "date": "14 Jun 2015",
            "name": "Parichay Verma",
            "stars": "1 star"
        },
        {
            "comment": "Moto g 2nd gen - every thing is good. but comparing to Zenphone, Xiaomi Mi 4i, Spice, HTC, Yureca, Yuphorbia - configuration is low but Its stll a brand. 1) not getting heated for gaming 2) good quality camera pic 3) only 1 GB Ram 4) extendable up to 32GB overall i liked it.",
            "date": "14 Jun 2015",
            "name": "RAMASHANKAR NAYAK",
            "stars": "4 stars"
        },
        {
            "comment": "MOTO G 2nd Gen is really super cool. The product is reasonable stylish and moreover with all best features in it.Also it was such prompt service. Packed with safety and got the product on the third day. Excellent service Flipkart and excellent make from Motorola",
            "date": "13 Jun 2015",
            "name": "Sandeep",
            "stars": "5 stars"
        },
        {
            "comment": "good worth for money but bad camera really good to use liked the handset look, feel and overall aspects. The Stereo speakers, Camera and additional storage are the biggest upgrades over the previous phones. The only con in this phone is the very average battery life. If one is a regular user of the phone for browsing, whatsapp, etc several times a day I feel the battery will drain out in about 8-10 hours.",
            "date": "13 Jun 2015",
            "name": "danu",
            "stars": "2 stars"
        },
        {
            "comment": "hanging problem......................................................................................................................................................................................lots of hanging problem poor product acts like 256 mb ram fed up with it",
            "date": "13 Jun 2015",
            "name": "srij",
            "stars": "1 star"
        },
        {
            "comment": "I bought moto g in WS retail...in delivered mobile external keys are not working so i have requested a new piece but every i give return request ,they are not giving a new piece instead telling me to use the defective product . but i am going to request till i will get a new piece......this is the worst service i ever faced...",
            "date": "13 Jun 2015",
            "name": "eniyatamil jothi",
            "stars": "1 star"
        },
        {
            "comment": "Worst android phone i have ever seen.Absolutely sensitive screen but gets broken easily comparing to other touch screens.Poor battery backup.Those who prefer Moto G 2nd generation should carry their battery backup with them.Gets hanging frequently while using internet.Whenever we start use this handset it gets heat.Among all very costly to service the phone when the screen gets broken.",
            "date": "13 Jun 2015",
            "name": "Ram",
            "stars": "1 star"
        },
        {
            "comment": "This is very low quality product. it's not even starting. Manufacturing defective set. Flipkart is selling defective products to customers.",
            "date": "13 Jun 2015",
            "name": "rahul",
            "stars": "1 star"
        },
        {
            "comment": "I brought this phone from flipkart 2 days ago. it is good, sound quality is nice, picture is also better but not so good as samsung phones,and i get the lollipop version 5.0.1. The android is regretful. no music player,no audio recorder,even no file manager. Can you imagine Motorola helpline said me that I have to install file manager from the playstore to install apps further??? Main problem is that you even can't install Many big games like \"Weird Park 3, \"Rayman Jungle Run\" etc.The Call quality is also very poor. So, I will suggest you to go for an another phone like \"samsung s3 neo\" in this range of 10 to 12k.just listen to me for your welfare and buy another.",
            "date": "12 Jun 2015",
            "name": "joyita bhattacharyya",
            "stars": "2 stars"
        },
        {
            "comment": "First of all Flipkart's delivery was awesome. It was delivered 4 days before expected time. Packaging was also good. Now for the Moto g2- It's a very good phone. Very very fast. Though battery life a bit short.But takes very less time to charge.It comes with a lolipop android v5.0.2. which upgrades time to time. Overall the specs are good to run the phone smoothly.",
            "date": "12 Jun 2015",
            "name": "Yudhajit Ray",
            "stars": "5 stars"
        },
        {
            "comment": "its not satsfactionable for me it was very irritated, ihad got defective picece be careful of such like hand sets in online",
            "date": "12 Jun 2015",
            "name": "goutham balusu...",
            "stars": "1 star"
        },
        {
            "comment": "this item NOT GOOD why because some times hanging. i face the problem like this. this is my review not for others.i suggest lenovo A6000+ or A7000",
            "date": "12 Jun 2015",
            "name": "Sravan Kumar",
            "stars": "1 star"
        },
        {
            "comment": "I bought it for my friend, really liked the Build quality. It comes with latest Android 5.0 Has good camera also.",
            "date": "12 Jun 2015",
            "name": "Krishna Patil",
            "stars": "5 stars"
        },
        {
            "comment": "The performance of the phone is excellent but the delivery by E-kart logistics is very bad..... But if the item is shipped to blue dart or delhivey the delivery is within 48 hrs.... FLIPKART MUST IMPROVE SERVICE OF E-KART... (I have ordered 4 moto g's)",
            "date": "12 Jun 2015",
            "name": "Rajesh Hirurkar",
            "stars": "2 stars"
        },
        {
            "comment": "PRODUCT AS DESCRIBED HOPE THE PHONE IS IN ORIGINAL WARRANTY, PRODUCT WORKING SMOOTHLY.... THANKYOU WILL PREFER BUYING FROM WSRETAIL",
            "date": "12 Jun 2015",
            "name": "Prady Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Its a very good phone with amazing features. We have bought 3 phones in span of 2 months and such is the good experience in this product. The photos are coming out very good. Display is exceptional. Actually I have not seen any negative impacts because of it. Battery last long very long compared to S3. I would definitely recommend to others especially now its 10999 only.",
            "date": "12 Jun 2015",
            "name": "Prabhakaran T",
            "stars": "5 stars"
        },
        {
            "comment": "nice phone with very good features battery backup is very nice since this is my first smart phone i am enjoying it sound quality is also good the only thing that troubles me is that it does not has an inbuilt file manager so you have to download an app called es file explorer in the playstore you can not set your own custom ring tone so i did it using the esfile explorer and there is no reminder feature in it or note pad facility and you cant even keep different lock screen and different home screen pictures i faced only these problems all games work nice and all apps also work properly nice phone within its price HAPPY to own a MOTO :)",
            "date": "12 Jun 2015",
            "name": "Revanth",
            "stars": "5 stars"
        },
        {
            "comment": "value for money...voice command really good...........best in price range......only problem come when you try to listen music in Moto phone, then you have to use google play..!!",
            "date": "12 Jun 2015",
            "name": "gen. buyer",
            "stars": "4 stars"
        },
        {
            "comment": "MOTO G hanged after three month of USE. I have contact respective Service center but NO USE. Two times they have taken service but issue was not resolved. I dont know what to do NEXT?",
            "date": "12 Jun 2015",
            "name": "Prabhu",
            "stars": "1 star"
        },
        {
            "comment": "Nothing else to say, after using Samsung this product is no where lessor than a 20k bucks Samsung phone.",
            "date": "12 Jun 2015",
            "name": "Amit Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 1st Gen has better build quality than gen 2, screen sharpness is not that great as moto G gen 1, Power and voulme buttons are cheap quality. Stero speakers are of cheap quality, Gorilla glass too is of cheap quality. Better go for 1st gen or wait for 3rd gen which will be introduced soon",
            "date": "12 Jun 2015",
            "name": "YUNUS PARVEZ SYED",
            "stars": "4 stars"
        },
        {
            "comment": "It seems that Motorola is dumping off a bad batch of Moto G Phones as most of the People who are using this Phone i know, are facing similar issue with the Battery. When i approached the Service Center, i was informed that they already have such Phones with them in abundance and that the Battery cannot be replaced without an approval (I don't know from whom). There isn't any definite answer as to if you would get the Product replaced or that the Battery gets replaced. Kindly opt for another Mobile and save yourself the Hassle. 10,999 down the drain.",
            "date": "11 Jun 2015",
            "name": "Hrishi Ambali",
            "stars": "1 star"
        },
        {
            "comment": "Dear Flipkart team, Thanks for such a royal treatment. I have been one of the fan and loyal customer of flip-kart till this mail. But the loyalty is broken this time. I will never buy a single product from flipkart neither i will recommend you guys to any of my friend. Let me tell you this glamorous story to you. I order Moto G (2nd Gen) my Order In exchange offer I was happy for the amount that I was getting for my old phone so I decided to go for it. I was eligible for two offers 1) Exchange offer 2) HDFC bank card 5% off I booked the order, delivery was schedule for 11th June. Now the problem starts here 1) I didn't got name and no of a person who was going to deliver the product. Flipkart always use to send the name and no of person who will be delivering the product. 2) Delivery boy gave me call right from my door step, and asked me for my old mobile, which was with me and i was at office it was around 4:00 (Approx time) i asked him to deliver at 6:30. he said he cant deliver again and suggested me to collect it from the Andheri Hub at Sona Udyog. and also mentioned it is open 24*7 3) I went to hub at 7:15PM and there I came to know the order has been RTO, customer care has cancelled my order without consulting me. 4) Then there was a blame game, CC said it has been cancelled from Logistic side, and logistic team said it has been cancelled by CS, and also said delivery vendor is new they may not be aware of process. I am aware if I reschedules the delivery for 3 time then the order gets RTO. This is ridiculous and not accepted at all. I have formatted my old phone now have to do all rework on it. How can you guys cancel the order without consulting me. Even after showing my readiness to go to hub for collecting my order by myself. this is mental harassment. And now i have to burn my blood at your customer care no. Hope you guys take corrective measure for it.",
            "date": "11 Jun 2015",
            "name": "Vikrant",
            "stars": "1 star"
        },
        {
            "comment": "First this is very dissappointing that the delivery is done late, I am really unhappy with that. Ok apart from that phone is really great..... Just got it now so checking it out...",
            "date": "11 Jun 2015",
            "name": "Suhas Patil",
            "stars": "3 stars"
        },
        {
            "comment": "GUYS NOTHING MUCH TO SAY ABOUT SPECS... JUST 1 WORD: AWESOME PHONE AT THE BUDGET PRICE... ALL OTHER COMPANIES CAN'T EVEN STAND IN FRONT OF MOTOROLA'S QUALITY AT THIS PRICE RANGE... JUST GO FOR IT.. UPDATE AS ON 15/07/2015 (After 1 & half month's use) The phone fell from my hands 3 times and nothing happened... The screen did not brake even falling from a height of 5 feets... people who say that screen broke from the height of 2 feet are those who might have thrown their phone out of anger and the result was screen broken.. My experiency says: \"Yes, there is a good quality of corning gorilla glass 3:.... so guys go for it... best phone...",
            "date": "11 Jun 2015",
            "name": "Lakhan Lalwani",
            "stars": "5 stars"
        },
        {
            "comment": "Only two things are missing and other things are incomparable with any-other phone. 1) Hardware : Battery Must be above 2500 mh. 2) Software : Close all recent applications at single click",
            "date": "11 Jun 2015",
            "name": "Nirav panchal",
            "stars": "4 stars"
        },
        {
            "comment": "Defective Device Sold No After Sales & Service Support. Service Center take motorola customers as taken for granted.",
            "date": "11 Jun 2015",
            "name": "Ankit Singhal",
            "stars": "1 star"
        },
        {
            "comment": "Stylish and good sensor phone. Only thing I can hope it does not hang in future as other androids starts hanging after 5-6 months. Manufacturing and designing is good, price a bit high compare to other company.",
            "date": "11 Jun 2015",
            "name": "Alok Shaw",
            "stars": "3 stars"
        },
        {
            "comment": "I have got a product with defects or issues. This Mobile has severe issue with the battery. The battery backup is pathetic. I almost use the mobile putting it in for charging. This mobile's battery dies to 0% from 100% and shuts down often. And on normal basis this mobile has only half day battery back up. I am using this bloody device as landline... by putting it for charging most of the time. I raised this concern with Flipkart just after 5 days of purchase. But no help. I am a regular buyer on flipkart. Still did not get support. My request to look at the issue was rejected.",
            "date": "11 Jun 2015",
            "name": "Anil Puttappa",
            "stars": "1 star"
        },
        {
            "comment": "very fast delivery.....goood servicee. thank you so much flipkart 1) Display: Awesome, crisp, clear, vivid and beautiful. 2) Speed and performance: Zero lag, lightening fast. Pure Android experience as expected from & by Google. After the kitkat update, the performance is much better as kitkat is optimized for 512MB RAM phones. So, 1GB is more than enough here! Battery performs really well, goes for 1.5-2 days on one full charge with nominal usage. With heavy 3G usage, it goes for 1 day+. 3) Call quality: No issues! Clean and clear!",
            "date": "11 Jun 2015",
            "name": "Shijin Thomas",
            "stars": "5 stars"
        },
        {
            "comment": "Purchased a Moto G2 handset from flipkart (Order id:OD002895576077885700). The product delivered was defective and probably already used ( the handset came in with a matt finished screen guard already starting to wear off). The battery drains within a few hours, sometimes dropping from 100 to 20 percent within 30 minutes. The flipkart Tech support team rejected the request for a replacement. Have wasted weeks arguing with your customer support to no avail. They still stubbornly maintain the handset has no problem. Really disappointed in you guys!",
            "date": "10 Jun 2015",
            "name": "Navneet Kaur",
            "stars": "1 star"
        },
        {
            "comment": "The Moto G phone I had received gets heated up frequently. Its battery life is very poor; fully charged battery hardly last for 3-4 hours without using it for communication purposes. To make the things worse, Flipkart's customer service is really bad. I had wasted a lot of time and energy in making them understand the problem and ask for a resolution. I found them pretty unprofessional. Overall, I had a very bad experience with the phone and with Flipkart. Will always refrain from buying stuff from Flipkart in future. I think Flipkart should STOP using the rallying cry - \"Ab Har Wish Hogi Poori\".",
            "date": "10 Jun 2015",
            "name": "Gunjan",
            "stars": "1 star"
        },
        {
            "comment": "Dont make a try to buy.worst quality ever seen...service problems and all...gud if you buy it from official site!!",
            "date": "10 Jun 2015",
            "name": "Säñdêêp Sëtty",
            "stars": "5 stars"
        },
        {
            "comment": "I had ordered Moto G handset on 02-Jun-15. On 9-Jun-15 i received my packet and its very unfortunate to say that it contains a piece of brick. I open this packet in front of delivery boy and I just informed to customer care of flipkart for this type of occurrence.",
            "date": "10 Jun 2015",
            "name": "Mohammad Meraj",
            "stars": "1 star"
        },
        {
            "comment": "I purchased this phone, 5 months back. One fine day, my phone got wet in rain. Since then the resolution of the screen has gone down and pink linings started appearing on the screen. When I contacted Motorola customer service center they told, since it is fluid damage, it is not covered under warranty and I will have to pay 4500 INR for the same. Seriously!!!?? For a phone worth 10K, I need to pay 4.5K for display. I would rather buy some Chinese handset in the same price range with better functionality, performance and quality. From specification perspective this phone seems really good, but when it comes to the quality it is a cheap phone.",
            "date": "10 Jun 2015",
            "name": "Amitabh Divyaraj",
            "stars": "1 star"
        },
        {
            "comment": "Initially Moto G had heating problem. But, some how the heating issue got resolved after emptying and recharging the battery for the 3rd time. Good phone to use.",
            "date": "10 Jun 2015",
            "name": "preethi gopalan",
            "stars": "4 stars"
        },
        {
            "comment": "Biggest Issue is pathetic battery. Dual sim with internet hardly it is lasting till 3 -4 hrs. ZI can not keep charger alyways on & then use \"Mobile\" Phone",
            "date": "10 Jun 2015",
            "name": "Prasad Bahulekar",
            "stars": "1 star"
        },
        {
            "comment": "Moto g 2nd is the best mobile i got it in 9k.",
            "date": "10 Jun 2015",
            "name": "mukesh madani",
            "stars": "5 stars"
        },
        {
            "comment": "Used 4 days , after 2nd day start hanging, multiple time restart, appsa are getting hanging, when try to pickup call then touch is not responding. I think its mot MOTO G Its defective G",
            "date": "10 Jun 2015",
            "name": "Krunal Lakhata...",
            "stars": "1 star"
        },
        {
            "comment": "Hachu kav ne to levayi iphone 5s ka 6. But paisa no hoy ne purta to j ava moto foto levayi. Sitaram (from Gandigram, Rajkot)",
            "date": "10 Jun 2015",
            "name": "Dharmik Chag",
            "stars": "5 stars"
        },
        {
            "comment": "My phone is hanging too much. I have already complain to customer care but customer care unable resolve this issue. Very bad service of Motorola. Don't purchase MOTO G2.",
            "date": "10 Jun 2015",
            "name": "Arpit Patel",
            "stars": "1 star"
        },
        {
            "comment": "Phone is running great. Bought it for my Dad.Compared with my moto X, looks a tad bigger but normal usage is operated with same speed. Moto X is another beast, so lets not compare it with Moto G except its size. Overall a nice decent entry level smart phone with all good android features. Received it in 2 days.",
            "date": "09 Jun 2015",
            "name": "Sunil Garhwal",
            "stars": "5 stars"
        },
        {
            "comment": "I have hardly used this phone in the last 60 days of it's purchase and I am gearing up for a second visit to the service center. Originally the PCB was Faulty so got it replaced. Now the camera can't focus and heating issues. DO NOT BUY THIS PHONE. I was looking for something cheap with average specs so that i could manage college, but its absolutely waste now.",
            "date": "09 Jun 2015",
            "name": "Ashesh Kumar",
            "stars": "1 star"
        },
        {
            "comment": "HI Friends , Flipkart sent me a defective phone , the phone speaker and the audio quality is completely bad , it's completely unacceptable . It's been 7 days i raised request for the return but there is no any proper action taken from Flipkart side . No matter how many times i call flipkart support center they simply disconnecting my call .every time they telling me your request is in process and concern team will call me back in 48hr's they are telling the same stories from the last 7 days . i dont' know what to do now to whom whom i have to complaint on this , how to get my money back . All i want either new phone or refund my money , i am never ever gonna buy anything from flipkart in feature .",
            "date": "09 Jun 2015",
            "name": "baratam goutham",
            "stars": "1 star"
        },
        {
            "comment": "cancel the item dele in delaware in 12 days Your courier company your Flipkart company not available ni kannada exectu",
            "date": "09 Jun 2015",
            "name": "Jayadeva M",
            "stars": "1 star"
        },
        {
            "comment": "Phone is awesome.... I called the delivery wala to deliver mob near by address to FK pondicherry hub....but he made me to roam here and there in the mid day sun....",
            "date": "09 Jun 2015",
            "name": "harish",
            "stars": "4 stars"
        },
        {
            "comment": "price down, pick it ! without any second thought, still running fine, rest of phone still far away from its quality",
            "date": "09 Jun 2015",
            "name": "Ankit Singla",
            "stars": "3 stars"
        },
        {
            "comment": "Once I received the phone, there was a problem with the sound that whenever I used to call I am not able to hear any sound from the received, hence I requested either to return or to exchange the item and also I paid extra bucks to deliver the order on the same day itself.However, this flipkart people just texted me back their product specialist will contact. but they cancelled the time what they mentioned on the message, then they will fix at another time. till yet I did not receive any calls from them regarding this issue. Its clearly shows that they are cheater.... I never expect this from the online shopping shop like FLIRTCARB.....",
            "date": "09 Jun 2015",
            "name": "Bony",
            "stars": "1 star"
        },
        {
            "comment": "All functionality is good only battery issue. If you use 3g then in 4 hours battery lost, I just purchased 2 weeks ago, camera is too gud. Over all its nice phone in such a price",
            "date": "09 Jun 2015",
            "name": "Pradeep Patel",
            "stars": "4 stars"
        },
        {
            "comment": "Everything is nice execpt for batter charge time. It take literally 4 hours and 15 min to completly charge.",
            "date": "09 Jun 2015",
            "name": "Chatty",
            "stars": "3 stars"
        },
        {
            "comment": "I BROUGHT MOTO G2 IN FLIP KART ON 08.06.2015 & I EXCHANGE WITH HONOR HOLLY MOBILE HAVING SMALL CRACK IN MY DISPLAY HONOR HOLLY SO E KART EXECUTIVE NOT EXCHANGING MY MOB............... I LOST MY ONE DAY DELIVERY CHARGES RS: 90/- AND EXCHANGE CHARGES RS: 50/- TOTALLY 140/-",
            "date": "09 Jun 2015",
            "name": "Balaji T",
            "stars": "1 star"
        },
        {
            "comment": "Its a very good phone with lots of features in this price range but there is problem of battery drain out at once. My phone was fully charged, at once whole battery got drained out and it came to 9%. This happened with me 2-3 times till now since I bought it. Please look into this problem.",
            "date": "09 Jun 2015",
            "name": "Rohit Bansal",
            "stars": "3 stars"
        },
        {
            "comment": "Very good product from moto for low price.....i purchased 3 moto g mobile...for my frineds and both are happy.. .............................................................................................................................................................................................................tk",
            "date": "09 Jun 2015",
            "name": "Puneeth Kumar MB",
            "stars": "5 stars"
        },
        {
            "comment": "i have odered moto g2.. i have got that phone corect time. but i didnt get offer attached with this phone.how to obtained that offer?",
            "date": "09 Jun 2015",
            "name": "sooraj s",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased this mobile just 45 days back and its becoming complete blank screen and hangs frequent, please its my request dont buy.",
            "date": "09 Jun 2015",
            "name": "Karunakar",
            "stars": "1 star"
        },
        {
            "comment": "it is very good product n i really like it n hope it should not trouble me.. have very high expectn from moto",
            "date": "08 Jun 2015",
            "name": "BIBHU",
            "stars": "5 stars"
        },
        {
            "comment": "SIMPLY SEXY... Just the sexiest of android phones in this price range. Awesome experience. Hope this continues and MOTO stands up to the expectations. Just go for it. No second thoughts.",
            "date": "08 Jun 2015",
            "name": "Abhishek Rath.",
            "stars": "5 stars"
        },
        {
            "comment": "First of all again flipkart delivery is awesome.... Moto G 2nd gen is already best phone in this price range....you can't get better that this in this price.",
            "date": "08 Jun 2015",
            "name": "Gyan Prakash",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G 2nd gen is a beautifully designed device. Matt finished at back cover made it handy. The device come with Lolipop 5.0.2 which give it an extra edge. The specification are quite decent, It is fast and capable to run some heavy graphic games. The only cone with this device is its battry backup, it is good but not that great. Overall the device is best choice in this price range. You can imagine its popularity by this that every 2nd person in my company have this device. ( Even also E-kart logistic person which handed me this phone have the same device ) :) Thanks Flip Kart for provide this device in unbeatable price offer. Thanks",
            "date": "08 Jun 2015",
            "name": "Sanjay Chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Service, First time experience of purchasing a Mobile Phone online. Initially the Delivery was delayed even after asking for a \"One day Delivery\" Flipkart was kind enough to refund the amount as it was delayed delivery from their side.",
            "date": "08 Jun 2015",
            "name": "Virat",
            "stars": "5 stars"
        },
        {
            "comment": "I have purchased Moto G2 from flipkart and after one month I am facing issue no service/Emergency call only in both sim. mobile is not detecting the sim at all . what I came to know , the mobile with IMEI starting with 3533 are incapable of connecting to network and it is faulty lot . donot buy this phone from flipkart delivering the refurbished set or faulty one and now they are denying the exchange , as my set had crossed 30 days(only 8 days extra ) .",
            "date": "08 Jun 2015",
            "name": "Dhirendra parihar",
            "stars": "1 star"
        },
        {
            "comment": "I bought MotoG2 on 30th December 2014 and got the delivery on 1st Jan 2015. The performance was acceptable and the phone was working fine. On 5th June when i connected the charger to charge my phone, there was a spark in the phone port for charging and then i was not able to charge the phone. The phone was working fine, but it was not getting charged. A call to to the Motorola Call Center yielded a 9000 Rs Quote for complete replacement of motherboard. 9000 Rs to replace the motherboard on a 11000 Rs phone? Are you people offering MOTO G at good prices, so that you can take out all our money in the after sales and services?? Please give me solution for this.",
            "date": "08 Jun 2015",
            "name": "Shweta Kumari",
            "stars": "1 star"
        },
        {
            "comment": "moto g 2nd have some drawback its start hang , heating and most dangers moto provide service only one time on repair in warranty period",
            "date": "08 Jun 2015",
            "name": "anupam thakur",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased MOTO G (2nd) mobile and was shipped by WS Retail, delivery was done on time as per expected. But 10 days I found the product to be defective where the performance of the mobile was too slow. When i raised the concern to Flipkart, then they gave me a solution to Switch Off and Switch On the mobile and then charge the mobile (crazy solution ever). I tried it but no use still the performance was slow. Later after 20 days I found that the Dual speakers was sometime not working which was a begger concern for me. After I raised a request for Return / Replacement, without any discussion they rejected my request which was such Unprofessional way of dealing with the customer. Simmilarly again I raise 2 more request for the replacement but no one has reached me on my mobile and hence i lost 10K buying this defective product.",
            "date": "08 Jun 2015",
            "name": "Vishwanath Pillay",
            "stars": "1 star"
        },
        {
            "comment": "moto g 2 has a severe heating problem it heats even when it is not in use and because of it battery drains g 2's functions are good but only there is a big problem with its battery if u use wifi or 3g for longer time (as i do my note 4 is always connected to wifi) its not worth gl hf (good luck have fun)",
            "date": "08 Jun 2015",
            "name": "Sujay Dudwadkar",
            "stars": "1 star"
        },
        {
            "comment": "mobile is good battery back up is very poor increase the battery backup I can't understand what to do the phone without USB cable.",
            "date": "08 Jun 2015",
            "name": "satish",
            "stars": "4 stars"
        },
        {
            "comment": "Hardware specification Phone is good. But Android Lollipop OS is not good enough with the device. like songs still playing at back of the call. and other issues, message alert dims the music player voice., even its silent. Charger received with this phone is very slow. need to be replaced. Earphones are OK. But phone provide good output with other resources. Value for Money in market.",
            "date": "08 Jun 2015",
            "name": "Rohit",
            "stars": "4 stars"
        },
        {
            "comment": "Amazing phone Worth for buying Go for it 2nd preference is moto after iPhone Very good technics Amazing camera",
            "date": "08 Jun 2015",
            "name": "PARAS SETHI",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone almost 2-3 weeks back. Reason for buying this phone was because my father and my wife had bought moto g 1st generation. This moto g first generation worked perfectly weel and giving amazing service since last 1.5 years. battery life is amazing. Hence me, my sister and brother in law bought moto g 2nd generation. ALl these moto g 2nd generation is work as far as batter life is concern. the main reason for me to buy new phone was battery life. which was amazing in moto g 1st generation. but moto g 2nd generation is worst for its battery life. not just with my phone but all the moto g 2nd generation phones we bought at my place. i also enquired with few of my friends who bought moto g 2nd generation. every one had battery problem. it takes 4 hours to charge the complete battery and it takes 3 hours to drain if you have 3g data ON. I strongly do not recommend any one to buy this phone. applications response, RAM and display is good Flipkart delivered it well with in time and good coordination",
            "date": "08 Jun 2015",
            "name": "Alaukik Kotecha",
            "stars": "1 star"
        },
        {
            "comment": "i have purchased moto g2 in the month of april 29 and it will be touch is not proporly working.so i ahave replaced...but not delivered....due to incomplete adrees..like that they showed..ekart courier,,,but same adrees initial product delivered..after one week they played games and replacement cancelled...and returned item.....worst...situation",
            "date": "08 Jun 2015",
            "name": "ravi",
            "stars": "2 stars"
        },
        {
            "comment": "Yes. Its really a best mobile. No heating problem and the best cameras compare to other high end phones and the volume of the loudspeaker are really too gud. Only disadvantage in this mobile is with the battery. If motorola introduced the 3rd Gen with 3000AH battery then it will be the best mobile in the market",
            "date": "08 Jun 2015",
            "name": "Karthik Kasirajan",
            "stars": "4 stars"
        },
        {
            "comment": "Reason to buy this phone is, 1. Aged but still Reliable and time tested. 2. Value for money (Though around Rs. 9000/- should be the exact price for this phone as per present market.) 3. Build quality. 4. Plain and simple ANDROID LOLLYPOP. No unwanted preloaded apps. Just One minus point, THE BATTERY. It should be atleast 2500 mah. A poer bank is necessary for this phone.",
            "date": "07 Jun 2015",
            "name": "JAYDEEP BANERJEE",
            "stars": "4 stars"
        },
        {
            "comment": "we are placing order for kitkat version os ,they will deliver lolypop version ,that has so many problems and that can genrate the at the time of speaking in the call,audio player has been struked ,and brightness settings should not work. DON'T BUY THIS THINGS. they will didnot replace they PUT LINK SEND TO OUR MAILS THAT LINK ARE NOT WORK, I AM REPLACING MY MOBILE THEY WILL NOT REPLACE MOBILE THEY WILL GIVE SOME LINKS SEND TO OUR MOBILE THAT WAS NOT A GOOD THING .THESE IS THE \" THIRD \" TIME I REPLACE REQUEST FOR FLIPKART",
            "date": "07 Jun 2015",
            "name": "manu",
            "stars": "1 star"
        },
        {
            "comment": "NOTE: In any case, if u feel exhausted by the length, My sincere advice: Don't read, not even partially. Doing so can result in unintended perceptions. It's written to be read fully as a whole. If u want to leave, do it right now. CAUTION: The review would begin with discouraging buyers, but there's a lot of good news down under. Don't miss that, it's going to help u a lot. Therefore, read the full review, else don't read at all. First of all, everyone who intends to view this review for advice on whether he/she should buy it, NO, Not at all. Check the date and time of this review. Guys, its June 2015. The processor used in this phone dates back to the Moto G (1st gen). 1GB RAM, while it was enough a year ago, its not the case now as the apps are getting more resource intensive. In simple words, they need more RAM. So what should u do. Go for other phones? NO. Other phones, such as Mi4i, have a lot of software issues. For example, MIUI (Xiaomi's OS) alone consumes 800 MB RAM. And it's not so fast either, even with 2 gb ram. I mean seriously, you dont want to shell out Rs 13000 to go for a phone whose RAM management is so poor. MIUI, for all its customisation, is a bug magnet and cause a lot of overheating issues with a phone. So every time there's a breakout (which is often), company issues a statement saying they will release an update. In all the developing course, It's the user that suffers. Seriously, U don't want to risk ur hard earned money and user experience on a smartphone whose quality is limited to regular updates (NOTE: regular update size is close to 800MB). On the contrary, stock android consumes just 450 MB ram and its ram management is excellent and safer. It is pure, simple, elegant and minimalist. You guys might be thinking that mine is a probably hate case against MIUI or Xiaomi. In reality, it's on the contrary. The reason i'm only talking about MIUI is because it's still the best of custom UI's, others are far worse. Anyways, it's time for good news. Moto G 2015, (yes u heard what u saw), the 3rd generation of Motorola's most loved smartphone is surely coming by the end of july, probably earlier. It's going to be the most awesome phone in the budget. It will boast stock android, faster processor, 1080p screen resolution, 2GB RAM, 8 and 16 gigs internal memory models, and will retain one deal maker that's missing on mi4i, Expandable Memory Slot (upto 32 or 64 gigs). You might think that these are rumours. But its logical, isn't it. Otherwise, how do u expect motorola to survive in a world where 2 gigs RAM is quickly becoming the norm. You can also google it to confirm that it's coming. Lastly, it won't be fitting if i don't express my gratitute to this amazing device. I bought the device in feburary 2015. It's best on quality, user experience is the most excellent thing. Hardware is impressive. Designed to hold comfortably in hands. It does not lag. Battery backup lasts for a full working day (not more). Many of you might be thinking that I'm not a power user or I don't play games, Well, u're right. But that's what u expect from a phone this range. I won't claim it's a flagship by any means. It's a mid range device, but a perfect mid ranger. The reason I've reviewed this device so late is because I wanted to gift a 5-inch smartphone to my mother on her birthday, which is in june. So I saw a hell lot of reviews of smartphones under rs.15000 like Asus Zenfone 2, Zenfone 5, Mi4i, Redmi 2, MeiZu mi note, Yu Yuphoria, Yureka, Lenovo a6000 plus on a hell lot of you tube channels like GeekyRanjit, C4ETech, Bailey Stien, Intellect Digest, Android Authority, Techniqued, u name it. In the process, I wasted almost 3 days watching videos, reviews, typing constantly before settling for Mi4i. But it's overheating issues and its dependence on large updates for quality coupled with unexpendable 16gb storage (out of which u hardly get 10gigs) constantly flogged my mind. Then suddenly I saw my moto g (2014), and thought: why not this? I nearly ordered it, just noticing seconds before that most of the phones were shipping with 2 gigs, even when they were priced lower. I thought probably that was because of custom UI's (which is partially true), but I also found out that apps were starting to use more RAM than ever, So I backed out. Though my moto g still provides me with 450mb free ram (which is just enough), but when u think of a year later in 2016, 1gb becomes pointless. A budget buyer usually buys a phone that can serve him best value for at least 1.5 years. And don't forget a 2 year old processor. So DEFINITELY NOT. Again guys, I know it's long but it would rather spare u the 4 day headache (in my case, I had a very fast internet, 30gb plan and did all this on a laptop. For mobile users, it can take forever). So I'm not at all sorry for the length. I coudn't have described it any lesser and better. Hope, It would help most of u guys.",
            "date": "07 Jun 2015",
            "name": "Siddharth Bhat...",
            "stars": "5 stars"
        },
        {
            "comment": "flipkart gave me defective moto G (2nd gen) and not return my phone. Please don't buy flipkart. And reply my complain",
            "date": "07 Jun 2015",
            "name": "Abhishek Singh",
            "stars": "1 star"
        },
        {
            "comment": "best smartphone in this range . camera quality of both the cam's is awesome . best price , sleek design ... gaming quality is good ... but just one problem its battery backup is very low and this sucks :( ... most of the time youtube crashes . m giving 4 stars .. one star missing just for battery life othervise phone is good .. a smart choice ;)",
            "date": "07 Jun 2015",
            "name": "vasu dhiman",
            "stars": "4 stars"
        },
        {
            "comment": "pathetic product, brand new phone with a package tampered and the new charger been replaced by the old one i belive softwar issue and many more in the list dont buy. i regretand didt got my money back yet",
            "date": "07 Jun 2015",
            "name": "Amit Agarwal",
            "stars": "1 star"
        },
        {
            "comment": "Factory loaded Lollipop 5.2.0. decent performance, speakers are excellent,very user friendly, customisable , well built with a good screen .",
            "date": "07 Jun 2015",
            "name": "Rahul Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "The mobile motorola 2 G purchased initially worked well but after about a month, the speaker is giving out crackling sound. The battery also gets discharged within 2-3 hrs.",
            "date": "07 Jun 2015",
            "name": "PRANAY KUMAR",
            "stars": "1 star"
        },
        {
            "comment": "I bought it around 10 months back and after using this for this long, I can say that this mobile is the best available product at this price range. Infact no other mobile is near this much. Google always provides the latest available android version w.r.t this product. So if you wanna buy an android phone and you don't have a budget for Nexus 5 then this is the right phone.",
            "date": "07 Jun 2015",
            "name": "Stripathi",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome mobile.. good performance..no complaints..Dint expect so much at this price..really mesmerized",
            "date": "07 Jun 2015",
            "name": "karthik Allen",
            "stars": "4 stars"
        },
        {
            "comment": "5/5 for the delivery time by the Flipkart. I got the first and every replacement within 1 day. but 1/5 for the QUALITY of product delivered. Requested for the replacement 2 times and even then the product delivered was low on quality. The quality does seems to be related with the reduced prices of the particular model. Every time I received this product, there was a problem with the display. 1. There was white light spread (as if a white bulb is present) at bottom left and right of the screen display. This light spread was not visible under day light or normal conditions. but was clearly visible in dark with full brightness level and placing a black wallpaper. 2. The second piece I received as a replacement had another display problem. This time there was blue spot just below the centre of the screen, which was clearly visible with a white background. Not only that if a screen was touched anywhere on the lower half, the same blue spot shows some kind of depression and looks as if some liquid is flowing down the screen. More disappointing was that I was told by the technical team to download third party app from the PlayStore to check if it resolves the issue and the app when downloaded was showing an ad \"Your phone has a virus, click to scan\" -- I mean, firstly how a hardware problem could be fixed with a software, secondly that too by a third party app which promotes risky adware, and lastly, what if I do not have access to internet then how could someone download that app. 3. The third piece delivered, again had some quality issues where the display shows the grid lines of the LCD panel on tilting the phone even with the slightest angle. but it seems have to accept the mistake of buying it first place and hence not reporting it again. Also, the process of replacement is not very convenient. I had to contact the customer support team first which schedules a call with the technical team on a specified date and time that means I had to bear with the issue till then. And to explain the real issue is another big challenge because it is very easy to see or observe the issue but very hard and difficult to explain it in words. my suggestion, PLEASE DO NOT BUY this product anymore.",
            "date": "07 Jun 2015",
            "name": "SHUBHYANT NIGAM",
            "stars": "1 star"
        },
        {
            "comment": "I bought this phone on 4th Jun 2015. I open the box start installing the OS and software it was working fine. 5th Jun Morning phone was totally dead I though it is because of battery. I put this on charge for 1 hour. Still this phone is dead. I lodge a complaint to flipkart customer care. But their response was very bad. They told me as per company policy minimum 24 hour they will take to give me a call to understand the problem. Very ridiculous. I lost my trust on flipkart online shopping.",
            "date": "06 Jun 2015",
            "name": "Sunil",
            "stars": "1 star"
        },
        {
            "comment": "It is an average handset some basic features are missing like call recording, video calling and poor battery backup........ charge three times every day",
            "date": "06 Jun 2015",
            "name": "Ratnesh Kumar...",
            "stars": "3 stars"
        },
        {
            "comment": "Great with one small issues. I don't like the volume rockers & the power button on the phone. They don't feel long lasting at all. Just hope they do last. And also hoped that the original accessories were a bit reasonable.",
            "date": "06 Jun 2015",
            "name": "Sachin Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "First of all, I'd like to clarify. My review is not of the product per se, but the delivery experience. I never received the product, and thought it worthwhile to make you aware of the terrible service. My first gen phone broke down after 1.5 years of usage, due to hardware issues, and I went in for this device. I ordered it with 24-hour guarantee as I needed it on a priority basis as my work was getting delayed without a smartphone. And the phone reached my nearest hub overnight according to their tracking platform. But until three days, they just kept giving excuses that they couldn't reach me, etc. and kept updating with \"Out for delivery\" at 10 am and \"Failed to deliver due to operational issues\" at 3 pm. We contacted customer care, gave alternate number, still the same tomfoolery going on. Finally they gave up and refunded the amount. They had the audacity to postpone delivery further. Let me tell you, their van comes to my campus almost daily with parcels as there are many who order. And when I'm not around, they leave it with the warden. And this has happened countless times. Probably I'm guessing they never had the phone in stock and were just fooling around. So be wary. My rating is also based on delivery experience and not the product itself.",
            "date": "06 Jun 2015",
            "name": "Shrivallabh Sa...",
            "stars": "1 star"
        },
        {
            "comment": "I was already a fan of MOTO G since last year, the only reason for not picking was lack of expandable memory.. With this 2nd Generation Launch I must say Motorola has launched a monster which would eat away the charm of ANY other phone! With 5 inches display it looks really classy.. Looks better than any phone I see around :) Camera is awesome even for dim lights, good battery, very smooth in operation due to 1gb RAM and quad core processor, excellent graphics and above all extremely sleek and handy! There are already huge praises all over the website, I would just mention one thing, ppl please open your eyes and buy a phone which values your money.. I don't understand why they have a doubt and say its Motorola I am looking for something in Samsung!! Please!! Same configuration in Samsung would cost you just double and all Samsung phones look alike!! and moreover FYI - Motorola is the oldest company to launch mobiles! Motorola Powered by Google is the BEST combination anytime with unbelievable price.. I was not expecting 2nd gen to be this low at price! Hats off!! Also, If you have been delivered a defected piece you can get it replaced instead of talking ill over websites.. even Xperia Z1 was replaced by me 2 months back, that doesn't mean its a bad phone! Its just an electronic device, there are chances of manufacturing faults, check properly when you get, use it extensively for a week, analyze it and get it replaced!! Just close your eyes and buy it.. you will love it!!",
            "date": "06 Jun 2015",
            "name": "sadab ansari",
            "stars": "5 stars"
        },
        {
            "comment": "Hi FlipKart, This is Goutham Kona, i am very disappointed to share this with you that i am very sad with the services which you provide. The reason for my Regret is the hell lot of inconvenience caused because of you!! With due respect on the website and services i have placed an order for Moto G Generation 2 Black colour as on April 27, 2015 using my registered mobile number 9494600648 with email address used is gouthamkonaa@gmail.com. The order placed was Order# OD002696336318460500 . I was very happy but with unfortunate reasons the product got returned as on April 29, 2015. from then my problems became worse neither i got the product nor the amount which i have paid have been refunded. From May 5 everyday i have been giving a call to your customer care service and have been receiving the same response that the refund amount would be credited to my account by tomorrow. The tomorrow is never seen till now and so does my refund amount.Everyday your employee have been suggesting us to refresh my bank statement and i am doing the same but there isn't any change in my Bank Balance. Its High time now, please find the attached bank statement of my account and i would request you to get this issue resolved soon Any further delay would highly effect your stupid organisation and please do remember that i would never suggest anyone to shop on this idiotic on line shopping centre Please respond back soon to avoid further destruction. my patience levels have come down and would file a compensation case on your organisation in case of further delay. Respond immediately",
            "date": "06 Jun 2015",
            "name": "Gouthamkona",
            "stars": "1 star"
        },
        {
            "comment": "Over all performance is good, but i am very disappointed with battery Back is very poor. Touch is also not very soft. I lit bit disappointed with Moto g2.",
            "date": "05 Jun 2015",
            "name": "Kamini Singh",
            "stars": "3 stars"
        },
        {
            "comment": "Better for money...i bought this product last two week ago.....Good one will purchase this product ..",
            "date": "05 Jun 2015",
            "name": "Satheesh Kumar D",
            "stars": "4 stars"
        },
        {
            "comment": "I have purchased this mobile recently.I am very much satisfied with this model. Only one drawback that battary should be more than 2070MAH.one more that when you go message composing you will not find enter.Rest is ok",
            "date": "05 Jun 2015",
            "name": "Manikantha Sa...",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased MOTO G 2nd Gen mobile from Flipkart. After some days it started stucking up/ screen blackout. Also Battery door is missing. I raised complaint and return request to Flipkart since it was before 30 days. But I keep seeing the message that \"We will call you\", but no return request was processed and no one called me on this. Disappointed with Flipkart in this regard. Hope atleast now Flipkart tries to retain its loyal customers.",
            "date": "05 Jun 2015",
            "name": "Upendar Srirangam",
            "stars": "2 stars"
        },
        {
            "comment": "1st 3 months it is working very fast and very good , after 3 months i faced so many problems , touch is properly not working, batter issue , suddenly my mobile was struck. some times automatically switched off also.",
            "date": "05 Jun 2015",
            "name": "Dileep",
            "stars": "1 star"
        },
        {
            "comment": "hangs a lot no replacement given to me for the product inspite of talking on phone on proper service and response",
            "date": "05 Jun 2015",
            "name": "Ankit Gupta",
            "stars": "1 star"
        },
        {
            "comment": "I am using this ph from past 6 months. Touch is good as per price tag. Not as good as of apple I3. performance is good in different application and in different games. Battery is for 1 day in which I play candy crush for 15-20 min a day, 8-10 calls and somewhat whatsapp. (so battery life is not so good) Power saving mode is a good option when you less battery left in this ph. my rating is 3.5.",
            "date": "05 Jun 2015",
            "name": "Sourabh Vats",
            "stars": "4 stars"
        },
        {
            "comment": "Got this frm flipkart in exchange of my old samsung grand quattro... i m not disappointed as mogo g2 is cool trendy and nice phone.. i m still getting used to it, after using samsung device for quite a while this looks a lot refreshing.",
            "date": "05 Jun 2015",
            "name": "Sukhmeet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "getting 38 degree celsius while using Flash light for 10 min In call - 15 min games - 30 min internet - 30 min I requested flipkart to resolve this issue on 28th may 2015, Still now i didn't get any call from flipkart.",
            "date": "05 Jun 2015",
            "name": "bharani",
            "stars": "2 stars"
        },
        {
            "comment": "I have purchased Moto G2 from Flipkart, but there was a fault in device. At the time of call, at callers end is getting Echo of itself. I contacted the Customer Care, they told me to install SmartCheck so that customer care executive can check the product from their end. But they have not checked the product and said that please contact the Motorola service center. Since my issue did not solved and they given the mail that the Issue solved. Since i changed others SIM but still there was a echo i told this to Customer Care but still they are not giving me proper reply stating that we will call you back to check the product again from our end. Thanks!",
            "date": "05 Jun 2015",
            "name": "Saurabh Soni",
            "stars": "1 star"
        },
        {
            "comment": "I used this product for 20 days and write this review !! Performance wise this phone is best phone i had ever used. You must choose this product if you are performance lover. Camera quality is above average. most wrost thing of this phone is its charging time. Its take almost 4 hours to full charge.",
            "date": "05 Jun 2015",
            "name": "Mehul J",
            "stars": "3 stars"
        },
        {
            "comment": "Kindly update teh list of phones that could be exchanged for buying the Moto G2. I want to purchase two Moto G2 in lieu of LG E435. Let me know if it is possible.",
            "date": "05 Jun 2015",
            "name": "Jai Ved",
            "stars": "4 stars"
        },
        {
            "comment": "used it for a month..no problems...even battery backup is okay.HD games can be played without lag.but scared after hearing the cost of gorilla glass replacement around 7k.keep your phone safe.",
            "date": "05 Jun 2015",
            "name": "rko",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this Moto G on recommendatino from friends. While I; sure the phone is good when bought from an authentic vendor- the unit that came through Flipkart was corrupted- did not even have Google Play Store on it. this is a software the vendor/manufacturer needs to preinstall and cannot be done by any other user. Also, I realised this unit had this piece missing quite late as I'm new to Android processors, and was unable to do this online!!",
            "date": "05 Jun 2015",
            "name": "Mridu",
            "stars": "1 star"
        },
        {
            "comment": "i have a very bad experience with the delivery of flipkart. i want to say it is worst. i ordered this product and it was showing the delivery date is 4th june but yesterday was 4th june and when i was checking tracing details. i saw that the item was not shiped yet.not expected at all. from my side the star will be zero but there is no option for zero so star will be one.",
            "date": "04 Jun 2015",
            "name": "Viral Upadhyay",
            "stars": "1 star"
        },
        {
            "comment": "Well thought that i m going to have a good phone..But after a few days it sucks....not only the performance even the battery backup also suddenly dropped..but the only plus [point is its camera and its sound built...... i was even provided an extra default feature,i.e.,even if i double tap the screen it gets enlarged . . . .thus it is not so good phone according to me",
            "date": "04 Jun 2015",
            "name": "Allu Pritham",
            "stars": "3 stars"
        },
        {
            "comment": "Got the phone on May 26.. Found it defective and raised return request immediately.... They told that I will be receiving call from technical support on the next day evening, so that they can troubleshoot the problem. Also asked to install 'Flipkart SmartChk App'.... But everyday I use to wait for the call which had never come... I call to the FLIPKART CUSTOMER CARE 2-3 times daily, for connecting to THIS Technical team...But these people always have only one reply ::::: \"Sir, U will be getting the call tommorow 3:30 PM\"....ANNOYED LIKE ANYTHING, hearing this reply, daily!!!!! STILL I am carrying the defective box with me.... Haven't xperienced such a bad service from any customer care!!!!! In tonight's call, they told that my request has expired and so, i will have to raise a new request!!! NOW WAITING FOR THEIR CALL, WHICH THEY TOLD, I WILL BE RECIEVING TOMORROW NOON!!!!! I think, such negligence should be brought to CONSUMER COURT.!!!!!",
            "date": "04 Jun 2015",
            "name": "Sabarinath S S",
            "stars": "1 star"
        },
        {
            "comment": "NICE PHONE EVENTHOUGH ITS WEIGHT IS MORE COMPAED TO OTHERS I BOUGHT THIS 17TH APRIL AND STARTED USING THIS FROM 29 TH APRIL ONWADS. RCENTLY MY CHARGER IS NOT FUNCTIONING AND THIS IS FIRST TIME IAM COMPLAINING ABOUT MY PROBLEM I EXPECT A REPLY FOR THIS",
            "date": "04 Jun 2015",
            "name": "ramesh babu",
            "stars": "5 stars"
        },
        {
            "comment": "Good features but the battery backup is not good. It does not even last for a day.",
            "date": "04 Jun 2015",
            "name": "Aayush Srivastava",
            "stars": "4 stars"
        },
        {
            "comment": "I have been using this product since 2 months that too after replacement of the first piece as it started heating on using 3G which shouldn't have happened at all.The replacement was also not fast on flipkart's part which again was not expected from flipkart. Now about phone, it still heats up but lesser than earlier one,is heavy,camera is average and those who want specially a camera phone dont buy it and the spaekers,they are excellent for hearing a song but when u call or someone calls u the voice go out and u constantly need to lower the volume but....the good thing is and only good thing is for which u can buy it that it doesn't hang and the android is very fast..........so choose wisely.",
            "date": "04 Jun 2015",
            "name": "mumal singh",
            "stars": "3 stars"
        },
        {
            "comment": "i had purchased this mobile on 7 may 2015 with in 4 days the mobile gets hanging up and it was unable to call also. i had placed for replacement they told first we will return and provide new product. next day they called and told we are providing one app to download, after downloading they told with in 48 hours our software developer will check and rectify issue. till know no call not clearing the issue also i am totally disappointed with this mobile you people please clear the issue or give me replacement",
            "date": "04 Jun 2015",
            "name": "sricharan batchu",
            "stars": "1 star"
        },
        {
            "comment": "I am suffering Heating ,auto restart ,battery problem i have applied for exchange within the exchange period ( no physical damage )what they do is give me a miss call and say we tried to call you will contact you later i am regular costume of flipkart ( bought more then 2lacks of goods from them in last 7 month or so ) and the worst service provider so far. its time to change the site for sure , have to buy from the other website",
            "date": "04 Jun 2015",
            "name": "Mani Sharma",
            "stars": "1 star"
        },
        {
            "comment": "Facing lot of problems with my moto G2. worst charging even not reliable and touch issue. Raised an complaint with flipkart that i am facing these issues with my phone but no one responded well and nothing went right. I raised that complaint within 30 days from purchase. really frustrated with flipkart service and never buy from flipkart",
            "date": "04 Jun 2015",
            "name": "Raviteja N V",
            "stars": "1 star"
        },
        {
            "comment": "Good phone with this price tag. Phone delivered in good condition and working well for past 3 months :)",
            "date": "04 Jun 2015",
            "name": "Rajesh S",
            "stars": "5 stars"
        },
        {
            "comment": "I like my MOTO G so much that i bought another one for my son. Just when i was planning to buy another one (third) for my sister i notices that the first phone is slowing down. Apps are getting slow, phone is hanging, now the charger stopped charging too !!! Strange its less than one year. Its such a nice phone - Why ?",
            "date": "04 Jun 2015",
            "name": "Guneet Gary",
            "stars": "3 stars"
        },
        {
            "comment": "I purchased the phone a few days ago and am facing many issues with the phone. It frequently hangs up or turns off automatically. Sometimes, I am unable to make a call as the screen just hangs up and then I have to switch off and on to get it working. The screen also heats up quickly while playing normal games on the phone. Call Quality is also not good as the voice echo's a lot.",
            "date": "04 Jun 2015",
            "name": "Madhurima Maggo",
            "stars": "1 star"
        },
        {
            "comment": "looks very stylish and very good phone for my priceee and camera quality awesomee but batery performance average",
            "date": "04 Jun 2015",
            "name": "rohith charugu...",
            "stars": "5 stars"
        },
        {
            "comment": "After reading a lot of reviews and watching unboxing videos I bought this phone. So I had a fair idea what to expect. But it wasn't what I expected. First, I received the phone in Moto G branded box without any plastic encasing it. So it seemed to be that I have been delivered an unpacked product. Second the box contained only the phone. By only phone I mean only phone (and couple of manuals). The charger and earphone were included separately outside the Moto G box. Third the charger is not branded by Motorola and it does not have any USB cable. The earphones are Motorola branded but are probably the worst quality earphones (in terms of materials used, not sound wise) I have ever seen. In unboxing videos of Moto G I could see that the charger and earphones were included in the Moto G box itself, but this wasn't the case with me. This arouses a lot of suspicion in my mind – has Flipkart cheated me out with this product. In Flipkart’s defense the actual Moto G phone is working pretty well and I couldn’t find any signs that I was delivered an unpacked product. But the unbranded charger and low quality phone makes me wonder if Flipkart is taking its customers for a ride.",
            "date": "04 Jun 2015",
            "name": "Naveen Maurya",
            "stars": "2 stars"
        }
    ]
}
