{
    "filpkart": [
        {
            "comment": "Although the phone is good,the screen is too fragile,it broke completely after I dropped it from a pocket height and moreover motorola is reluctant to replace it in warranty.Unsatisfied with the services and build quality.",
            "date": "28 Dec 2014",
            "name": "Vipul",
            "stars": "1 star"
        },
        {
            "comment": "App not supported on this phone. fifa 14,street cricket,and many more, so please no one buy this phone it normal Android phone",
            "date": "28 Dec 2014",
            "name": "Satya",
            "stars": "1 star"
        },
        {
            "comment": "This is the best choice in this price range. Main reason to chose Moto G is for battery backup. Even though Zenphone has 2gb ram under 10000 price tag, It lacks in battery backup. I have been using this for the past 2 weeks. Overall satisfied with the performance as well as camera quality. It has big 5 inch screen with superb build quality and design. Much satisfied with the battery.",
            "date": "28 Dec 2014",
            "name": "Pradheep Halan",
            "stars": "5 stars"
        },
        {
            "comment": "I was very happy with the product i bought it 3 months back. Early this month somehow it wasn't booting and i came to know the motherboard has crashed. Luckily in warranty period, I got the motherboard replaced. just 3 days back i got my phone back and here now i am writing this review! The primary camera is not working properly. Its giving blurred images. Some issue with the auto focus. I spoke to Motorola customer support, the personel suggested me to do factory reset. I had to do the whole procedure again. And i am again back to the square one. Once again i spoke to the moto customer care, they asked me to take it to the service centre. Why do i have to make rounds of the service centre every now and then. It was woking properly before giving for servicing, I find here that these are some workmen whom motorola has given authority and they are not exclusively for Motorola. I DON'T TRUST TO GIVE MY PHONE TO THESE SERVICE CENTRES AGAIN. But i am left with no option. Somehow i could claim for my money back. and I wish I knew this before.",
            "date": "28 Dec 2014",
            "name": "Sneha Sawant",
            "stars": "1 star"
        },
        {
            "comment": "Talking about service- ***** Taking about Phone- **** -* just for battery , only for battery , completely disappointed with battery life. **** for Excellent product from motorola.",
            "date": "28 Dec 2014",
            "name": "Pallav RAjput",
            "stars": "4 stars"
        },
        {
            "comment": "A great mobile phone by Motorola and on top of it, awesome service by Flipkart. The estimated delivery time was 31st December but I recieved it on 27th itself. Talking about the phone, the phone is a genuinely good piece by Motorola having all the essential specs and great harware, this phone is a must buy if anyone needs a true-value smartphone under 15k. It capture great photos, have a smooth touch, incredible speed and HD display. The stereo speakers provide a good sound output. PROS: Screen Size. Primary Camera. Secondary Camera. Stereo Speakers. Quad Core Processor. CONS: Haven't found one till now.",
            "date": "28 Dec 2014",
            "name": "Deepak Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "It's an awesome phone in this price bracket.... the screen quality is great and the camera is just amazing. JUST GO FOR IT !!!",
            "date": "28 Dec 2014",
            "name": "Jatin Popli",
            "stars": "5 stars"
        },
        {
            "comment": "Do not regret the decision, the phone is simply awesome, the best you can get within INR. 13000. Feels solid and looks gr8 at the same time.",
            "date": "28 Dec 2014",
            "name": "Shivnath Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Phone to use regularly , So smooth to use: Pros: 1.Has 8 MP Rear Camera and 2 MP Front Camera 2.Nice Dual Stereo Speakers 3.2 Mics for Perfect VoIP Chat and Recording 4.Has Latest OS 5.Going to get Lollipop Update next month 6.Has Snapdragon Qualcomm Quadcore Processor and Adreno 305 7.Has 12 GB ROM and 1 GB RAM 8.Has 2 Dual Sim Slots which accept MicroSims Cons: 1.Nothing to tell about(Only slow charging time)",
            "date": "28 Dec 2014",
            "name": "Sri Hari",
            "stars": "5 stars"
        },
        {
            "comment": "Very Nice Product and best delivery. I am using it and it have great features. Please buy it,It is a economic product. internal space is 16 gb. 16 gb SD card price is 550 in market. So that space is already in phone so no need to buy extra card.",
            "date": "28 Dec 2014",
            "name": "Vandana Jain",
            "stars": "5 stars"
        },
        {
            "comment": "Got delivered quickly... Product is good and i am satisfied. No issues till now... Moto is always good in the products. i like the changes done from the first gen...",
            "date": "28 Dec 2014",
            "name": "Harsha Koraddi",
            "stars": "4 stars"
        },
        {
            "comment": "after using for 1 mnth great phone except one problem . . . . . . . . . . . . Still didnt recive Lollipop update :( :'(",
            "date": "28 Dec 2014",
            "name": "Rathul Kv",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent performance of Moto G...it gives real value of your money.Have been using this phone since last more than 15 days...No issue at all.Even my friends are impressed with its looks n performance.",
            "date": "28 Dec 2014",
            "name": "M N Gohil",
            "stars": "5 stars"
        },
        {
            "comment": "I am very happy with moto g 2nd generation. Its a good phone. I have good experience with this phone. the battery back up is good & touch is also good.",
            "date": "28 Dec 2014",
            "name": "ravish",
            "stars": "5 stars"
        },
        {
            "comment": "i purchased this phone from flipkart (not available anywhere else), within 3 months phone worked off, and from 22 days my phone is in service center and they only says that part has been dispatched and will come soon. is part coming from outside india. service is just worst like micromax. i will think atleast 1000 times to buy any moto product again.",
            "date": "28 Dec 2014",
            "name": "Montu Yadav",
            "stars": "2 stars"
        },
        {
            "comment": "Excellent display and upgradable android lolipop camera is decent at this price tag build quality is MOTO",
            "date": "28 Dec 2014",
            "name": "Rajpal Singh",
            "stars": "5 stars"
        },
        {
            "comment": "The only problem is of battery. battery drain very fast. Overall Good . I am using it for a month. NO problem . gaming experience is much good ! Mobile look like nexus its ui is much good ....waiting for lolipop which will also be upgradable..!!!!!!!!!!!!!!!!Best budget Phone!!!!!!!!!!!!!!!!!! :)",
            "date": "28 Dec 2014",
            "name": "Aman T",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered MOTO G 2nd edition on 25th of Dec and I got the product 26th Morning. I am very satisfied with the delivery and package. Thanks to Flipkart for the wonderful service.",
            "date": "28 Dec 2014",
            "name": "Ramesh Puruganti",
            "stars": "4 stars"
        },
        {
            "comment": "a nice phone for those who have power bank. it get lots of time in charging but it will discharge at normal rate like other phones. other technical qualities are up to the marks.",
            "date": "28 Dec 2014",
            "name": "Akash Verma",
            "stars": "3 stars"
        },
        {
            "comment": "Anyone looking for a phone? Please go for Motorola. Amazing Mobile with features such as the next android update as well as a RAM, Processor and Display! 13000/- is totally worth it.",
            "date": "28 Dec 2014",
            "name": "Nikhil Sanjay",
            "stars": "5 stars"
        },
        {
            "comment": "The phone got delivered within 3 days, which is always earlier than the estimated time in my area. Overall the phone is very good to hold and in perfornance but the one I received had a bright spot near the centre of the screen which was clearly visible on lighter backgrounds. I asked for replacement of the product but first Flipkart customer service mailed me some troubleshooting steps of fixing dead pixels, but it did not work. I don't think the spot is due to dead pixels. After telling them again they accepted the return and scheduled it for delivery till 7th Jan. Thanks to Flipkart for helping me out. I'm eagerly waiting for the phone and will write a complete review after I receive the final product.",
            "date": "28 Dec 2014",
            "name": "Binod Kumar Singh",
            "stars": "4 stars"
        },
        {
            "comment": "It is veery cool, and very easy to handle it , now a days thise type of mobile substitute for samsung mobiles, moto g 2nd gen is veery cool, it has memory upgraded facility, 1GB ram is veery cool for playing some heavy games, and thise mobile gives rich look.",
            "date": "28 Dec 2014",
            "name": "veerendra amballa",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is impressively sharp for such low cost, and beats most of the mid-range phones I would say. The only area I found dissapointing was the brightness area. It is a bit lower than other phones in its price category. Can't comment on the battery life as of now, but it has gone pretty strong for the past 6 hrs of my moderate usage. Commenting on flipkart delivery, it was awesome, got it delivered with still 5 days remaining for the due date. (Wasn't so happy about the packing though. Protection was meager, but could do with it, no worries) Definite recommendations from my side for both the moto g2 and flipkart.",
            "date": "28 Dec 2014",
            "name": "Tom Pallissery",
            "stars": "4 stars"
        },
        {
            "comment": "Screen display and touch quality is good. Battery backup is good. Good value for money. Photo and music quality is also not bad.",
            "date": "28 Dec 2014",
            "name": "Sandeep Teegela",
            "stars": "4 stars"
        },
        {
            "comment": "Fist I have been using micromax canvas 2 A110 for three years, I know what is the bad quality product. That Phone was bad and slow so I got exchange offer I switched it with this GEM. I have used Nexus 5, Grand 2 and Grand 1 for two days each. I think Grand 1 and 2 is no where in competition with this phone. Battery is same to canvas so I know how to use this new phone but it is almost 24 hr still battery running on Wifi And whatsapp. I am not heavy user. but still In office wifi is connected for 8 hrs this phone survived easily. Screen is vivd 295ppi. camera is awesome, slow mo 720p is perfect. Phone is delicate i dont know why but I cant Put my phone even in Pocket :P now buttons for volue lock key are decent. Now the call quality thing: you have to set the volume to 50% or anyone can listen to your call. Wifi Signal catching is in good range. Dual speakers are same if you set on high volume sound will crack but set it on 80% I have used only for 24hr I will update after every one week month and six onths just to help some of my fellas out there who are reading and get confused about what to buy in budget range cause budget is big thing for us. 5 stars fpr phone display,camera. Used this phone for more more than 10 days it is working well pictures are clear. battery back up is for more than one day for me( wifi 24 hr even in office and home+low brightness whole time). head phones are cheap quality but why the charger and headphones are white? I dont understand the concept. I already have the skullcandy headphones working well with this device. I will update after one month. Till now the best of the best! Used it for months now I have started using more more brightness and high end gaming with graphics. All is set for 12 hours ( full time wifi on and 40% screen brightness ) phone is bit slow while switching to apps while playing games. Battery is kind of drawback but screen resolution pics are amazing. Will update after month. 18/02/2015 Phone is working well. Awesome hats off to moto for 5.0.2 update.",
            "date": "28 Dec 2014",
            "name": "Jay Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone on 23rd November and got it on 24th and I was pretty happy about it. It seemed like a good phone at the moment but then came the problems. If I would use any type of screengaurd my touch screen would start to act funny. I hated it.it was also pretty slow. I ordered for a replacement and got it within 1 day. The new one did not seem to have any problems. But the screen turned yellow and the buttons went inside the body. I got it refunded and bought a note 3 neo. I am really happy with the note experience. And the battery for me pasts one and a half days and best of all it has no problems.",
            "date": "28 Dec 2014",
            "name": "siddharth kumar",
            "stars": "1 star"
        },
        {
            "comment": "Hi Team, This was the worst experience ever i have had with filpkart, I had processed an order on 23rd Dec for a phone MotoG2, on exchange offer through my mobile application from standard chartered credit card, Order no:-OD201618115386931100. I processed this order when i was traveling i ordered this phone for my uncle & by mistake i had but his incomplete mobile number 09890581865, i forgot the last digit 5 to enter while placing the order, Now the delivery was expected by the 1st Jan, Now today when i checked my email i got a mail from flipkart that my order was cancelled without me being aware of it & i spoke to Pranay, Sunil Alok & everyone easily hung up the phone on me. Sunil being a manager hung up that was strange. They said they couldn't help & i will have to replace the fresh order & the same offer is no longer available. Now as a customer try and understand how i would feel agreed that the mobile number was incorrect but the email ID was correct an email could have been sent that \"please contact us in 48hrs or 72hrs since we are not able to get in touch with you due to your incorrect mobile number & i you don't contact your order will be cancelled\". Rather than directly cancelling my order. Now my request was to help me place the same order again as a human error of typing can always be there & i as a customer had already made the payment & had never asked for the order to be cancelled. Hope somebody considers this mistake & helps me because as of now my perception is Flipkart does not requires customers and thinks only they sell mobile phones. But any company should always think the are there because of the customers.",
            "date": "28 Dec 2014",
            "name": "Neelesh Gwalani",
            "stars": "1 star"
        },
        {
            "comment": "Performance: 4 / 5 Software: 5 / 5 Display: 5 / 5 Camera: 5 / 5 Battery life: 4 / 5 Design: 4 / 5 Value for Money: 5 / 5",
            "date": "28 Dec 2014",
            "name": "VIRAJ RANA",
            "stars": "5 stars"
        },
        {
            "comment": "If any one wants to buy a mobile then this is the best choice . Overall compared to other mobiles in this range like grand , asus ..etc moto g is comparatively better. The only cons in this mobile is when u downlod lot of app and install launchers it gets hanged a bit .",
            "date": "27 Dec 2014",
            "name": "NARASIMHAN N",
            "stars": "5 stars"
        },
        {
            "comment": "I've used this phone for the past 3 months now, and reading all the reviews already would only speak of pros & cons for me. The product : Pluses Good call quality & nice speakers Decent camera for outdoors Doesnt crash or freeze as my Lumia used to. Battery life of ~20 hrs with calls of 30-45 min, wi-fi on 10 hrs, rest on 3G, social media usage, email checking & game playing of maybe 20 min Useful apps out of the box Minuses Camera for indoor/low light photos Screen shows blotchy reds and faded blues GPS first fix takes a very long time ~6-8 min (a big minus for me) Charging time is high at ~4 hrs. But at this price, I'd buy it again, not the brilliant Zenfone 5, which is as good/better in some areas, except 2 - I found Moto G a bit easier to hold and use singlehandedly, the battery life is better than Asus, with the better screen being Asus USP over Moto G. Now about FK. I was a bit disappointed to wait for 8 days for delivery, as the status messages showed the phone was stuck in transit for the most part. To be fair, FK did say 10-12 days at the time of the order, however I suppose I've gotton used to FK's superfast delivery. Still FK's customer service was good as always, on pointing out the delay, they got the delivery expedited.",
            "date": "27 Dec 2014",
            "name": "Manoj Khare",
            "stars": "4 stars"
        },
        {
            "comment": "just go for it .. :D :D Awesome in all display 10/10 sound 8.5/10 weight 9/10 Camera 9/10 best in all class . No mobile can beat> moto g 2 < just go for it",
            "date": "27 Dec 2014",
            "name": "Nikhil Gautam",
            "stars": "5 stars"
        },
        {
            "comment": "i love moto....quality good..battery good....solid phone...................................................perform nice",
            "date": "27 Dec 2014",
            "name": "Gourab Roy",
            "stars": "5 stars"
        },
        {
            "comment": "i highly recommend you to buy this phone. it is the best phone in its price range.it performs really well. there is is no game which it doesn't support . must buy. the built quality is amazing. the camera is good . its more than you can ask for at such a pricing",
            "date": "27 Dec 2014",
            "name": "Ansari",
            "stars": "5 stars"
        },
        {
            "comment": "love it awesom handset in my budget battery backup good camera awesom display awesom response awesom looks awesom games mast hai banta bus time nahi milta thanku MOTOROLA and also to FLIPKART for delivering this in just 3 days",
            "date": "27 Dec 2014",
            "name": "Deepak Bhosle",
            "stars": "5 stars"
        },
        {
            "comment": "I got my mobile on 25-Dec-2014 and Today 27-Dec-2014, I got an issue. I could not hear the voice for all the calls. Looks like this is bug in Motorola. Thanks to the motorola support team who guided me to reset the phone and make this temporary fix.",
            "date": "27 Dec 2014",
            "name": "Vinoth Kanna",
            "stars": "1 star"
        },
        {
            "comment": "Moto G 2nd Gen not worth.product quality is worst. heating issues during call and all application installed via google play gets corrupted and photos stored in SD card gets deleted automatically replaced the product 1 times and finally returned the product to Flipkart. Please cautious before buying. Moto E was far better when compared to Moto G 2nd gen. Camera clarity depends on phone to phone.it was worst in the replace moto g than the earlier one",
            "date": "27 Dec 2014",
            "name": "VASANTHAN A A",
            "stars": "1 star"
        },
        {
            "comment": "Mobile looks good .. Just 1 word its better then HTC desire models ranging from 10k to 18k .. Pros : Camera Quality is Marvelous , processing speed is good too .. rest read other review guys.. Cons : I didnt liked the look of Mobile though .. HTC desire looks amazing but lags in camera and performance... Its boring to comment u knw :( .. but its good to help 'as elders said' lol :) :)",
            "date": "27 Dec 2014",
            "name": "Udith Kerudi",
            "stars": "5 stars"
        },
        {
            "comment": "Do not buy from flipkart. 1. Sensor not working properly. 2. Replaced mobile got crash. 3. service center took 20 days to repair. 4. now again I have to go for repair because speakers are not working. Please do not buy.",
            "date": "27 Dec 2014",
            "name": "saket pandit",
            "stars": "1 star"
        },
        {
            "comment": "certainly its a wonderful cellphones coming from Motorola i am using Moto E, but bought this phone for my sister, i had send this phone as a gift to my sister and she received it in time. This Product has all the features and makes it as very handy smart phone, my sister likes this product and she is happy with the product, specially with the camera quality...good work Motorola, very good come back !!",
            "date": "27 Dec 2014",
            "name": "Ghanshyam Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Previously I owned Moto G 1st Gen. which is the best budget phone of 2013 and now I feel happy and proud to have the Best budget phone of 2014.. Moto G 2nd Gen. Here are the pros and cons of the phone. Pros :- The phone is slim and easy to carry The phone has a good battery backup. The look of the phone is awesome and the curved edges makes easy to handle the phone!! The speakers are loud enough and gaming experience is awesome.... It is upgradable to the latest Android L \"Lollipop\" and Motorola claims that it will always provide the latest android to the phone.. Cons :- I have used this phone for Two months and till date I didn't find any problem in the phone.... Description :- The phone is awesome and there were no issues till now when I was using my phone... I suggest this phone for the gadget geeks and its the best budget phone ever !!!! Kudos to Motorola !!!!!!!!!!!!!!!!!!",
            "date": "27 Dec 2014",
            "name": "Koushik Yadiyala",
            "stars": "5 stars"
        },
        {
            "comment": "Company promise to replace the product, first time it replaced it but next time company delivered me defective set and when I called for replacement they told me to go service centre and get a certificate for defect,and rejected my request.",
            "date": "27 Dec 2014",
            "name": "Pawan Kumar",
            "stars": "1 star"
        },
        {
            "comment": "The Moto G 2nd Gen is an awesome product and the flipkart delivery and the content were prompt and accurate",
            "date": "27 Dec 2014",
            "name": "Kabir",
            "stars": "5 stars"
        },
        {
            "comment": "charger gone!! i hav bought my moto g2 on 25th oct. within 2 mnths my charger lost its life. service centre is also not available in my city,,,, disappointed",
            "date": "27 Dec 2014",
            "name": "Mahaboob Ali",
            "stars": "3 stars"
        },
        {
            "comment": "Head phone quality is very poor and USB cable not available with phone. Hide app feature not available.",
            "date": "27 Dec 2014",
            "name": "Neeraj Patial",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is really good.I liked the build quality and user interface. Flipkart logistics is not good as before unless you pay extra for fast delivery!!!",
            "date": "27 Dec 2014",
            "name": "santhosh",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome camera , grear graphics .This handset contains all the features which the buyer desires.But the disadvantage is that this handset has very short battery back-up time and its battery needs very long time to charge.This is the only drawback in this phone but instead of this, this phone is awesome.",
            "date": "27 Dec 2014",
            "name": "Samurai Jack",
            "stars": "4 stars"
        },
        {
            "comment": "Prompt delivery the next day from Flipkart! I have been using it since my purchase on the launch date and faced no problems. Rugged construction. Survived a fall down the stairs. Good Specs at a reasonable price. Good performance in gaming. Excellent Camera which is a marked improvement over 1st edition which I purchased for my daughter. Great low light pictures… some better than my Cannon IXUS. So stopped carrying my camera. Battery is lasting two days for me which is better than my previous LG L9. Prefer this over the Chinese ones.",
            "date": "27 Dec 2014",
            "name": "san_shanbhag",
            "stars": "4 stars"
        },
        {
            "comment": "i had this as my first phone .motorola as changed his personality by starting moto series.in moto g 1st gen there is a lot of problem such as charging is not particular,the screen quality is not that good that in moto g2,camera is better in moto g2,screen size is more in moto g2 than moto g",
            "date": "27 Dec 2014",
            "name": "Risheik Dhir",
            "stars": "5 stars"
        },
        {
            "comment": "Camera is not as good as discussed on flipkart. \"\"Go for lumia 730. I purchase this product on Friday got on Monday.",
            "date": "27 Dec 2014",
            "name": "Saurabh Kumar...",
            "stars": "2 stars"
        },
        {
            "comment": "I bought a Motorola Moto G 2nd gen. phone and as the one month passed i begin to face several issues like hanging, Whatsapp not working properly, and most severe issue was mic was not working properly. When i contacted FLipkart they refused to take any action as they said one month has passed and acc. to their policy they only return or exchange a product within 30 days, which in my case have passed. Even the Motorola don't have their exclusive service centers in India, the service center they are having are on contract basis who are working for multiple companies simultaneously. Thus having a very poor shopping experience.",
            "date": "27 Dec 2014",
            "name": "Ramendra Rana",
            "stars": "1 star"
        },
        {
            "comment": "The phone is very good in terms of specs and performance. The build quality is really good. But the battery is really disappointing. On normal usage it lasts barely a day. Once I was travelling and was using this phone for GPS navigation, to my surprise battery was empty within few hours. If you usually use phone for navigation, like me then make sure to carry a powerbank with you. Another annoying thing I noticed about this phone is that I keep on getting a notice that says \"Restricted Access Changed Emergency service is blocked\". this happens every few minutes. I found that many are having this problem. I think this may be resolved in the next software update.",
            "date": "27 Dec 2014",
            "name": "Ashik",
            "stars": "3 stars"
        },
        {
            "comment": "Reviews were always good for this phone, delivery, service amd the turn around time was pretty amazing by flipkart, thanks a lot!! The delivery guys were also pretty amazing, delivered the product at the exact time as promised!!",
            "date": "27 Dec 2014",
            "name": "Arpit Khurana",
            "stars": "5 stars"
        },
        {
            "comment": "Its a okay okay. Pics look good in camera itself but when view on standard LCD desktop/laptop,it looks avg. Battery- avg ( last for 10-12 hrs ) even on avg use of phone. Over all its a good mobile if budget is below 15K.",
            "date": "27 Dec 2014",
            "name": "Faizan",
            "stars": "3 stars"
        },
        {
            "comment": "very good product,,, got the product on time ,............................................................................................",
            "date": "27 Dec 2014",
            "name": "sama",
            "stars": "5 stars"
        },
        {
            "comment": "after i bought this mobile..... first 20days it worked gud... but after that i cant hear receiver voice and after that they told me to clear cache.... i cleared it worked but after 2 days same problem..... now i asked flipkart to replace ..... need see wht happens now....... very disappointed ........",
            "date": "27 Dec 2014",
            "name": "shiva kumar",
            "stars": "1 star"
        },
        {
            "comment": "Good product with timely software updates..!battery average..!accessories and repairs pricey though,shattered glass of moto g 1st gen cost 4.5k. Rest okay no pobs..!!",
            "date": "27 Dec 2014",
            "name": "JITEN GOGOI",
            "stars": "4 stars"
        },
        {
            "comment": "best ever device in this price tag.... just close your eye and simply buy it............................................",
            "date": "27 Dec 2014",
            "name": "kaushal naik",
            "stars": "5 stars"
        },
        {
            "comment": "Willing to stretch your budget to 13K? Then this is the phone for you. Excellent display. Great performance. All the games and apps run flawlessly. No cons yet (1 week of usage). Bottom line: Yes. I would recommend it to a friend (Heck, I would buy it for him ;).)",
            "date": "27 Dec 2014",
            "name": "Rahul Balakris...",
            "stars": "5 stars"
        },
        {
            "comment": "moto g 2 is a quality and powerful beast at this price the company provides the latest updates the build quality is good, the performance is good comparin slate 6 and zenfone and grand prime ,the stereo speakers are awesome in the loud and clarity, at last the 720p display makes a crisp for viewing angles along of quad core processor and with 1GB ram BENCHMARK SCORES: ANTUTU-20785. QUARDANT-5098 NENA MARK-56.6FPS",
            "date": "27 Dec 2014",
            "name": "SURAJ CHAVAN",
            "stars": "5 stars"
        },
        {
            "comment": "I am using Nexus 5 , i gifted this phone to my sister. Her requirement is simple , a big phone , good features .. Wasting of 30k or 40k for a phome is waste. I just checked this one .. Budget Phone .. Happy for this ... Front cam or back cam .. Awesome.. Moreover google phone .. we will get updates timely ..",
            "date": "27 Dec 2014",
            "name": "Mohan Venkata...",
            "stars": "5 stars"
        },
        {
            "comment": "best phone in range of Rs. 16000....... Value for money phone.... awesome sound quality and camera too.. loved it...",
            "date": "27 Dec 2014",
            "name": "Harsh Gandhi",
            "stars": "4 stars"
        },
        {
            "comment": "Pro's Dual SIM, 1GB RAM, Excellent camera, Good screen; Quiet fast, Battery Backup and Overall Super configuration Con's No Data cable provided Excellent configuration phone without a data cable",
            "date": "27 Dec 2014",
            "name": "Mahesh Khande",
            "stars": "5 stars"
        },
        {
            "comment": "excellent Camera...excellent speakers...great look..!!! great picture clarity...fast processor to work with..!!",
            "date": "27 Dec 2014",
            "name": "Pratik Modh",
            "stars": "4 stars"
        },
        {
            "comment": "It has a nice look. Camera picture quality is good. HD display is good. Sound quality is good. Extended storage SD card is available",
            "date": "27 Dec 2014",
            "name": "Shree",
            "stars": "4 stars"
        },
        {
            "comment": "If you want to utilize your money.Go for it. Very good phone in 12K range and features is like almost all 22k range phone. Good sound..Good HD screen..Batry alos works fine for me ( around 2-3 days).",
            "date": "27 Dec 2014",
            "name": "Deepak Kumar S...",
            "stars": "4 stars"
        },
        {
            "comment": "dear buyers plz u have to here me when I orderd this phone on 25th the Christmas day u knw that is a good day but the flipkart this available seller he cancel my order my cash is gone and my precious time its time wasting so plz not buy this kind of products from this site",
            "date": "27 Dec 2014",
            "name": "anuranj",
            "stars": "1 star"
        },
        {
            "comment": "if you r looking for a good phone in this range den moto g is d best option..! must recommend dis phn to my frnd..! :)",
            "date": "27 Dec 2014",
            "name": "Aashish Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "Nice product and quick delivery. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
            "date": "27 Dec 2014",
            "name": "Arun",
            "stars": "4 stars"
        },
        {
            "comment": "battery backup is not good... charging also taking so much time. Other functionality are extremely good.",
            "date": "27 Dec 2014",
            "name": "Nilanchal Katual",
            "stars": "5 stars"
        },
        {
            "comment": "This phone is good in terms of budget phone. This phone don't have file manager so you can't access your phone file directly for this you would be require to install 3rd party file manager app. I will rate it 3.5 Rating.",
            "date": "27 Dec 2014",
            "name": "Ashutosh",
            "stars": "3 stars"
        },
        {
            "comment": "Good product with awesome features, value for every rupee you spend. Good service from Flipkart, next day delivery at no extra cost",
            "date": "27 Dec 2014",
            "name": "VIVEKANANDAN N",
            "stars": "4 stars"
        },
        {
            "comment": "no description needed !!! if one has to spend around 12-13 k bucks,this is a must buy!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "date": "26 Dec 2014",
            "name": "#bh#k M#j#md#r",
            "stars": "5 stars"
        },
        {
            "comment": "There are very less service centres. There are around 80 lakh people in hyderabd & secunderabd, here they arranged only 2 centres. @service centre, they behave like customers are beggers",
            "date": "26 Dec 2014",
            "name": "Nageswar",
            "stars": "1 star"
        },
        {
            "comment": "Its very nice handset for me , more than one month i search veryase handsets in market then i decided to purchase this because its in quality , price , look every areas comfortable against my choice. Thanks to MOTO G & FLIPKART!!!",
            "date": "26 Dec 2014",
            "name": "Deepak Kadam",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using this phone for atleast a month now... The phone looks exceptionally good!!!!!!!!!!!! BUT.... Dont FALL for it, This is a piece of crap being sold!! The Android Kitkat 4.4.4 stock is not meant for this phone at ALLLL!!! The phone hangs a lot.. It is better kept empty as it proves to be a crap as it hangs a lot when it is filled with apps. The android 5.01 lollipop is just a teaser which has not come to INDIA in months. So please go select some other mobile as it is unworthy of the HYPE it is creating and created. I feel the 1st gen was a lot more better than the second gen ........ When rooted it performs a tad better.. but dont get it rooted as it is suicidal.... Dont go for IT!!!!!!!!!!!!",
            "date": "26 Dec 2014",
            "name": "Adka Srisha",
            "stars": "1 star"
        },
        {
            "comment": "I am fully satisfied with the flipkart service as well as the product. The product is sturdy and feels good in hand. the quality of material is good.",
            "date": "26 Dec 2014",
            "name": "Sanjay Singh Y...",
            "stars": "5 stars"
        },
        {
            "comment": "bought the phone around 3 weeks ago, full marks to flipkart for quick delivery. phone working alright, but i have two issues with it. 1). does charge to 100% even after keeping it on charge whole night. i have inquired from others who are using it. they does not report having this issue. 2). voice from speakers isnt the crispiest..",
            "date": "26 Dec 2014",
            "name": "sidharth arya",
            "stars": "3 stars"
        },
        {
            "comment": "It is worst phone and its services. Sim cards are not working properly in it and more over there are very less service centers.Battery as well as Whole Mobile is getting Heated up in very short time.Battery is getting Discharged quickly. People sitting on toll free numbers are also useless.",
            "date": "26 Dec 2014",
            "name": "PRAMOD KUMAR S...",
            "stars": "1 star"
        },
        {
            "comment": "This is the best Phone in the given range of price. This phone is better than most of the competitor Phones. All things are good like memory,sound(2 speakers ) ,speed Display etc. Only single problem is battery which goes down and is the case of all the Android phone. This is very nice phone ..just go for it.",
            "date": "26 Dec 2014",
            "name": "Gopal Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered moto G 2nd Gen phone...which was faulty.mean to say..since first days phone has issue, frequently getting shutdown,, battery down within 15-30 mins, phone hang..etc... After replaced the got new replaced phone...new replaced has same issue and selar is not ready to replace the phone and also not ready to return the phone... its really very ridiculous service from Flip cart..and I will not buy any items from flip cart if am not getting return or refund my money ....",
            "date": "26 Dec 2014",
            "name": "NARENDRA JHA",
            "stars": "1 star"
        },
        {
            "comment": "Flipkart rarely delivers on their promise. In this case it is that rare moment. Product is good, fast delivery. Satisfied.",
            "date": "26 Dec 2014",
            "name": "Varun Kapoor",
            "stars": "4 stars"
        },
        {
            "comment": "excellent product from motorola think better will get better experience i got this phone 2 weeks ago stunning performance excellent speed awesome design average battery backup in 3g conditions and good one day backup under 2g conditions i loved a lotttt",
            "date": "26 Dec 2014",
            "name": "SARATH KUMAR",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased it two months back and one fine day I was sitting on a chair and it slipped from my pocket and fell on a mat. I picked it up and was shocked to see the broken screen. I wrote an email to Motorola but there was no response. Policy is not the same for Indian customers, outside India they are aware of this issue and are replacing the screen for free but here they are charging over 6k. I would not recommend it to anyone now.",
            "date": "26 Dec 2014",
            "name": "Anand Sachan",
            "stars": "1 star"
        },
        {
            "comment": "average touch battery backup not good both sim not working in 3g mode. please do the needful and solve my issue",
            "date": "26 Dec 2014",
            "name": "kuldeep",
            "stars": "3 stars"
        },
        {
            "comment": "The next 2nd day from the booking, product is reached my doorstep in the morning time itself. Keep it up !!! Moto G2 is very well advanced from his prior version and product is very handy and feels little heavy along with flip case. Best product to go with (With exchange offer ;))",
            "date": "26 Dec 2014",
            "name": "Senthil Nathan",
            "stars": "5 stars"
        },
        {
            "comment": "Its been 3 months since i buyed this product and i'm writing this review after a long time. But still, I'm in love with this product. Everything is perfect with this phone, its camera, processing speed, display ppi, battery backup, internal memory. Its really worth the price.... If you're planning to buy anything in this range, Just blindly go for it.......",
            "date": "26 Dec 2014",
            "name": "Raman Sahasi",
            "stars": "5 stars"
        },
        {
            "comment": "Nice Phone. You can go for it. I Bought this Mobile in September,Its working Fine. Its worth to take this Phone at that Price. The only Bad thing was When I watch HD Videos or Videos for more time. The phone gets Heated Up. Except that everything was Fine. Thank You.",
            "date": "26 Dec 2014",
            "name": "VINAY CHALLAGULLA",
            "stars": "5 stars"
        },
        {
            "comment": "the mobile is awesome as well as the seller is excelllllent because of same day shipping and also i have replaced with new one in an exordinary way.. excellent service and i am very happy with the new moto g.. thnq for ur service seller WS.RETAIL",
            "date": "26 Dec 2014",
            "name": "Kiran",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone. worth every penny. completely satisfied. I have 2 moto g2 in my family and happy. Recommended for purchasing.",
            "date": "26 Dec 2014",
            "name": "Abhinav Jain",
            "stars": "4 stars"
        },
        {
            "comment": "Hello readers, I, here first time writing review of any product. For moto g 2nd i would definitely suggest to buy it. Really it is product of value for money. After using 20 days. I am writing pros and cons of this product. Pros: 1) Great display you would love it at this price. 2) Multitasking much easier. 3) picture quality of camera is good front(2mp) as well back(8mp). 4) sound quality of call is great. 5) Built in quality and Hardware is great. Cons: 1) Battery backup is real issue like any smart phone,, It can allow you to run 24 hours backup for medium user for heavy user battery die in 12 hours max. and in case of wifi user it will give poor battery performance. 2) some times difficult to judge which one is upside and downside as both side looks same. 3) Hands free given with the phone is not up to the mark. So, overall i rate this device definitely pick. At this price range it is difficult to find such great device in market. I hope you like my review. Thank you",
            "date": "26 Dec 2014",
            "name": "Yogi",
            "stars": "4 stars"
        },
        {
            "comment": "This is good phone, but Weight of mobile is heavy. can't use it continuously for a hour in hand, as the weight causes pain in hand and more over after 2 months phone starts to get hanged very often",
            "date": "26 Dec 2014",
            "name": "Shreyas B.M",
            "stars": "3 stars"
        },
        {
            "comment": "Have used it for over a month, a good budget phone, headphone quality is very bad,and the built quality is not as expected or as it looks, just a single slip from ur hand can give dents and scratches to the plastic outline.",
            "date": "26 Dec 2014",
            "name": "Tapash Ghosh",
            "stars": "3 stars"
        },
        {
            "comment": "I got it a week ago and fell in love with this mobile Moto g 2nd gen has a better processer and better features... ofcourse upgradable 2 the latest software 2 date.. Much-improved camera Strong battery life Solid, well-built design one of the best of the best phone within 13k wht to say abt it its simply awesome from the house of motorola .. And last but not least flipkart service is simply Aaaawsome.. :)",
            "date": "26 Dec 2014",
            "name": "Gupta Devatha",
            "stars": "5 stars"
        },
        {
            "comment": "I got Moto g 2nd gen and got it replaced in a week. Major issues in hearing as there is a lot of background disturbance. Very annoying to have a conversation. I have read about other people having the same problem. Is moto not going to do anything about this? How many times do we get out product replaced and take back-ups and transfer our data. Very very disappointed with the call quality. The sound on earpiece was buzzing/crackling, was really annoying because it happens in every call, regardless the phone number. Have tried changing my sim to other phones. There was no problem with those phones. No issues with flipkart though. I would not recommend buying this handset.",
            "date": "26 Dec 2014",
            "name": "Ujwal Tripurari",
            "stars": "1 star"
        },
        {
            "comment": "I have brought both Moto G 2 and Asus Zenphone 5 from Flipkart. On almost all aspects Zenphone is better. Also zenphone costs only 8999/-.",
            "date": "26 Dec 2014",
            "name": "Suryakumar Sur...",
            "stars": "3 stars"
        },
        {
            "comment": "i m already using moto g (1 Gen )...this one i gift to my father..he liked it very much..big screen, best mobile",
            "date": "26 Dec 2014",
            "name": "Jayshree Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "I liked this product very much. Although they had promised for a free upgrade to Android 5 (lollipop), but haven't got an upgrade yet.",
            "date": "26 Dec 2014",
            "name": "Rahul Bhatia",
            "stars": "4 stars"
        },
        {
            "comment": "This phone does not have the world's best specs or the world's best camera.But , for 13K it gives you, more than enough. Having quite decent specs and camera and of course the latest android updates(Lollipop 5.0) it's one of the best cell phones I've used till date. There's no lag(even while loading heavy games like FIFA 15 or Ashphalt 8) and all my apps run smoothly. The battery life is great and lasts upto a day on heavy usage. Initially the battery will take upto 6 hours to charge but after a few days it won't take much time and PLEASE DO NOT THE MOTOROLA CHARGER, use some other charger of samsung or sony because the phone will get charged quickly.",
            "date": "26 Dec 2014",
            "name": "Rutul Shah",
            "stars": "5 stars"
        },
        {
            "comment": "I just migrated to the Moto G from being with Nokia for a long time. I am yet to use all the features fully, before I can qualify to comment (whether good or bad). But prima-facie, this mobile for the listed features is definitely a good value for Money. I shall have to wait for few more weeks to check out all the feature, to come full circle before I pass my comments. Package reached before time and was packed well. The delivery person was courteous to quickly check the exchanging mobile and delivered this beauty.",
            "date": "26 Dec 2014",
            "name": "Arvind Chandra...",
            "stars": "4 stars"
        },
        {
            "comment": "I liked the Moto g2 camera. I used Nexus 4 before, but Moto g2 camera qualit is very good. Only issue I have seen is with my piece it's not detecting Memory card, which is very crucial.",
            "date": "26 Dec 2014",
            "name": "Pratheep",
            "stars": "4 stars"
        },
        {
            "comment": "I switched from windows phone (lumia 820). Obviously there are many nice things to like here. Android OS, customizability, ROMs and what not. I heard good things about moto series and am not at all disappointed by the device. The construction is of good quality not unlike the Nokia phones. Device is appropriately thin and light but it's not setting records in either category. At 13k, it's probably not meant to. Coming to the performance, I am pleasantly surprised at how far android has come since I left it (2.2 froyo) in search of smoother experience (hence the WP). It's not that the device doesn't stutters. It does. But they are not in general animations and transitions. Maybe if I am running too many apps and want to switch from google play to camera. It's only 1GB after all. Otherwise, the feeling of stock android is pretty great and if used well, this phone keeps things smooth. And this is someone coming from WP which is a damn smooth system even on lowly 530. So I know what actually good performance feels like (820 is not the fastest phone out there but it's no slouch either). Moreover, the upcoming Lollipop update should help sweeten the deal even further. I plan on unlocking the bootloader soon and getting into flashing roms. Just waiting for at least one OTA to make its way onto a pristine system. I dont' use the camera much. I think it'll do well in good lighting conditions but I don't expect too many low light shots to shine through. That's all from a couple of shots I did take just to check out the app. Overall, I am very happy with my purchase and can easily recommend this phone.",
            "date": "26 Dec 2014",
            "name": "Akash Agrawal",
            "stars": "5 stars"
        },
        {
            "comment": "good mobile best in class some of the applications like outlook and other day to day office applications needs improvement generally very good product for the general category pricing is the most beutifull things in this product",
            "date": "26 Dec 2014",
            "name": "Amol Joshi",
            "stars": "5 stars"
        },
        {
            "comment": "Hi m Chetan from Amravati it is a best value smartphone of the year 2014.. i tink ok! overall performance is satisfactory... but Ram and Battery little bit higher wht would happen..! And one thing to be said in right side small corner touch caliber wrong scene, but that is nothing to worry about it. I've been using it for 3 months now am update lollipop 5.0.2 work as my expected, excellent..! and that calibration problem is gone... Thank u flipkart ...",
            "date": "26 Dec 2014",
            "name": "Chetan Mahalle",
            "stars": "5 stars"
        },
        {
            "comment": "At this price, it is an amazing Android phone with all the features that are actually useful (as opposed to features that are dumped into higher-end phones that normal people almost never use). Camera is pretty good as well,",
            "date": "26 Dec 2014",
            "name": "RITESH GHOSAL",
            "stars": "5 stars"
        },
        {
            "comment": "Mobile is in not good not bad state, Many things are appraisable, Camera, processor, External SD card support. Negative things are battery and DPI for screen. but still good to go. One thing that make you confused to buy is almost same kind of configuration you can get much cheaper with xiaomi redmi S. But G2's camera is far more better than its.",
            "date": "26 Dec 2014",
            "name": "Manthan Tripathi",
            "stars": "4 stars"
        },
        {
            "comment": "product is good but having some problem with battery get heated and on large volume voice clearity is not so good",
            "date": "26 Dec 2014",
            "name": "Santosh Gupta",
            "stars": "3 stars"
        },
        {
            "comment": "using phone from last 20 days phone is actually too goood and having very good touch music and camera quality is also awesome overall this mobile is best in less then 15000 budget battery is have some less back up due to 2070 mah but overall is good mobile .... go for it without any tension...",
            "date": "26 Dec 2014",
            "name": "Ashish Singhal",
            "stars": "4 stars"
        },
        {
            "comment": "Writing this review after well using the product for 2 months. *Excellent product. *Value for Money. *Best Budget Smart Phone PROS: VFM, Features, Durability, Android Stock OS, Better performance, Less Heating, Compatibility, Branding, Gaming. Cons: * Battery Backup is not good(Requires 2 to 3 recharges a day if connected to 3G/2G all day plus games for 1 hr and browsing 30mins and location sevices for 1 hour) and battery one percentage drops every 10 to 15 mins, * Motorola should atleast give 3200mAh Battery for all the Moto E,G,X series. * Front cam is not impressive if you take a lot of selfies. And Camera app is Buggy. * Very low quality headsets(Worth just 50rs/- or maximum 100rs/-. Bought skullcandy and its great. so another extra 500 bucks you may have to spend if you are a serious music junkie like me). * Charger is overheating while charging but the phone stays cool(No probs for me). * Price a little Higher(2000 may be) considering the processor and graphics card and chipset same as MOTO E. * Almost doubled the price of MOTO E for just camera and bigger display? What else is the change every other things are just the same. Original Accessories are costly. Delivery: Happy with the delivery and the package.",
            "date": "26 Dec 2014",
            "name": "Lakshmanan M",
            "stars": "5 stars"
        },
        {
            "comment": "at the time of buying i have research a lot on micro max canvas nitro, xiomi red me 1s, and every phone which was in competition of this phone, but i trusted only this phone because Motorola is genuine company , and it serves good product from starting, i have given 5 stars because motorola has fulfilled my requirement , i have motoe also. sound is excellent, not like chinise phone, camera is also very good, bettery life is also very good , in normal use my bettery last for 1.5 day, and also it will come with android 5, so only some of phone has given surety of android 5, motorola is one of them, it is very good phone, go for it, it is my personal experience.",
            "date": "26 Dec 2014",
            "name": "viradiya sagar",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is definitely excellent value for money with a very decent camera. Using since last four months.",
            "date": "26 Dec 2014",
            "name": "Swatantra",
            "stars": "5 stars"
        },
        {
            "comment": "its really worth for the price and good battery back up. Only disadvantage what i found is no enter key in normal text messaging.",
            "date": "26 Dec 2014",
            "name": "AMAL VARMA RAJAN",
            "stars": "4 stars"
        },
        {
            "comment": "Believe me... its just the best at this price range..anybody can go for it blindly.The display and the performance is unbeatable.",
            "date": "26 Dec 2014",
            "name": "DEBASISH DASH",
            "stars": "5 stars"
        },
        {
            "comment": "Got my moto g2 yesterday and verified IMEI number. Found those IMEI numbers exist with Samsung phone where i can say this phone is not genuine. Seller needs to block from flip kart.",
            "date": "26 Dec 2014",
            "name": "pradeep",
            "stars": "1 star"
        },
        {
            "comment": "One of the best budget phone I have ever used. Good display/camera/looks. Flipkart delivered the product on in-a-day-delivery service. Great service. Thanks,",
            "date": "26 Dec 2014",
            "name": "Asif",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone for its price..Totally justified for the money you out in. Plus the guaranteed update to latest version is a plus",
            "date": "26 Dec 2014",
            "name": "Samrat",
            "stars": "5 stars"
        },
        {
            "comment": "At this price, it is an amazing Android phone with all the features that are actually useful (as opposed to features that are dumped into higher-end phones that normal people almost never use). Camera is pretty good as well, much better than the 1st generation Moto G.",
            "date": "26 Dec 2014",
            "name": "Rohan Padhye",
            "stars": "5 stars"
        },
        {
            "comment": "one of the pixels is displayed brightly.. Tried the below apps to fix the pixel, but no use.. the pixel is still displayed brightly..",
            "date": "26 Dec 2014",
            "name": "G Sravan",
            "stars": "3 stars"
        },
        {
            "comment": "Pros - Well built , fits perfectly in the palm with a good built - Very good battery life - clean efficient OS - good camera even though its an 8 mp - excellent touch and display quality Cons - Voice call quality could do better Overall its a top class phone in this price range, you might get better specs better speed better ram by other brands in this 13k range , but this performs better and is very much stable in OS. Caution : Unless you are a app junkie who wants to use several apps simultaneously i would highly recommend this phone",
            "date": "26 Dec 2014",
            "name": "Varun",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent value for money.....nothing comes close to a standard quality at this price. Do not make mistake of comparing it will low quality products....",
            "date": "26 Dec 2014",
            "name": "Amit Sheth",
            "stars": "5 stars"
        },
        {
            "comment": "I have used all the versions of motorola, nice phone @ very good price. Hats off to flipkart for timely delivery...",
            "date": "26 Dec 2014",
            "name": "S. Madhan raj",
            "stars": "5 stars"
        },
        {
            "comment": "Huge mobile, Low battery power, Hangs on middle of FULL MOVIE WATCH. Charging takes more time. The pricing should be less than Rs5000, not advisable for OLD People",
            "date": "26 Dec 2014",
            "name": "Satyasai",
            "stars": "1 star"
        },
        {
            "comment": "Awesome phone, It has more than 1 month and performance is very good. I am pretty satisfied. The person who like android, this phone will be best.",
            "date": "26 Dec 2014",
            "name": "Pankaj Chauhan",
            "stars": "5 stars"
        },
        {
            "comment": "This is really A good handset. A nice & very quick service from seller also. very much easy to use handset.",
            "date": "26 Dec 2014",
            "name": "Rohit Vala",
            "stars": "5 stars"
        },
        {
            "comment": "As like everyone, I also impressed by the feature of the Moto G 2nd gen. I got it right on the 1st week of launch. It was quite good until the day happens. After the 60days of using the mobile, I got an issue, it happened suddenly, it turned off automatically, I charged it for an hour and tried to turn it on. It just kept showing the moto logo and no further response, I did all the basic troubleshooting from my side. I am even ready to do the factory reset. No use, it just kept displaying the logo. I reached out the service center on 14th Dec, they are not ready to do the basic trouble shoot, they just got the mobile and gave me some work out Num. and told the mobile will be ready in 7 days. I called the service center again in 3 days, to know the status. They told like they are waiting for Parts to come from moto. I gone weird, on further questions they told like the 'Mother Board gone busted' and they have requested for the replacement of mother board to moto, and they are waiting for the parts to arrive. 1 - How come a 60days mobile get trouble with Mother Board. 2 - How come the service persons request for replacement of mother board, without my permission. Customer Service, the another Hell which i entered into. Worst ever Customer Care service. - They told there is no replacement after 30 days, even if the mother board is got busted - One of the service person said, his moto g also got busted and questioning myself what can we do. - They agree that Moto g 2nd is facing the mother board issue for many customers. - NO ONE is ready to talk about the replacement. In due after 7 days I called to check whether they at least replaced the parts Another shocking from the service center, they told as it was moto g2nd they may another 4 days to dispatch the parts from moto side. Again I reached Moto Customer Service, A lady picked and told that she has escalated the issue and will be getting call in 24 hrs. - No response in 24 hrs, when I reached the moto again, they told there is no such a escalation at all. - am being fooled by the service persons again and again. - One guy said, i must call at the where Service Center is open and they will have the conference call to give the solution, ( i dont why they cant do in offline without me) Now, they agreed to give me a solution in another 48 hrs, that is too over, i didnt get back any calls yet The SLA of the issue is 7 days, but even after 12 days, they are not ready to give a compormising response - I will still going to reach out them. - Mother Board getting busted in 60days is not at all a good mobile - Motorola is not ready to replace the device as it was more than 30 days, another irritating service - No one ready to give you any proper response or ready to take responsible for our escalation. WORST EVER CUSTOMER SERVICE!!! NEVER GO TO MOTOROLA.",
            "date": "26 Dec 2014",
            "name": "Rajesh J",
            "stars": "1 star"
        },
        {
            "comment": "exxxxxellent for the price range. qaulity is the best.............................................................................................................................................................................",
            "date": "26 Dec 2014",
            "name": "chandu",
            "stars": "4 stars"
        },
        {
            "comment": "awesome phone, value for money, display is very sharp and bright and phone design and build quality is also better. I like external memory card support and big screen",
            "date": "26 Dec 2014",
            "name": "Neelesh Shukla",
            "stars": "5 stars"
        },
        {
            "comment": "Best handset in this price. Awesome MOTO. Google 4.4.4 upgradable to 5.1 awesome. Great delivery thnx",
            "date": "26 Dec 2014",
            "name": "Saksham Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "I just love this phone.awesome look with awesome sound quality.very good phone for gamers.UI is too good.what you guys can expect with in this 13k budget.",
            "date": "26 Dec 2014",
            "name": "Bismaya Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "The battery is not that great. Just internet usage. (no gaming or nor heavy calling) Network is not detected all of a sudden. (have to restart for that) Been a week of use and its already starting to lag. Video calls hangs or are not clear. did not have that problem with the S3 earlier. Camera is good though.",
            "date": "26 Dec 2014",
            "name": "Chirag Puri",
            "stars": "2 stars"
        },
        {
            "comment": "WORLD'S best Really Smartphone....in its Range!!! Gives a Damn to Others....... Big screen.... ...Even though the shocking thing is Long Battery Life....!!!!",
            "date": "25 Dec 2014",
            "name": "MANISH KHEDIA",
            "stars": "5 stars"
        },
        {
            "comment": "Osm phone cool sound features best. Motorola Is Back With Bang.Fully Loaded with power and battery all features are Good .",
            "date": "25 Dec 2014",
            "name": "Abhishek Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "its really a nice experience using this phone for last 3 months.i am using this as my primary phone and listening music, playing game, using wifi and getting full day battery backup.",
            "date": "25 Dec 2014",
            "name": "Rina Shaw",
            "stars": "5 stars"
        },
        {
            "comment": "The quality of the phone is great. It's hard to find a phone of this quality at this price range. Motorola lived upto my expectation. There is no issues of heating or lag in this phone, after a week of continuous usage. The best part is we get an option of expandable memory along with 16GB of internal storage. The parts used in manufacturing of this phone are of top standards.",
            "date": "25 Dec 2014",
            "name": "Sourav Hazra",
            "stars": "5 stars"
        },
        {
            "comment": "all is go0d. but but if there is no speaker slots....it might look good like 1st gen..except front design all is g00d",
            "date": "25 Dec 2014",
            "name": "Prä Shänth",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent product with latest features in a reasonable price.Rated 3 as am not satisfied with the looks and ear phones ( hard built and can damage ur ears) Has less boot time compared to other smart phones like Samsung. Cornila gorilla glass and HD recording with 8MP camera are a big among other features.",
            "date": "25 Dec 2014",
            "name": "Srikanth Reddy...",
            "stars": "3 stars"
        },
        {
            "comment": "I'd purchased Moto G (2nd gen) from flipkart on 3rd October 2014. Fairly quick delivery. Impressedwith the product. But then on 20th december 2014 (that is less thn 3 months from date of purchase), my device would just not turn on. Online chat support was fairly impressive but not really helpful. There are VERY FEW privately owned authorised service centres for motorola. Here's my story: When i finally reached the service centre (in thane, Mumbai), I was informed that I had to wait for at least 90 minutes before my problem would be heard. THE AUTHORISED SERVICE CENTRE ALSO ACCEPTS XAIOMI, BLACKBERRY, HTC and one more brand i cannot recollect. And for all of these, it has just 1 counter. I came to know of a BB customer who waited for over 3 hours for his turn. Finally when it was my turn, this was what was told to me: ANY SOFTWARE PROBLEM WILL TAKE MINIMUM 3 DAYS, AND ANY HARDWARE PROBLEM WILL TAKE ATLEAST 10-15 DAYS. This was a standardized statement for all customers. Bottom-line- You CANNOT expect quick, easily or accessible after sales service. Even though I have been a motorola fan, I'm beginning to question its reliability after listening to so many experiences and experiencing trouble myself.",
            "date": "25 Dec 2014",
            "name": "Chaitanya Avatapalli",
            "stars": "3 stars"
        },
        {
            "comment": "Excellent phone !!! Superb delivery................................................................................. !!!",
            "date": "25 Dec 2014",
            "name": "Satish",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this phone 2 months back...performance and battery backup is so nice.... waiting for Android upgrade :)",
            "date": "25 Dec 2014",
            "name": "sai krishna",
            "stars": "5 stars"
        },
        {
            "comment": "excellent product. fast delivery. however takes more time to charge.Reasonably priced. I am using this mobile for over a month and am satisfied with its performance.",
            "date": "25 Dec 2014",
            "name": "Ramesh Damani",
            "stars": "4 stars"
        },
        {
            "comment": "It is Apple of India next to Nexus :P The Phone speed is awesome, thanks to motorola to add new things in moto g and make it moto g2 . Just waiting for android lolipop update now.",
            "date": "25 Dec 2014",
            "name": "Pushpender Singh...",
            "stars": "5 stars"
        },
        {
            "comment": "just one word for it......awesome only one issue is that battery drain fast not very fast..moderate i can say thnks moto",
            "date": "25 Dec 2014",
            "name": "nitin vahane",
            "stars": "5 stars"
        },
        {
            "comment": "Gr8 phone overall. Good screen , camera, looks, nice to hold, nice OS ( almost stock android) , decent processor. Only negative: 1 GB RAM is less if you use a lot of apps.",
            "date": "25 Dec 2014",
            "name": "mohit tilva",
            "stars": "4 stars"
        },
        {
            "comment": "Excellent phone and value for money. I have used both moto g 1st generation and 2nd generation phone. Its comfortable to hold as compared to other 5 inches phones. Touch is very smooth and fast. Sound quality if this phone is awesome. I a using this phone from 2 month and I have played games on it without any lag. Happy to buy it.",
            "date": "25 Dec 2014",
            "name": "Balvinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "phone is good.. no damages.............................................................................................",
            "date": "25 Dec 2014",
            "name": "Hari",
            "stars": "5 stars"
        },
        {
            "comment": "The phone has many good features . I am using this phone from last 1 month and have never experenced any lag . The phone works very smoothly and has excellent picture quality . It is light weight and handy too. The thing that I don't liked was the screen was not showing battery percentage on top . Though it is not a big issue . I advice everyone to buy this phone.",
            "date": "25 Dec 2014",
            "name": "Devanand Patil",
            "stars": "5 stars"
        },
        {
            "comment": "hey guys after a long search on internet i finilize this device.this is a fantastic phone between 10k to 15k.",
            "date": "25 Dec 2014",
            "name": "babbu",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent Mobile in 13K, Budget Phone Pro's Good Display Quality Excellent Camera Quality Good Stereo Speakers No hanging issue No Heating problem Good Battery Backup",
            "date": "25 Dec 2014",
            "name": "Anil Kumar",
            "stars": "5 stars"
        },
        {
            "comment": "The phone has good build, great display and battery backup. The 8 megapixel camera does its job well. Phone works well and can handle regular games well. Cons: It is costly, at a price bellow 10,000 you could get phones with simlar or better hardware configuration. Pros: I will get Android Lollipop :)",
            "date": "25 Dec 2014",
            "name": "Bharat sharma",
            "stars": "4 stars"
        },
        {
            "comment": "Hello I was Interested to exchange it With panasonic T11 .. kindly Let me Know if it is Available .",
            "date": "25 Dec 2014",
            "name": "Siddiq",
            "stars": "5 stars"
        },
        {
            "comment": "I purchased it for my wife. Its really a good phone. Good camera and all other features are as good as an android phone can be. Fast and no delay in working.",
            "date": "25 Dec 2014",
            "name": "Tarang",
            "stars": "4 stars"
        },
        {
            "comment": "Phone is getting heated automatically with out any usage and even after doing the complete charging (100%) it is giving the backup only for 9 hrs that to with the minimum usage.",
            "date": "25 Dec 2014",
            "name": "dalveer singh",
            "stars": "1 star"
        },
        {
            "comment": "flip kart delivery is good, mobile working fine , after one month i'm facing memory card slot problem.. automatically memory card removed icon came ... after memory card formatting placed again working , fine. i don't whether problem in memory card, mobile phone issue.. anyone face the problem like that??? pls help to solve the issue..",
            "date": "25 Dec 2014",
            "name": "rajkumar selvam",
            "stars": "3 stars"
        },
        {
            "comment": "After using samsung for two yrs, it was time for different brand and after lot of pondering i stuck to moto g2, using it for the last twenty days i can say that its simply superb, performance is ultimate,no lag at all, dont worry about ram, in my case i was bit worried but after using it, i felt that its very much compatible with hardware.Coming to the battery life, its not that bad, average users can easily go for a day, while moderate to bit high end user need to charge.Still under 20 k segment, it is the best phone to buy, just go for it.",
            "date": "25 Dec 2014",
            "name": "Vikas Anand",
            "stars": "5 stars"
        },
        {
            "comment": "Overall v good phone only issue is some times the signal goes zero. abruptly for small time. Which i never faced with same SIM with old model phone.",
            "date": "25 Dec 2014",
            "name": "vishnu",
            "stars": "4 stars"
        },
        {
            "comment": "Best smartphone in 13K range..i had ordered last month and its working very good..there is not any problem..worth buying guys...much better than samsung...it does not hang...but ya sometimes it get heated.",
            "date": "25 Dec 2014",
            "name": "rahul gujra",
            "stars": "4 stars"
        },
        {
            "comment": "Its been 3 weeks with this phone and I love this like anything. This is the best phone I have ever seen in this budget. Its amazing!!! 8MP camera captures with superb!! clarity.. Front camera is also awsome!! I feel this is the best phone for middle class people with limited budget and for normal web applications.Go for it guys you will love it..",
            "date": "24 Dec 2014",
            "name": "Prasad",
            "stars": "5 stars"
        },
        {
            "comment": "I am really thankful to flipkart for this phone, all features with good price and services of flipkart",
            "date": "24 Dec 2014",
            "name": "Vikas Tiwari",
            "stars": "5 stars"
        },
        {
            "comment": "awasome phone with uniqe style and features.. its look like nexus's brother.. hatsup to u motorola ..samsung is nothing its just a crap..sony is good lg is 50:50..asus zenfone looks not good. one thing i dont like is its ringtones are nt good as like samsung..honestly samsung has good kind of ringtone collections even sony dont have wat ever im truely satisfied",
            "date": "24 Dec 2014",
            "name": "Rajat kumar Pa...",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product love this phone................................................................................",
            "date": "24 Dec 2014",
            "name": "Siddhesh Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "This phone has alot of awesome features as per price but most important feature is Gorilla Glass 3 which brings additional perfection to phone.",
            "date": "24 Dec 2014",
            "name": "Shashant Vijay",
            "stars": "5 stars"
        },
        {
            "comment": "People who go by specs alone would prefer RedNote, micromax or Zenphone. But this phone has got a killer design, great UI, no bloatware and decent specs. I am not an avid gamer, so i don't need a 2 gb RAM and this phone is looks classy. It would've been 5 stars if the battery were better.",
            "date": "24 Dec 2014",
            "name": "Ananth SG",
            "stars": "4 stars"
        },
        {
            "comment": "PRO\"S: 1.almost evrything offered for that budget CONS : 1. Headphones supplied are of low quality. 2. Charger does not come with detachable USB cable LAST BUT NOT LEAST delivery is super.. super fast flipkart u guys r rocking!!!!!!!!!!!!!",
            "date": "24 Dec 2014",
            "name": "srinivas chitt...",
            "stars": "5 stars"
        },
        {
            "comment": "Worth going for it. Good smooth interface as it contains quad core processor. Battery slight con from this, still good to get it !!!",
            "date": "24 Dec 2014",
            "name": "srinivas kumar",
            "stars": "5 stars"
        },
        {
            "comment": "Its almost 3 months using this mobile, till now no issue, best phone under 12k with good performance, features and reasonable battery back up. Mobile fell down from my hand couple of time but no damage very rough.",
            "date": "24 Dec 2014",
            "name": "mahendra raju",
            "stars": "5 stars"
        },
        {
            "comment": "I already own a Moto G 1st edition and i decided to change the phone since i had to give that to my wife recently.I couldn't decide on any phone other than Moto G2 on this price range. It has been just 2 days since the purchase. I may give a detailed review later. First Impressions: 1. Feels premium 2. Bigger display looks better even with the relatively lower dpi 3. Powerful dual speakers 4. Decent photos from the 8MP camera 5. Good battery life Overall I am not disappointed by this second purchase from Motorola. It is the most reliable phone comparing to the other phones you may be comparing right now likes of zen phone and Redmi. Finally, Flipkart service was awesome as usual; delivered the product well before the promised delivery date.",
            "date": "24 Dec 2014",
            "name": "Sivasubburaj P...",
            "stars": "5 stars"
        },
        {
            "comment": "The phone was well packed and the delivery was very quick. This is my review after working with phone for one week. I AM VERY DISAAPOINTED WITH THE HEADPHONES, VERY POOR QUALITY AND THE HEADPHONES I RECEIVED IS SHACKING INSIDE THE MIC PART. BUT the Phone is working excellent and everything is functioning smoothly in phone. i have been using SAMSUNG series phones for a long time. The only difficulty i felt after working with SAMSUNG phones is 1. There can be an option for put the phone in silent, vibration in notification bar (quickly as in samsung phones) 2. Turning on GPS and mobile data can be made available in the notification bar easily as in samsung with one click rather than again going to settings. BUT overall the phone is the best budget phone.",
            "date": "24 Dec 2014",
            "name": "SARAVANAN",
            "stars": "4 stars"
        },
        {
            "comment": "good phone, well built and well priced. dont know how many updates it will get in the future. but the gen 2 is worth getting if one does not want to spend at lot of money for a good phone. dont listen to people who diss motorola. they dont use it just go and spread rumours of what other people think",
            "date": "24 Dec 2014",
            "name": "Jesal Arya",
            "stars": "5 stars"
        },
        {
            "comment": "motorola has left considerable impact by launching this phone...i mean for Rs.13k the specifications are totally paisa wasool at this price range..motorola is really looking forward to capture the indian market..",
            "date": "24 Dec 2014",
            "name": "toshniwaljyoti",
            "stars": "4 stars"
        },
        {
            "comment": "Very nice phone to use and looks also very good. Performance also very fine. No lagging in using all 3D games. Battery backup also fine.",
            "date": "24 Dec 2014",
            "name": "Muthu kumar",
            "stars": "4 stars"
        },
        {
            "comment": "faulty mobile moto g (2nd gen) i was suffering because baying this product. ekdum bakwaas mobile hai display problems, can't conect with wifi, internet problems, gmail problems playstore problems youtube was not working, mobile signal was not catching. and many more problems i have faced please help mee please help mee.. flipkart was not understand customers imotions and trust.. please-FLIPKART.COM be loyale and trustfull WITH CUSTOMERS.",
            "date": "24 Dec 2014",
            "name": "rakesh kamble",
            "stars": "1 star"
        },
        {
            "comment": "Data speeds awesome, overall performance is good, with the price what we afford, most important is that the same can be upgradable to android 5 verson (lollypop).",
            "date": "24 Dec 2014",
            "name": "Krishna Murthy A",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: The phone is worth buying for the price. Features No heating problems Good camera Good speakers Cons: A bit slow Bit low quality mic",
            "date": "24 Dec 2014",
            "name": "Krishna Chaitanya",
            "stars": "4 stars"
        },
        {
            "comment": "Got the product delivered in time. Nice looks, nice feel to hold. Everythings fine about the phone. Only thing is that they should have also delivered the screen guard and a data cable. Else everything is fine. Thanks flipkart and M",
            "date": "24 Dec 2014",
            "name": "Jeherul",
            "stars": "4 stars"
        },
        {
            "comment": "Well, I was mesmerized at my first look of Moto G 2. But gradually ended up very dissatisfied by the quality of the 2 MP Front Camera. It is not comparable to Nexus 5, another phone with a 2 MP camera. My take on MOTO G 2 : Screen Touch : Awesome. Primary Camera: Great quality. Secondary Camera: Below par. Other Features: STOCK ANDROID: Nice. Google Voice Search. Upgradable to Android Lollipop.",
            "date": "24 Dec 2014",
            "name": "Aditya Agarwal",
            "stars": "4 stars"
        },
        {
            "comment": "can anybody tell when lolipop upgrade will come of moto g 2 nd gen i m wating from so many days when update will come can i body tell the exact date",
            "date": "24 Dec 2014",
            "name": "VINOD BHATIA",
            "stars": "5 stars"
        },
        {
            "comment": "okay guys i have got my moto g2 on 19th dec 2014 and tilol date no issues. And here are my observations 1)built quality is good, screen looks good, camera is good(front camera is average). 2)speed is nice, web browsing is excellent, plays all games well. 3)Battery is average , need to charge everyday even with normal usage. 4)Charging takes a lot of time(3-4 hrs for complete charge.) 5)Supports usb charging, not tested otg 6)received no lollypop updates yet. 7)phone is worth price mentioned",
            "date": "24 Dec 2014",
            "name": "SAM",
            "stars": "4 stars"
        },
        {
            "comment": "A wonderful phone at a moderate price. Works superb with Kitkat and above. Looks awesome just like Nexus :) Best phone in this price range.",
            "date": "24 Dec 2014",
            "name": "Narayanan P S",
            "stars": "5 stars"
        },
        {
            "comment": "First of all for Ws Retail did a great job and dispatched the product next day of order but the delivery company Delhivery Prepaid was quite slow and took 5 days to deliver pack to Dehradun which generally takes 2 days. About the product this is an awesome phone with good screen performance battery backup with full time on WiFi and playing games in between. Camera quality and sound quality are also very good. It has been more than a week I am using this phone and it has not hanged up even once. I have been using Samsung Galaxy S-Advanced before this and was really tired of its hanging and battery problem. But I am totally satisfied with it. Best Buy at this cost.",
            "date": "24 Dec 2014",
            "name": "Anoop Singhal",
            "stars": "5 stars"
        },
        {
            "comment": "I am using this phone since 2 months and suddenly I found difficulty in charging. When I call to service center they told me that you have to change PCB and it is not included in the warranty and it cost about half of the mobile phone. I am using Android phone since 2 years but first time with this phone I found this issue.. Motorola providing hardware with lower quality in higher price range. And customer support is even worse. They just want to sell phone that's it not support then after.",
            "date": "24 Dec 2014",
            "name": "Yogesh Patel",
            "stars": "1 star"
        },
        {
            "comment": "No doubt this is the best product under 20K price range. Amazing screen display and camera. It's very smooth to operate and gives a very good experience.",
            "date": "24 Dec 2014",
            "name": "Vikas",
            "stars": "5 stars"
        },
        {
            "comment": "I received this mobile on 1st Aug 2014, The mobile was fine until 30~40 days, after that it all started, 1. Mobile screen had got vertical lines (got in replaced from service center - it took 15 days) 2. Speaker was very loud even without loud speaker ON ( (got in resolved from service center - it took 12 days) 3. All my callers are hearing an eco of their voice when speaking (definitely not a network issue as I am not facing any problem with same sim in other hand set). All Factory resetting done, nothing works every 10 days a new problem.",
            "date": "24 Dec 2014",
            "name": "Bhuvanesh S",
            "stars": "1 star"
        },
        {
            "comment": "The main problem with this device is its battery backup.. Otherwise everything is fine and satisfactory. Also 1GB of RAM is not enough sometimes.",
            "date": "24 Dec 2014",
            "name": "Sarath KN",
            "stars": "4 stars"
        },
        {
            "comment": "Better than the best at this price.. Very Good mobile... Love this mobile.....But very bad thing about flipkart...why they stop delivering in Ghaziabad...",
            "date": "24 Dec 2014",
            "name": "Deepak Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "Great Job by your team ,product delivered before the despatched date.Excellent condition ,Packing was also good.Its a good product to buy online as i was against purchasing any electronics items through ecommerce .....But great piece of product ,competitive pricing ,lesser than the retail ....All the best flipkart team .Happy Selling",
            "date": "24 Dec 2014",
            "name": "Sanjay Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Good specs and solid performance on a very competitive price. No issue found. Good battery performance, get one full day from a single recharge with 3G ON round the clock and optimum usage.",
            "date": "24 Dec 2014",
            "name": "Sudhir Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "It is a good purchase and it has good battery life which lasts upto one day with gaming etc., a wonderful 8 mp camera with flash...supports games..works fast. Flipkart delivered it in 5 days to a remote location like ours, thanks for the great service.",
            "date": "24 Dec 2014",
            "name": "Rgupta",
            "stars": "5 stars"
        },
        {
            "comment": "I was thinking to go for higher end phones like moto x2 or nexus 6. but for some reasons, I bought moto g2. and I never expected that i can get satisfied with this phone... I'm totally Satisfied with this moto g2...",
            "date": "24 Dec 2014",
            "name": "Vamsi Garla",
            "stars": "5 stars"
        },
        {
            "comment": "Got this device the Next day itself - THANKS TO FLIPKART FIRST SERVICE! The new Moto G isn't just an amazing bargain. It's a phone that gives a surprising number of mid-range handsets a real run for their money, and in most cases actually beats them hands down in terms of overall value. I didn't think it was possible to create a better phone than the original Moto G, but the latest version of Motorola's unstoppable handset rightly claims its crown as the new king of budget smartphones.",
            "date": "24 Dec 2014",
            "name": "PRATIK GHOGRE",
            "stars": "4 stars"
        },
        {
            "comment": "Received a scratched piece first .. looked like it was used .. Post complaining, the piece got replaced ..",
            "date": "24 Dec 2014",
            "name": "aditya",
            "stars": "3 stars"
        },
        {
            "comment": "I have been using this phone for past couple of months and am happy to have it. FlipKart had a long delivery time (probably due to Diwali rush), but I got it on the promised delivery date. Its a good robust phone - unlike a samsung or carbon which I owned earlier. Bigger screen size compared to prev generation helps. Battery is okay. It doesn't produce great photos - but they are good enough to share on whatsapp. I usually rely on my sony camera for any serious photography. In summary, definitely recommend Moto G for anyone looking for sub 25K phone.",
            "date": "24 Dec 2014",
            "name": "M",
            "stars": "4 stars"
        },
        {
            "comment": "Advantages: 1.Good camera quality 2.Battery is good 3.Nice look Disadvantages: 1.No USB cable 2.Getting heat sometimes while playing",
            "date": "24 Dec 2014",
            "name": "Meena Natarajan",
            "stars": "5 stars"
        },
        {
            "comment": "Overall good There is a little bit of Lag on camera app. In case of dual sim its taking more than 30sec to latch with the network",
            "date": "24 Dec 2014",
            "name": "SUPRIYA MONDAL",
            "stars": "5 stars"
        },
        {
            "comment": "Ordered a Moto G and found out that call clarity was terrible. The technical assistance team's suggestions did not work, so I returned the handset. The second one I got had the same problem, and also its battery was draining at a super fast speed. Returned the second one as well and do not intend to buy motorola product again.",
            "date": "24 Dec 2014",
            "name": "Pallavi Palkar",
            "stars": "1 star"
        },
        {
            "comment": "The new Moto G isn't just an amazing bargain. It's a phone that gives a surprising number of mid-range handsets a real run for their money, and in most cases actually beats them hands down in terms of overall value. I didn't think it was possible to create a better phone than the original Moto G, but the latest version of Motorola's unstoppable handset rightly claims its crown as the new king of budget smartphones.",
            "date": "24 Dec 2014",
            "name": "Raj Kumar Baid",
            "stars": "5 stars"
        },
        {
            "comment": "i ordered on 22/12/2014 at 11:15pm and my moto g is in my hands @10:45am on 23/12/2014........................................................................................................................................................",
            "date": "24 Dec 2014",
            "name": "karim",
            "stars": "5 stars"
        },
        {
            "comment": "willn't talk about specs but below are some points to consider before u buy it 1 - good mobile if you are an office guy..good UI exp. as stock android is there. 2 - not worth for hardcore gamers why.?? coz high games like asphalt, have to be played at low resol otherwise even with medium graphics it crashes out, same with other games. 3 - battery is an issue if you play asphalt contentiously it will last to 3-3.5 hrs..i have used other mobiles at 10k segments & they last for 5 hrs below is the battery life while using cont, having battery saving on & with battery doctor : high game like asphalt - 3-3.5 hr, temple run -5 hrs,camera - 4 hr, music - around 4.5 hr, wifi - 4-4.5 hrs, currently i play temple run for 1 hr in a day, 1 hr on call with 2g check whatsapp, gmail & fb check after half an hour each just for 5 min & having dual sim inserted & i get battery backup of around 5 - 5.5 hr 4 - sound (music) is loud but not enough clear still acceptable 5 - good grip, easy to use & good look 6 - some heating prob while using camera & gaming 7 - camera is 8 mp but is awesome. it looks better than 13 mp in it's segment, proper & clear image but only in day light. at night it is like 5 mp in it's segment. front camera is good 8 - take much time to get charged, more than 3 hr from 0 to 100% final words it is a better option if you are not an hard core gamer even after that you have to charge it twice a day.best for an office guy. I say it 'gareebon ka iphone'.... :) joking.. Hope it will help....",
            "date": "24 Dec 2014",
            "name": "rahul",
            "stars": "3 stars"
        },
        {
            "comment": "Everything is fine with phone except touch screen. Sometimes touch is not working properly. Response time is very slow.",
            "date": "24 Dec 2014",
            "name": "Ranjith A",
            "stars": "3 stars"
        },
        {
            "comment": "oh man what a superb mobile this is i have use samsung galaxy s4 active but this is even faster than s4 active and it is also very cheap",
            "date": "24 Dec 2014",
            "name": "kevin ruban",
            "stars": "5 stars"
        },
        {
            "comment": "You can't get the phone at any price in the market .Very good flat screen,loud speakers,gr8 colour,and a very good battery backup.I bought it in offer @ 11599/-.i WAS ALMOST DONE TO BUY ASUS 5 BUT WHEN I SAW MY FREINDS ASUS PHONE THEN I was done that i was wrong.Moto g2 was the best phone i can get ever @ this price .i love it...................................................",
            "date": "24 Dec 2014",
            "name": "Prashant sah",
            "stars": "5 stars"
        },
        {
            "comment": "MUST BUY BUDGETED PHONE!!! This one just satisfied all my needs Pros: Bigger screen Latest Android OS Stereo speakers OTG Supports Dual sim Cons: Earphones sucks, but use better earphones or headphones.. In short--------------- MOTO G2 rockzzz!!! Atlast wanna thanks to Flipkart with promised same day delivery!!",
            "date": "24 Dec 2014",
            "name": "Anurag Dey",
            "stars": "5 stars"
        },
        {
            "comment": "Go for this if you want a mobile with dual sim. Issues related to dual sim compatibility. By this time it should strike you why expensive mobiles offer single sim.",
            "date": "23 Dec 2014",
            "name": "kaushik surikuchi",
            "stars": "3 stars"
        },
        {
            "comment": "The cell phone is great but they messed up with the Memory management of the android. Its throwing force close and crashes for games that i can easily play on a Moto E device. I hope they'll fix it in the lollipop update",
            "date": "23 Dec 2014",
            "name": "KASHIF AHMAD",
            "stars": "1 star"
        },
        {
            "comment": "I will directly write the pro's n cons of this device so that its easily helpful for all. I am writing this review after using it for more than 2.5 months (83 days to be exact). Pros: 1.Camera: a)Front Camera-This is the best thing about this phone.The 8 m.p camera works better than 12 m.p camera of other Indian brands like Micromax etc. The HDR mode is best for snaps. Personal Suggestion- Download and Use Google camera app instead of inbuilt camera app. As Google camera app supports various modes for camera like Photo sphere, Paranoma, Lens blur and better HDR mode. Front camera- 2 m.p.It is also good for taking selfies. Believe me images come pretty good more than expected. 2.Display- A 5 inch display. it depends on person to person . I like 5 inch display rather than 4.5 inch diplay on old Moto g. The diplay is bright and good. And come on friends who notices ppi with naked eye. 3. Dual Stereo Speakers- Good for watching movies and playing games and are loud enough. And as both speakers are on front side so u don't need to worry about placing phone upside down n all on table or bed so that speakers don't get blocked. 4. Software- Pure Android experience and getting updates time to time #Lollipop coming soon. After Nexus devices Motorola is the 2nd company to get updates. Note- Don't think that after Lenevo- Motorola Deal there will be any effect on updates. Google has sold only hardware unit and not all the patents n all. And even Nexus 6 hardware is by Motorola. 5. Price- At least if i compare it with brands like Samsung's, LG, Nokia,etc it is best value foe money phone. Cons: 1. Less Ram 1 GB- Lags some time and apps crash sometime.(1.5 GB or 2 GB ram would be sufficient ). 2. Design- Dust may enter through gap between the Dual Stereo Speakers and most people don't like than design and want their phone to be fully flat and covered on front. 3.Feels bulky and bigger in hands when compared to other slim 5 inch phones. Now regarding Battery backup I can't place it neither as a pro nor as a con. It is neither best nor bad. It is better than other phones in range and average user may sometimes get more than a day. Note- File manager and audio recorder etc are not available. But it is not an issue you can download from play store for free . Last But not least- Flipkart Service at its best as always. Thanks. Merry Christmas",
            "date": "23 Dec 2014",
            "name": "AKSHAY",
            "stars": "5 stars"
        },
        {
            "comment": "Very good Product.. Pls Buy. Excellent in all ways, review posted by others i give a thumbs up, cos any product i buy i view all the reviews and go for it. Wonder full MOTO is back old cham is back",
            "date": "23 Dec 2014",
            "name": "Ganesh Sheelvant",
            "stars": "5 stars"
        },
        {
            "comment": "Camera : 8 MP main cam & 2 MP front. Very good snaps so far both indoors and outdoors. 2MP - great selfie.Cam clarity is Excellent Sound : The front dual speakers are awesome. Very nice sound.Sound experience is superb. Phone gets headed.Heats very rarely in normal use Pure Android (4.4.4) (ALSO GUARANTEED UPGRADE TO ANDROID LOLLIPOP 5.0) No File Manager installed (You need to download ES File Explorer from Play Store) Go to Settings>>About Phone and tap 5 times on Build number to enable developer mode. 2) PROCESSOR: Moto G Runs on 1.2 GHZ SnapDragon ARM based Processor, On the other hand ASUS runs on 1.6 GHZ Intel x86 based processor. The point here is most of the (99%)android apps are designed to run on an ARM based cpu. Expandable memory - Additional advantage Moto G(1st gen) with the screen size of 4.5 inch had 2070 mah, which was the one of the drawbacks of the phone. Atleast now they should have used 2500 mah battery for the 5inch new moto G(2nd gen) , but they have used the same 2070 mah battery. Performance is also very good Well Design and accurate Delivery by flip kart Headphone sound was average.HD Recording is good and camera is effective on dark room (no light) at 3.5 meter only and picture is good on Mobile flash light.Headphone wired is not too good.File Manager not found on 4.4.4 kitkat Battery(2070mh) performance is good if it is mixed use. 22hrs guaranty.brilliant 5 inch IPS display which produce very high quality images and vides with 720P. 1.2 GHz Qualcomm Processor which allows you for multitasking.",
            "date": "23 Dec 2014",
            "name": "Ragave Ndhra",
            "stars": "5 stars"
        },
        {
            "comment": "i have searched for many mobiles which are so reliable in all terms their is only one mobile MOTO G 2gen very good product this time it has better battery life than the 1st gen",
            "date": "23 Dec 2014",
            "name": "ram bobba",
            "stars": "4 stars"
        },
        {
            "comment": "motog2nd is the best smartphone that you get in the price range of 10000-15000. You will understand it when you compare it with phones like Samsung galaxy grand, sony xperia C,L,M(same price range). Its exceptional speed,butter smooth touch ,8mpfront&2mp rear camera (pacca clear clarity) ..make this phone unique. Its front camera of good clarity for taking selfies. Best phone...go for it (y)",
            "date": "23 Dec 2014",
            "name": "henry",
            "stars": "5 stars"
        },
        {
            "comment": "There are some stupid bugs in the phone which is not expected of motorola.For ex: while calling if u want to open keypad it doesn't open in one go u have to press it thrice and then it appears. Battery is another pain.It takes 4 hrs to get fully charged and drains in 12hrs of medium usage.Apart from the above negatives everything is almost OK but not great.",
            "date": "23 Dec 2014",
            "name": "inteq",
            "stars": "2 stars"
        },
        {
            "comment": "nyc phone, awesome features, handy, easy to use and its fun to play with. The only problem is its battery takes almost 4 hours to get charged by its original charger, on the other hand on using galaxy y chargers it takes 2:30 to 3 hours to charge. I think Motorola should work on there batteries or chargers (do the RCA) and fix it soon.",
            "date": "23 Dec 2014",
            "name": "Parvez Alam",
            "stars": "5 stars"
        },
        {
            "comment": "Great Buy. I am still loving its feel and features. Apps good enough..Worth item at a reasonable price!!!",
            "date": "23 Dec 2014",
            "name": "Vishwas George",
            "stars": "5 stars"
        },
        {
            "comment": "Hi, I had purchased Moto G, 2nd Gen from Flipkart on 06th of September, 2014. Flipkart was quick as usual in delivering the product at my door step. The device worked well for 3 months until 14.12 when it started refusing to boot-up. Took the phone to the Motorola authorized support expert where the device was detected with motherboard problem. On 16.12, I had filed a formal complaint with Motorola (via email) for which I received an email back from Motorola saying \"Your question has been received. You should expect a response from us within 24 hours.\". Today, it is 23.12. Haven't heard from them yet, despite several reminders in between. When I bought this phone, a lot of my friends suggested not to go with Motorola. I am realizing that they were right. Do they have any service/support at-all? Or only sales? Do they realize that somebody is suffering because of their disgusting product and service. At the moment, it is not going anywhere. Anybody faced similar problem? Any way out?",
            "date": "23 Dec 2014",
            "name": "Krishanu Biswas",
            "stars": "1 star"
        },
        {
            "comment": "This is a unique replacement for all the expensive phone in the market.... Worth Money, No Lag, super Awesome display....",
            "date": "23 Dec 2014",
            "name": "Nikhil Sawant",
            "stars": "5 stars"
        },
        {
            "comment": "I recommend everyone to buy this phone. It is superb to use . PROs 1 Good software updates 2 Great display in its class 3 Good value for money Cons Nothing",
            "date": "23 Dec 2014",
            "name": "flipkart rocks",
            "stars": "5 stars"
        },
        {
            "comment": "Good camera and display Good internal memory and nice features battery back up is above average. Overall excellent phone at this price.",
            "date": "23 Dec 2014",
            "name": "Shaji kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Got the delivery before the due date good service flipkart Now about the phone screen is great voice is clear But the battery backup is not up to the mark Look wise good phone but bit boxy type Overall its good having this set.. M disappointed with the accessories I got in the box Headphone is really bad Charger is so slow that it charges 10 to 100 in 4 hours Other side I ordered the black phone and got the white charger and the headphones..",
            "date": "23 Dec 2014",
            "name": "amitesh swarnkar",
            "stars": "3 stars"
        },
        {
            "comment": "I am glad i took this phone!! one of the best budget friendly smart phone!! excellent features with classy look :)",
            "date": "23 Dec 2014",
            "name": "Swamy Gonisetti",
            "stars": "5 stars"
        },
        {
            "comment": "Superb Best Phone ever ....only battery is little worry but its manageable not like samsung..camera is awesome ..stylish phone ...",
            "date": "23 Dec 2014",
            "name": "lazar frank",
            "stars": "5 stars"
        },
        {
            "comment": "i am using this phone since six months Pros: Display, Sound, performance super, Does not hang. Cons : Some times I have noticed the Battery Drains out very fast.",
            "date": "23 Dec 2014",
            "name": "Ravindranath C",
            "stars": "5 stars"
        },
        {
            "comment": "This is a great phone in the price offered. The curved body doesn't let you get tired while playing games. The touch is good and smooth. It gives amazing 16 GB storage in less price. Hangs a bit while playing games sometimes but it has never froze till now.",
            "date": "23 Dec 2014",
            "name": "Sabah Shams",
            "stars": "5 stars"
        },
        {
            "comment": "its simply awsome in my terms.... built quality is awsome.... i droped it from 4 ft of height facing screen.... bt didnt get a single scratch on it... speed is superb.... high end games like asphalt 8 etc can be easily access.... i used from 3 month n till now , i didnt got any issue..... so go for it guys.....",
            "date": "23 Dec 2014",
            "name": "G@ur@v Bh@r@dw@j",
            "stars": "5 stars"
        },
        {
            "comment": "I never used to buy a low range mobile phone until Motorola came into market with Moto G. I bought the 1st gen Moto G too. And now buying this after one year is just amazing. The specs increased are so much great. The 8MP camera is flawless. The 2 front speakers are amazing and very useful. The 5inch screen is also really great. With Lollipop coming to it. It seems the best phone at this range.",
            "date": "22 Dec 2014",
            "name": "Avneet Singh",
            "stars": "5 stars"
        },
        {
            "comment": "It has everything you need in a descent range.....also there is the option of dual sim and memmory card......qualcom snadragon 1.2ghz processor 1gb ram 16gb internal what else do you need guys??",
            "date": "22 Dec 2014",
            "name": "Chandresh Chou...",
            "stars": "5 stars"
        },
        {
            "comment": "There are some issue in this version either... but when compared to Moto G1, Moto G2 far far better. Have inherited issues ( MG1) like signal problem (sometimes)... bit lagging b/w typing and display (negligible) , sound outcome isn't refined ( when we are on call people sits in adjacent can able to here it) issue with speaker design and so on...",
            "date": "22 Dec 2014",
            "name": "Sreecharan Cha...",
            "stars": "4 stars"
        },
        {
            "comment": "Drawbacks 1. Camera is good but not the best as 8 megapixel After use of 3 months - my mobile will not give heating problem as i read from review - no single problem Why to Buy : 1. Latest OS 2. Sound/Speaker Quality is Superb... ***** 3. HD Display 4. Slim Light weight Black color looks better than white 1 by considering all things at this price Performance wise and look wise overall quality of Moto g 2nd gen is BEST.... buy bindasss...",
            "date": "22 Dec 2014",
            "name": "Samarth Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "plz provide debit card payment offers through any other bank such-as (sbi) also. because most of us does not have standard chartered bank account. standard chartered bank have only very less branches through out the state. particularly in TamilNadu there are only branches in Chennai and Coimbatore. so other district peoples are unable to avail this offer. kindly accept this query and avail this offer to us through other banks.",
            "date": "22 Dec 2014",
            "name": "Kumarraparaja A",
            "stars": "1 star"
        },
        {
            "comment": "I have Purchase the Phone on 19th Dec and Got on 21st Wow...what an Services.....Flipkart...Mast Yaar... . .. Only One thing upset that the Batter Life is not more...It will last for a day..... . . . But An Great Phone For a Year...i am Dam Excited....",
            "date": "22 Dec 2014",
            "name": "Mahendra Khedekar",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is good one but the camera has some problems it turns on the flash light and after rebooting only the flash turns off. The battery must be more powerful one. Overall performance is good.",
            "date": "22 Dec 2014",
            "name": "Shubhashish",
            "stars": "4 stars"
        },
        {
            "comment": "My first mobile is from Motorala- in late 90's. Good speed, No hang ups, battery charging life moderate - may be because of my continuous data usage. Best mobile recommended to purchase for all purpose usage like gaming, surfing, chatting.",
            "date": "22 Dec 2014",
            "name": "Ramasarma Nandula",
            "stars": "4 stars"
        },
        {
            "comment": "all over phone is best but battery not suit to phone. battery only 6 th hours on working data connection. data off maximum use 10 to 12 hours use our moto G 2nd.",
            "date": "22 Dec 2014",
            "name": "Santosh Pandere",
            "stars": "4 stars"
        },
        {
            "comment": "i used this product and i found some problam in this product like network- Preferred network option with 3g not given. Only 3G network option given. some time apps are hide after restart apps are show excet all are nice, its look are soooo nice",
            "date": "22 Dec 2014",
            "name": "SANDEEP SINGH",
            "stars": "4 stars"
        },
        {
            "comment": "Simply one thing, I am very happy with this phone. At price 13000, it is fully loaded phone with all the features. Good Cam Good Front Cam Good Speakers Average Charger Good Battery Perfect Display Size Below average display Good Voice quality Dual Sim Expandable external memory Good In build memory Android 4.4.4 Kitkat OS Overall very happy with this product.",
            "date": "22 Dec 2014",
            "name": "Kiran Karande",
            "stars": "5 stars"
        },
        {
            "comment": "Greeting from Flipkart! WS Retail has shipped 1 item in your order OD301523353567308800 You will receive your shipment by Saturday, Dec 20, 2014 The shipment was sent through: Ekart Logistics Shipment Tracking ID: WSRC3800611644 TRACK YOUR SHIPMENT Tracking ID may take up to 24 hours to get activated. The following item has been shipped: Seller: WS Retail Moto G (2nd Gen) Item Price Rs. 12999.00 Qty 1 Subtotal Rs. 12999.00",
            "date": "22 Dec 2014",
            "name": "swapnil khare",
            "stars": "5 stars"
        },
        {
            "comment": "its totally worth of money but only issue is that the speakers are not good enough...they crack at high volumes...",
            "date": "22 Dec 2014",
            "name": "Aditya mehra",
            "stars": "4 stars"
        },
        {
            "comment": "I am writing this review after the use of Moto g for 2 weeks. This is one of the best android phones in this range. The real android experience is good, and easy to use. There is no lag of the applications and medias. If you are looking for a phone under the budget of 15 K, I would suggest to go for this. Few negative points i have noticed are - Charging speed is slow - Camera is average, but again in this budget it is good",
            "date": "22 Dec 2014",
            "name": "Saadil P V",
            "stars": "4 stars"
        },
        {
            "comment": "Do not buy from this seller. They have sold me the duplicate product which worked fine till one month and after that it is getting even switched on. I have got it repaired from the service center twice but still problem has not been resolved. I am sure they are selling duplicate products. I will definitely take legal action against flipkart for the same and against this particular seller.",
            "date": "22 Dec 2014",
            "name": "Tushar Gupta",
            "stars": "1 star"
        },
        {
            "comment": "Dude many people complain about the battery life & software problem.. But for me I've never faced any battery life & software problems.. This phone is much better then the mediatek devices.. Wherein with heavy use it dies within 1-2 hrs.. This device lasts for 4-6 hrs of heavy usage.. Plus I hardly use it in weekdays so it lasts almost the full day With 3g on.. And charging is only once a day..",
            "date": "22 Dec 2014",
            "name": "Babu K B",
            "stars": "5 stars"
        },
        {
            "comment": "All these feature in the Moto G are very good but problem is that Battery backup is still not so much",
            "date": "22 Dec 2014",
            "name": "Susheel Kushwaha",
            "stars": "4 stars"
        },
        {
            "comment": "I was using a Sony Xperia U running CM11 which fell and broke. So after a lot of research, I bought the Moto G 2nd Gen for 11.7k. Build Quality - 8/10 ( The volume and power buttons are flimsy ) Looks - 10/10 ( Surely the best looking phone at this price range ) Display - 7/10 (Display is sharp and bright, still can't match up to Sony's) Sound - 10/10 (Might sound funny, but the speakers are loud enough to put my laptop's onboard speakers to shame) Call quality - 7/10 ( Maybe BSNL to blame, but call quality is not up to my expectations) UI - 9/10 (Vanilla Android) Camera - 7/10 ( The default camera app needs improvement. Google camera gives superb results) Battery - 6/10 (Battery back up is good, but I'd rather have a higher capacity battery) I opted for this phone over Zenphone 5 because of stock android. Zenphone has a nice UI, but it becomes a burden after a few months. With stock android you have the option to customize it your own way. PLEASE NOTE - The charger will charge your phone slowly so as to prevent the battery from over-heating. You may get a charger with higher mAh rating, but it might spoil your battery within a year.",
            "date": "22 Dec 2014",
            "name": "Azaz Ahmed",
            "stars": "4 stars"
        },
        {
            "comment": "I have bought this and found some issues. I am not able to call recoding in this phone. and there is beep sound whenever I make a call. Mobile get heat instantly when we play a big size game.",
            "date": "22 Dec 2014",
            "name": "Navin Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Moto g 2 gen is actually good in all department. The camera is awesome quality. Gorela glass are good. easy touch..but i think battery backup time is some what less..satsified with motorola..good one than samsung and other brand..",
            "date": "22 Dec 2014",
            "name": "girish pande",
            "stars": "5 stars"
        },
        {
            "comment": "Decent value for money product with a decent build quality, bright screen and overall performance. However there are some big let downs: 1) The battery is not as good as the motoG 1st gen 2) The body starts heating up pretty fast (after 5-10 mins of continuous use)",
            "date": "22 Dec 2014",
            "name": "Pratik Chowdhury",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is exceptionally too good at the correct price. I have been using it since 4 months and it is very good and handy for me.",
            "date": "22 Dec 2014",
            "name": "Subhasish Patt...",
            "stars": "4 stars"
        },
        {
            "comment": "3.5 / 5 Few problems. Camera. Its pathetic. Enough said. So much noise even when taken in broad daylight. Only a fool would say that the camera quality is very good. Its mediocre at best. Memory. The launcher crashes quite often when you have lot of apps open / left open. Especially when you open a relatively big app and close, you will see that launcher crashes. CPU speed. Yes, this is a budget phone but I found Redmi 1S is way faster than this phone. The phone does lag. Dont believe anyone who says it doesnt. I have used a higher end phone also and this is slow and it shows. But, not very slow. On a whole, its a very decent phone. But, Redmi 1S is better and is only half the price of this one. The only reason I bought this was hoping that AOSP would be very fast. Unfortunately, it wasnt upto my expectations.",
            "date": "22 Dec 2014",
            "name": "Wasim Raja",
            "stars": "4 stars"
        },
        {
            "comment": "I liked the phone. Its quality is awesome.And the delivery of flipkart is really very fast. But the headset sound is not good.But overall nice set. Buy this product.",
            "date": "22 Dec 2014",
            "name": "HIMANSHU",
            "stars": "5 stars"
        },
        {
            "comment": "Love the style and quality in making of phone. I have been using this phone for 5 five days for now. I am a apple user and was not a great fan of big screens, however i started liking big display. phone is definitely big for a jeans pocket, however you can say that by looks of phone. A five star for Flipkart next day delivery.",
            "date": "22 Dec 2014",
            "name": "Rakesh S",
            "stars": "4 stars"
        },
        {
            "comment": "Hi, I just ordered the Moto2 gen few mins back. I have used my HDFC credit card for the payment. I didnt get the 10%discount..",
            "date": "22 Dec 2014",
            "name": "Aiswarya",
            "stars": "1 star"
        },
        {
            "comment": "My Complaint Number - 32226365 - Still am not getting replacement set My touch is not working from the day 1. PL refund my cash-- am tired and fed up for this moto g2--First time am facing these types of issues from Flipkart",
            "date": "22 Dec 2014",
            "name": "Karthick",
            "stars": "2 stars"
        },
        {
            "comment": "I got this mobile just one month before. Starting it was fine but nowadays it's heating up like anything just playing games, videos or browsing for ten minuets. I called flipkart after one month 4 days and they said our replacement policy only for 1 month, so go to service center. And i don't want any part replacement for my new mobile. Overall product is good but which i received the mobile from flipkart is very bad.",
            "date": "22 Dec 2014",
            "name": "veerandra kumar",
            "stars": "1 star"
        },
        {
            "comment": "In these Phone all features is Good but Battery back up is 2020Mah it's too low Compare to others Phone,Phone will get Heat during charging if we are using Internet,games.",
            "date": "22 Dec 2014",
            "name": "Praveen Shetty",
            "stars": "3 stars"
        },
        {
            "comment": "Simply it's best value for money phone in India market. Believe Moto G will be people's phone of the year 2014.",
            "date": "22 Dec 2014",
            "name": "Hemkumar Laksh...",
            "stars": "5 stars"
        },
        {
            "comment": "MOTO G2 comes with Great looks, is pretty handy and the camera is upto the expectations too. The Handset is working fine but the EAR PHONES delivered are NOT WORKING AT ALL. Hope FLIPKART takes a quick action & replaces the earphones.",
            "date": "22 Dec 2014",
            "name": "Abhishek Paradkar",
            "stars": "4 stars"
        },
        {
            "comment": "Best delivery service by Flipkart, they re-visited delivery address on the same day on insisting to completed the order.... thank u Flipkart... And Moto G is rocking.. grt display, grt handling, and Camera is too good..",
            "date": "22 Dec 2014",
            "name": "Avinash Ambalgi",
            "stars": "5 stars"
        },
        {
            "comment": "I think this is the best smartphone you can get for this price. Pure Android UI is smooth enough. Bt my phone got some issues regarding calling but a reboot fixes them all. Still waiting for the lollipop update",
            "date": "22 Dec 2014",
            "name": "Mithu Paul",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this mobile for my brother.. He is dam enjoying ... you can blindly buy it... superb...... mobile Pros: Good Screen while using in sun lite. Smooth performance. Best mobile at this price with great features You know all the features... Cons: Little heating problem only while charging everything is good",
            "date": "22 Dec 2014",
            "name": "Ravikanth Reddy",
            "stars": "5 stars"
        },
        {
            "comment": "This product is awesome. What we need is smooth touch & fast processing. I think,everything is there whatever smartphone has. Moreover,it work faster than any other comparative phone. Same features which other smartphone has in higher price.Overall its fantastict product in such price.",
            "date": "22 Dec 2014",
            "name": "Product Not Worth",
            "stars": "5 stars"
        },
        {
            "comment": "i wont say about specification , that u all know. The phone is great and u must buy. but u have to buy a powerbank as well from flipkart as i did :-). battery life is poor. i have to charge my MotoG2's battery twice a day.",
            "date": "22 Dec 2014",
            "name": "Kushal Patel",
            "stars": "4 stars"
        },
        {
            "comment": "This is a very good product. Touch is good. Even it is 1 gb RAM but it is very good. I loved to use this product. Flipkart delivery and packing is also very good.",
            "date": "22 Dec 2014",
            "name": "Sagnik Das",
            "stars": "5 stars"
        },
        {
            "comment": "moto g2 ,its camera work very well main and front both are good , It work perfectly and the touch is amazing.its s/w and h/w both are good.It is a very good phone in this range.you can perches without any hesitation.",
            "date": "22 Dec 2014",
            "name": "deepak patel",
            "stars": "4 stars"
        },
        {
            "comment": "its my first time when i came here to bought something, so its a little bit risky for me to buy a thing like electronics but when i orderd for a moto g 2nd generation i thought may be its little risky but i can manage with that . so after getting the delivery on very time i am very happy about their delivery skills and my moto g 2nd generation is just too good because its too fast and reliable with extra aided features with in the price bracket of inr 12999. so i will advise to my friends to buy this latest mid pricy smart phone motorola's design is just suave (handsome,good.smart,intelligents in looks)",
            "date": "22 Dec 2014",
            "name": "SAuvik Samanta",
            "stars": "5 stars"
        },
        {
            "comment": "the value for money smart phone which should be priced bit less at 9000 to 10000. rest all is fine with the phone but with increased competition the price should be lessened",
            "date": "22 Dec 2014",
            "name": "Suprateem Moitra",
            "stars": "5 stars"
        },
        {
            "comment": "From apple iPhone 4 to Moto g2 very effective solution. I am happy with the performance and looks of the handset. recommended in the budget for 10-15 k",
            "date": "21 Dec 2014",
            "name": "Sushain KApoor",
            "stars": "5 stars"
        },
        {
            "comment": "it just doesn't need any review... for battery full marks...smooth operation...camera is definitely not the best ..but it is more than good..",
            "date": "21 Dec 2014",
            "name": "Anand Kishore",
            "stars": "4 stars"
        },
        {
            "comment": "Nice product from MOTOROLA. Performance is good. Battery back up also good. Definitely a good choice in this price.",
            "date": "21 Dec 2014",
            "name": "hanimi reddy g...",
            "stars": "5 stars"
        },
        {
            "comment": "Very very good product and worth for money. The features and display is simply super compared to other products available in market for same price. I like it..!!!",
            "date": "21 Dec 2014",
            "name": "Lalit",
            "stars": "5 stars"
        },
        {
            "comment": "Good product, super fast delivery... recommendable to others.... Very good product by Motorola.... very happy to see this in my hands within few days of ordering it... Much better than samsung smartphones.....",
            "date": "21 Dec 2014",
            "name": "Bhupinder Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Flipkart - Thanks for the quick delivery. This was my first online mob purchase, so very nervous about the delivery. Ordered on 23 Nov'14 and Delivered on 24 Nov'14. About the phone Value for money, only cons is the battery drains quickly. Apart from it's very good",
            "date": "21 Dec 2014",
            "name": "Ramalingam R",
            "stars": "4 stars"
        },
        {
            "comment": "perfect packing, product, service.....ordered moto g2nd gen....works fine!! overall satisfying experience of my first purchase....",
            "date": "21 Dec 2014",
            "name": "Parth Thanki",
            "stars": "5 stars"
        },
        {
            "comment": "Overall performance is good but battery charging rate is poor. Battery capacity may also be increased with such a big size phone.",
            "date": "21 Dec 2014",
            "name": "Gyan",
            "stars": "3 stars"
        },
        {
            "comment": "great phone at this price range. also far better than micromax phones. u can also get guarenteed future updates also. camera also good",
            "date": "21 Dec 2014",
            "name": "Jagadeesh Sk",
            "stars": "5 stars"
        },
        {
            "comment": "After using Moto G2 about one month I am writing this. I am totally unsatisfied with this phone that internet is working very slow even the signal full and showing H+ / 3G.",
            "date": "21 Dec 2014",
            "name": "Perisetti N Rao",
            "stars": "2 stars"
        },
        {
            "comment": "in this price this is the best phone you can get. this is an awesome phone by moto, great value for money. i will tell you all about this phone below. screen: moto g2 has an awesome 720p screen which is awesome, great quality, colors and everything. no complaints there. processor: moto g2 has snapdragon 400 soc in it. which provides great power to it and phone runs very smoothly, no lag at all. camera: it has 8 mp primary camera that produces great detailed images and good colors. it could have been better but for daily average use its great. sound quality: front stereo speakers are just awesome, great sound quality. they are very clear and loud enough. build quality: moto g has has good body and with good build quality. it has full plastic body with curved back, which is super good to hold and for grip. bonus: water resistence is bonus for this phone. it resist water really good. and also a notification light on top is very useful.",
            "date": "21 Dec 2014",
            "name": "Shubham shriva...",
            "stars": "4 stars"
        },
        {
            "comment": "First look is good. will update the review later once i used the same for some days.. Flipkart delivery is Awsome.. booked on Saturday and the same got delivered on Sunday .. :)",
            "date": "21 Dec 2014",
            "name": "Vishnu",
            "stars": "4 stars"
        },
        {
            "comment": "This is my first smartphone and to tell the truth to me its the best budget phone .. The performance is beyond expectation , battery life is decent , solid design with a gorgeous look, the front facing speakers adding to the beauty..the 8MP rear shooter shoots great pics..no issue of heating or lagging yet ..inclusion of microsd slot and dual sims will make this a perfect phone for those who are planning to buy one.. I got this phone 2 weeks ago and till now i have no complain..flipkarts service was great again delivering the item on time....at 13K we are getting a good smartphone with a promise of getting software updates in the long run...in short its a value for money.. thanks motorola for this awesome device..",
            "date": "21 Dec 2014",
            "name": "gaurab dey",
            "stars": "5 stars"
        },
        {
            "comment": "hiii i purchased this phone 2 months back . moto g is awesome phone in this price range . it looks cool and sturdy . it heavy but phone hardware quality is quite good and better then micromax nitro . it works smoothly although do hangs sometimes which i never faced in my old lumia 520 but acceptable for android phones (still better then most samsung phones). battery lasts for a day with good usage . value for money phone . go for it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1",
            "date": "21 Dec 2014",
            "name": "shazy",
            "stars": "5 stars"
        },
        {
            "comment": "What to say .............My mobile was stolen even before completing one month of purchase. !!!!!!!!!!!!!!",
            "date": "21 Dec 2014",
            "name": "SATYAJIT ROUT",
            "stars": "3 stars"
        },
        {
            "comment": "only they should increase the RAM 1GB to 2GB,orelse the product is very good as compared to samsung galaxy grand and other brands which meet the moto G2 feature.",
            "date": "21 Dec 2014",
            "name": "sunny dias",
            "stars": "5 stars"
        },
        {
            "comment": "Have a great features with nice look. It gives a nice feel to use this android 4.4.2 kitkat with 16 GB internal memory and 8 Mega Pixel rear and 2 mega pixel front camera. very handy and stylish. :)",
            "date": "21 Dec 2014",
            "name": "Sachin",
            "stars": "5 stars"
        },
        {
            "comment": "excellent mobile .. it is superb .. i would reccomend everyone this..... i love it.......................",
            "date": "21 Dec 2014",
            "name": "D.J",
            "stars": "5 stars"
        },
        {
            "comment": "This is one of the best phones available on Flipkart especially after Xiaomi went off the shelves. So until the Xiaomi Note or Redmi isn't available, this is the best phone you should go for without doubt.",
            "date": "21 Dec 2014",
            "name": "Rohit A%20T",
            "stars": "4 stars"
        },
        {
            "comment": "There is no other phone come in mind when i think about Best average phone, Its pure Android experience is top of the line feature. I suggest this phone to 3 frnd till today. If your Budget is 15K, then you should go for this...",
            "date": "21 Dec 2014",
            "name": "Pankaj Gajbhiye",
            "stars": "5 stars"
        },
        {
            "comment": "I gifted this phone to one of my close friends. I am writing this review after about two months of purchase. The phone is good however there are two main things that I never expected from Moto atleast. 1. Camera does not seem to be 8MP. Pictures are good for online sharing; not great for printing. 2. Battery is average. It barely touches 10 to 12 hours considering this is a multimedia enabled phone. Battery could have been better. If you watch movies or listen to songs , the battery dies in less than 10 hrs. Recommendation : If you travel a lot, better buy a battery bank or buy some other phone",
            "date": "21 Dec 2014",
            "name": "ISOGeek ISO 27...",
            "stars": "3 stars"
        },
        {
            "comment": "I have ordered this product on Big Billion day, got this at its best price. Overall experience is very nice. i received this product before the expected delivery date. Thanks Flipkart.",
            "date": "21 Dec 2014",
            "name": "Bharath Kancha...",
            "stars": "5 stars"
        },
        {
            "comment": "great phone , Awesome features , good for price,fall a bit short on battery if you have excessive use of WIFI and GPS.. over all impressive phone",
            "date": "21 Dec 2014",
            "name": "Siddhesh Ambetkar",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone a while ago, and everything worked well until one day when the phone completely drained of charge and when i tried to switch it on after charging, it went on a Boot Loop. I then handed over this phone to the Motorola Service Centre in Bhubaneswar (that also happens to be the service centre of Karbonn, Micromax, Alcatel etc) on 28th November,2014. They by the way are the most dumb people I have ever come across, I find government officials to be more responsible then these servicing people. I am still waiting to get my phone repaired/replaced. I went to the customer service center at least 10 times without any success. The worst part is that I called Motorola on their toll free no. and explained the issue, and they are saying the Parts for this phone are not available in India! And they seem to have escalated the issue and told me I would get a call from the \"Actual Service Officials\" within the next 24 hours. But they 24 hours wait has now turned into 240 Hours wait. I would strongly suggest users not to buy this phone. Only good specifications doesn't buy you a Customer Motorola, effective after sales service is also important. My Job Sheet No is BHV/MG/14/00569",
            "date": "21 Dec 2014",
            "name": "Abhijeet",
            "stars": "1 star"
        },
        {
            "comment": "its indeed an amazing product under 20k as it looks well,feels well and works exceptionally well. 1- gaming is hd and awesome 2-processor quite good 3-best catch serves lollipop(why i bought this fon) it lags a bit after ive used for 2 months now but i think it will b fixed with the coming lollipop upgrade.. go for it guys",
            "date": "21 Dec 2014",
            "name": "anish bura",
            "stars": "5 stars"
        },
        {
            "comment": "its really a very gud mid range phone and battery is just awesome n camera is juss awesome n no issues gud work by motorola n google",
            "date": "21 Dec 2014",
            "name": "Ganesh",
            "stars": "4 stars"
        },
        {
            "comment": "Nice Phone... I got it at very reasonable price after 10% discount from my Standard Chartered credit card and exchange of Rs. 4000/-. Cons : I noticed heating problem after 15-20 minutes usage.",
            "date": "21 Dec 2014",
            "name": "Sandeep Verma",
            "stars": "4 stars"
        },
        {
            "comment": "Best phone in this range. Nice screen size and good graphics. Battery is a bit poor though, last almost 7 to 8 hours on single charge while using heavy internet and gaming.",
            "date": "21 Dec 2014",
            "name": "Ashutosh Jha",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this phone when it launched, and I am posting this review after using it extensively. It is the best mid range phone having excellent features. It has a 8MP primary camera and 2MP secondary camera which is far better, when compared with its predecessor. My views Pros:- *The battery life, which is the most important aspect is pretty good. *Better gaming experiences than the old version due to larger display. *The phone does not hang at all as against the other Low Cost phones which have flooded the market. *The photo quality is excellent. *The flash works amazingly during low light. *I have seen people losing their cool, as half of a mobile's feature is nullified because of low internal memory. This mobile obviously doesn't give you a reason to crib on those grounds. Cons;- *The sound quality could have been better. *The phone could have been slimmer. *SAR value seems to be a big deterrent.When compared with Samsung devices the figures seems to high. *Moto should work on reducing the SAR value when they plan the next version. The phone is good, and that is the reason everyone is talking about it.",
            "date": "21 Dec 2014",
            "name": "Anant Balgi",
            "stars": "5 stars"
        },
        {
            "comment": "Nice phone with great features. Quite a few motorola softwares Moto assist, make this phone easy to use & secure. Also Motorola migrate allows you to transfer contents from your old android phone to this new phone very easily. Easy to learn.",
            "date": "21 Dec 2014",
            "name": "Ajay Pohare",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G is undoubtedly a cheap fone with great looks! It hangs more than it delivers...Pls cross check with other users of Moto-G before purchasing it.",
            "date": "21 Dec 2014",
            "name": "Bijoy Jha",
            "stars": "3 stars"
        },
        {
            "comment": "This phone is awesome. Latest and fastest updates(faster than even flagship devices) Good hardware with great performance. Worth every penny.",
            "date": "21 Dec 2014",
            "name": "Ashwani Kumar...",
            "stars": "5 stars"
        },
        {
            "comment": "my rating is 5.... Display its display is superb..with 294 ppi HD screen... camera quality is good both front and back cameras are good you can install camera zoom fx to take pics..that app can truly increase the quality of pics..u can get it from play store. no hanging issues no lags at all..really satisfied with its performance. u can dwnld solo launcher to get notification bar...both the sim slots supports 3g. install mx player or mobo player that can decode any video formats and can play mkv,flv,avi files etc..5 inch screen good enough for me to watch videos and all 13k worth buying...",
            "date": "21 Dec 2014",
            "name": "Rahul KR",
            "stars": "5 stars"
        },
        {
            "comment": "some options are not available (Ex: My files and 3 x 4 Keyboard not Inbuilt) But worth price compare to other phones and some options are good",
            "date": "21 Dec 2014",
            "name": "Vishwanathaiah...",
            "stars": "3 stars"
        },
        {
            "comment": "good battery backup gets latest software updates good camera if u know how to set focus big display and good resolution cons: not very handy",
            "date": "21 Dec 2014",
            "name": "Sarabpreet Singh",
            "stars": "4 stars"
        },
        {
            "comment": "please replace my order with new moyo g2. because i need phone as early as posible so please exchange it.",
            "date": "21 Dec 2014",
            "name": "lokender singh...",
            "stars": "1 star"
        },
        {
            "comment": "problem of signal dropping, battery life too low, take too much time to get fully charge............................overall it works average...........",
            "date": "21 Dec 2014",
            "name": "pari",
            "stars": "1 star"
        },
        {
            "comment": "One of the best smartphones available in the market, but motorola should work on few of the improvements... 1. Battery Backup is poor 2. 1 GB RAM looks ok, but 2 GB would be great 3. Audio Quality is not so good, an improvement is needed",
            "date": "21 Dec 2014",
            "name": "SANJAY DUBEY",
            "stars": "3 stars"
        },
        {
            "comment": "Its very cool mobile, Most important after downloading all necessary applications, It is not yet hanged, speed is good, Filpkart s services are also excellent.",
            "date": "21 Dec 2014",
            "name": "Ganesh Sharma",
            "stars": "4 stars"
        },
        {
            "comment": "I didn't installed any application but still its hanging some times..............................................",
            "date": "21 Dec 2014",
            "name": "Janakiramudu B...",
            "stars": "3 stars"
        },
        {
            "comment": "Flipkart service - 5/5 Mobile phone : Touch : 4.5/5 Camera : 4/5 Overall : 4.3/5 U can go for this one if u want a descent phone with good features ..",
            "date": "21 Dec 2014",
            "name": "Sashaank Padmanaban",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is quite good.the android system has always been good. the camera is decent with a front camera also. overall it is a worth buy within this price.",
            "date": "21 Dec 2014",
            "name": "gunisha arora",
            "stars": "4 stars"
        },
        {
            "comment": "Flipkart is Leading the India in Online Shopping.what a great service guys,keep it up. About the phone: Battery Big Issue Below are the problem that I am facing:- 1. Charger gets heated. 2. Its take around 4 hours to get 100% charged. 3. Battery does not last even 6 hours. 4. Phone gets heated.",
            "date": "21 Dec 2014",
            "name": "Chiranjeev Bommen",
            "stars": "3 stars"
        },
        {
            "comment": "looks absolutely awesome. the camera is also awesome. no lagging and very smooth touch. 720p resolution is awesome.",
            "date": "21 Dec 2014",
            "name": "anil kumar val...",
            "stars": "5 stars"
        },
        {
            "comment": "phone have 2 prbs .1 not removeable battery,2charging vvvery bad phone working 3g 2g simple super .",
            "date": "21 Dec 2014",
            "name": "saikumar sureddy",
            "stars": "5 stars"
        },
        {
            "comment": "All is well except the battery.Drains fast if we don't close mobile NET connection, Google Now etc. Better use some battery doctor application.",
            "date": "21 Dec 2014",
            "name": "Bhanu Sridhar",
            "stars": "5 stars"
        },
        {
            "comment": "moto g2 is a superb smartphone. Other mobile of the range can't touch the bottom line In Performance and in price. Camera is superb No hanging after inserting 32GB memory card and having data more than 10 GB data Speed is much and much better than other smartphone like Samsung Grand series and low range Galaxy series. Voice quality is superb It gives good 3G speed in compare of other smartphones on the same network It's 5\" but not bulky due to its curved design Bes position of speaker for loud sound. Clear conference voice and signal quality No call drop No hitting even hours and hours use I can't list out here all features here because I am collecting the features of MOto g2 by using it. There are some lack also like Battery is not superb Earphone headset is not of best quality. Not volume control in headset. No music change control in headset Headset speaker is not so fitted with ear initially. You will have to be used to. Sound support stereo no mono. Power button is not like previous version Moto g Its accessory should come as freebies Not good for small hand. No one hand use",
            "date": "21 Dec 2014",
            "name": "Gulam Ali Ansari",
            "stars": "5 stars"
        },
        {
            "comment": "The mobile is amazing..... Good camera clarity , Voice clarity during calls was too good, It gives me more than 1 day Battery backup... finally it is an amazing phone Im using this from past 3 moths n I didnt got any problem.... Amazing gorilla glass 3 my phone fell down from 5 feet 3 times and still no scratches.. Pros: Everything is good Cons: phone ll heat up if u use the camera for more than 15 min",
            "date": "21 Dec 2014",
            "name": "Joy",
            "stars": "5 stars"
        },
        {
            "comment": "I got received a faded back case of this mobile... i raised a complaint for this in flipkart customer care, they called me and they told me to visit service centre i was disappointed, then again i raised a complaint they add some amount in my wallet for purchase a new case... so i totally unsatisfied about this :(",
            "date": "21 Dec 2014",
            "name": "siddiq",
            "stars": "1 star"
        },
        {
            "comment": "Each and every feature is awesome.....! Only drawback is molded battery. And the service provided by flipkart in delivering the product is awesome.",
            "date": "20 Dec 2014",
            "name": "Manjalam Manohar",
            "stars": "3 stars"
        },
        {
            "comment": "Hi all, This phone is very ultimate phone. Everything is excellent in this phone.This never hangs. go for it.even after 5-6 days i lost my phone..but miss that phone.",
            "date": "20 Dec 2014",
            "name": "Raghvendra Singh",
            "stars": "5 stars"
        },
        {
            "comment": "Yes indeed a superb buy and delivery from flipkart as well. I love to see the phone gives great feel when kept in pocket and was surprised to see the resemblance of nexus 6.",
            "date": "20 Dec 2014",
            "name": "Abhilash Chatt...",
            "stars": "5 stars"
        },
        {
            "comment": "battery back up less then 5 hours. heating problem .. camera not good.... camera stabilization not good...",
            "date": "20 Dec 2014",
            "name": "Siva Krishna",
            "stars": "2 stars"
        },
        {
            "comment": "This phone amazed me a lot! The experience with this phone is excellent. It multitasks with ease. Everything from voice call, music player, camera, web browsing seems enjoyable. Totally worth the price. Excellent phone overall.",
            "date": "20 Dec 2014",
            "name": "Rakshith R",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent , Awesome, Amazing, I just love it.... Everything is good the color sound and much more things but the battery backup is not gud at all if you would go for internet surfing the battery turns up to the low level.... But everything is osm....",
            "date": "20 Dec 2014",
            "name": "Ainy Pie",
            "stars": "4 stars"
        },
        {
            "comment": "i just purchased moto g2nd generation from flipkart, but i did nt got warrantypaper from mobile package. so plzzz do needful",
            "date": "20 Dec 2014",
            "name": "Dwitikrushna...",
            "stars": "5 stars"
        },
        {
            "comment": "this is phone is the best at this price only the battery should have been more better it decreases if i am using continuous internet otherwise the phone is quite good.Good camera quality and good performance.the delivery by flipkart was also quite fast thankyou.",
            "date": "20 Dec 2014",
            "name": "akash chandra",
            "stars": "4 stars"
        },
        {
            "comment": "Good Camera, Display and hardware specs. Battery should have been increased. Except for that everything is fine. Overall satisfied with MotoG2.",
            "date": "20 Dec 2014",
            "name": "Karthick S",
            "stars": "5 stars"
        },
        {
            "comment": "I already have a Moto G (1st gen), bought this phone and it is very good. Its definitely an improvement from 1st gen.",
            "date": "20 Dec 2014",
            "name": "Karthik K",
            "stars": "5 stars"
        },
        {
            "comment": "When i have purchased the Moto G (2nd Gen), i have get the date offer described as: Data Offer - 1 GB 3G/2G data per month for 2 months in 3G/2G circles for Airtel prepaid and Bill discounts of INR 250 and INR 155 per month for 2 months on subscription of 3G and 2G data boosters of 1 GB and above in 3G and 2G circles respectively Airtel postpaid. I have got only 1 month free data. I didn't get the same offer in 2nd month. Also i complaint to Airtel regard this, but my issue is not resolved. Are these offers are making fool of customers. Also 100 Rs is deducted from my account for using the net, as the offer is not regulated on my number.",
            "date": "20 Dec 2014",
            "name": "Vinay Sharma",
            "stars": "1 star"
        },
        {
            "comment": "This phone is very good with its shining features like 1gb ram , 16gb internal storage , 8mp camera etc. Working good with good battery power. I recommend this phone because this phone come with descent features at very good affordable price.",
            "date": "20 Dec 2014",
            "name": "Tark Patel",
            "stars": "5 stars"
        },
        {
            "comment": "It is a cheap android phone by motorlola which has wonderful specifications for me it is phone like you have never before in one word i would describe it its an awesome phone",
            "date": "20 Dec 2014",
            "name": "Harry Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Nice mobile. all thing super . Battery need to improve. Headset also a problem, my ear is paining after a long time use. Please improve this.",
            "date": "20 Dec 2014",
            "name": "Sathish Pjs",
            "stars": "5 stars"
        },
        {
            "comment": "First 2 Months its fine, Problem will come after 2 month, May be basically because of manufacture from China I hope.",
            "date": "20 Dec 2014",
            "name": "Chakravarthi",
            "stars": "1 star"
        },
        {
            "comment": "If you want to buy a phone and u cant afford to invest more then 13000, u must go for this phone and you'll be using the best phone under 13k",
            "date": "20 Dec 2014",
            "name": "Sahil Kalra",
            "stars": "5 stars"
        },
        {
            "comment": "good for the cost at which it comes. added brand name and built quality plus points good for the cost at which it comes. added brand name and built quality plus points",
            "date": "20 Dec 2014",
            "name": "DAMANJIT MINHAS",
            "stars": "4 stars"
        },
        {
            "comment": "I have given my phone to the authorised service center in siliguri, West Bengal on 3rd Dec 014. Technician told me that the board needs to be changed under warranty. It has been 17 days but still there is no board from the company. I was told it'll be replaced within 7-10 days. MOTOROLA NEEDS TO BEEF UP THEIR SERVICE OR SHUT DOWN THE SALES.",
            "date": "20 Dec 2014",
            "name": "Pratik Ghimire",
            "stars": "1 star"
        },
        {
            "comment": "budgeted phone.. nice performance . . using from last one week . good result . cam quality to be improved.",
            "date": "20 Dec 2014",
            "name": "krishna teja",
            "stars": "5 stars"
        },
        {
            "comment": "really worth for appericiation , best handset you can get in such an affordable price, just the thing lagging behind is the software which rarely gets up dated and don't have quick search menu for applications and also don't have file manager tool of its own.",
            "date": "20 Dec 2014",
            "name": "harshwardhan p...",
            "stars": "5 stars"
        },
        {
            "comment": "It is always a pain to know that the order you just received paying a lot of money is defective and that sinking feeling that \"oh will i get new piece or again go through the service karo ,idhar jao, udhar jao circle \"is the one that all dread. I must really commend on the good job that was done when i posted my return request of Moto G2 and all efforts were taken by the CS team of flip-kart to get me the replacement on time without hassles. I really had the peace of mind (which is usually nerve racking) during the entire process of replacement without having to lift my finger. Really commendable job CS team..!!!",
            "date": "20 Dec 2014",
            "name": "gagan hegde",
            "stars": "5 stars"
        },
        {
            "comment": "when i ordered it was not in stock but it arrived in dec 4. I got the shipment on 7 dec....awesome product.. coming on details cpu:a quad core cpu stunning fast speed in gaming and internet use and other comman operation.. ram:1 gb quite good for multitasking.. gpu:andreno 305 good for mid range gming...some high games too... battery:2070mah can run easily for 12hrs without playing games.. camera:8 mp rear camera for hd recording as well as sharp snaps.. . . only 1 problem is there..my OK GOOGLE is not working",
            "date": "20 Dec 2014",
            "name": "Harshit Singh",
            "stars": "4 stars"
        },
        {
            "comment": "Motorola just rocking with these handsets....love it...:) :) Good quality in this price range...:) So far so good...Am a satisfied user of Moto g 2nd gen...:)",
            "date": "20 Dec 2014",
            "name": "Vineeth VR",
            "stars": "5 stars"
        },
        {
            "comment": "awesome mobile, has got all those features which are essential! handy, touch is great. again thanks to flipkart for delivering it before time",
            "date": "20 Dec 2014",
            "name": "blaze rulz",
            "stars": "5 stars"
        },
        {
            "comment": "it had been 20 days i had used the mobile. the mobile wont hang for any load. but main problem for me is battery.the battery life is low.(not very its average).its showing some errors like battery suddenly drops to half.like that",
            "date": "20 Dec 2014",
            "name": "Praveen Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the product on launching day 6/9/14 but receive on 11/9/14. In first view, it is the best phone (budget) but in reality the product is stuck.No matter it have 16 gb in-build memory and allow to use around 12 gb. But when you fill its 6 gb and more, its performance take you to your worst nightmare.Its not actually Google product and more then 1 month since the lollipop update available, it did not get any update. Also, since last 2 days it become dead however no accident happened. Service center promise me to return product at-least 5 working days or 15 if there is some problem in motherboard.",
            "date": "20 Dec 2014",
            "name": "Ankur Mishra",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is very good at this price, Best buy. But never use the Airtel data offer with this phone. As usual Airtel having some hidden terms like, you should use this offer for only to download apps and software ( this is the reason airtel customer care gave me). If you use it watch videos or download music ( this is the , it will detect from your main balance and empty your balance. Guys who can take risk shall use the Airtel offer. Airtel made flipkart as scapegoat to loot their customers",
            "date": "20 Dec 2014",
            "name": "Vadivel Mani",
            "stars": "3 stars"
        },
        {
            "comment": "Dear Team I bought this product from flipkart almost 3 months back and now suddenly my phone is not charging and its dead. Now I am trying to turn it on but it is not turning on. When I do the method of keeping the power button pressed for 120 seconds but the screen doesn't turn on. I have tried holding it for longer times too but the same thing happens yet it does not turn on (watched you tube video for doing so). I have read out this problem is still in MOTOROLA Gen. 2 phones. I want a replacement of the phone as it under warranty or get it rectify at UK or India. Really its a big problem for me & Flipkart should resolve this issue as soon as possible. Reply back for some positive solution.",
            "date": "20 Dec 2014",
            "name": "Rupak Sood",
            "stars": "3 stars"
        },
        {
            "comment": "Nice & Fast phone. My Samsung mobiles used to hang. this phone got pretty speed. Design look great. I suggest to buy the Moto brand cover for this phone",
            "date": "20 Dec 2014",
            "name": "Share Khanna",
            "stars": "5 stars"
        },
        {
            "comment": "i am using Moto G2 from 8th dec 2014 till date not any lagging,heating problem with havy usage(game+internet with using mobile data) battery work for single ,play game like MC5,alphalt8 with no heating and lagging, camera quality also best, i am satisfied with this mobile at this price range. only one problem is battery charging take 3hr... Moto G2 is much better then grand 2 and other brand 10k price range mobiles...",
            "date": "19 Dec 2014",
            "name": "Ravi",
            "stars": "4 stars"
        },
        {
            "comment": "bought it for my dad, actually selected cos he only paid for it..,,,well about the product.. battery was my main concern and it's good as he makes decent number of calls. no need of charging for 3+ days without 3G....and 1+ day with 3G usage....data connectivity awesome.....nice camera....satisfied after using it for more than a month... on a lighter note, my dad's only complaint was that battery icon was too small... disappointed when got the news that chinese company lenovo bought motorola from google..",
            "date": "19 Dec 2014",
            "name": "vinay",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 ! A great piece at affordable price. I got a faulty piece for first but was easily replaced by flipkart. Thank you for the service. The camera quality is great front facing is also not bad, works excellent in day light. The ram should have been 1.5GB for more smooth multitasking,but looking at the price you cant really complaint. 16GB memory brings everything in your hand and this one has a OTG(On The Go) support too. As said by the moto they will be providing 5.0 update to this device as early as possible. Interface is almost pure android. Though it has a gorilla glass 3 i have noticed some scratches on the screen so please ensure that you put on a screen guard as early as possible. The stereo speakers are lound but sound cracks sometimes mostly when you play a song with heavy bass. The battery life is average about 7-8 hours of moderate usage and about 4-5 hours of heavy usage.(If the connection is 3G) Overall a very good phone by moto and in budget. Go for it!",
            "date": "19 Dec 2014",
            "name": "Vismay Patil",
            "stars": "5 stars"
        },
        {
            "comment": "it's an amazing product from motorola i have a problem that on screen buttons won't hide while gaming it's a major issue to me",
            "date": "19 Dec 2014",
            "name": "Rahul",
            "stars": "4 stars"
        },
        {
            "comment": "i am using this phone, this is very good phone at this price, camera quality is too good, but battery is not so good.",
            "date": "19 Dec 2014",
            "name": "Udit Tiwary",
            "stars": "4 stars"
        },
        {
            "comment": "very very good!!!! only battery is just satisfactory. other things r good stereo speaker is of good quality",
            "date": "19 Dec 2014",
            "name": "khan",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G2 2nd Gen is a good phone when it comes to the screen size, looks, clarity, audio quality, gaming, Speed and so on. But the main purpose of the phone gets defeated when there is no / poor signal. 3G is very weak. Will get only Edge most of the time. VERY VERY Poor Reception. Very good build quality with poor network reception. Also the voice transmission is very very poor that the person on the other end would never hear anything when you sound soft.. As a phone would rate 3/10 As a gaming and video/audio device 8/10 Trust Broken..﻿",
            "date": "19 Dec 2014",
            "name": "Nishanth Chida...",
            "stars": "2 stars"
        },
        {
            "comment": "Battery should have been atleast 2500 MAH. Though it gives a full day of mixed usage..................................................",
            "date": "19 Dec 2014",
            "name": "Varun Kumar Lella",
            "stars": "4 stars"
        },
        {
            "comment": "Its a week now since I am using MotoG 2nd Gen and here is what i feel about this handset. Overall the touch is smooth and nice and so is the performance but what i feel is missing is: 1. More Features like Battery % in Text 2. Launcher and Lock Screen Customization 3.Pull down tabs like Wifi, Mobile Data should activate the functions rather than taking inside the settings. 4.Options to configure tabs in Status Bar pull down. Battery Life is avarage and if taken care of can make this phone a great phone. Will keep updating my review on more usage.",
            "date": "19 Dec 2014",
            "name": "Tushar Mohta",
            "stars": "4 stars"
        },
        {
            "comment": "once you play any video/ music your phone mic will not work properly. Don't know whether all are facing the same problem or only me.",
            "date": "19 Dec 2014",
            "name": "RAJ KUMAR PHUYAL",
            "stars": "3 stars"
        },
        {
            "comment": "everything is fine.. Whilre charging keyboard wont work properly..it gets struct r get closed..there it iritates u. smetimes phone is hanged out..we have to switch it off n then on again.. camera is very nice...",
            "date": "19 Dec 2014",
            "name": "chandu3245",
            "stars": "4 stars"
        },
        {
            "comment": "Good Product.      --",
            "date": "19 Dec 2014",
            "name": "Mohamed Safeek",
            "stars": "5 stars"
        },
        {
            "comment": "Moto is Best This Moto G2 Phone is very graceful. Its 5\" HD screen is very responsive.RAM is good. I can handle this moto g2 in one hand smoothly.",
            "date": "19 Dec 2014",
            "name": "PRASHANT SONI",
            "stars": "5 stars"
        },
        {
            "comment": "Yeah we can say that the battery sucks ..But overall I'm very much satisfied with this handset camera quality for front camera is much more awesome then handsets at this range .:) :) Don't think Just go for it. :) And Last but not the least Flipkart's delivery Rocks :)",
            "date": "19 Dec 2014",
            "name": "Vivek Thakur",
            "stars": "4 stars"
        },
        {
            "comment": "Loved this phone. Using last 2 moths facing no problem except faster battery drainage. Nonetheless, good product at affordable price.",
            "date": "19 Dec 2014",
            "name": "Aks2379",
            "stars": "4 stars"
        },
        {
            "comment": "I had recieved brand new Moto g 2nd Gen on 16th Dec 2014 which was booked on 14th Dec 2014. Handset was deffective with Audio speaker while incoming & outgoing calls. Now had request for replace it on yesterday but still no revert from flipkart.",
            "date": "19 Dec 2014",
            "name": "Milind Devrukh...",
            "stars": "1 star"
        },
        {
            "comment": "I liked it so much. Very classy phone. you are gonna mad behind it for sure. I would suggest to purchase it from FK.",
            "date": "19 Dec 2014",
            "name": "Divyachandra S...",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone on the day it was released. Around three months. I have used this device to the core and tested it. And this is what I felt after three months. 1. A good budget phone( good for people who change their phones very often) 2. Build Quality: Not that great. The phone kinda feels cheap and when it falls down, there are gonna be dents. So be careful. Dont make it fall or something :P 3. Display: Really good. 720p videos look awesome. Screen brightness under the sun is less could have been a bit more bright. 4. Performance: 1 gb ram. Initially, was a bit doubtful about it but trust me its a beast. I have nfs, real racing, asfalt 8 and rarely lags. Very rare. There is no doubt on performance for the price. I give it a 5 star. 5. Camera: Decent enough. Flash is good, HDR works well. 6: Battery life: Very bad. If you are a heavy user it wont even last for a day and for a moderate user it will last for day. 7. Gets heated up sometimes. 8. Sound quality is ohk not that great. This phone is well suited for people who want good performance at an affordable rate. If you are looking for good battery life not a good option but for the price its a beast. I personally felt the build quality could have been better and battery also. Rest everything is good.",
            "date": "19 Dec 2014",
            "name": "Raul Reddy",
            "stars": "4 stars"
        },
        {
            "comment": "the battery performance is very bad when compared to that of moto g and the head set sound quality provided with the device is very bad the battery is getting consumed even when no background apps are running personally i would not prefer it for any one",
            "date": "19 Dec 2014",
            "name": "Madhusudhan Reddy",
            "stars": "2 stars"
        },
        {
            "comment": "the phone looks premium and has good call quality,awesome speakers and lastly it will receive the android lollypop",
            "date": "19 Dec 2014",
            "name": "venus sethi",
            "stars": "5 stars"
        },
        {
            "comment": "performance----8out of 10 quality ------7out of 10 flipkart service 10out of 10 ............................",
            "date": "19 Dec 2014",
            "name": "kushal bhalodiya",
            "stars": "5 stars"
        },
        {
            "comment": "I had bought this phone as a gift. I had done plenty of research before buying this phone and everywhere this phone has got praises. Except for very few low rated reviews on flipkart. Unfortunately, I ignored these reviews thinking they were one-off cases and ordered the phone. Now, the 1st phone I got; 3G wasn't working and there was a buzzing sound coming from the earpiece during calls. I got it replaced. The 2nd phone had the same buzzing sound problem, but this time it was LOUD. So I got curious as how can 2 random phones could have the same defect. So I checked my friends' phones (around 3-4 moto g 2s) ALL HAD THE SAME PROBLEM! Just that the buzzing was very faint, but when I pointed it out, everyone could predominantly hear the buzzing sound. I requested for a replacement. The 3rd phone had the same problem, however the buzzing was very faint. Also, now the main speakers sound warped when I play songs with a lot of treble. I believe the people who complained about the speaker now. It is present in all the phones. I cannot believe that motorola is selling such crap now that they have established a decent enough market share in India. N many thanks to flipkart for giving me 3 replacements, just unfortunate that the product itself is a fail.",
            "date": "19 Dec 2014",
            "name": "Nahush Choudhari",
            "stars": "1 star"
        },
        {
            "comment": "Google, through Motorola, got a decent upgrade through this 2nd Generation Moto G. I also purchased MOTO G Ist Gen for 13999 and I now feel really having been duped into buying that 1st Gen crap. When devices like Mi3 got into our hands for same price as MOTO G 1st, it was a huge letdown for those who purchased 1st Gen, MotoG. That said, this is a decent device with middle ranking specifications and a camera that's just ok for casual photography. Nothing to boast about. The screen size is a good advancement over the previous iteration. But even at 12999, this is, in my opinion, a tad on the higher side of pricing. Now that we have Redmi1s & Mi3 as price reference, I believe that this a highly overpriced gadget. Presently we have many options in this price range where we can get better phones at lesser price points. If one can live with \"late\" updates, Huawei Honor at 6999 is a better option.",
            "date": "19 Dec 2014",
            "name": "Rakesh",
            "stars": "3 stars"
        },
        {
            "comment": "The icons appear ungainly big. This is mainly due to big screen and small resolution. I always like the old Moto G than this second generation phone. The build quality is very nice though. The USB cable, like first generation phone, doesn't detach from the charger.",
            "date": "19 Dec 2014",
            "name": "Vaibhav",
            "stars": "3 stars"
        },
        {
            "comment": "This phone is gud as per its price..has excellent camera..which when u compare it with LG L90 8 MP is far better...Its been 19 days m using this phone....had captured photos around 800,only there I found some hanging problem..Backup is fair enough for the day..sound quality is not so good as expected.. By this time product's price should be reduced.",
            "date": "19 Dec 2014",
            "name": "shraddha",
            "stars": "4 stars"
        },
        {
            "comment": "i bought moto g in october, very good service from flipkart, but after 50 days, my mobile switched off on its own, and then i couldnt start it, then i gave it to service centre, they told me that its main board gone off, so it has to be changed and that will take around 10-12 days. after 12 days again they are telling that it will take more 12 days. i mean with new product company has not got parts of it. will not buy any motorola product in future.",
            "date": "19 Dec 2014",
            "name": "rohan vyas",
            "stars": "1 star"
        },
        {
            "comment": "Pros: 1. Touch is smooth. 2. Display is brilliant. 3. Very much responsive, notice no lag or delay. 4. Camera is ok. Cons: 1. The moto g version2 battery performance is very much disappointing. As it could last long, with heavy usage of 3g & GPS, not more than 2-3 hours and, with regular use, not more than 7-8 hrs. 2. Low light photography not well. 3. Speaker volume is not good. It becomes difficult to talk while on road. 4. Headphone quality too is substandard. 5. Takes 3-4 hours to get fully charged.",
            "date": "19 Dec 2014",
            "name": "Varun Agarwal",
            "stars": "3 stars"
        },
        {
            "comment": "Battery back up is very bad and gets Heated. Motorola and Flipkart please do something. I have got Moto E 2nd Generation and Sony Xperia C. Sony Xperia C has awesome battery back up. Moto E 2nd Gen is also pretty good. But MOTO G 2nd Gen Battery back up is very bad. Please get an upgrade and solve this issue. Apart from this phone is good. Looks good and works good. I Love flipkart for the delivery and service. Waiting for their reply.",
            "date": "19 Dec 2014",
            "name": "Kaushik Anchaliya",
            "stars": "2 stars"
        },
        {
            "comment": "value for money ........excellent in terms of features ....must buy product n outer material of the phone is quite tough which makes its durability lasts longer.......",
            "date": "19 Dec 2014",
            "name": "mihir vedia",
            "stars": "4 stars"
        },
        {
            "comment": "1.Android OS, v4.4.4 (KitKat), upgradable to v5.0 (Lollipop) 2.CAMERA 8 MP/2 MP with LED flash 3.BATTERY 2070 mAh 4.16 GB, 1 GB RAM, microSD, up to 32 GB 5.Corning Gorilla Glass 3 6.No LTE 4G 2300 Mhz",
            "date": "19 Dec 2014",
            "name": "Daniel Mascare...",
            "stars": "5 stars"
        },
        {
            "comment": "very good product. very fast delivery by flipkart. I am enjoying by using this phone. thanks to flipkart.",
            "date": "19 Dec 2014",
            "name": "sri devi",
            "stars": "5 stars"
        },
        {
            "comment": "its good handy phone with the best ptice,,,,,,,,,, i love it,,,,,,,,its worthy compared to other brands with the same configuration,,,,,,,",
            "date": "19 Dec 2014",
            "name": "KIran H K",
            "stars": "5 stars"
        },
        {
            "comment": "Hi i got this mobile on 18-Dec, i order on 16 Dec, after using 3g in mobile ,it is Producing heat on use of 10 minits.",
            "date": "19 Dec 2014",
            "name": "Sudhan Radhakr...",
            "stars": "1 star"
        },
        {
            "comment": "In march 2014 I have purchased MOTO G 16 GB first Generation, the only issue was unavailabiity of Memory card slot. In 2 nd Gen MOTOROLA has provided all required features. Phone is having excellent speed & display quality. Must buy.",
            "date": "19 Dec 2014",
            "name": "Dhaval Dave",
            "stars": "5 stars"
        },
        {
            "comment": "Bought this for my sis on her Birthday, MOTO G 2nd gen is really worth the price infact the best phone at this price. After gifting it I feel that i should have brought it for myself ;)",
            "date": "19 Dec 2014",
            "name": "SYEDA SHAGUFTA",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Pure android experience No bloat wear Only device with L (other than nexus) All day battery crisp display Changeable back covers As always Best service from Flipkart.",
            "date": "19 Dec 2014",
            "name": "Sujith",
            "stars": "5 stars"
        },
        {
            "comment": "This is my third phone after iPhone and Galaxy S3. I am already in love with this phone. Slim, Sleek design and superb looks. No issues with battery backup. Superb phone under 13K. Better than Asus Zenfone5...Primary and Secondary Camera quality is also good..Must go for this if looking for a phone under 14K..",
            "date": "19 Dec 2014",
            "name": "Divy Mohan Shorey",
            "stars": "5 stars"
        },
        {
            "comment": "FANTASTIC! Just go for it. 1. A qualcomm snapdragon(**quad core**) 2. Adreno GPU, 5 inch 3. 1 GB RAM 4. Long battery life 5. Google Update support(you will get Lollipop update) What else do you need! Unlike \"copycat Micromax\" adn, who use shitty processors or \"Shame-sung\" fooling people, this quad core will give you amazing performance, and fast graphics. Motorola is a developers company, you will get long life hardware.",
            "date": "19 Dec 2014",
            "name": "Nilanjan",
            "stars": "5 stars"
        },
        {
            "comment": "i bought this in september 2014.it worked great for 1 month and after all the problem arises.i cant hear what the other person is telling and also he cant hear what i am saying,bad quality speaker with full of jigling sound even when not in use,sim slot 1 was not detecting,automatic off,hanging,heating,wifi complaint etc.so its my request for people going to buy this not to buy motorola(BRAND) instead you can buy indain brands.If you are not believing me ,you can buy this.but all you want to know is that your nightmare will start on that day you are buying this.",
            "date": "19 Dec 2014",
            "name": "Hemanth Manika...",
            "stars": "1 star"
        },
        {
            "comment": "I did lot of research before buying this phone actually. Finally made my mind to buy this phone. After ordering I got the phone with in 24hrs, thank you Flipkart for the fast delivery. I am using this phone since few days and its really good. You can buy this phone without thinking much. Note: Battery is the only problem it has just 2070 mAh power.",
            "date": "19 Dec 2014",
            "name": "Gopal Mn",
            "stars": "4 stars"
        },
        {
            "comment": "Everything's good, It's fast, allows multiple apps at a time, no lags. Best part of it it has a good camera with focus and burst imaging. The sound of the speakers are crisp and loud. Only regret that the battery could have been better. Normally, the phone perishes after 3 - 4 hours of GPS use or 3G browsing. !!!!",
            "date": "18 Dec 2014",
            "name": "Jagannath singh",
            "stars": "4 stars"
        },
        {
            "comment": "This phone is just brilliant.As we already know that its a budget phone with some nice specs but my phone is having one severe problem for which i am suffering till date that sometime my phone's touch goes unresponsive and after a reboot it starts operating normally.i contaced moto g customer executives but they never solved the problem correctly.maybe i am the only person who is having this kind of problem wid my phone.otherwise this phone is awesome go for it.",
            "date": "18 Dec 2014",
            "name": "S.J",
            "stars": "5 stars"
        },
        {
            "comment": "The phone is looking superb,light weight,I tested this product by surfing the internet continusly for 9 hours till charge remains 7%,I played games for 2 hours continuously I heats only very little its negligible, even u can avoid that by cooling by means of CM security, the phone is superb speed but don't install high end games",
            "date": "18 Dec 2014",
            "name": "Navas",
            "stars": "5 stars"
        },
        {
            "comment": "I have been using the phone for 2 weeks now. The phone is excellent in every aspect and a value for money. Call quality is very good and loud (which is a missing feature on most of the smartphones today). Camera on both sides are decent enough resolving enough details.Although, in some other phones , the front camera is more focused on selfies, but the one in Moto G2 is decent enough for video chats and casual selfies.And yeah, I feel that the battery could have been a bit better.",
            "date": "18 Dec 2014",
            "name": "Santosh Pradhan",
            "stars": "5 stars"
        },
        {
            "comment": "great phone with stock android......easy handling n good specs at this price level..............................................................................................................camera is ok....and battery hardly last for just one day.",
            "date": "18 Dec 2014",
            "name": "Karthik Tadigiri",
            "stars": "5 stars"
        },
        {
            "comment": "It is an awesome looking product much better then samsung grand and any other mobiles of this price range.",
            "date": "18 Dec 2014",
            "name": "Subhajit Das",
            "stars": "5 stars"
        },
        {
            "comment": "Using this phone since 10th spetember 2014. Its an amazing phone. playing some high end games like dead trigger, asphalt 8 etc. The phone is without any lag and battery does stay like 2 days.. Iam a medium user with playing games 2-3 hrs a day, listening musing 1 hr and using whats app like 2-3 hrs a day and i charge it after 2 days. heating issues are there but after a week or so its solved. Till date i havent faced any issue. No hanging, laging, heating or network drop issue. just a amazing phne.",
            "date": "18 Dec 2014",
            "name": "krish",
            "stars": "5 stars"
        },
        {
            "comment": "Best phone in this range, must buy. everything is awesome as according to your budget, dont think so much that ram 1gb processor not latest.. this phone is comes with stock android which require less ram also lags very low as compare to modified in samsung sony etc. dont go for any chinese like redmi note.. buy this.",
            "date": "18 Dec 2014",
            "name": "sidharth mehta",
            "stars": "5 stars"
        },
        {
            "comment": "moto is no more, pathetic customer service n it's worst brand till date n they are not repairing phone only charging unreasonable price from customer, i'll never suggest this phone to anybody. plz don't buy moto phone it's my humble request to everyone.",
            "date": "18 Dec 2014",
            "name": "Naveen",
            "stars": "1 star"
        },
        {
            "comment": "Purchased Moto G 2 mobile 2 months back. Software is upto date, Camera is excellent, even in low light. Excellent product even though battery back up is not upto the mark. Finally, surfing internet and using social sites give uptimum performances. Value for moner.",
            "date": "18 Dec 2014",
            "name": "Great",
            "stars": "5 stars"
        },
        {
            "comment": "I am removing my earlier MI3 positive feed back (against Moto G2). MI3 will work only for few days,after that always problems (like many people told, I agree now), now I have given my MI3 in service center, but always telling that parts not available from past 4 weeks. I am really frustrated about MI3 service center. I see huge crowd always,You will get your time only after 5 hours of waiting there. My work order number is QCI/XM/15/00032 Moto G2 is working fine as of now.",
            "date": "18 Dec 2014",
            "name": "D Venkateswarlu",
            "stars": "3 stars"
        },
        {
            "comment": "best phone with 5\" screen size i bought it for my friend he is vary Happy with this. very nice phone.",
            "date": "18 Dec 2014",
            "name": "DK Arya",
            "stars": "5 stars"
        },
        {
            "comment": "In love with Motorola products. Waiting for more at higher segments. There are Cons, but can be accepted for less cost. Services information should be provided.",
            "date": "18 Dec 2014",
            "name": "Hemanth",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent mobile for my specific needs. Good storage space and user friendly mobile. Lots of applications supported with ease",
            "date": "18 Dec 2014",
            "name": "Shankar Madhavan",
            "stars": "5 stars"
        },
        {
            "comment": "i would have opted more stars if available. service part was beyond compare. the new set was developing some problemand it was changed within days and no questions asked....full marks",
            "date": "18 Dec 2014",
            "name": "navtej",
            "stars": "5 stars"
        },
        {
            "comment": "i have purchase 1 moto g 2gen mobile.after use this product i have purs. more 2 mobile for my bro & sis. borth r happy.....",
            "date": "18 Dec 2014",
            "name": "Hitesh Patel",
            "stars": "5 stars"
        },
        {
            "comment": "first of all very late delivered some products are delivered next day but this took too long anyways the phone is cool good features in this prize range stylish with big display",
            "date": "18 Dec 2014",
            "name": "kaushik jadav",
            "stars": "5 stars"
        },
        {
            "comment": "Now, its almost 3 months with the phone. Overall I am good with the Moto G. Display, sound and software is great as expected. However, I found moto G 2nd generation slower then the first generation. The phone hang when you download a few apps from the store. all display icons become invisible and its become dead for a few seconds. apart from this single complain, I am happy with the device. Moto needs to work on the problem, probably a processor update or software improvisation can solve this problem. at last, great phone at this price.",
            "date": "18 Dec 2014",
            "name": "Virendra Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using this phone since last 2 weeks. Overall a good phone. But some cons: 1) Takes 3 hours to charge full battery. It last for 30-36 hours depending on usage. 2) Notification tones and ringtone level remains same. There is no separate settings for setting notification tone low. 3) Personal mail syncing sometimes does not work and has to be done manually. May be one time issue. 4) Does not come with a USB cable. Flipkart delivered the product before the scheduled delivery date.",
            "date": "18 Dec 2014",
            "name": "Shridhar Toshn...",
            "stars": "4 stars"
        },
        {
            "comment": "my mobile was sttolen by someone..i cant give it star review because i bought it for my brother nd when i was in train my mobile has stoolen by anyone....if possible plz blok that mobile code...",
            "date": "18 Dec 2014",
            "name": "sudha",
            "stars": "3 stars"
        },
        {
            "comment": "you wont get any thing else better then this in this range. every phone have big specifications but their quality matters.",
            "date": "18 Dec 2014",
            "name": "Rishi Shrivas...",
            "stars": "5 stars"
        },
        {
            "comment": "the mobile deliverd was repacked as it was not sealed so kindly take the action on the supplier thank u",
            "date": "18 Dec 2014",
            "name": "mehul durgani",
            "stars": "1 star"
        },
        {
            "comment": "Flipkart service is very nice and safe packing, Very much satisfied with this Moto G (2nd Gen) worth for price and simply good.",
            "date": "18 Dec 2014",
            "name": "Ashok A",
            "stars": "5 stars"
        },
        {
            "comment": "its a very good phone ever I had used so far...Awesome camera .... High resolution, screen sensitivity , long lasting battery back up. Most of the applications are comparable.",
            "date": "18 Dec 2014",
            "name": "Rajukumar Sur...",
            "stars": "5 stars"
        },
        {
            "comment": "i have purchased moto g 2 in September and till now it is going very good, its interface touch,camera,speed,battery backup are mind blowing. I am recommended to you to this mobile.",
            "date": "18 Dec 2014",
            "name": "Krishna Murari",
            "stars": "5 stars"
        },
        {
            "comment": "It takes 2 days to receive. Awesome. Moto G is a very reliable budget handset Which will fulfill almost all your requirements. Good camera. Back cover should be strengthened more. Overall a suggestible one.",
            "date": "18 Dec 2014",
            "name": "Manzur Beeran.P",
            "stars": "3 stars"
        },
        {
            "comment": "I already bought moto g 1st gen ..I really impressed with Moto g ..... So I buy one more motog 2nd gen for my family but I cannot comfortable with that!! 1.Touch was not that much smooth. 2. Messages also typed discomfort. That is double time or more touched then only gone. Flip cover also got prob that s without magnetic lock. Replaced cover also same problem.",
            "date": "18 Dec 2014",
            "name": "Priya",
            "stars": "3 stars"
        },
        {
            "comment": "I have purchased Moto-G(16GB) from Flipkart (IMEI No:353321066674527) on 23.09.2014. From the 1st day receiving speaker very noisy,and some how i managed till date but day by day i cannot hear receiving voice and Handset hand over today(18.12.2014) for service work to Motorola authorized service center(M/S:Vinayaka communication,Coimbatore). Hope that problem will be solved.Otherwise the phone is good in all aspects.Awaiting for Handset.",
            "date": "18 Dec 2014",
            "name": "Ramamoorthy",
            "stars": "3 stars"
        },
        {
            "comment": "Ordered for moto g 2nd gen (Black) last week, But I got totally AWKWARD COMBINATION of Mobile phone and accessories. BLACK COLOR PHONE WITH WHITE COLOR ACCESSORIES. requested to change it but denied. After one week of use, facing MORE PROBLEMS like WI-FI CONNECTIVITY AND HANGING PROBLEM. Requested to replace it BUT REQUEST AGAIN TURNED DOWN. If flipkart has to turned down every request then Y showing the status at home page \"30 days replacement guarantee\". I wanted to buy google phone thats the only reason I came to FLIPKART but I think I made a mistake which I have to pay now. I WILL NOT BUY ANYTHING FROM flipkart in the future.",
            "date": "18 Dec 2014",
            "name": "vkg",
            "stars": "1 star"
        },
        {
            "comment": "Spec and performance wise it's a sturdy phone. But all the model I received had a defect. I didn't return the last replacement in fear that I might get worst phone. The phone I received had fused LED on the screen.",
            "date": "18 Dec 2014",
            "name": "javed mohammed",
            "stars": "3 stars"
        },
        {
            "comment": "Phone is awesome. No match at this price!! Better than Moto G first gen No issues at all. You'll be pleased by its performance.",
            "date": "18 Dec 2014",
            "name": "Garish Gargish",
            "stars": "5 stars"
        },
        {
            "comment": "Very good product, received product within a day, used the product extensively without any issues. Looking forward to more exclusive purchases from flipkart",
            "date": "18 Dec 2014",
            "name": "Shanu Mathew",
            "stars": "5 stars"
        },
        {
            "comment": "I ordered Moto G2 in flipkart on 12th Dec'14 and the delivery was scheduled on 20th Dec'14. But yesterday (17-12-14) in Tracking Order there was a message that \"Your order is out for delivery\". But today 18-12-14 the order was cancelled and the following message received to my mail \"We regret to inform you that our courier partner was unable to deliver following items in the Order OD201524143487280300.\" It is very worst experience in Flipkart I had.",
            "date": "18 Dec 2014",
            "name": "Jayakumar N",
            "stars": "1 star"
        },
        {
            "comment": "Since specs are available on the net, just a quick notings of experiences:- Pro's - Good solid build and feel - Flip cover also available on flipkart strongly recommended - Good Camera both in still and video - Average battery life - Gorilla glass screen - no screen guard required Con's - A little under powered - lag while switching apps / sluggish response - Mini SIM so get yours cut / changed in advance :) - Camera could have been better For the price point and reliable performance - recommend it !",
            "date": "18 Dec 2014",
            "name": "Vinayak",
            "stars": "4 stars"
        },
        {
            "comment": "Th phone is just superb...it is full 'Paisa Vasool' has got great features and I like evrything about it. Totaly satisfied with it. And hats off to flipkart...within 24 Hours delivery from Bangalore to Pune.",
            "date": "18 Dec 2014",
            "name": "Harshal Mistry",
            "stars": "5 stars"
        },
        {
            "comment": "Using this from the last 3 months, I can say this is a good pick among the mobiles in the same range, audio, screen, size, portability etc., everything is good. Only remark is its battery is not satisfactory, when I say satisfactory, it is up to me, some of my friends say this is good.",
            "date": "18 Dec 2014",
            "name": "Yella Prabhu s...",
            "stars": "4 stars"
        },
        {
            "comment": "Have been using this phone since a month. Very Smooth operation. No lag. Front Speakers works fantastic and create a good experience while viewing videos. But the battery life could be better. Overall best to buy",
            "date": "18 Dec 2014",
            "name": "Erramilli Naga...",
            "stars": "5 stars"
        },
        {
            "comment": "i got this phone in next day from purchase date, but i paid 90 rs extra for express delivery, i thought they should provide free delivery next day it amount is more than 5000 rs..... over all it is ok, not really impressive, so far so good....",
            "date": "18 Dec 2014",
            "name": "PLASTOTECH CONTAI...",
            "stars": "1 star"
        },
        {
            "comment": "Hi all, I am using this phone from last two months the phone is very good,but 3G network selection is difficult.....If any body knows how to enable the 3g network please let me know............The product got delayed due to the big billion day but after calling the flip kart the customer executive solved the problem in the delay of the product thank you flip kart.",
            "date": "18 Dec 2014",
            "name": "Ramesh Kamble",
            "stars": "5 stars"
        },
        {
            "comment": "Few weeks back, our new moto G2 got superheated while charging, and its switched off permanently...... But the service center quickly responded for our request & replaced our fault piece with a new box piece.... Hats off for service... Overall performance is good.... Only drawback is quadcore processor, instead of octacore...",
            "date": "18 Dec 2014",
            "name": "Karthigeyan Sekar",
            "stars": "4 stars"
        },
        {
            "comment": "BEST OF THE REST AT THIS PRICE TAG USING PHONE SINCE LAST 4 DAYS ITS NOT JUST PROS AND CONS , ITS PRO'S, OK'S AND CON'S PROS: 1. GOOD AND FAST PROCESSOR - NO LAG 2. CALL QUALITY TOP NOTCH WITH NOISE CANCELLING 3. PURE KITKAT WITH GUARANTEED \" L \" UPGRADE. 4. LOW LIGHT PICTURES IN CAMERA EXTEREMLY GOOD. 5. LAST BUT NOT LEAST - SOLID BUILD QUALITY. 6. EXPANDABLE MEMORY. OK'S 1.SCREEN PPI AND COLOR VIVIDNESS COULD HAVE BEEN BETTER. 2. CAMERA NOT THAT TOP NOTCH BUT NOT COMPLAINABLE.-GOOD FOR THIS PRICE RANGE 3. FRONT SPEAKERS- MANY PEOPLE PRAISE ABOUT THE FRONT SPEAKERS , BUT IT REALLY IS NOT THAT LOUD, THIS IS MY 5 TH PHONE IN 3 YEARS AND SO I CAN EASILY FIND THE DIFFERENCE. 4. MUSIC AND SOUND OUTPUT QUALITY NOT GREAT BUT OK, EVEN WITH HEADPHONES. 5. FINGER PRINT MAGNET BACK COVER. 6. BACK PANEL LITTLE SLIPPERY. 7. FOR SOME HIGH END GAMES PROCESSOR HAS SOME LAG. 8. COULD HAVE DONE WITH A BETTER CUSTOMIZED UI , STOCK ANDROID (EVEN THOUGH THE LATEST KITKAT) FEELS VERY CHEAP AND NOTHING SPECIAL. BUT THIS CAN BE OVERCOME BY PURCHASING EVERYTHING ME LAUNCHER OR THEMER APP WHICH IS THE GREATEST IN UI CUSTOMIZATION HOME REPLACEMENT AVAILABLE TODAY IN ANDROID STORE. CON'S 1. THE SCREEN BRIGHTNESS IN IN DEFAULT WITHOUT BRIGHTENING IS TOO TOO LOW , EVEN FOR INDOORS IN A HALF LIT ROOM. JUST INCREASE THE BRIGHTNESS BY ONE POINT AND EVERY THING IS FINE. 2. NO DLNA AND NFC. 3. NOT A VERY GOOD AUDIO CODEC. 4. LAST BUT NOT LEAST , BULL SHIT EAR PHONES, COULD HAVE DONE BETTER WITH JBL IN EARS. SUGGESTIONS: 1. COULD HAVE DONE WITH AN MORE GRIPPIER BACK PANEL. 2. A BETTER HEADPHONES. 3. COMPLETELY CLOSED FRONT DUAL SPEAKER VALLEYS. IF YOU KEEP THE PHONE DIRECTLY UNDER A LIGHT AND LOOK AT THE EDGE OF THE SPEAKERS YOU CAN ACTUALLY FIND THE BOTTOM FROM WHERE THE SPEAKER EMERGES, NOW THIS SMALL GAP CAN BE PRONE TO DUST AND SWEAT WHICH CAN GO INSIDE. 4. USB PLUG-GABLE CHARGING PLUG. 5.3000 MAH BATTERY. THATS IT, FINALLY IT IS A GOOD PHONE, EVERY THING HAS ITS PROS AND CONS, WELL YOU CANT EXPECT GALAXY S5 ALPHA FEATURES AND SELL FOR 13 K, BUT WORLDS FIRST MOBILE PHONE MANUFACTURER AND POWERFULL ANDROID MAKES DEADLY COMBINATION, THERE ARE PHONES LIKE KARBONN, ALCATEL, XIAOMI M1 WHICH MAY HAVE DOUBLE SPECS AND SELL AT THE SAME RATE OR SLIGHTLY HIGHER. BUT CANNOT BE COUNTED FOR ENDURANCE. BECAUSE MY 4 YEAR OLD MOTOROLA ATRIX 4G STILL SMOKES SOME OF TODAY'S NEW AND GOOD PHONES FROM TOP MAJOR INTERNATIONAL MANUFACTURERS IN ALMOST EVERY RESPECT. HENCE MY OPINION \"\"\"\"\" GOOD DEAL \"\"\" And 3 Day Super Fast Delivery By Flipkart",
            "date": "18 Dec 2014",
            "name": "Linus Elias Ge...",
            "stars": "4 stars"
        },
        {
            "comment": "Really i appreciate Flipkart team with Quick Delivery System. Phone is awesome. you will get all features in this phone.",
            "date": "18 Dec 2014",
            "name": "Manish Kumar",
            "stars": "4 stars"
        },
        {
            "comment": "i have used moto g for 2 months and i haven't seen any issue with the mobile. yes battery drains fast but it will remain atleast 18 hours which is not bad. surely you can buy this mobile without any doubt.",
            "date": "18 Dec 2014",
            "name": "Rahul Mishra",
            "stars": "5 stars"
        },
        {
            "comment": "In 13k not a bad deal at all. performance good, all disadvantages of moto G1 gone...only disadvantage remain is its battery life. otherwise nice phone...GO for it.",
            "date": "18 Dec 2014",
            "name": "Mayank Chaudhary",
            "stars": "4 stars"
        },
        {
            "comment": "ONE OF THE BEST PHONES AVAILABLE IN THE MARKET. RUNS LIKE BUTTER. I ALSO THANK FLIPKART FOR ITS HASSLE FREE DELIVERY . PACKAGING WAS UPTO THE MARK.",
            "date": "18 Dec 2014",
            "name": "DARA ERFAAN",
            "stars": "5 stars"
        },
        {
            "comment": "over all its very nice mobile....defect is it take more time to charge,..............................................................................................",
            "date": "17 Dec 2014",
            "name": "Mohith Raghavan",
            "stars": "5 stars"
        },
        {
            "comment": "Got the phone in just two days after ordering.The phone looks great and the i like the display very much.Battery life is average but it takes a bit more time to get fully charged.The phone works smooth and doesn't lags at opening apps.Camera quality is excellent and I'm in love with the slow motion feature.The best phone under 13000 price range.",
            "date": "17 Dec 2014",
            "name": "Ashish Poonia",
            "stars": "5 stars"
        },
        {
            "comment": "Shopping Experience: I tried placing the order atleast 7 times before finally placing it. 2 times it went out of stock, and even after placing my email for a notification of availability, i didnt get any email. While placing the order, the offers kept changing every second, and finally the product went out of stock ! Finally, I had to place my order like i was catching a Shatabdi Delivery of Product : I ordered the product and was given an estimate of Dec 16 for delivery. I received it on Dec 12. 5 stars for delivery and package quality. The Product itself: I had checked the technical configuration and found it to be pretty good at this price range. saw useful comparisons with LG 90, but looking at the number of pieces sold, i went for Moto G. The appearance of the phone is very classy, the white color gleams out. Battery backup is pretty good with average calls, gaming and net surfing. I believe it could last more than 2 days if not fiddled much. I did experience some heating while playing Gunship battle around the camera lens. The Andriod version takes some time to get used to after you have used a Samsung. Camera quality is quite good, I did see some concerns for the Moto E camera, but now im fine. The size is as large as Nexus and takes a day to get acquainted to after you've used a 4 inch screen. If you have the above 10 budget, you can go for it. Thanks",
            "date": "17 Dec 2014",
            "name": "Aman D",
            "stars": "4 stars"
        },
        {
            "comment": "i m using this phone from last 1 week. its really awsm. camera is better then nexus 5. one of my friend has nexus 5 we compared our comera n moto g 2 wins :). apart from this im playing asphalt 8 and dead trigger 2 without any lag and heating issue so gaming is also awsm, in short best buy. dont thnk just go for it",
            "date": "17 Dec 2014",
            "name": "Vivek Pandey",
            "stars": "5 stars"
        },
        {
            "comment": "This is the best phone in this range, all features are good enough. Only problem with the phone is battery backup.",
            "date": "17 Dec 2014",
            "name": "sai shravan",
            "stars": "4 stars"
        },
        {
            "comment": "its a budget phone with all features pros: video clarity ,sterio speakers are good cons charging is not that much good camera is not great in night time with flash",
            "date": "17 Dec 2014",
            "name": "Veerababu Ramakurthi",
            "stars": "4 stars"
        },
        {
            "comment": "Configuration is good, but make is cheap, already power button is loose enough to hang out. Motorola shuld chk out the hardware too, rather spoiling the brand.",
            "date": "17 Dec 2014",
            "name": "vivek singh",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G2 looking very good and clarity very nice but some battary problem its very low dfdggdfgdfgfffffffffffffffffffffff",
            "date": "17 Dec 2014",
            "name": "murti",
            "stars": "5 stars"
        },
        {
            "comment": "If u r stock android lovers go for this. This is the best mobile. It meet all the basic requirement a mobile should have and a person should hold in their hands. Design is OK thing, not great processing is good. Fits perfectly in the hands bcz of curved back. Good to have removable back shell atleast, so that we can use different coloured back shells Only dropout I felt badly with this mobile is battery backup. It is draing too fast. I hope lollipop update will helpout in this matter. Definetly if u r is travelling out of staton, one should carry backup battery for sure. I want to add one more thing is, flipkart gave awesome delivery, they delivered this in just 30hrs after I placed the order.",
            "date": "17 Dec 2014",
            "name": "Purna Chandu B...",
            "stars": "4 stars"
        },
        {
            "comment": "I ordered the phone on its launch day....Flipkart was giving so much offers on launch day...but almost all were useless....Delivery is on time...The phone is a good one with very good performance...Initially Battery performance was very bad....but after a few days battery performance improved....The rear camera is very bad with respect to a Nokia with Carl Zeiss lens....low light performance is below the line. Otherwise its a good buy...Slim nd Sexy phone... Very good display....The price should be within 10k.",
            "date": "17 Dec 2014",
            "name": "CHANDAN GARAI",
            "stars": "4 stars"
        },
        {
            "comment": "Great phone. great display. poor battery performance. need to improve a lot on battery. otherwise great phone. flipkart is good.",
            "date": "17 Dec 2014",
            "name": "Narayanan R",
            "stars": "4 stars"
        },
        {
            "comment": "For this cost, this is the best option compared to Asus. But battery backup is not that good compared to windows mobiles :)",
            "date": "17 Dec 2014",
            "name": "Anandha Raj Jeyab...",
            "stars": "5 stars"
        },
        {
            "comment": "Best buy cell phone at this price. Feels great in hand. Feels good in quality and performance. Overall, just go for it.",
            "date": "17 Dec 2014",
            "name": "Anurag Jaiswal",
            "stars": "5 stars"
        },
        {
            "comment": "30 to 40 percent battery charge is going off even when it is not being used at night. it is getting heated up.",
            "date": "17 Dec 2014",
            "name": "sanga",
            "stars": "3 stars"
        },
        {
            "comment": "best in class, best in performance.. best in all.. no lag, smooth performance.. superb camera.. smooth processor..",
            "date": "17 Dec 2014",
            "name": "rohit nigam",
            "stars": "5 stars"
        },
        {
            "comment": "Very good phone at this price. This has everything that a phone should have. And the best thing is that it has stock android.",
            "date": "17 Dec 2014",
            "name": "Gaurav Rajput",
            "stars": "5 stars"
        },
        {
            "comment": "Good product and fast delivery i am very much satisfied with the product.... got delivered in two days after purchasing the item ;-)",
            "date": "17 Dec 2014",
            "name": "Marx Prathap S...",
            "stars": "5 stars"
        },
        {
            "comment": "Awesome phone ...i am using i from last 25 days..i dint found any problem till now...battery is also good ...very fast.................................:)",
            "date": "17 Dec 2014",
            "name": "Praveen Parihar",
            "stars": "4 stars"
        },
        {
            "comment": "well its my second order for the same mobile but for my sister this time. very nice product under 12k . i have been using it for past 2 months and I did not find any issue so far . although sound quality could have been somewhat better.",
            "date": "17 Dec 2014",
            "name": "BIRENDRA YADAV",
            "stars": "4 stars"
        },
        {
            "comment": "I bought this phone on launch day, Didn't got promotional offers, had to write repeated emails for Launch day offers. Than 5% cash back from HDFC Debit Card was never received. Phone - 5 star Flipkart - 1 star Average Exp - 3 star",
            "date": "17 Dec 2014",
            "name": "Himanshu Gupta",
            "stars": "5 stars"
        },
        {
            "comment": "i bought a nw motorola moto g it was amazing.....! the only one reason i gave 5star bczzz compare the features between other mobiles in same rate any 1 mobile can doesn't beat moto g 2nd gen............",
            "date": "17 Dec 2014",
            "name": "krish bhat.",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: Design and build quality Battery is not that bad compared to zenfone5 Display is good. 5 inch and expandable memory. People who want more storage will find it useful. Cons: Camera is not that good. Audio clarity is worst when compared to Moto G 1st",
            "date": "17 Dec 2014",
            "name": "Prasanna S",
            "stars": "4 stars"
        },
        {
            "comment": "Moto G as name suggest its nice mottu it really good to bye this mobile i got this product in discount of 1250,display camera everything is nice am enjoying it battery 16hr u will get.",
            "date": "17 Dec 2014",
            "name": "Thejesh",
            "stars": "4 stars"
        },
        {
            "comment": "I got Moto G 2nd Gen on an amazing price for Rs 11749. After 10 days of use, ohh boy!! It works like a charm. Only con is the battery, but since I'm not into heavy gaming, it lasts 24 hours easily for me. Though I would rate the Flipkart Logistics Service 1 STAR. They stopped the delivery of Moto G all across Noida once the price went down. I had to order this to my friends place in Delhi.",
            "date": "17 Dec 2014",
            "name": "Nitin Sharma",
            "stars": "5 stars"
        },
        {
            "comment": "worth value. quality pics, super sound. Best in the category. I simply love it. Now going to purchase one more for my wife on her b'day. .",
            "date": "17 Dec 2014",
            "name": "kaushal",
            "stars": "5 stars"
        },
        {
            "comment": "I bought this mobile for 8000/- on exchange of my old mobile with flipkart on bigBillion day sale happened in october. First mobile which I received has few display problems and flipkart replaced with brand new one immediately after my complaint. I simply love flipkart service and price cuts always tempt me to buy from flipkart. -Swamy.",
            "date": "17 Dec 2014",
            "name": "Swamy",
            "stars": "5 stars"
        },
        {
            "comment": "Excellent product. Value for money. This is my third Moto G 2nd generation order. I ordered it for my friend. Nice phone.",
            "date": "17 Dec 2014",
            "name": "Raghavendra G...",
            "stars": "5 stars"
        },
        {
            "comment": "Moto G Problem he Mobile Heating Problem and Network error Battery Backup Problem Only White mobiles",
            "date": "17 Dec 2014",
            "name": "RAHUL KAMBLE",
            "stars": "1 star"
        },
        {
            "comment": "very good phone, v.good camera, good features, very sleek but it has micro sim so i have to cut it and just in 13k",
            "date": "17 Dec 2014",
            "name": "Ashok Dhabalia",
            "stars": "5 stars"
        },
        {
            "comment": "Good Phone. .",
            "date": "17 Dec 2014",
            "name": "Tridip",
            "stars": "5 stars"
        },
        {
            "comment": "Good handset with good battery backup (2g mode). Functioning well. I ordered on Monday and received the handset by wednesday, good service by flipcart. After putting Starz Flip cover, handset becomes heavy.",
            "date": "17 Dec 2014",
            "name": "Seenu",
            "stars": "4 stars"
        },
        {
            "comment": "I purchased this product one month back and the phone was working alright for few days. After few days the phone experienced some problem with not getting switched so i took to their authorized service dealers in pune. The experience has been horrendous since then, their service centers are shared by many multi brands and they have highly non-professionals at their service center. They committed that they will give an estimate and solution to the problem within 2 days but there hasn't been any communication after 2 days so i spoke to their service center and they claimed they will take another 7 days to give me an estimate and when i insisted that i need it urgently they replied in an irritating manner to contact motorola. The customer care of mototrola also is not equipped enough with info and they hung me up for around 30 mins to finally escalate the matter further. The matter will take another 2 days and till then i am clueless what this company is doing for its customer. The service level is below pathetic than any brand in todays market and i fail to understand how can a mobile take 7 days to identify the problem. Motorola is not recommended for its after service after the experince that i have went through and i was planning to buy for my mom but now i wont even recommend at all for their service standard. I request flipkart and its users to discontinue using moto phones till they resolve their service standards. Pathetic! Disgusting! Non-professional",
            "date": "17 Dec 2014",
            "name": "Sourav Lahiri",
            "stars": "1 star"
        },
        {
            "comment": "Moto g is a pretty decent mobile for its cost. Battery performance with stock android UI makes it look good.",
            "date": "17 Dec 2014",
            "name": "Kalyan Chandra",
            "stars": "5 stars"
        },
        {
            "comment": "Very Good ..........................................................................................................................................................................................",
            "date": "17 Dec 2014",
            "name": "Manish Dudia",
            "stars": "5 stars"
        },
        {
            "comment": "Pros: 1. Amazing Screen 2. 16GB internal storage 3. Battery backup is very good (Full battery giving one full day backup with regular usage like fb, whatsapp, playstore,games etc.) 4. Both Cameras are of good quality. 5. Full HD screen Cons: 1. Better if it has 2GB RAM.",
            "date": "17 Dec 2014",
            "name": "Bhanu Chander...",
            "stars": "5 stars"
        },
        {
            "comment": "I like the phone and interface. Motorola has improved a lot after jump into android version. Promising interface and handsfree features of motorola i like most.",
            "date": "17 Dec 2014",
            "name": "Sajid",
            "stars": "4 stars"
        },
        {
            "comment": "Hi , I bought the Moto G2 .All applications and camera quality good even though without charge how can I use. If they change the battery model I can say Moto G 2 is best smartphone",
            "date": "17 Dec 2014",
            "name": "Balaji Dhandapani",
            "stars": "3 stars"
        },
        {
            "comment": "every cell is having some pro and cons.,, its up to you what you want.. phone of ASUS is having less battery backup, xolo is having worst camera, samsung became common...",
            "date": "17 Dec 2014",
            "name": "Kshitj Kant",
            "stars": "5 stars"
        },
        {
            "comment": "Its all good, really love the phone, its worth the money, as compared to the Micromax and all that we get in this price band, the looks itself are rich and appealing :) as well as the performance too. :)",
            "date": "17 Dec 2014",
            "name": "Swapneel Golapkar",
            "stars": "5 stars"
        },
        {
            "comment": "i brought the phone few moths back its good. pros good camera quality processing is fast worth for money cons some times it get hanged need to switch off and on continuous use of wifi drains the battery soon touch response is not as good as 1st gen looks bulk in hand",
            "date": "17 Dec 2014",
            "name": "raj Varun",
            "stars": "5 stars"
        },
        {
            "comment": "Hi Everyone, I have bought a Moto G-2nd Gen (DEC-14 edition) from Flipkart. Flipkart packaging and delivery process can't be questioned. Mere holding it in hand gives you a feeling that it is superb. Though I haven’t started using it in full swing, on start up I found some unerasable/unscrachable/unremovable logo marks (specifically battery & back cover logos). I erased some of the logos by rubbing them with cotton after applying nail polish remover onto them. But this is not working for the battery & the back cover logo.",
            "date": "17 Dec 2014",
            "name": "Abhijit Nag",
            "stars": "4 stars"
        },
        {
            "comment": "Very Good Smart Phone in this budget, Instead of grand people can opt for this,with a good brand like motorola",
            "date": "17 Dec 2014",
            "name": "Abdul Mohsin",
            "stars": "4 stars"
        },
        {
            "comment": "The cell is really quick in all the work we tell it to do. No problems as such. Only urge Motorola to bring in the lollipop update as quick as possible.",
            "date": "17 Dec 2014",
            "name": "Khushru Battiw...",
            "stars": "5 stars"
        },
        {
            "comment": "Have to be the best phone for the price. Using it for over 9 months and it has been performing flawlessly in all departments",
            "date": "17 Dec 2014",
            "name": "Mustafa Husain",
            "stars": "4 stars"
        },
        {
            "comment": "Its a great Deal....................................... Very good phone in price range........................ Good Quality, premium look...................... Thanks Flipkart..........................................................................................................................................",
            "date": "17 Dec 2014",
            "name": "Amar Saxena",
            "stars": "5 stars"
        },
        {
            "comment": "Phone is not up to the mark as it always hang.. even my friends are also facing the same problem. The phone is not good. please try some other phone",
            "date": "17 Dec 2014",
            "name": "Thomas",
            "stars": "3 stars"
        },
        {
            "comment": "Everything is good except Call recording feature is missing which however can be achieved through Apps",
            "date": "17 Dec 2014",
            "name": "Vikas",
            "stars": "4 stars"
        },
        {
            "comment": "Nice product of its range... If you are android lover this is the best option in the range of 13k. It satisfies all your expectations from a smart phone If you are windows lover then ill strongly suggest to go for nokia lumia 730 as the look and feel of it is awesome.",
            "date": "17 Dec 2014",
            "name": "Harsha",
            "stars": "4 stars"
        },
        {
            "comment": "i got my moto g 2 on 16 december evening , i connected it to my wifi which it connected fine ,but after an hour it started showing it colors , no wifi signal , not even from one step from my wifi router , my hp laptop was connecting fine which was in the last room but not this moto g 2 . i request flipkart to return or exchange this defective piece .",
            "date": "17 Dec 2014",
            "name": "Aaditya Ady",
            "stars": "2 stars"
        },
        {
            "comment": "I was spell bounded and completely overwhelmed by the prepossessing sight of my new phone. The breath taking features and the mellifluous sound of its speakers are impeccable. The camera and video quality are verisimilitude to the real world. Playing games with such a riveting graphics quality is a feature that can only be explained while experiencing. The a la mode looks of this phone is something which can only be compared to itself coz i don't feel any other phone can stand in competition against it!!",
            "date": "17 Dec 2014",
            "name": "malay warankar",
            "stars": "5 stars"
        },
        {
            "comment": "My review title may confuse you ...but thats what i actually mean... Pro's: There are several pros ...camera n clarity is super good...user interface is good..the storage both internal and external works fine with good apps(ES3 file explorer) Con's : As you might have heard the network issues ...yes it troubles a lot...i m writing to moto on that too...post issues in their Fb page... General: I 've been using this G2 for two months now and i feel my money has not went down the drain...looks are cool feel comfortable with the cons so it dont pester you....",
            "date": "17 Dec 2014",
            "name": "Balaji Raghavan",
            "stars": "4 stars"
        },
        {
            "comment": "Got this delivered within 24 hours of purchase even without next day delivery option selected. Awesome service.",
            "date": "17 Dec 2014",
            "name": "Rajat Mahajan",
            "stars": "5 stars"
        },
        {
            "comment": "I'm using this phone, this is good. Just missing exposure on camera and hi resolution 3d graphics fully not supported.",
            "date": "17 Dec 2014",
            "name": "Pramatha Patra",
            "stars": "4 stars"
        },
        {
            "comment": "The touch from extream right and left end of the screen is not working properly when i have to drag from the corners. camera at the lock screen is very difficult to get it out , same in the case when i have to get the status bar when the screen is rotated horizontally, it comes down after some tries. please solve my problem. on the other phone is working perfect",
            "date": "17 Dec 2014",
            "name": "Kashish Walia",
            "stars": "2 stars"
        },
        {
            "comment": "This is not regarding the product but the cheating and fraud done by Airtel for offering 1 GB of data on 2G/3G connection on this MOTO G(2nd Gen) product. I purchased this product and followed the steps mentioned (view T&C apply) for getting this offer activated on my mobile phone. I visited www.airtellive.com/offers using on mobile phone after enabling data network and I got the following message \"No offer exists for this device\". I immediately called up FlipKart customer care and they told me that this is not their responsibility and I have to contact airtel for the resolution. I contacted airtel but there has been no response from them. I have wasted so much time and money while moving here and there from flipkart and airtel and so on. At least flipkart can ensure if the offer by Airtel in genuine or not. Either this is mis-selling attempt by Flipkart for selling their phone or they have send me the second hand phone where the airtel might have disconnected the offer after giving one. There is definitely something wrong. I am user of Flipkart since last 5 years and never face such fraud in these years.",
            "date": "17 Dec 2014",
            "name": "Sachin Goel",
            "stars": "1 star"
        },
        {
            "comment": "This is amizing phone Peisa vasul Not Support gujarati Lenguage i Hope Moto Team Solve This Problem My friends and Fimily Tell me after see my Moto G 2nd genration kas hamne waight kiya hota to Aisa Phon lete So it,s good perfomence",
            "date": "17 Dec 2014",
            "name": "Nileshkumar Ja...",
            "stars": "5 stars"
        },
        {
            "comment": "we 3 friends purchased this phone at same time. one device started showing issues in about a month. Contacted FlipKart support. After initial diagnosis, there was no response from FlipKart and now they are saying your 30 days is past and we cant replace your device. The support only cares for his rating and not on the resolution. I will never recommend anybody to buy on Flipkart from the experiences I had with FlipKart. I have decided to take this legally and will be initiating the process soon.",
            "date": "17 Dec 2014",
            "name": "Hemant",
            "stars": "1 star"
        },
        {
            "comment": "I received a defective piece on delivery. The ringtones and sms tones were not ringing when notifications were received. On exchange I got a working model the 2nd time only when I realized that the first one delivered by flipkart was probably a used one because it had a clear screen guard already on it which I thought was the usual protective one received from the manufacturer. But the new one's screen protector had specs printed all over it. I am pretty sure the first one delivered was a returned item (probably from someone who had found the same ringtone issues and returned) which gives me a bad feeling about Flipkart that they are trying to shove the defective pieces again onto other buyers thinking that someone would at least quietly keep them ! Pathetic !",
            "date": "17 Dec 2014",
            "name": "Anurag Das",
            "stars": "4 stars"
        },
        {
            "comment": "i have been using this phone for 3 months,i think i got a defect one ,i contact the service center but no use and changed my phone to asus 5...",
            "date": "17 Dec 2014",
            "name": "gadgadkar",
            "stars": "1 star"
        },
        {
            "comment": "got this phone in just 2 days of ordering, excellent device, no lags....but still no update for lollipop 5.0, current version 4.4.4, white looks nice, but if some one wish to buy this go for black color, the white back matty covers gets messy... i hope i bought the black one..!!",
            "date": "16 Dec 2014",
            "name": "Mohit Deen",
            "stars": "5 stars"
        },
        {
            "comment": "Its awesome phone ! Playing Games faster , HD videos playing very clear , Sound is better Battery is also long performing !!!! Friends I suggest - Just go for it !!",
            "date": "16 Dec 2014",
            "name": "Bipin Yadav",
            "stars": "5 stars"
        },
        {
            "comment": "Supportive handset with good Display, but off late it had started hanging for few seconds, over all sound quality, camera and robustness is good with pretty feature and is price worth.",
            "date": "16 Dec 2014",
            "name": "SG",
            "stars": "4 stars"
        },
        {
            "comment": "It has nice internal storage. HD recording is a good feature that I have never found in other mobile in this price range earlier.",
            "date": "16 Dec 2014",
            "name": "Aravind Adavani",
            "stars": "5 stars"
        },
        {
            "comment": "Just got the phone 4 days back. Although the phone is quite good and all but the Sim 1 slot gives a lot of trouble. It does not catch network most of the time. While there is no problem with the other slot at the same time. This was never expected from a brand new device. Flipkart, please help.",
            "date": "16 Dec 2014",
            "name": "Debashish Sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Moto G 2gen is the best phone. Flipkart delivery is awesome. as till now didnt see any drawback.. i recived my phn on 13 dec. no issue with charger heating nor wid battery as said by some user. battery backup is awesome.. once charged to 100% you can use it for one day with data conn or wifi as u wish.. i recommnd u to buy this phn.. got best phn in best price",
            "date": "16 Dec 2014",
            "name": "Chirag",
            "stars": "5 stars"
        },
        {
            "comment": "I have ordered this phone however got a damaged one with cracked screen...was worried as there is negative publicity about FK return policy where executive deal customer as james bond but my experience was entirely different...with much worry I explained the condition to the lady executive...who shows empathy to my cause and without any \"chick chick\"..agreed to return the phone...Thumbs up to FK for their empathy towards customers ...believe this is the difference between you guys and other online players...Last but not the least If I got a chance to talk to the lady executive I would like to give my appreciation to her...and about phone still had to xplore...carry on guys..you are the best..",
            "date": "16 Dec 2014",
            "name": "ashish",
            "stars": "5 stars"
        },
        {
            "comment": "phone is too good but the battery life is ok but still i will rate it five it has excellent camera which is as good as iphone 6 plus ,1 gb ram , and it has attractive looks and such a low price but the company needs to work on battery",
            "date": "16 Dec 2014",
            "name": "jagath bhandary",
            "stars": "5 stars"
        },
        {
            "comment": "flipkart as usual your delivery speed was just awsome and in case of the product thebest phone u can get at this range only problem i facing is shutting down of apps due to lack of ram",
            "date": "16 Dec 2014",
            "name": "Athul Suresh",
            "stars": "5 stars"
        },
        {
            "comment": "I liked the phone by reading reviews and specifications. But after started using it, feel dissatisfied at many fronts. Battery drops quickly, have to use many battery saver apps to use it throughout the day. Display is one factor that attracts, but fails at other ends in terms games and hardware rendering apps. AnTuTu Benchmark score is approx. 18k even while testing, it was crashing like anything. Many apps just crash in between a using it and make device unstable. Its just value for money phone, just use it as a normal smartphone with limited use of apps. Dont expect much. It is good to view videos. Overall it is 6.5/10 based on my experience.",
            "date": "16 Dec 2014",
            "name": "Saurabh Lazarus",
            "stars": "3 stars"
        },
        {
            "comment": "I just bought 3 months back MotoG 2nd gen phone set. It was working fine but suddenly I started facing issue with Calling feature. It was Unable to connect to the Network and when few of my friends suggested try with 2nd sim slot, it started working. Now I know at least 4-5 people who have faced same issue in Moto G 2nd gen.",
            "date": "16 Dec 2014",
            "name": "hari sharma",
            "stars": "3 stars"
        },
        {
            "comment": "Considering the specs and comparing the performance, the phone outruns many of its competitors in the price segment. Overall a satisfactory device for regular use though high end games is often a bit laggy. For example Asphalt 8 and The dark knight (the older paid one). Pros include latest OS which WILL be updated to Android L or Lollipop, and the almost stock android experience is really nice. 16gb internal and the sd card slot makes the phone a really good option for people who carry heavy amount of music, videos and movies. Lastly, had the ram been 1.5 gb, it would have added a couple of more thousands but the phone would have been legendary. ;)",
            "date": "16 Dec 2014",
            "name": "Debanjan Bhaskar",
            "stars": "4 stars"
        },
        {
            "comment": "Pretty good product . Superb display , good camera , Nice audio video playing capability, web browsing is good experience. But cannot sync with fb as well as whatsapp contacts ,battery backup is not upto the mark. Regarding the sller ws retail and flipkart ,Amazing experience . The best online seller and best service i have experienced . Thank you ws retail and flipkart",
            "date": "16 Dec 2014",
            "name": "Rejeesh Tk",
            "stars": "5 stars"
        },
        {
            "comment": "Product is delivered in advance to my hand with good condition. Great experience in buying this product. I also got my cashback offer while buying this product. Thanks.",
            "date": "16 Dec 2014",
            "name": "Karthik Mohan",
            "stars": "5 stars"
        },
        {
            "comment": "the phone is absolutely looking a gem for 13000,,but for me charge is the only problem,,,,anyway every phone has its own defects,,,",
            "date": "16 Dec 2014",
            "name": "pragadeesh bala",
            "stars": "5 stars"
        },
        {
            "comment": "everything is nice except the non removable battery and i feel little thicker. Rest is all great as explained or on papers. Camera is also good.",
            "date": "16 Dec 2014",
            "name": "Sasikiran Pall...",
            "stars": "5 stars"
        },
        {
            "comment": "i purchase new MOTO G 2ND generation recently. over all phone performance is very nice very good.touch,sound clarity,storage capacity,camera,os,phone look very nice and excellent.",
            "date": "16 Dec 2014",
            "name": "hitesh patel",
            "stars": "5 stars"
        },
        {
            "comment": "I am a iPhone user and have purchased this phone for a change but was bit disappointed with respect to the expectation that I was having. user experience when compared to iPhone was not so good. Battery power management in the OS is also not good. I saw many times message that application stooped working and later they start. It looks like they are crashing. There are lot of scope to improve the user experience and the Operating system.",
            "date": "16 Dec 2014",
            "name": "Ankit Verma",
            "stars": "2 stars"
        },
        {
            "comment": "I bought this phone every thing is good but battery drains fast. What is the use of smartphone if there is no smart battery life.",
            "date": "16 Dec 2014",
            "name": "Shankar",
            "stars": "3 stars"
        }
    ]
}
